#lang racket
(provide aczel1997.html)
(require SMathML)
(define $aleph (Mi "&aleph;"))
(define $aleph_0 (_ $aleph $0))
(define (!0 f) (curry app f))
(define (!1 f) (curry apply f))
(define (!commute f g . x*)
  (&= (f (apply g x*))
      ((!1 g) (map f x*))))
(define (ι A B)
  (_ $iota (&cm A B)))
(define -- "&mdash;&mdash;")
(define (Arrow f A B)
  (&: f (&-> A B)))
(define CatC $CC)
(define CatC^ (&prime CatC))
(define (Cat str)
  (Mi str #:attr* '((mathvariant "bold"))))
(define-syntax-rule (define-Cat* (id str) ...)
  (begin
    (define id (Cat str))
    ...))
(define-Cat*
  (CatSet "Set")
  (alg "alg")
  (Str "Str")
  (Lisp "Lisp")
  (List "List")
  (CatPea "Pea"))
(define (CatList K)
  (app List K))
(define (CatLisp K)
  (app Lisp K))
(define (CatStr Σ)
  (app Str Σ))
(define (Catalg F)
  (app alg F))
(define $Ɛ (Mi "Ɛ"))
(define $id (Mi "id" #:attr* '((mathvariant "italic"))))
(define (&id A) (_ $id A))
(define ((tcomment #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "tcomment")))
   (B (format "译者注记~a." n)) " " x*))
(define $PS (Mi "PS" #:attr* '((mathvariant "double-struck"))))
(define ||M|| (&abs $M))
(define $dot (Mi "dot"))
(define $atom (Mi "atom"))
(define (&atom k)
  (app $atom k))
(define $K^inf (^ $K $inf))
(define $K* (&* $K))
(define $cons (Mi "cons"))
(define $cons^inf (^ $cons $inf))
(define (&cons a d)
  (appl $cons a d))
(define (&cons^inf a d)
  (appl $cons^inf a d))
(define $varepsilon (Mi "&varepsilon;"))
(define $NN^inf (^ $NN $inf))
(define $s^inf (^ $s $inf))
(define (ap f . x*)
  (Mrow f $af (apply : x*)))
(define $OverBrace (Mo "&OverBrace;"))
(define (OverBrace x y)
  (Mover x (Mover $OverBrace y)))
(define (^+ x) (^ x $+))
(define |$[]| (Mi "[]"))
(define $square (Mi "&EmptySmallSquare;"))
(define $::= (Mo "&Colone;"))
(define $\| (Mo "|"))
(define |$[[0| (Mo "&LeftDoubleBracket;"
                   #:attr* '((stretchy "false"))))
(define |$]]0| (Mo "&RightDoubleBracket;"
                   #:attr* '((stretchy "false"))))
(define (|[[]]0| x)
  (: |$[[0| x |$]]0|))
(define denote
  (case-lambda
    ((x A) (^ (|[[]]0| x) A))
    ((x) (|[[]]0| x))))
(define $dummy
  (Mphantom $d*))
(define Σ $Sigma:normal)
(define $cong (Mo "&cong;"))
(define-infix*
  (&cong $cong)
  (&=> $=>)
  (&::= $::=)
  (&\| $\|))
(define-@lized-op*
  (@c* &c*)
  (@compose &compose)
  (@cm &cm)
  (@∈ ∈))
(define aczel1997.html
  (TnTmPrelude
   #:title "语义学讲义: 始代数和终余代数方面"
   #:css "styles.css"
   (H1. "语义学讲义: 始代数和终余代数方面")
   (H2 "摘要")
   (P "这些讲义为计算机科学专业的学生提供了一个形式语言的数学语义的非标准介绍. "
      "我们并不试图给出平衡的处理, 而是专注于一些关键的一般性思想, "
      "并用简单的例子加以刻画. "
      "这些思想使用一些基本的范畴论概念来表述. "
      "所有需要的范畴论知识都会在讲义中介绍. "
      "除了为人熟知的句法和语义的始代数方法之外, "
      "我们还会检视不那么为人熟知的操作语义的终余代数方法. "
      "我们对形式语义的处理旨在对于更为标准的介绍进行补充.")
   (H2 "引论")
   (P "这些讲义主要旨在为计算机科学专业的学生介绍形式语言的数学语义的某些方面. "
      "这些讲义并不试图在任何意义上对该领域进行综述, "
      "而是聚焦于一簇与这样的观念相关的想法, "
      "即句法和语义在某种意义上是相互对偶的. "
      "为了表达这一观念, 我们需要使用范畴论中的一些基本概念. "
      "因此, 这些讲义的次要目标是给出对于主要目的而言"
      "必要的那些范畴论概念的介绍.")
   (P "这些讲义只是给出了对于语义学和基本的范畴论的部分介绍. "
      "但是, 我相信将这两个主题结合起来进行介绍能够有效地"
      "对于更为标准的介绍进行实用的补充. "
      "至于那些对于这两个主题均有所熟悉的人而言, "
      "我希望这里仍然有些新颖的内容能够吸引你.")
   (P "暑期学校里我进行了四次讲座. "
      "这篇论文大致遵循着讲座的组织方式, 一章对应于一次讲座. "
      "但是有的部分似乎应该为讲座所给出的内容补充额外的细节. "
      "第一次讲座提供了对于数学语义的介绍. "
      "其引入了一些最为简单的抽象句法例子以及与之相伴的结构的概念, "
      "这些东西是为了对于之后讲座所使用的抽象定义进行形象刻画. "
      "第二次讲座引入了范畴的概念, 用以刻画范畴的例子是结构的范畴, "
      "以及集合的范畴. 第三次讲座引入了这些讲座的中心思想: "
      "集合范畴上的有界标准自函子的概念, "
      "自函子的代数和余代数范畴的概念, 始代数和终余代数的概念. "
      "关于始代数和终余代数的存在性有两个重要的一般性定理. "
      "对于始代数定理, 我们给出了大致的证明思路, "
      "但是对于终余代数定理, 我们没有给出任何证明. "
      "转而在(第三次)讲座的最后一部分, "
      "我们描述了与第一次讲座所给出的四个抽象句法的例子相关的三个终余代数. "
      "第四次也就是最后一次讲座关心的是进程的终宇宙. "
      "讲座讨论了三种类型的计算范式: "
      "传统的非交互确定性计算范式, "
      "两个交互性的确定性计算范式, "
      "以及一个交互性的非确定计算范式. "
      "对于每个情形, 我们都使用了一个有界标准自函子, "
      "而一个终余代数给出了这个范式的进程的终宇宙. "
      "我所使用的交互性非确定范式在强双模拟下与CCS相关联, "
      "但是对于这个事实我只有时间给出草略的图景.")
   (P "这些讲座里用以刻画想法的都是非常简单且为人熟知的例子. "
      "由抽象句法所给出的句法表达式宇宙和归纳数据类型之间存在着紧密的联系. "
      "这些例子可以看成是归纳数据类型, "
      "但我是以形式语言的术语呈现它们的. "
      "对偶地, 对于终余代数的讨论可以用余归纳数据类型的语言重述.")
   (H2. "数学语义")
   (H3. "对于语义学的一般介绍")
   (P "句法和语义这两个学科之间的区别起源于对于自然语言的研究. "
      "句法关心的是语言的表达式的形式的结构性质, "
      "通常对于其意义毫不在意. 在语义学中, "
      "注意力集中于表达式的意义上. "
      "自然语言" (Q "在自然中")
      "出现, 一般经过了漫长的时间演化. "
      "它们的句法和语义通常只是隐式给出的, "
      "因而有必要通过观察语言的实际使用来建立"
      "对于其句法和语义的理解. "
      "这是语言学研究的一部分内容.")
   (P "与之形成的对比的是, 形式语言, 也就是这些讲义所关心的对象, "
      "是显式的构造, 并且通常拥有显式刻画的句法, "
      "而且理想情况下拥有显式的语义. "
      "形式语言的范例最初出现于逻辑学领域. "
      "它们是经典的命题演算和谓词演算, "
      "以及无数变体和扩展. "
      "形式语言也用于语言学, "
      "其可能扮演着理论性的角色, "
      "作为自然语言的片段的模型出现, "
      "这类似于物理科学中所使用的数学模型.")
   (P "在计算机科学中形式语言的最直接例子是编程语言. "
      "计算机科学里形式语言的想法有着更为广阔的应用, "
      "不单单是应用于编程语言. "
      "但是对于我们的目的而言, "
      "我们暂时只考虑编程语言就够了.")
   (P "从历史上来说, 编程语言的设计者没有必要通过"
      "给出全然精确的显式句法和语义来描述他们的语言. "
      "他们可以对于一个特定的机器构造一个编译器 (或者一个解释器), "
      "然后编写一个手册给出可以在这个机器上运行的以该语言写成的示例程序. "
      "一个程序员可以通过阅读手册来学习语言, "
      "也可以通过不断试错或者专家的帮助来学习. "
      "以这种方式可用的编程语言在某种意义上就像自然语言. "
      "为了取得对于这种语言更为深刻的理解, "
      "或许有必要更仔细地检视语言并构造显式的句法和语义, "
      "其比运行在特定机器上的编译器更加抽象和理论化.")
   (P "关于为什么我们想要对于编程语言进行更为深刻和抽象的理解存在着诸多理由. "
      "但是这里我们不会讨论理由. 或许这么说就足够了, "
      "因为对于句法和语义的数学研究的进步, "
      "现在从原则上将编程语言的设计呈现为"
      "由精确的句法和语义构成的数学对象成为可能.")
   (H4 "形式语言")
   (P "一个" (B "形式语言") "具有一个" (B "句法")
      ", 其刻画了语言的表达式的句法范畴, 它还有一个"
      (B "语义") ", 其刻画了对于句法的一些可能"
      (B "解释") ", 这赋予了语言的表达式以意义. "
      "有时存在一个突出的解释, 其或许可以称为"
      (B "意图") "或者说" (B "标准")
      "解释, 其他的则被称为" (B "非意图的")
      "或者" (B "非标准的")
      ". 一个形式语言可能只有单独一个意图解释, "
      "之后才会考虑其他可能的解释. "
      "也可能提供形式语言的时候就没有给出语义, "
      "或者甚至是语义为空, 没有提供解释. "
      "由逻辑学家所研究的未经解释的"
      (B "形式系统") ", 是这样的例子.")
   (P "与其专注于单独一个形式语言, 其有着单独一个句法和可能多个解释, "
      "不如把注意力放在" (B "一族形式语言")
      "的意图解释的统一方法上. "
      "这些讲义的一个主题是在精确的范畴论意义下, "
      "第二种想法可以视为对偶于第一种想法.")
   (P "运用范畴论, 我们想要检视两个对偶的主题, "
      "其中每个主题都需要选择一个自函子:"
      (Ol (Li "对于形式语言的抽象刻画, "
              "通过聚焦于句法的抽象表示作为自函子代数的范畴的始对象, "
              "其解释也被表示为范畴的对象而意义函数则是箭头.")
          (Li "对于表示一族形式语言的每个的意图解释的特定统一方法的刻画, "
              "作为自函子余代数的范畴的终对象, "
              "其每个语言的句法也被表示为范畴的对象而意义函数则是箭头.")))
   (P "当然了, 上述主题对于尚不熟悉范畴论术语的读者而言可能并不清晰. "
      "但是所有的术语都会在这些讲座里介绍.")
   (P "这些讲义的主题是" (B "数学语义")
      ". 讨论一个形式语言的一个" (B "直接语义")
      "是有可能的. 例如, 我们可能想要建立一个用于数学基础的形式语言. "
      "在这种情况下, 我们所想要的是一个直接的先于数学的语义 "
      "(pre-mathematical semantics), 其和数学语义相当不同, "
      "因为后者基本上是将形式语言的句法翻译为我们的数学语言. "
      "类似地, 我们可以区分我们对于我们母语的直接理解和"
      "通过翻译所得到的对于外语的理解.")
   (H3. "句法和语义的例子")
   (P "这些讲义里我们将会专注于四个非常简单的带有句法和语义的形式语言的例子. "
      "它们是不切实际的简单, 以至于我们可以看到清晰的一般想法"
      "而不被更为现实的例子的细节所迷惑. "
      "在每种情形下我们都给出了一个抽象句法, 其确定了一个表达式的集合"
      $E ", 我们还会给出一个与之相关的数学结构概念, 并且对于每个这样的结构"
      (&= $A:script (tu0 $A $..h)) ", 还要给出一个" (B "意义函数")
      (func (denote $dummy $A:script) $E $A)
      ". 结构的第一个分量是" $A "是一个集合, 其被称为结构的"
      (B "潜在集合 (underlying set)")
      ". 于是, 意义函数将每个表达式与潜在集合中的一个值关联起来. "
      "数学结构是形式语言的解释. {译注: 解释的结果而非解释的过程.} "
      "意义函数是由结构递归定义的, 其遵照表达式生成的方式; "
      "即这个函数被刻画为满足定义性等式 (复数) 的唯一函数, "
      "每种表达式的形式都有一个等式.")
   (P "在第二个和第三个例子里我们会假设给定了一个固定的集合"
      $K ". 在第四个例子里, 我们假设给定了一个签名, "
      "其由一个" (B "函数符号") "的集合" Σ "构成, 每个"
      (∈ $sigma Σ) "都有一个与之关联的自然数"
      $n_sigma "作为其" (B "元数 (arity)") ".")
   (H4 "Peano结构")
   (P "一个" (B "Peano结构") (&= $A:script (tu0 $A $a $f))
      "由一个集合连带着" (∈ $a $A) "和" (func $f $A $A)
      "构成. 这个例子的表达式集合" $E "由以下抽象句法给出:"
      (MB (&::= $e (&\| $square (^+ $e))))
      "于是" (&= $E (setE $square (^+ $square) (^+ (^+ $square)) $..h))
      ". 给定一个Peano结构" (&= $A:script (tu0 $A $a $f))
      ", 意义函数" (denote $dummy $A:script)
      "是唯一的函数" (func (denote $dummy) $E $A) "满足"
      (MB (Choice
           ((denote $square) $= $a)
           ((denote (^+ $e)) $= (app $f (denote $e))
                             (@∈ $e $E)))))
   (H4 "列表结构")
   (P "给定一个集合" $K ", 一个" (B $K "上的列表结构")
      (&= $A:script (tu0 $A $a $f)) "由一个集合" $A
      "连带着" (∈ $a $A) "和" (func $f (&c* $K $A) $A)
      "构成. 这次表达式的集合" $E "是由以下抽象句法给出的:"
      (MB (&cm (&::= $e (&\| |$[]| (&: $k $e)))
               (@∈ $k $K)))
      $E "的一个典型元素具有形式"
      (&: $k_1 $..c $k_n |$[]|)
      ", 其中" (&cm $k_1 $..h $k_n)
      "都是" $K "的元素. 给定一个列表结构"
      (&= $A:script (tu0 $A $a $f))
      ", 意义函数" (denote $dummy $A:script)
      "是唯一的函数" (func (denote $dummy) $E $A) "满足"
      (MB (Choice
           ((denote |$[]|) $= $a)
           ((denote (&: $k $e))
            $=
            (appl $f $k (denote $e))
            (@cm (∈ $k $K) (∈ $e $E))))))
   (H4 "Lisp结构")
   (P "给定一个集合" $K ", 一个" (B $K "上的Lisp结构")
      (&= $A:script (tu0 $A $a $f)) "由一个集合" $A
      "连带着" (func $a $K $A) "和" (func $f (&c* $A $A) $A)
      "构成. 表达式集合" $E "由以下抽象句法给出:"
      (MB (&cm (&::= $e (&\| $k (&d* $e $e)))
               (@∈ $k $K)))
      "给定一个Lisp结构" (&= $A:script (tu0 $A $a $f))
      ", 意义函数" (denote $dummy $A:script)
      "是唯一的函数" (func (denote $dummy) $E $A) "满足"
      (MB (Choice
           ((denote $k) $= (app $a $k) (@∈ $k $K))
           ((denote (&d* $e_1 $e_2))
            $=
            (appl $f (denote $e_1) (denote $e_2))
            (@∈ $e_1 $e_2 $E)))))
   (H4 Σ "-结构")
   (P "给定一个签名" Σ ", 一个" Σ "-结构"
      (&= $A:script (_ (tu0 $A (^ $sigma $A:script))
                       (∈ $sigma Σ)))
      "由一个集合" $A "连带着对于每个" (∈ $sigma Σ) "的"
      (func (^ $sigma $A:script)
            (^ $A $n_sigma) $A)
      "构成. 当" (&= $n_sigma $0) "时, " (^ $A $n_sigma)
      "是一个单元素集合, 其由一个空元组构成, 于是"
      (^ $sigma $A:script) "不过就是挑选" $A
      "的某个元素" (app (^ $sigma $A:script))
      ". 根据惯例此时我们将" (^ $sigma $A:script)
      "与这个元素视为等同的. 表达式集合" $E
      "由以下抽象句法给出:"
      (MB (&cm (&::= $e (ap $sigma
                            (OverBrace
                             (: $e $..c $e)
                             $n_sigma)))
               (@∈ $sigma Σ)))
      "给定一个" Σ "-结构"
      (&= $A:script (_ (tu0 $A (^ $sigma $A:script))
                       (∈ $sigma Σ)))
      ", 意义函数" (denote $dummy $A:script)
      "是唯一的函数" (func (denote $dummy) $E $A) "满足"
      (MB (&cm (&= (denote (ap $sigma $e_1 $..c (_ $e $n_sigma)))
                   (appl (^ $sigma $A:script)
                         (denote $e_1) $..h
                         (denote (_ $e $n_sigma))))
               (@cm (∈ $sigma Σ)
                    (∈ $e_1 $..h (_ $e $n_sigma) $E))) "."))
   ((tcomment)
    "其实个人感觉既然" $A "是固定的, 将"
    (&= $A:script (_ (tu0 $A (^ $sigma $A:script))
                     (∈ $sigma Σ)))
    "写成"
    (&= $A:script (tu0 $A (_ (^ $sigma $A:script)
                             (∈ $sigma Σ))))
    "是不是看上去更合理一些.")
   ((exercise #:n "1.1")
    "请你表明前三个例子可以视为第四个例子的特殊情况, 通过选择"
    (Ol (Li (&= Σ (setE $square $+)) ", 并且"
            (&= (_ $n $square) $0) ", "
            (&= (_ $n $+) $1) ".")
        (Li (&= Σ (&union (setE |$[]|) $K))
            ", 假定" (&!in |$[]| $K) ", 并且"
            (&= (_ $n |$[]|) $0) "而对于"
            (∈ $k $K) "有" (&= $n_k $1) ".")
        (Li (&= Σ (&union $K (setE $d*)))
            ", 假定" (&!in $d* $K) ", 并且对于"
            (∈ $k $K) "有" (&= $n_k $0) "而"
            (&= (_ $n $d*) $2) "."))
    "{译注: 不过, 一般认为之前的定义里已经隐含了这里的假定了.}")
   (H3. "关于结构归纳和结构递归的讨论")
   (P "考虑到有的读者可能不熟悉可用于抽象句法的结构归纳和结构递归, "
      "我们以其与第四个例子" Σ "-结构的关联来回顾这些想法. "
      "已经熟悉了的读者可以将这个间章视为填充细节的拓展练习.")
   (P "一个句法等式" (&::= $e $..c) ", 对于表达式" $e
      "的集合" $E "而言, 刻画了" $E "的一个归纳定义. "
      "在我们的第四个例子里, " $E
      "被归纳地定义为满足对于每个" (∈ $sigma Σ) ", 有"
      (MB (&=> (∈ $e_1 $..h (_ $e $n_sigma) $E)
               (∈ (ap $sigma $e_1 $..c (_ $e $n_sigma)) $E)))
      "的最小集合. 这个归纳定义可以重述为以下的显式定义:"
      (MB (&= $E (&union $E^0 $E^1 $..c)))
      "其中" $E^k "是由等式" (&= $E^0 $empty)
      "和对于" (∈ $k $NN) ","
      (MB (&= (^ $E (&+ $k $1))
              (setI (ap $sigma $e_1 $..c (_ $e $n_sigma))
                    (&cm (∈ $sigma Σ)
                         (∈ $e_1 $..h (_ $e $n_sigma) $E^k)))))
      "原始递归地定义的. 注意到根据数学归纳法, 可得"
      (&sube $E^0 $E^1 $E^2 $..c) ".")
   
   (H3. "结构的例子")
   (H4 "Peano结构")
   (P "标准的例子是" (tu0 $NN $0 $s) ", 其中"
      (&= $NN (setE $0 $1 $2 $..h))
      "是自然数集, 而对于" (∈ $n $NN)
      "有" (&= (app $s $n) (&+ $n $1))
      ". 另一个我们之后会感兴趣的例子是"
      (tu0 $NN^inf $0 $s^inf)
      ", 其中" (&= $NN^inf (&union $NN (setE $inf))) "而"
      (MB (&= (app $s^inf $n)
              (Choice0
               ((app $s $n) ", 如果" (∈ $n $NN))
               ($inf        ", 如果" (&= $n $inf)))) ".")
      "这里的" $inf "是一个不在" $NN
      "之中的对象.")
   (H4 "列表结构")
   (P "我们将取" (tu0 $K* $varepsilon $cons)
      "作为我们的标准例子, 其中" $K* "是由" $K
      "的元素的所有(有限的)字符串"
      (&= $rho (: $k_1 $..c $k_n))
      "构成的集合, " $varepsilon "是空字符串, 而"
      (MB (&= (&cons $k $rho)
              (: $k $k_1 $..c $k_n)))
      "其中" (∈ $k $K) "而"
      (∈ (&= $rho (: $k_1 $..c $k_n)) $K*)
      ".")
   (P "我们也会对于可能无穷的字符串的列表结构"
      (tu0 $K^inf $varepsilon $cons^inf)
      "感兴趣. 这里" (&= $K^inf (&union $K* $K^omega))
      ", 其中" $K^omega "是由" $K "的元素的无穷字符串"
      (&= $rho (: $k_1 $k_2 $..c)) "构成的集合, 而"
      (MB (&= (&cons^inf $k $rho)
              (: $k $k_1 $..c)))
      "其中" (∈ $k $K) "而"
      (∈ (&= $rho (: $k_1 $..c)) $K^inf)
      ".")
   (H4 "Lisp结构")
   (P "给定集合" $K ", 标准的例子是Lisp结构"
      (tu0 $SS $atom $dot) ", 其中" $SS
      "是Lisp的" $S "-表达式的集合, 而"
      $S "-表达式由对于每个"
      (∈ $k $K) "的原子" (&atom $k)
      "通过点对 (dotted pairing) 操作" $dot
      "构建而成, " $dot "将两个" $S
      "-表达式" (&cm $M_1 $M_2) "和一个"
      $S "-表达式" (&d* $M_1 $M_2)
      "联系起来.")
   (P "我们也对于带有可能循环或者无限的" $S
      "-表达式的Lisp结构感兴趣. "
      "这些表达式可以被视为叶子以" $K
      "的元素所标记的特定种类的二叉树. "
      "给出一个对于这些树的精确集合论定义是有用的. "
      "我们从更一般的" (B $S "-预树")
      "的概念开始. 这些对象被定义为序对"
      (&= $M (tu0 ||M|| $l_M))
      ", 其中" (&sube ||M|| (&* (setE $1 $2)))
      "而" (func $l_M ||M|| (&union $K (setE $d*)))
      ". 这里的" $d* "是某个不在" $K
      "之中的对象. 令" $PS "是由这些预树构成的集合. 如果"
      (∈ $k $K) ", 令" (&atom $k) "是由"
      (MB (Choice
           (||M|| $= (setE $varepsilon))
           ((app $l_M $varepsilon) $= $k)))
      "所给出的预树" $M ". 如果" (&cm $M_1 $M_2)
      "是预树, 令" (&d* $M_1 $M_2) "是由"
      
      )
   
   (H4 Σ "-结构")
   
   (H3. "句法作为结构")
   (P "在我们四个句法和语义的例子里, 我们都可以根据表达式集合"
      $E "构造一个结构" (&= $Ɛ (tu0 $E $..h))
      ". 我将其称为" (B "句法结构 (syntax structure)") ".")
   ((example #:n "1")
    (&= $Ɛ (tu0 $E $square $s)) ", 其中" (func $s $E $E)
    "是由" (&= (app $s $e) (^+ $e)) "给出的, 对于" (∈ $e $E) ".")
   ((example #:n "2")
    (&= $Ɛ (tu0 $E |$[]| $cons)) ", 其中"
    (MB (func $cons (&c* $K $E) $E))
    "是由" (&= (&cons $k $e) (&: $k $e)) "给出的, 对于"
    (&cm (∈ $k $K) (∈ $e $E)) ".")
   ((example #:n "3")
    
    )
   ((example #:n "4")
    
    )
   (H2. "结构的范畴")
   (H3. "范畴")
   (P "这一节我们将引入范畴的概念. "
      "我们初始的启发性例子是集合与集合之间的函数的范畴.")
   (H4 "集合之间的函数")
   (P "如果" (&cm $A $B) "是集合, 那么我们记"
      (func $f $A $B) ", 如果" $f "是一个从" $A
      "到" $B "的函数. 集合" $A "被称为" $f "的"
      (B "定义域 (domain)") "而集合" $B "被称为"
      $f "的" (B "陪域 (codomain)")
      ". 对于每个" (∈ $x $A) ", " (B "应用 (apply)")
      $f "于" $x "的结果" (app $f $x)
      "在" $B "之中. 当陪域和" (B "值域 (range)")
      (setI (app $f $x) (∈ $x $A))
      "重合时, " $f "是" (B "满射的 (surjective)")
      ". 但是, 函数不必然是满射的. "
      "因此, 集合论的习惯一样, "
      "函数不能与其图 (graph) 等同起来, "
      "而是需要携带陪域的信息. "
      "这意味着若有" (func $f $A $B) "和"
      (func $f^ $A^ $B^) ", 那么"
      (&= $f $f^) "当且仅当" (&= $A $A^)
      ", " (&= $B $B^) ", 且对于每个" (∈ $x $A)
      "有" (&= (app $f $x) (app $f^ $x)) ".")
   (P "如果" $A "是一个集合, 那么" (B $A "上的恒等函数")
      (&id $A) "是满足" (func (&id $A) $A $A)
      "和对于所有" (∈ $x $A) "都有"
      (&= (app (&id $A) $x) $x)
      "的唯一函数.")
   (P "如果" (func $f $A $B) "而" (func $g $B $C)
      ", 那么" (tu0 $g $f) "是" (B "可复合的 (composable)")
      ", 而其" (B "复合 (composite)") (&compose $g $f)
      "是满足" (func (&compose $g $f) $A $C)
      "和对于所有" (∈ $x $A) "都有"
      (&= (app (@compose $g $f) $x)
          (app $g (app $f $x)))
      "的唯一函数.")
   (P (B "注记: ") "如果" (func $f $A $B) ", 那么"
      (MB (&= (&compose $f (&id $A))
              (&compose (&id $B) $f)
              $f) ".")
      "另外, 如果也有" (func $g $B $C) "和"
      (func $h $C $D) ", 那么"
      (MB (associate &compose $h $g $f) "."))
   (H4 "定义")
   ((definition #:n "2.1")
    
    )
   (H4 "集合的范畴")
   (H3. "结构的范畴")
   (P "本节我们将会基于之前所给出的结构概念的四个例子来给出更多的范畴的例子. "
      "在每种情形下, 范畴的对象都是结构, "
      "而箭头是由一对结构和其间一个同态构成的三元组; "
      "也就是说, 是一个结构的潜在集合之间的" (Q "保持结构")
      "的函数. 三元组是必要的, 而不能只是单独的同态, "
      "由此范畴的定义域和陪域运算才能得到定义. "
      "不过在实践中往往忽略箭头和其同态分量之间的区别更为方便.")
   ((tcomment)
    "实际情况是, 几乎没有人特别注意这点, 至少很少有人明确指出这点. "
    "就译者的阅历而言, 也只是第二次看到. "
    "一般而言, 读者可以将箭头的定义域和陪域, 或者说来源和目标, "
    "视为箭头的" (Q "元数据") ".")
   (H4 "Peano结构的范畴")
   (P "范畴" CatPea "以Peano结构作为其对象. 给定Peano结构"
      (&= $A:script (tu0 $A $a $f)) "和"
      (&= (&prime $A:script) (tu0 $A^ $a^ $f^))
      ", 从" $A:script "到" (&prime $A:script)
      "的一个" (B "同态") "是一个" (Q "保持结构")
      "的函数" (func $pi $A $A^) ", 即"
      (MB (Choice
           ((app $pi $a) $= $a^)
           ((app $pi (app $f $x))
            $=
            (app $f^ (app $pi $x))
            (@∈ $x $A))))
      CatPea "的箭头是由Peano结构和其间的一个同态构成的三元组"
      (tu0 $A:script $pi (&prime $A:script))
      ". 这个范畴的运算是什么应该是显然的, "
      "并且成为范畴的条件成立也是显然的. "
      "在其他三个例子里我们只会描述同态的概念.")
   (H4 "列表结构的范畴")
   (P "给定一个集合" $K ", 范畴" (CatList $K)
      "以" $K "上的列表结构为其对象, "
      "而确定了箭头的同态的概念则定义如下. 给定"
      $K "上的列表结构"
      (&= $A:script (tu0 $A $a $f)) "和"
      (&= (&prime $A:script) (tu0 $A^ $a^ $f^))
      ", 从" $A:script "到" (&prime $A:script)
      "的一个" (B "同态") "是一个函数"
      (func $pi $A $A^) "满足"
      (MB (Choice
           ((app $pi $a) $= $a^)
           ((app $pi (appl $f $k $x))
            $=
            (appl $f^ $k (app $pi $x))
            (@cm (∈ $k $K) (∈ $x $A))))))
   (H4 "Lisp结构的范畴")
   (P "给定一个集合" $K ", 范畴" (CatLisp $K)
      "以" $K "上的Lisp结构为其对象, "
      "而确定了箭头的同态的概念则定义如下. 给定"
      $K "上的Lisp结构"
      (&= $A:script (tu0 $A $a $f)) "和"
      (&= (&prime $A:script) (tu0 $A^ $a^ $f^))
      ", 从" $A:script "到" (&prime $A:script)
      "的一个" (B "同态") "是一个函数"
      (func $pi $A $A^) "满足"
      (MB (Choice
           ((app $pi (app $a $k)) $= (app $a^ $k) (@∈ $k $K))
           ((app $pi (appl $f $x_1 $x_2))
            $=
            (appl $f^ (app $pi $x_1) (app $pi $x_2))
            (@∈ $x_1 $x_2 $A)))))
   (H4 Σ "-结构的范畴")
   (P "给定一个签名" Σ ", 范畴" (CatStr Σ) "以"
      Σ "-结构为其对象, "
      "而确定了箭头的同态的概念则定义如下. 给定"
      Σ "-结构"
      )
   (H3. "句法结构是始对象")
   (P "现在我们已经得到了四个结构范畴的例子. "
      "对于这些例子, 我们都已经定义了一个句法结构"
      $Ɛ ". 对于范畴中的每个结构"
      (&= $A:script (tu0 $A $..h))
      ", 都存在着一个意义函数"
      (func (denote $dummy $A:script) $E $A)
      ", 其由" $E "中的表达式形式上的结构递归定义; "
      "也就是说, 其被定义为满足特定等式的唯一函数. "
      "通过观察这些等式, "
      "我们发现它们恰恰就是用于描述从" $Ɛ "到"
      $A:script "的同态概念所使用的等式. "
      "于是, 我们发现" $Ɛ "具有一个特别的性质, "
      "即对于每个结构" $A:script
      ", 在结构范畴里存在唯一的箭头"
      (&-> $Ɛ $A:script)
      "; 也就是说, 根据以下的定义, "
      $Ɛ "是结构范畴里的一个始对象.")
   ((definition #:n "2.3")
    "一个范畴中的一个对象" $X "是一个" (B "始对象")
    ", 如果对于每个对象" $Y ", 存在唯一的箭头"
    (&-> $X $Y) ".")
   (P "在集合范畴里, 空集" $empty "是唯一的始对象. "
      "这是因为对于任意的集合" $Y
      ", 存在唯一的函数" (&-> $empty $Y)
      ", 即空函数, 其由序对构成的图就是空集. "
      "注意到范畴不必拥有始对象. "
      "例如, 非空集合的范畴就是这样的. "
      "范畴也不必只有一个始对象. "
      "例如, 在Peano结构的范畴里, "
      "自然数的Peano结构和句法结构不同, "
      "但也很容易看出来是始对象. "
      "尽管这两个结构是不同的, "
      "但是从抽象层面来说它们是相同的, "
      "在于一个结构是另一个结构的复制, "
      "意即存在一个给出了来回两个结构的同态的一一对应, "
      "也就是说两个结构是同构的. "
      "这是关于始对象的一般事实" --
      "当存在始对象时, 任意一对始对象之间都存在唯一的同构, "
      "因而是同构的. 我们现在转向范畴中的同构的一般概念.")
   (H3. "同构")
   (P "在抽象数学里, 同构的数学结构被视为在抽象层面上相同. "
      "同构的意思是结构之间存在一对同态, 互为对方的逆. "
      "这种同构的概念可以在任何范畴之中定义.")
   
   (H3. "始对象")
   (P "抽象数学刻画数学结构只关心同构意义上的, "
      "即所描述的结构上的条件满足"
      (Ol (Li "存在满足条件的结构.")
          (Li "任何同构于满足条件的结构的结构都满足条件.")
          (Li "对于任何一对满足条件的结构, 它们都是同构的."))
      "而且, 如果第3个要求里的同构是唯一的就更好了.")
   (P "范畴论的一个基本主题是使用所谓的" (Q "泛映射性质")
      "来描述范畴中" (Q "唯一同构意义上 (up to unique isomorphism)")
      "的对象. 这种想法最简单的例子由我们已经定义了的始对象给出.")
   ((exercise #:n "2.4")
    "证明如果" $A "同构于一个始对象, 那么" $A "本身就是一个始对象.")
   ((proposition #:n "2.5")
    "如果" (&cm $A_1 $A_2) "是始对象, 那么存在唯一的同构"
    (&cong $A_1 $A_2) ".")
   ((proof)
    
    )
   (P "总结一下, 以下定理刻画了这次讲座的要义. "
      "形式语言的句法和语义的" (Q "始代数")
      "方式在于选择一个范畴使得形式语言的句法可以视为这个范畴的始对象. "
      "然后, 任何语义都应该刻画为范畴里的对象. "
      "这么做了以后, 意义函数就由从(作为始对象的)句法宇宙"
      "到表示语义的对象的唯一映射所唯一确定了. "
      "{译注: 这里的唯一映射指的是范畴里存在唯一的箭头, "
      "当然指的不是随意的映射.}")
   ((theorem #:n "2.6")
    "在我们四个范畴的例子里, 句法结构可以刻画为同构意义下的始结构, "
    "即结构范畴里的一个始对象.")
   (H2. "始代数和终余代数")
   (P "让我们设我们有了一个形式语言, 我们想要选择一个范畴"
      CatC "以使得句法可以表示为始对象" $I
      ", 而每个解释可以表示为一个对象" $A
      ", 并且意义函数可以表示为唯一的箭头" (&-> $I $A)
      ". 在许多情况下, 例如对于我们的四个例子而言, "
      "范畴" CatC "可以自然地选取为某个自函子的代数的范畴, "
      "这使用了我们将要引入的术语. 从范畴" CatC "到范畴"
      CatC^ "的函子的概念是自然的同态概念, "
      "即范畴之间保持结构的映射.")
   (H3. "函子")
   (H3. "结构作为代数")
   (H4 "自函子的代数")
   (P "给定某个范畴上的一个自函子" $F ", 那么一个"
      (B $F "的代数") "是一个序对" (tu0 $A $alpha)
      ", 其中" $A "是范畴的一个对象, 而"
      (Arrow $alpha (app $F $A) $A)
      ". 我们可以构造范畴" (Catalg $F) ", 其对象是"
      $F "的代数而箭头是这样的代数之间的同态给出的. 如果"
      (tu0 $A $alpha) "和" (tu0 $A^ $alpha^)
      "是" $F "的代数, 那么从" (tu0 $A $alpha)
      "到" (tu0 $A^ $alpha^) "的一个" (B "同态")
      (&-> (tu0 $A $alpha) (tu0 $A^ $alpha^))
      "是一个函数" (Arrow $pi $A $A^) "满足"
      (MB (&= (&compose $pi $alpha)
              (&compose $alpha^ (app $F $pi))) ".")
      "{译注: 原文这里是函数, 但是我感觉用箭头一词更为合理.} "
      "于是, 这个范畴的箭头可以取为三元组"
      (tu0 (tu0 $A $alpha) $pi (tu0 $A^ $alpha^))
      ", 或者我们也可以使用三元组"
      (tu0 $alpha $pi $alpha^) ".")
   (P "我们可以表明, 对于我们的四个结构概念的例子, "
      "我们都可以在集合范畴" CatSet
      "上定义一个自函子" $F "以使得每个结构"
      (&= $A:script (tu0 $A $..h))
      "都可以视为一个" $F "的代数" (tu0 $A $alpha)
      ". 在以下每种情形里, 我们首先对于每个集合" $X
      "定义" (app $F $X) ", 并且对于集合" (&cm $X $Y)
      "和每个函数" (func $pi $X $Y) "定义"
      (func (app $F $pi) (app $F $X) (app $F $Y))
      ". 我们将验证" $F "的确是一个函子的工作留作练习. "
      "最终, 在每种情形里我们都会对于结构"
      (&= $A:script (tu0 $A $..h))
      "定义" (func $alpha (app $F $A) $A)
      ". 不过, 首先我们需要二元无交并和索引无交并的记号.")
   (P (B "一些记号: ")
      "对于集合" (&cm $X $Y) "我们令" (&+ $X $Y)
      "为其" (B "二元无交并") ", 使用" (&cm $0 $1)
      "作为标签, 即"
      (MB (&= (&+ $X $Y)
              (&union (@c* (setE $0) $X)
                      (@c* (setE $1) $Y))) ".")
      "更一般地, 如果" (_ (@ $X_i) (∈ $i $I))
      "是由集合" $I "索引的一个集合族, 那么"
      (sum (∈ $i $I) $X_i) "是这个族的"
      (B "索引无交并") ", 即"
      (MB (&= (sum (∈ $i $I) $X_i)
              (setI (tu0 $i $x)
                    (: (∈ $i $I) "且"
                       (∈ $x $X_i)))) ".")
      "在以下的前两个例子中对于函子" $F
      "的定义里, 我们使用" $1 "代表单元素集"
      (setE $0) ".")
   ((example #:n "1")
    (&= (app $F $X) (&+ $1 $X)) (Br)
    (func (app $F $pi) (&+ $1 $X) (&+ $1 $Y))
    (MB (Choice
         ((ap (app $F $pi) (tu0 $0 $0))
          $= (tu0 $0 $0))
         ((ap (app $F $pi) (tu0 $1 $x))
          $= (tu0 $1 (app $pi $x))
          (@∈ $x $X))))
    (func $alpha (&+ $1 $A) $A)
    (MB (Choice
         ((ap $alpha (tu0 $0 $0)) $= $alpha)
         ((ap $alpha (tu0 $1 $x))
          $= (app $f $x)
          (@∈ $x $A)))))
   ((example #:n "2")
    (&= (app $F $X) (&+ $1 (@c* $K $X))) (Br)
    (func (app $F $pi)
          (&+ $1 (@c* $K $X))
          (&+ $1 (@c* $K $Y)))
    (MB (Choice
         ((ap (app $F $pi) (tu0 $0 $0)) $= (tu0 $0 $0))
         ((ap (app $F $pi) (tu0 $1 (tu0 $k $x)))
          $= (tu0 $1 (tu0 $k (app $pi $x)))
          (@cm (∈ $k $K) (∈ $x $X)))))
    (func $alpha (&+ $1 (@c* $K $A)) $A)
    (MB (Choice
         ((ap $alpha (tu0 $0 $0)) $= $a)
         ((ap $alpha (tu0 $1 (tu0 $k $x)))
          $= (appl $f $k $x)
          (@cm (∈ $k $K) (∈ $x $A))))))
   (let ((F (λ (X) (&+ $K (@c* X X)))))
     ((example #:n "3")
      (&= (app $F $X) (F $X)) (Br)
      (func (app $F $pi) (F $X) (F $Y))
      (MB (Choice
           ((ap (app $F $pi) (tu0 $0 $k))
            $= (tu0 $0 $k)
            (@∈ $k $K))
           ((ap (app $F $pi) (tu0 $1 (tu0 $x_1 $x_2)))
            $= (tu0 $1 (tu0 (app $pi $x_1) (app $pi $x_2)))
            (@∈ $x_1 $x_2 $X))))
      (func $alpha (F $A) $A)
      (MB (Choice
           ((ap $alpha (tu0 $0 $k))
            $= (app $a $k)
            (@∈ $k $K))
           ((ap $alpha (tu0 $1 (tu0 $x_1 $x_2)))
            $= (appl $f $x_1 $x_2)
            (@∈ $x_1 $x_2 $A))))))
   (let ((F (λ (X) (sum (∈ $sigma Σ)
                        (^ X $n_sigma)))))
     ((example #:n "4")
      (&= (app $F $X) (F $X)) (Br)
      (func (app $F $pi) (F $X) (F $Y))
      (MB (&= (ap (app $F $pi)
                  (tu0 $sigma
                       (tu0 $x_1 $..h (_ $x $n_sigma))))
              (tu0 $sigma
                   (tu0 (app $pi $x_1) $..h
                        (app $pi (_ $x $n_sigma))))))
      (MB (@∈ $x_1 $..h (_ $x $n_sigma) $X))
      (func $alpha (F $A) $A)
      (MB (&= (ap $alpha (tu0 $sigma
                              (tu0 $x_1 $..h (_ $x $n_sigma))))
              (ap (^ $sigma $A:script)
                  (tu0 $x_1 $..h (_ $x $n_sigma)))))
      (MB (@∈ $x_1 $..h (_ $x $n_sigma) $A))))
   ((exercise #:n "3.1")
    
    )
   (H3. "始代数")
   (P "在什么条件下自函子代数的范畴拥有始代数呢? "
      "我们给出了这个问题相对于集合范畴上的自函子的答案.")
   (H4 "有界标准自函子")
   (P "范畴" CatSet "上的一个自函子" $F "是" (B "标准的")
      ", 如果对于所有的集合" (&cm $A $B) "满足"
      $A "是" $B "的一个子集, 都有" (app $F $A)
      "是" (app $F $B) "的一个子集, 且"
      (MB (!commute (!0 $F) ι $A $B))
      "其中" (func (ι $A $B) $A $B)
      "是从" $A "到" $B "的" (B "嵌入 (inclusion)")
      "函数, 即满足对于每个" (∈ $x $A) "都有"
      (&= (app (ι $A $B) $x) $x)
      "的从" $A "到" $B "的唯一函数.")
   (P "一个标准函子" $F "是" (B "有界标准的")
      ", 以" $kappa "为界, 如果" $kappa
      "是一个正则基数使得对于任意的集合" $A
      ", 若" (∈ $x (app $F $A)) "则存在"
      $A "的一个子集" $A^ "具有小于" $kappa
      "的基数且" (∈ $x (app $F $A^))
      ". 若" $kappa "是" $aleph_0
      ", 那么我们称" $F "是" (B "有限标准的") ".")
   ((exercise #:n "3.2")
    
    )
   (H4 "始代数定理")
   (P "我们将会藉由以下不动点定理得到始代数.")
   ((theorem #:n "3.3")
    "令" $F "是有界标准的. 那么, 作为集合上的算子, "
    $F "具有唯一的最小不动点" $I ", 即" $I
    "是一个集合满足" (&= (app $F $I) $I)
    "且若" (&= (app $F $X) $X) "则有"
    (&sube $I $X) ".")
   (P (B "有限情形的证明大纲: ")
      
      )
   (H3. "终余代数")
   (H3. "终余代数的例子")
   (H2. "进程的终宇宙")
   (H3. "非交互确定性范式")
   
   ))