#lang racket
(provide algebra.html)
(require SMathML)
(define (make-entry name class)
  (lambda (#:n [n ""])
    (lambda x*
      (keyword-apply
       Div '(#:attr*) `(((class ,class)))
       (B (format "~a~a." name n)) " " x*))))
(define joke (make-entry "玩笑" "joke"))
(define tcomment (make-entry "译者注记" "tcomment"))
(define $GL (Mi "GL"))
(define (GL n F) (app (_ $GL n) F))
(define (matc l)
  (pare (&table l)))
(define-syntax Matc
  (syntax-rules ()
    ((_ (x ...) ...)
     (matc (list (list x ...) ...)))))
(define (forall . b)
  (: $forall (apply ∈ b)))
(define (@forall . b)
  (@ $forall (apply ∈ b)))
(define (exists . b)
  (: $exists (apply ∈ b)))
(define (@exists . b)
  (@ $exists (apply ∈ b)))
(define tuple tu0)
(define (Cat name)
  (Mi name #:attr* '((mathvariant "sans-serif"))))
(define CatC (Cat "C"))
(define CatG (Cat "G"))
(define CatSet (Cat "Set"))
(define CatGrp (Cat "Grp"))
(define CatRing (Cat "Ring"))
(define $Hom (Mi "Hom"))
(define Hom
  (case-lambda
    ((A B) (appl $Hom A B))
    ((C A B) (appl (_ $Hom C) A B))))
(define $Aut (Mi "Aut"))
(define Aut
  (case-lambda
    ((A) (app $Aut A))
    ((C A) (app (_ $Aut C) A))))
(define Order &abs)
(define $*:id (Mi "&#8270;"))
(define $1_* (_ $1 $*:id))
(define $1:bold (Mi "1" #:attr* '((mathvariant "bold"))))
(define (Card S) (&abs S))
(define $bull (Mo "&bull;"))
(define $bull:id (Mi "&bull;"))
(define $=: (Mo "&ecolon;"))
(define-infix*
  (&bull $bull)
  (&=: $=:)
  (&=> $=>)
  
  )
(define algebra.html
  (TmPrelude
   #:title "代数: 第0章"
   #:css "styles.css"
   (H1 "代数: 第0章")
   (H2 "第1章 预备: 集合论和范畴")
   (H2 "第2章 群, 第一次接触")
   (H3 "第1节 群的定义")
   (H4 "第1.1小节 群和群胚")
   ((joke #:n "1.1")
    "定义: 一个群是一个仅有一个对象的群胚.")
   (P "这实际上是一个相当可行的定义, 因为群胚既已定义 (在第1章的例子4.6中); "
      "但是大多数数学家会认为以这种方式引入群是滑稽可笑的, 或者说至少"
      "他们会善意地质疑这么做在教学上的有效程度. 为了挽回一下我自己, "
      "我会立即parse这个定义来表明它到底是在说什么. "
      "[译注: parse是一个计算机术语, 本意是将字符序列或者token序列转换为抽象句法树的过程, "
      "但是这里可以理解为" (Q "仔细阅读") ".] "
      "如果" $*:id "是这样一个群胚" CatG "仅有的对象, 那么"
      (MB (&= (Hom CatG $*:id $*:id) (Aut CatG $*:id)))
      "(因为" CatG "是一个群胚!), 并且这个集合携带了" CatG "的所有信息. "
      "称这个集合为" $G ", 那么(根据范畴的定义)" $G "上存在一个结合运算, "
      "这个结合运算有着恒元" $1_* ", 并且(根据群胚的定义, 其言称" CatG
      "中的每个态射都是一个同构)每个" (∈ $g $G) "都拥有一个逆元"
      (∈ (inv $g) $G) ".")
   (P (Em "这就是") "什么是一个群了: 一个带有某个复合法则的集合" $G
      ", 并满足几条关键性的公理, 即结合律, 恒元的存在性, 以及逆元的存在性.")
   ((tcomment)
    "在某种意义上, 这里存在一个小小的基础性问题, 就是" CatG
    "的所有态射构成的" $G "未必是一个集合, 但是也没有必要太过在意.")
   (H4 "第1.2小节 定义")
   (P "现在是给出正式 (official) 定义的时候. 令" $G "是一个非空集合, 装备有一个"
      (Em "二元运算") ", 即一个" (Q "乘法") "映射"
      (MB (&: $bull:id (&-> (&c* $G $G) $G)) ".")
      "我们的记号将会是"
      (MB (&=: (appl $bull:id $g $h) (&bull $g $h)))
      "或者就记为" (&i* $g $h) ", 若运算的名字不至于引起误解的话. "
      "细心的读者可能之前会期望我们应该写成是" (&bull $h $g)
      ", 这与前面我们对于范畴的定义一致, 但是这里的话约定俗称占据了上风. "
      "[原注: 并非没有例外; 例如见置换群, 第2节中有所讨论.]")
   ((tcomment)
    "其实在范畴的定义那里我就相当不解, 为什么作者要颠倒复合的参数顺序. "
    "而且, 颠倒了复合的参数顺序, 书写的常规记号却没有颠倒, "
    "在我看来这属实是多此一举, 画蛇添足.")
   ((definition #:n "1.2")
    "装备有一个二元运算" $bull:id "的集合" $G " (简而言之, "
    (tuple $G $bull:id) ", 或者即" $G ", 若是运算可以不言自明) 是一个"
    (Em "群") ", 如果"
    (Ol #:attr* '((type "i"))
        (Li "运算" $bull:id "是" (Em "结合性") "的, 即"
            (MB (&: (@forall $g $h $k $G)
                    (associate &bull $g $h $k)) ";"))
        (Li $bull:id "存在一个" (Em "恒元") $e_G ", 即"
            (MB (&: (: (@exists $e_G $G) (@forall $g $G))
                    (&= (&bull $g $e_G) $g
                        (&bull $e_G $g))) ";"))
        (Li $G "的每个元素都拥有一个相对于" $bull:id
            "而言的" (Em "逆元") ", 即"
            (MB (&: (: (@forall $g $G) (@exists $h $G))
                    (&= (&bull $g $h) $e_G
                        (&bull $h $g))) "."))))
   ((example #:n "1.3")
    "既然我们显式要求" $G "是非空的, 那么编造一个群最经济的方式是令"
    (&= $G (setE $e)) "为一个单元素集. 此时仅有一个类型为"
    (&-> (&c* $G $G) $G) "的函数, 也就是说" $G
    "上仅有一种可能的二元运算, 其由"
    (MB (&:= (&bull $e $e) $e))
    "定义. 三条公理对于这个例子平凡地成立, 于是" (setE $e)
    "装备了唯一的群结构." (Br)
    "这通常被称为" (Em "平凡群")
    "; 纯粹主义者应该称任何这样的群为平凡群, "
    "既然每个单元素集都会引出这样一种群. [译注: 没太读明白这句话.]")
   ((example #:n "1.4")
    
    )
   ((example #:n "1.5")
    "我的读者很有可能会熟悉一类极其重要的" (Em "非交换") "的例子, 即"
    (Em (&c* $n $n) "的可逆实矩阵") "的群, 其中" (&>= $n $2)
    ". 此时我想回避讨论这类例子, 因为之后我们将在讨论线性代数时 (自第6章起) "
    "有充分的机会考虑矩阵. 但是, 在那之前, 我们也会偶尔用到一两个矩阵. "
    "读者应该验证满足" (&!= (&- (&i* $a $d) (&i* $b $c)) $0) "的"
    (&c* $2 $2) "的实矩阵"
    (MB (Matc ($a $b) ($c $d)))
    "在通常的矩阵乘法下构成了一个群:"
    (MB (&= (&i* (Matc ($a_1 $b_1) ($c_1 $d_1))
                 (Matc ($a_2 $b_2) ($c_2 $d_2)))
            (Matc ((&+ (&i* $a_1 $a_2) (&i* $b_1 $c_2))
                   (&+ (&i* $a_1 $b_2) (&i* $b_1 $d_2)))
                  ((&+ (&i* $c_1 $a_2) (&i* $d_1 $c_2))
                   (&+ (&i* $c_1 $b_2) (&i* $d_1 $d_2))))) ".")
    "(条件" (&!= (&- (&i* $a $d) (&i* $b $c)) $0)
    "是为了保证矩阵" (Em "可逆") ", 那么何为其逆?) 因为, 比如说"
    (MB (&= (&i* (Matc ($1 $1) ($0 $1))
                 (Matc ($1 $0) ($1 $1)))
            (Matc ($2 $1) ($1 $1)))
        $!=
        (&= (Matc ($1 $1) ($1 $2))
            (&i* (Matc ($1 $0) ($1 $1))
                 (Matc ($1 $1) ($0 $1)))) ",")
    "这个群显然是" (Em "非") "交换的." (Br)
    (&c* $n $n) "的可逆实矩阵的群记作" (GL $n $RR) ".")
   (P "第2节中我们将遇到更多具有代表性的例子.")
   (H4 "第1.3小节 基本性质")
   (P "从" (Q "群胚") "的角度来看, 恒元" $e_G
      "应该记成" $1_* ". 从记号里省略" $G
      "并非不常见 (只要这个群在上下文中是已知的), 使用不同于"
      $e "的符号来表示该元素也是如此: " $1 "和" $0
      "都是常见的替代选择, 依赖于上下文. 在任何情况下, 对于任意给定的群"
      $G ", 这种元素都是唯一的. 也就是说, " $G "中没有其他元素可以充当恒元:")
   ((proposition #:n "1.6")
    "如果" (∈ $h $G) "是" $G "的一个恒元, 那么" (&= $h $e_G) ".")
   (P "意外地, 这使得群在第1章的例子3.8的意义下成为"
      (Em "带点集合") ": 每个群都有一个良定义的突出元素.")
   ((proof)
    "首先运用" $e_G "是一个恒元的事实, 然后运用" $h
    "也是一个恒元的事实, 我们得到"
    (MB (&= $h (&i* $e_G $h) $e_G) ".")
    "(有趣的是, 以上论证中只用到" $e_G "是一个" (Q "左")
    "恒元和" $h "是一个" (Q "右") "恒元的事实.)")
   ((proposition #:n "1.7")
    "逆元也是唯一的: 如果" (&cm $h_1 $h_2) "都是"
    (∈ $g $G) "的逆, 那么" (&= $h_1 $h_2) ".")
   ((proof)
    "这实际上是第1章的命题4.2的推论 (通过将" $G
    "看作是只有一个对象的群胚的同构的集合). "
    "通过使用相同的论证技巧, 读者应该可以构造一个自足的证明, "
    "无需引用任何与态射有关的概念.")
   (P "命题1.7授权 (authorize) 我们去为" $g "的"
      (Em "唯一(the)") "的逆命名: 通常这被记为" (inv $g) ".")

   (H4 "第1.4小节 消去律 (cancellation)")
   (P (Q "消去律") "在群中成立, 即")
   ((proposition #:n "1.8")
    "令" $G "是一个群, 那么" (forall $a $g $h $G) ", 我们有"
    (MB (&cm (&=> (&= (&i* $g $a) (&i* $h $a))
                  (&= $g $h))
             (&=> (&= (&i* $a $g) (&i* $a $h))
                  (&= $g $h))) "."))
   ((proof)
    
    )
   (H4 "第1.5小节 交换群")
   
   (H4 "第1.6小节 阶")
   ((definition #:n "1.9")
    "群" $G "是一个元素" $g "具有" (Em "有限的阶")
    ", 如果对于某个正整数" $n "有" (&= $g^n $e) ". 在这种情况下, 阶"
    (Order $g) "是满足" (&= $g^n $e) "的最小正整数" $n
    ". 如果" $g "没有有限的阶, 我们记" (&= (Order $g) $inf) ".")
   (P "根据定义, 如果对于某个正整数" $n "有" (&= $g^n $e)
      ", 那么" (&<= (Order $g) $n) ", 实际上还可以更精确.")
   ((lemma #:n "1.10")
    "如果某个正整数" $n "有" (&= $g^n $e)
    ", 那么" (Order $g) "整除" $n ".")
   ((proof)
    "我们观察到, 根据定义, " (&>= $n (Order $g)) ", 即"
    (&>= (&- $n (Order $g)) $0) ". 必然存在一个正整数" $m "使得"
    
    )
   (H3 "第2节 群的例子")
   (H4 "第2.1小节 对称群")
   (P "在第1章的第4.1小节中我们已经观察到每个范畴" CatC "中的每个对象" $A
      "都决定了一个群, 被称为" (Aut CatC $A) ", 即" $A "的" (Em "自同构")
      "群. 从某种有些人工刻意的角度来说, 显然每个群都以这种方式产生 (参见练习1.1); "
      "这个事实可以更" (Q "有意义") "的方式成立, 当我们讨论" (Em "群作用")
      " (第9节) 时会变得显而易见: 参见定理9.5和练习9.17.")
   (P "在任何情况下, 以下观察都为读者提供了一类无限多的重要例子.")
   ((definition #:n "2.1")
    "令" $A "是一个集合. " $A "的" (Em "对称群") ", 或者说" (Em "置换的群")
    ", 记作" $S_A ", 是群" (Aut CatSet $A) ". 集合" (setEnum $1:bold $n:bold)
    "的所有置换的群记作" $S_n ".")
   (P "这术语的由来是很容易澄清的: 一个集合" $A "的自同构当然是集合的同构, 即从"
      $A "到自身的双射; 应用这样一个双射恰相当于对于" $A "的元素施行置换 (或者说打乱). "
      "这种操作可以被视为不改变" $A " (作为集合) 的对于" $A "的变换, 因而是一个"
      (Q "对称") ".")
   (P "群" $S_A "是出了名的大: 正如读者在第1章的练习2.1中所验证的那样, "
      (&= (Card $S_n) (&fact $n)) ". 例如, " (&> (Card (_ $S 70)) (^ 10 100))
      ", 这比可观察宇宙的基本粒子的估计数目明显还要来得更大.")
   (P (Em "潜在令人困惑的点: ") 
      )
   (H4 "第2.2小节 二面体群")
   (P "一个" (Q "对称") "是一个保持结构的变换. 这当然是一种言及自同构的宽松方式, "
      "当我们太过懒惰以至于不想严格定义相关的范畴时. 作为范畴的对象的自同构, "
      "对称自然地形成了群.")
   (P "群的概念在某些上下文中可以被生动地视觉化, 其中一种这样的上下文是关于"
      (Q "几何形状") "的, 例如平面中的多边形和空间中的多面体. 相关的范畴可以定义如下: "
      "令对象是一个常规的平面" $RR^2 "的子集, "
      )
   (H3 "第3节 范畴" CatGrp)
   (H3 "第4节 群同态")
   (H3 "第5节 自由群")
   (H3 "第6节 子群")
   (H3 "第7节 商群")
   (H3 "第8节 典范分解和Lagrange定理")
   (H3 "第9节 群作用")
   (H4 "第9.1小节 作用")
   (P "正如第4.1小节所提及的, 一个群" $G "于一个范畴" CatC
      "中的一个对象" $A "上的一个" (Em "作用") "不过就是一个同态"
      (MB (&: $sigma (&-> $G (Aut CatC $A))) ".")
      "解释这个的方式在于每个元素" (∈ $g $G) "都确定了一个"
      (Q "从" $A "到自身的变换") ", 即" CatC "中" $A
      "的一个同构, 而且作用需要与" $G "的运算和" CatC
      "中的复合相兼容.")
   (P "以一种非常强烈的语气说, 我们关心群真的只是因为其作用在东西上: 知道"
      $G "作用于" $A "上告诉我们关于" $A "的某些事情; 群作用是研究"
      "几何与代数实体的关键工具.")
   (P "实际上, 群作用在研究" (Em "群") "自身时也是关键工具: 我们"
      (Q "理解") "一个群的最好方法之一是使其作用于某个对象" $A
      "上, 希望相应的同态" $sigma "是一个同构, 或者至少是一个单态射. "
      
      )
   (H4 "第9.2小节 集合上的作用")
   (P "在" $A "为" (Em "集合") "的情形下写出我们对于作用的定义, 于是"
      (Aut CatC $A) "就成了对称群" $S_A ", 由此我们得到以下定义:")
   ((definition #:n "9.2")
    "一个群" $G "在一个集合" $A "上的一个" (Em "作用")
    "是一个集合函数 (set-function)"
    (MB (&: $rho (&-> (&c* $G $A) $A)))
    "其满足对于所有" (∈ $a $A) "有" (&= (appl $rho $e_G $a) $a) ", 并且"
    (MB (&: (&cm (@forall $g $h $G) (@forall $a $A))
            (&= (appl $rho (&i* $g $h) $a)
                (appl $rho $g (appl $rho $h $a)))) "."))
   
   (H3 "第10节 范畴中的群对象")
   
   (H2 "第3章 环和模")
   (H3 "第1节 环的定义")
   
   (H3 "第2节 范畴" CatRing)
   (H3 "第3节 理想和商环")
   (H3 "第4节 理想和商: 评注和例子; 主理想和极大理想")
   (H3 "第5节 环上的模")
   (H3 "第6节 " $R "模中的积, 余积, ...")
   (H3 "第7节 复形和同调")
   (H2 "第4章 群, 第二次接触")
   
   (H2 "第5章 ")
   (H2 "第6章 线性代数")
   (P "在许多科学分支中, " (Q "代数") "意味着"
      (Q "线性代数") ": 对于向量空间和线性映射的研究, "
      "也就是说, 研究一个特别的环" $R "上的模的范畴, 其中"
      $R "是一个" (Em "域") " (而且往往人们限制其注意力于"
      "特别的域, 例如" $RR "或" $CC ").")
   (P "这将会是本章的主题之一. 然而, 我会强调"
      "许多在域上做的事情实际上也可以在不那么特别的环上进行. "
      
      )
   ))