#lang racket
(provide algebraic_subtyping.html)
(require SMathML)
(define (MBL label . exp*)
  (MB (Mtable #:attr*
              '((columnalign "left center right")
                (width "100%"))
              (Mtr (Mtd (Mphantom label))
                   (apply Mtd exp*)
                   (Mtd label)))))
(define -- "&mdash;&mdash;")
(define $bool (Mi "bool"))
(define $.
  (Mo "." #:attr* '((lspace "0"))))
(define (∃ . x*)
  (let-values (((x* P*) (split-at-right x* 1)))
    (: $exists (apply &cm x*) $. (car P*))))
(define (∀ . x*)
  (let-values (((x* P*) (split-at-right x* 1)))
    (: $forall (apply &cm x*) $. (car P*))))
(define (RcdType . x*)
  (apply setE (map2 &: x*)))
(define $sqcup (Mo "&sqcup;"))
(define $sqcap (Mo "&sqcap;"))
(define $\| (Mo "|"))
(define-infix*
  (&\| $\|)
  (&sqcup $sqcup)
  (&sqcap $sqcap))
(define-@lized-op*
  (@-> &->)
  (@sqcup &sqcup))
(define algebraic_subtyping.html
  (TnTmPrelude
   #:title "代数子类型"
   #:css "styles.css"
   (H1. "代数子类型")
   (P "大量使用机器翻译, 尽管又经人工大量修饰. "
      "尽管经过修饰, 鉴于大语言模型对于编程语言理论几乎一无所知, "
      "所以难免有很多直接的翻译错误, 我不一定会纠正, "
      "因为我也就是看个大概而已.")
   (H2 "总结")
   (P "类型推断让程序员享有静态的编译期类型检查的优势, "
      "同时无需手动标注类型, 长期以来一直是函数式编程语言的标准特性. "
      "然而, 将类型推断与子类型相结合被证明十分困难, "
      "因为经典类型推断核心所使用的unification引擎只接受等式约束, 而非子类型约束.")
   (P "本论文提出了一种类型系统, 将ML风格的参数多态与子类型相结合, "
      "并支持类型推断, principal types以及可判定的类型subsumption. "
      "类型推断基于biunification" --
      "一种适用于子类型约束的unification类比机制.")
   (P "使这一切成为可能的, 是若干理论贡献, 其中首要的是" (Q "可扩展")
      "类型系统的概念. 该概念假设存在一个开放的类型世界, 从而保证: "
      "向语言中添加新类型, 不会使原本可定型的程序变得不可定型. "
      "以往的子类型化方案均未能满足可扩展性, 而本论文表明, "
      "采用更具代数风格的方法可以弥补这一缺陷. "
      "基于这一方法, 本论文发展了biunification的理论, "
      "阐明了其用于类型推断的方式, 并展示了其高效实现的途径" --
      "深刻利用了正则语言代数与多态子类型之间的内在联系.")
   (H2. "引论")
   (P "长期以来, 使用ML及其衍生语言等函数式语言的程序员一直享受强大的类型推断能力"
      -- "他们可以写出"
      (CodeB "f x y = {foo : x, bar : y}")
      "然后让编译器静态地推断出: 函数" (Code "f")
      "返回一条record, 其" (Code "foo") "和" (Code "bar")
      "字段的类型分别与" (Code "f")
      "的第一个和第二个参数的类型一致. 用符号表示即为"
      (MB (&: $f (∀ $alpha $beta
                    (&-> $alpha $beta
                         (RcdType 'foo $alpha
                                  'bar $beta)))))
      "而更长久以来, 程序员们一直借助前置条件与后置条件来推理程序 "
      "(尽管这一过程未必令人愉快). 具体而言, "
      "若某函数所提供的后置条件能满足另一函数所要求的前置条件, "
      "则前者的输出可作为后者的输入. 例如, " (Code "f")
      "的输出可以传递给函数" (Code "g") ", 即"
      (CodeB "g x = x.foo")
      "这是因为" (Code "g") "仅要求其输入拥有一个名为"
      (Code "foo") "的字段, 而" (Code "f")
      "恰好提供了含有该字段的输出.")
   (P "这种推理本质上是不对称的. 函数" (Code "f")
      "所产生的输出, 其后置条件可能强于" (Code "g")
      "所要求的: 在上例中, " (Code "f")
      "的输出还额外拥有一个名为" (Code "bar")
      "的字段. 然而这与传统的类型推断方法相悖" --
      "传统方法将程序归结为一组类型等式, "
      "将输出端所提供的类型与输入端所要求的类型相等同. "
      "这种做法不允许" (Code "f") "所提供的条件强于"
      (Code "g") "所要求的条件.")
   (H3. "类型和数据流")
   (P "传统的类型推断方法要求: "
      "某个值被产生时所提供的类型 (例如"
      (Code "f") "的返回值) "
      "与该值被消费时所要求的类型 (例如"
      (Code "g") "的参数) 必须严格相等. "
      "这使得数据流的方向被完全忽视. "
      "其结果是, 大量使用record等语言特性变得相当繁琐, "
      "而面向对象风格的编程则几乎无从实现. "
      "然而, 忽视数据流的弊端并不局限于record和对象这类特性, "
      "甚至会导致一些简单的函数变得不如预期的那般通用.")
   (P "考虑" (Code "select") "函数" --
      "它接受三个参数: 谓词" (Code "p")
      ", 值" (Code "v") "以及默认值" (Code "d")
      ", 若" (Code "p") "对" (Code "v")
      "成立则返回" (Code "v")
      ", 否则返回" (Code "d") ":"
      (CodeB "select p v d = if (p v) then v else d")
      "在ML及相关语言中, " (Code "select")
      "的类型模式 (scheme) 为"
      (MB (∀ $alpha (&-> (@-> $alpha $bool)
                         $alpha $alpha $alpha)))
      "这个类型颇为奇怪, 因为它要求传入的默认值"
      (Code "d") "必须能被谓词" (Code "p")
      "所接受. 然而这一约束并不来源于程序的实际行为: "
      "我们的函数在任何时候都不会将"
      (Code "d") "传递给" (Code "p") ".")
   (P "下面来审视这个函数的实际数据流:"
      
      )
   (P "只有无视上述边的方向, 才能得出"
      (Q (Code "d") "流向" (Code "p") "的参数")
      "这一结论. 而这恰恰正是ML的做法: "
      "通过将数据流转化为类型之间的等式约束, "
      "数据流的方向信息被丢弃了. "
      "由于等式具有对称性, 数据流便被视作无向的.")
   (P "支持子类型的类型系统则关注数据流的方向. "
      "在子类型机制下, "
      "数据的来源必须至少提供目的地所要求的保证, "
      "但也可以自由地提供更强的保证.")
   (P "本论文所描述的类型系统支持子类型. 它为"
      (Code "select") "函数赋予如下类型:"
      (MB (∀ $alpha $beta
             (&-> (@-> $alpha $bool)
                  $alpha $beta
                  (@sqcup $alpha $beta))))
      "这正对应于上面的数据流图: 谓词" (Code "p")
      "必须能接受值" (Code "v") " (其类型为" $alpha
      "), 但默认值" (Code "d") "可以具有不同的类型"
      $beta ". 而输出的类型为" (&sqcup $alpha $beta)
      ", 因此只能用于同时接受" $alpha
      "和" $beta "的上下文中.")
   (H3. "贡献")
   (H3. "子定型的设计原则")
   (P "本论文的类型系统与以往工作的主要区别, "
      "不在于定型规则, 程序的句法或语义, 而在于类型的集合本身. "
      "我们并非直接给出类型与子类型的定义, "
      "而是首先考虑这些类型应当遵循的若干指导原则.")
   (H4. "可扩展性")
   (P "第一个指导原则是可扩展性. "
      "我将一个类型系统称为可扩展的, "
      "当且仅当仅仅向语言中添加更多类型, "
      "不会导致任何原本可定型的程序变得不可定型. "
      "换言之, 可扩展的类型系统从不依赖于某些类型的不存在性: "
      "它们假设类型世界是开放的, 而非封闭的.")
   (P "可扩展性之所以值得追求, 原因是多方面的. "
      "首先, 编程语言会不断演进, "
      "新特性与新类型会在后续版本中被陆续引入. "
      "为确保早期版本中编写的旧程序能够继续正常运行, "
      "这些旧程序就不能依赖于新类型的缺失.")
   (P "即便我们认为某门语言已臻完善, 无需再做改动, "
      "编译器也难以掌握所有类型. "
      "若该语言支持用户自定义类型与分离编译, "
      "则编译器在编译程序时, "
      "往往只能获知一个不完整的类型集合.")
   (P "可扩展性这一概念鲜少受到关注. "
      "我推测其原因在于, 大多数情况下它会自然而然地成立. "
      "在没有子类型的情况下, 通常无需特别努力即可保证可扩展性.")
   (P "然而, 引入子类型后情况便有所不同. "
      "本章后续部分 (第1.4节) 将展示以往方法如何以"
      "看似自然的子类型定义破坏了可扩展性. "
      "第3章中, 我将提出一种不同的子类型处理方式, "
      "以保持可扩展性.")
   (H4. "代数先于句法")
   (P "第二个指导原则是, 相较于类型的句法, "
      "更应着重关注类型的代数结构. "
      "类型的代数由定义在类型上的运算及其相互关系所构成: "
      "哪些类型是其他类型的子类型或与之相等, "
      "类型是否构成格, 等等. "
      "了解类型的代数结构在编写程序时颇为有用, "
      "因为它使程序员能够推断所用类型是否等价, "
      "或至少是否相容. 有鉴于此, "
      "本论文将首先聚焦于确定正确的类型代数结构, "
      "其次才考虑寻找表示它的句法.")
   (P "更简洁地说, 这一思路可以概括为:"
      (Blockquote
       "寻找" (B "最简洁")
       "的类型代数结构, 以及表示它的"
       (B "某种") "句法."))
   (P "这与标准方法形成鲜明对比. "
      "标准方法从最简洁的类型句法出发, "
      "进而在其上构建某种代数结构. "
      "若以句法的极简性为首要目标, "
      "则极易导致代数结构变得繁复难用. "
      "下文将列举若干此类无意间引入复杂性的例子.")
   (P "代数方法的一个优点在于, 它使可扩展性更易实现. "
      "句法推理的基本工具 (基于抽象句法的定义, 对项的归纳) "
      "预设了一个封闭的项的世界, 因此若可扩展性成立, "
      "也不过是巧合或艰辛努力的结果. "
      "而另一方面, 代数的基本工具 (公理化定义, 等式推理) "
      "则在默认情况下就具有可扩展性.")
   (H3. "可扩展性的失却")
   (P "接下来, 我们将梳理一种标准的子类型处理方式, "
      "说明可扩展性原则是如何被看似无害的定义轻易破坏的, "
      "以及如何通过对类型代数结构的审慎处理加以修复. "
      "以下讨论较为非正式, 完整阐述将留至第3章.")
   (P "作为贯穿始终的例子, 我们考虑一种简单的函数式语言, "
      "其中包含记录类型与原始布尔类型. "
      "非正式地, 该语言的类型由如下抽象句法定义:"
      (MBL "(1.4)"
           (&= 'types (&\| 'boolean_type
                           'function_types
                           'record_types)))
      "为支持子类型, 上述类型被赋予某种偏序关系. "
      "该偏序的大部分细节在此暂不相关 "
      "(尽管我们将在第3章中详加讨论). "
      "目前唯一值得关注的一点是, "
      "函数类型, 记录类型与布尔类型两两不可比: "
      "虽然存在一些子类型规则, "
      "规定了例如两种不同记录类型之间的子类型关系, "
      "但记录类型与函数类型之间并无此类规则.")
   (P "函数类型与记录类型不仅不可比, "
      "而且也没有公共的上界或下界. "
      "这一事实使得类型的偏序无法构成格. "
      "而为了进行类型推断, 类型构成格是非常有用的, "
      "因为这样一来, 条件表达式的结果类型"
      "便可被类型化为各分支结果类型的最小上界.")
   (P "因此, 子类型系统通常采用如下不同的类型定义, "
      "使之确实构成一个格:"
      (MBL "(1.5)"
           (&= 'types (&\| 'boolean_type
                           'function_types
                           'record_types
                           $bottom
                           $top)))
      "新引入的类型" $bottom
      "是所有类型的子类型, "
      "因而是无寓居类型, 不包含任何值; 而"
      $top "是所有类型的超类型, "
      "因而是无信息类型, 包含所有值. "
      "添加这两种类型后, 类型的偏序 "
      "(在函数与记录子定型的通常定义下) "
      "便构成了一个格.")
   (P "然而, 这个格在实践中表现相当不佳. "
      "在存在类型变量的情况下, "
      "即便是相当简单的子类型性质也难以判定 "
      "[SAN+02, Reh98, Pri04].")
   (P "下文将说明, 这种不良行为源于其对可扩展性的违背, "
      "而坚守第1.3节所述的设计原则, 则可有效规避这一问题.")
   (H4. "虚空推理")
   (P "使用(1.5)定义的格, 对于每个函数类型" $tau_f
      "和记录类型" $tau_s ", 我们都有"
      (MBL "(1.6)"
           (&<= (&sqcap $tau_f $tau_s)
                $bool))
      "其中" $sqcap "是格的meet运算. "
      "因此, (1.5)的格假定了不存在, "
      "将来也永远不会存在, "
      "同时为记录 (有着属性) 和函数 (可以被应用) 的值. "
      "我注意到这样的值最初没有出现在C++, "
      "Python等编程语言语言之中, "
      "但是之后却加入了.")
   (P "因此, 可扩展性要求我们将类似于(1.6)这样的陈述视为假的. "
      "特别地, 类型" (&sqcap $tau_s $tau_f) ", "
      (&sqcap $tau_s $bool) ", "
      (&sqcap $tau_f $bool)
      "应该是不同的也不可比较的类型. "
      "这些类型当前并非寓居不代表我们就应该将它们视为等同的.")
   (P "让我们重新检视原本的定义(1.4), "
      "其定义类型的集合为函数类型的集合, 记录类型的集合, "
      "布尔类型的集合的无交并. "
      "{译注: 当然了, 布尔类型只有一个, "
      "函数类型和记录类型都有许多.} "
      "以" $+ "记无交并, 我们表达其以"
      (MBL "(1.7)"
           (&= 'types (&+ 'boolean_type
                          'function_types
                          'record_types)))
      "{译注: 这上面四个东西都是集合.} "
      "无交并在集合范畴中是余积, "
      "所以说我们有很好的借口滥用符号"
      $+ ".")
   
   (H4. "封闭世界多态和自由代数")
   (H3. "论文的结构")
   (H2. "背景")
   (P "这篇论文所研究的中心问题是" (Em "类型推导")
      ", 这是检视程序并推导其类型的动作.")
   (P "当检视程序时, 我们会发现其子表达式"
      "会对于我们可以赋予该程序的类型施加" (Em "约束")
      ". 例如, 设我们有了一个具有类型"
      (&-> $tau_1 $tau_2) "的函数于具有类型"
      $tau_3 "的参数的应用. 那么, "
      "这个应用能够被定型仅当类型" $tau_3
      "的值能够传递给期望类型" $tau_1
      "的值的地方. 在类型推导算法能够赋予一个类型于该应用之前, "
      "这个约束必然要得到处理.")
   (P "在经典的Hindley-Milner类型推导算法中, "
      "约束是一种相等约束, 而应用能够被定型仅当"
      (&= $tau_1 $tau_3) ". 类型被定义为一阶项, "
      "而相等约束是运用合一处理的.")
   (P (Em "子定型") "允许更为有趣的约束, "
      "特别是由于其并不要求对称性: "
      "这只是因为我们可以将一个" $tau_3
      "传给期望一个" $tau_1
      "的地方并不能推出反过来也成立. "
      "这对于许多语言特征进行了建模: "
      "最朴素的一点是, 我们可以期望有着更多域的记录"
      "用在需要更少的域的记录的上下文里. "
      "然而, 合一的经典理论不能应用于子定型约束, "
      "于是类型推导的标准方法就失效了.")
   
   (H3. "序理论")
   
   (H2. "构造类型")
   (P "对于本论文的大部分而言, "
      "我们会研究一种具有子定型的极小演算, "
      "其包含布尔值, 记录, 以及函数. "
      "这三个特性足以使得子定型关系实际上会变得尴尬, "
      "但又保持了语言尽可能简单:"
      (Ul (Li "布尔值给出了一个基本类型, "
              "这个类型与任何其他使用类型构造子"
              "作成的类型都是不可比较的.")
          (Li "函数给出了具有不同variance的类型参数的类型构造子: "
              "函数类型相对于domain是逆变的, "
              "相当于codomain是协变的.")
          (Li "记录给出了不同元数的类型构造子之间的子定型关系, "
              "因为具有更多的域的记录类型是具有更少的域的记录类型的子类型."))
      "包括这三种类型排除了一些著名的更为简单的情形: "
      "函数类型意味着我们不能假定纯粹的" (Em "协变子定型")
      ", "
      )
   (H2. "类型系统")
   (H2. "极性和双向合一 (biunification)")
   (H2. "主类型推导")
   (H2. "类型的表示")
   
   ))