#lang racket
(provide algebraic_topology.html)
(require SMathML)
(define algebraic_topology.html
  (TnTmPrelude
   #:title "代数拓扑"
   #:css "styles.css"
   (H1. "代数拓扑")
   (H2 "前言")
   (P "代数拓扑是" (Q "连续") "和" (Q "离散") "数学之间的交互作用. "
      "连续数学的最一般形式是用拓扑空间和连续映射的语言表述的. "
      "离散数学是用来表达代数和组合的概念的. "
      "用数学语言来说: 我们使用实数来概念化连续形式, "
      "而我们使用整数来对于这些形式建模. "
      
      )
   (H2. "拓扑空间")
   (H2. "基本群")
   (H2. "覆叠空间")
   (H2. "初等同伦论")
   (H2. "余纤维化和纤维化")
   (H2. "同伦群")
   (H2. "稳定同伦对偶")
   (H2. "胞腔复形")
   (H2. "奇异同调")
   (H2. "同调")
   (H2. "同调代数")
   (H2. "胞腔同调")
   (H2. "同伦论中的单位划分")
   (H2. "丛")
   (H2. "流形")
   (H2. "流形的同调")
   (H2. "上同调")
   (H2. "对偶")
   (H2. "示性类")
   (H2. "同调和同伦")
   ))