#lang racket
(provide algebra.html)
(require SMathML)
(define (make-entry name class)
  (lambda (#:n [n ""])
    (lambda x*
      (keyword-apply
       Div '(#:attr*) `(((class ,class)))
       (B (format "~a~a." name n)) " " x*))))
(define joke (make-entry "玩笑" "joke"))
(define tcomment (make-entry "译者注记" "tcomment"))
(define (forall . b)
  (: $forall (apply ∈ b)))
(define (@forall . b)
  (@ $forall (apply ∈ b)))
(define (Cat name)
  (Mi name #:attr* '((mathvariant "sans-serif"))))
(define CatC (Cat "C"))
(define CatG (Cat "G"))
(define CatSet (Cat "Set"))
(define CatGrp (Cat "Grp"))
(define $Hom (Mi "Hom"))
(define Hom
  (case-lambda
    ((A B) (appl $Hom A B))
    ((C A B) (appl (_ $Hom C) A B))))
(define $Aut (Mi "Aut"))
(define Aut
  (case-lambda
    ((A) (app $Aut A))
    ((C A) (app (_ $Aut C) A))))
(define $*:id (Mi "&#8270;"))
(define $1_* (_ $1 $*:id))
(define $1:bold (Mi "1" #:attr* '((mathvariant "bold"))))
(define (Card S) (&abs S))
(define $bull (Mo "&bull;"))
(define-infix*
  (&bull $bull)
  )
(define algebra.html
  (TmPrelude
   #:title "代数: 第0章"
   #:css "styles.css"
   (H1 "代数: 第0章")
   (H2 "第1章 预备: 集合论和范畴")
   (H2 "第2章 群, 第一次接触")
   (H3 "第1节 群的定义")
   (H4 "第1.1小节 群和群胚")
   ((joke #:n "1.1")
    "定义: 一个群是一个仅有一个对象的群胚.")
   (P "这实际上是一个相当可行的定义, 因为群胚既已定义 (在第1章的第4.6小节); "
      "但是大多数数学家会认为以这种方式引入群是滑稽可笑的, 或者说至少"
      "他们会善意地质疑这么做在教学上的有效程度. 为了挽回一下我自己, "
      "我会立即parse这个定义来表明它到底是在说什么. "
      "[译注: parse是一个计算机术语, 本意是将字符序列或者token序列转换为抽象句法树的过程, "
      "但是这里可以理解为" (Q "仔细阅读") ".] "
      "如果" $*:id "是这样一个群胚" CatG "仅有的对象, 那么"
      (MB (&= (Hom CatG $*:id $*:id) (Aut CatG $*:id)))
      "(因为" CatG "是一个群胚!), 并且这个集合携带了" CatG "的所有信息. "
      "称这个集合为" $G ", 那么(根据范畴的定义)" $G "上存在一个结合运算, "
      "这个结合运算有着恒元" $1_* ", 并且(根据群胚的定义, 其言称" CatG
      "中的每个态射都是一个同构)每个" (∈ $g $G) "都拥有一个逆元"
      (∈ (inv $g) $G) ".")
   (P (Em "这就是") "什么是一个群了: 一个带有某个复合法则的集合" $G
      ", 并满足几条关键性的公理, 即结合律, 恒元的存在性, 以及逆元的存在性.")
   ((tcomment)
    "在某种意义上, 这里存在一个小小的基础性问题, 就是" CatG
    "的所有态射构成的" $G "未必是一个集合, 但是也没有必要太过在意.")
   (H4 "第1.2小节 定义")
   (P "现在是给出正式 (official) 定义的时候. 令" $G "是一个非空集合, 装备有一个"
      (Em "二元运算") ", 即一个" (Q "乘法") "映射"
      (MB (&: $bull (&-> (&c* $G $G) $G)) ".")
      "我们的记号将会是"
      
      )
   (H3 "第2节 群的例子")
   
   (H4 "第2.1小节 对称群")
   (P "在第1章的第4.1小节中我们已经观察到每个范畴" CatC "中的每个对象" $A
      "都决定了一个群, 被称为" (Aut CatC $A) ", 即" $A "的" (Em "自同构")
      "群. 从某种有些人工刻意的角度来说, 显然每个群都以这种方式产生 (参见练习1.1); "
      "这个事实可以更" (Q "有意义") "的方式成立, 当我们讨论" (Em "群作用")
      " (第9节) 时会变得显而易见: 参见定理9.5和练习9.17.")
   (P "在任何情况下, 以下观察都为读者提供了一类无限多的重要例子.")
   ((definition #:n "2.1")
    "令" $A "是一个集合. " $A "的" (Em "对称群") ", 或者说" (Em "置换的群")
    ", 记作" $S_A ", 是群" (Aut CatSet $A) ". 集合" (setEnum $1:bold $n:bold)
    "的所有置换的群记作" $S_n ".")
   (P "这术语的由来是很容易澄清的: 一个集合" $A "的自同构当然是集合的同构, 即从"
      $A "到自身的双射; 应用这样一个双射恰相当于对于" $A "的元素施行置换 (或者说打乱). "
      "这种操作可以被视为不改变" $A " (作为集合) 的对于" $A "的变换, 因而是一个"
      (Q "对称") ".")
   (P "群" $S_A "是出了名的大: 正如读者在第1章的练习2.1中所验证的那样, "
      (&= (Card $S_n) (&fact $n)) ". 例如, " (&> (Card (_ $S 70)) (^ 10 100))
      ", 这比可观察宇宙的基本粒子的估计数目明显还要来得更大.")
   (P (Em "潜在令人困惑的点: ") 
      )
   (H4 "第2.2小节 二面体群")
   (P "一个" (Q "对称") "是一个保持结构的变换. 这当然是一种言及自同构的宽松方式, "
      "当我们太过懒惰以至于不想严格定义相关的范畴时. 作为范畴的对象的自同构, "
      "对称自然地形成了群.")
   (P "群的概念在某些上下文中可以被生动地视觉化, 其中一种这样的上下文是关于"
      (Q "几何形状") "的, 例如平面中的多边形和空间中的多面体. 相关的范畴可以定义如下: "
      "令对象是一个常规的平面" $RR^2 "的子集, "
      )
   (H3 "第3节 范畴" CatGrp)
   (H3 "第4节 群同态")
   (H3 "第5节 自由群")
   (H3 "第6节 子群")
   (H3 "第7节 商群")
   (H3 "第8节 典范分解和Lagrange定理")
   (H3 "第9节 群作用")
   (H4 "第9.1小节 作用")
   (P "正如第4.1小节所提及的, 一个群" $G "于一个范畴" CatC
      "中的一个对象" $A "上的一个" (Em "作用") "不过就是一个同态"
      (MB (&: $sigma (&-> $G (Aut CatC $A))) ".")
      "解释这个的方式在于每个元素" (∈ $g $G) "都确定了一个"
      (Q "从" $A "到自身的变换") ", 即" CatC "中" $A
      "的一个同构, 而且作用需要与" $G "的运算和" CatC
      "中的复合相兼容.")
   (P "以一种非常强烈的语气说, 我们关心群真的只是因为其作用在东西上: 知道"
      $G "作用于" $A "上告诉我们关于" $A "的某些事情; 群作用是研究"
      "几何与代数实体的关键工具.")
   (P "实际上, 群作用在研究" (Em "群") "自身时也是关键工具: 我们"
      (Q "理解") "一个群的最好方法之一是使其作用于某个对象" $A
      "上, 希望相应的同态" $sigma "是一个同构, 或者至少是一个单态射. "
      
      )
   (H4 "第9.2小节 集合上的作用")
   (P "在" $A "为" (Em "集合") "的情形下写出我们对于作用的定义, 于是"
      (Aut CatC $A) "就成了对称群" $S_A ", 由此我们得到以下定义:")
   ((definition #:n "9.2")
    "一个群" $G "在一个集合" $A "上的一个" (Em "作用")
    "是一个集合函数 (set-function)"
    (MB (&: $rho (&-> (&c* $G $A) $A)))
    "其满足对于所有" (∈ $a $A) "有" (&= (appl $rho $e_G $a) $a) ", 并且"
    (MB (&: (&cm (@forall $g $h $G) (@forall $a $A))
            (&= (appl $rho (&i* $g $h) $a)
                (appl $rho $g (appl $rho $h $a)))) "."))
   
   (H3 "第10节 范畴中的群对象")
   
   (H2 "第3章 环和模")
   (H2 "第4章 群, 第二次接触")
   (H2 "第5章 ")
   ))