#lang racket
(provide analysis_dieudonne.html)
(require SMathML)
(define (openBall x r)
  (appl $B x r))
(define (&d x y) (appl $d x y))
(define Union
  (case-lambda
    ((a b X) (: (__^^ $Union a b) X))
    ((a X) (: (__ $Union a) X))
    ((X) (: $Union X))))
(define Intersect
  (case-lambda
    ((a b X) (: (__^^ $Cap a b) X))
    ((a X) (: (__ $Cap a) X))
    ((X) (: $Cap X))))
(define analysis_dieudonne.html
  (TmPrelude
   #:title "分析专著"
   #:css "styles.css"
   (H1 "分析专著")
   (P "Treatise on Analysis是Dieudonn&eacute;所著多卷本分析专著. 我仅是抄书.")
   (H2 "第3章 度量空间")
   (P "本章和第5章一起构成了这第一卷的核心, 其建立了表述分析结果的几何语言. "
      "这种语言使得这些结果能够以最一般的形式呈现, 也使得其证明尽可能简单清晰.")
   (H3 "第3.1节 距离和度量空间")
   (P "令" $E "是一个集合. " $E "上的一个距离是一个从" (&c* $E $E) "到实数集" $RR
      "的映射" $d ", 具有以下性质:"
      (Ol (Li "对于任意的" (∈ $x $y $E) ", " (&>= (&d $x $y) $0) ".")
          (Li "关系" (&= (&d $x $y) $0) "等价于" (&= $x $y) ".")
          (Li "对于任意的" (∈ $x $y $E) ", " (&= (&d $y $x) (&d $x $y)) ".")
          (Li "对于任意的" (∈ $x $y $z $E) ", "
              (&<= (&d $x $z) (&+ (&d $x $y) (&d $y $z)))
              " (&quot;三角不等式&quot;).")))
   (P "从三角不等式根据归纳可得对于任意的" (&> $n $2) "有"
      (MB (&<= (&d $x_1 $x_n)
               (&+ (&d $x_1 $x_2) (&d $x_2 $x_3) $..c
                   (&d (_ $x (&- $n $1)) $x_n))) "."))
   (P (B "(3.1.1) ") "如果" $d "是" $E "上的一个距离, 那么对于任意的"
      (∈ $x $y $z $E) "有"
      (MB (&<= (&abs (&- (&d $x $z) (&d $y $z))) (&d $x $y)) "."))
   
   (H3 "第3.2节 距离的例子")
   (P (B "(3.2.1) ") "函数" (&\|-> (tu0 $x $y) (&abs (&- $x $y)))
      "是实数集上的一个距离. "
      )
   (H3 "第3.3节 等距")
   (P "令" (&cm $E $E^) "是两个度量空间, " (&cm $d $d^)
      "分别是其上距离. 一个从" $E "到" $E^ "的双射" $f
      "被称为等距, 如果"
      (MB (&= (appl $d^ (app $f $x) (app $f $y))
              (&d $x $y)))
      "对于任意的" (∈ $x $y $E) "成立. 其逆映射" (inv $f)
      "是从" $E^ "到" $E "的等距. "
      )
   (H3 "第3.4节 球, 球面, 直径")
   
   (H3 "第3.5节 开集")
   (H3 "第3.6节 邻域")
   (H3 "第3.7节 集合的内部")
   (H3 "第3.8节 闭集, 簇点, 集合的闭包")
   (P "在一个度量空间" $E "中, 闭集被定义为开集的补. 空集是闭集, 整个空间"
      $E "也是闭集. 在实轴上, 区间" (: $lb $a $cm (&+ $inf) $lb) "和"
      (: $rb (&- $inf) $cm $a $rb) "是闭集. 整数集" $ZZ "相对于实轴是闭集. 区间"
      (: $lb $a $cm $b $lb) "和" (: $rb $a $cm $b $rb)
      "在实轴上非开非闭.")
   (P (B "(3.8.1) ") "闭球是闭集; 球面是闭集.")
   (P (B "(3.8.2) ") "任意的闭区间族之交是闭集.")
   (P (B "(3.8.3) ") "有限闭集之并是闭集.")
   (P (B "(3.8.4) ") "在离散空间中, 每个集合都是闭集.")
   (P "点" (∈ $x $E) "是" $E "的子集" $A "的簇点, 如果" $x
      "的每个邻域与" $A "的交均非空. " $A "的所有簇点构成的集合被称为" $A
      "的闭包, 记作" (OverBar $A) ". 说" $x "不是" $A "的簇点意味着"
      $x "就在" (&- $E $A) "的内部, 换言之:")
   (P (B "(3.8.5) ") $A "的闭包是" $A "的外部的补.")
   (P "开球" 
      )
   (H3 "第3.9节 稠密子集, 可分空间")
   (P "在度量空间" $E "中, 集合" $A "被称为是相对于集合" $B
      "稠密, 如果" $B "的每个点都是" $A "的簇点. 换言之, "
      (&sub $B (OverBar $A)) ".")
   (P (B "(3.9.1) ") "如果" $A "相对于" $B "稠密, " $B
      "相对于" $C "稠密, 那么" $A "相对于" $C "稠密.")
   ((proof)
    "因为" $A "相对于" $B "稠密, 所以" (&sub $B (OverBar $A))
    ". 因为" $B "相对于" $C "稠密, 所以" (&sub $C (OverBar $B))
    ". 鉴于" (OverBar $A) "是闭集, 所以" (&sub (OverBar $B) (OverBar $A))
    ", 最终我们可以得到" (&sub $C (OverBar $A)) ", 即" $A
    "相对于" $C "稠密.")
   (P "若" $A "相对于" $E "稠密, 则其被称为处处稠密, 或者就说是在" $E
      "中稠密. " $A "可由" (&= (OverBar $A) $E) "刻画, 或者等价地, "
      "每个非空开集都包含" $A "的点. 一个度量空间" $E
      "被称为是可分的, 如果其存在至多可数的稠密子集.")
   (P (B "(3.9.2) ") "实数轴" $RR "是可分的.")
   ((proof)
    "根据(2.2.16), " $QQ "在" $RR "中稠密. 根据(2.2.15), " $QQ
    "是至多可数的.")
   (P "一个非空开集的族" (_ (@ $G_lambda) (∈ $lambda $L))
      "被称为是度量空间" $E "的一个基, 如果每个" $E
      "中的非空开集都是族" (@ $G_lambda) "的一个子族的并. "
      "(事实上, 这两个非空都是不必要的, 但是加上去也是一样的. "
      "另外说一句, 虽然本书不允许空并, 但是将空并定义为空集是完全合理的.)")
   (P (B "(3.9.3) ") "开集族" (_ (@ $G_lambda) (∈ $lambda $L))
      "是基的充要条件为对于每个" (∈ $x $E) "和每个" $x
      "的邻域" $V ", 存在下标" $lambda "满足"
      (∈ $x (&sub $G_lambda $V)) ".")
   ((proof)
    "如果" (_ (@ $G_lambda) (∈ $lambda $L))
    "是一个基, 那么对于" $x "的邻域" $V
    ", 存在开集" (&sub $W $V) "满足" (∈ $x $W)
    ", 于是" $W "是某个子族的并, 因而存在下标" $mu
    "使得" (∈ $x $G_mu) ". 如果对于每个" (∈ $x $E) "和每个"
    $x "的邻域" $V "存在下标" $lambda "满足"
    (∈ $x (&sub $G_lambda $V)) ", 那么设" $U
    "是任意的开集, 对于每个" (∈ $x $U)
    ", 当然" $U "是" $x "的一个邻域, 我们有存在下标"
    (app $mu $x) "使得" (∈ $x (&sub (_ $G (app $mu $x)) $U))
    ", 最终" (&sub $U (Union (∈ $x $U) (_ $G (app $mu $x))) $U)
    ", 即" (&= (Union (∈ $x $U) (_ $G (app $mu $x))) $U) ".")
   (P (B "注记. ") "(3.9.3)不涉及度量, 所以在一般拓扑空间中也是如此.")
   (P (B "(3.9.4) ") "度量空间" $E "是可分空间的充要条件是其存在"
      "一个至多可数的基 (即第二可数性条件).")
   ((proof)
    "设" (_ (@ $G_lambda) (∈ $lambda $L)) "是度量空间" $E
    "的一个至多可数的基, 即要求" $L "是至多可数的. 考虑从每个"
    $G_lambda "中挑选一个点构成集合" $A
    ". (原文要求族中排除了空集, 但是即便定义里不排除空集, 我们"
    "现在排除空集也不会影响其为一个(至多可数的)基.) 这个集合"
    $A "显然是至多可数的. 对于" $E "中任意的非空开集, 其可以表达为"
    "基的某个子族之(非空)并, 我们只需要从这个子族里挑选一个集合"
    $G_mu " (我们已经排除了空集的情况), " $G_mu "与" $A
    "的交非空, 于是这个开集与" $A "的交也非空. 换言之, " $A "是"
    $E "的一个至多可数的稠密子集, 即" $E "是一个可分空间." (Br)
    "反过来, 设" $E "是一个可分空间, " $A "是" $E
    "的一个至多可数的稠密子集. 我们考虑开集族"
    (setI (openBall $a (&/ $1 $n)) (&cm (∈ $a $A) (∈ $n $NN)))
    ", 其中" $NN "是正整数集. 这个集合显然是可数的, 现在我们要说明"
    "其何以成为一个基. 对于" (∈ $x $E) "和" $x "的一个邻域" $V
    ", 我们知道存在" (&> $r $0) "使得" (&sub (openBall $x $r) $V)
    ". 根据阿基米德性质, 存在" (∈ $n $NN) "满足"
    (&< (&/ $1 $n) (&/ $r $2)) ". 因为" $A "是稠密的, 所以存在"
    (∈ $a $A) "满足" (∈ $a (openBall $x (&/ $1 $n)))
    ", 于是也有" (∈ $x (openBall $a (&/ $1 $n)))
    ". 对于" (∈ $y (openBall $a (&/ $1 $n))) ", 我们有"
    (MB (deriv0 (&d $y $x) $<=
                (&+ (&d $y $a) (&d $a $x)) $<
                (&+ (&/ $1 $n) (&/ $1 $n)) $<
                (&+ (&/ $r $2) (&/ $r $2)) $=
                $r))
    "也就是说, " (&sub (openBall $a (&/ $1 $n)) (openBall $x $r) $V)
    ". 换言之, 我们得到了" (∈ $x (&sub (openBall $a (&/ $1 $n)) $V))
    ". 根据(3.9.3), 这个可数的开集族的确是一个基.")
   (P (B "注记. ") "以上的证明亦可用来说明在一般拓扑空间中, "
      "第二可数性条件可以推出可分性, 因为其不涉及度量.")
   (H3 "第3.10节 度量空间的子空间")
   (P "令" $F "是" $E "的非空子集, 那么距离于" (&c* $F $F)
      "上的限制显然是" $F "上的一个度量. 我们说" $F "继承了"
      $E "的度量而成为其子空间. (最开始本书并不要求度量空间一定是非空的, "
      "但是是否要求非空往往只是个人口味问题.)")
   (P (B "(3.10.1) ") "集合" (&sub $B $F) "在子空间" $F
      "中是开集的充要条件是存在" $E "中的开集" $A
      "使得" (&= $B (&cap $A $F)) ".")
   (P (B "(3.10.2) ") "若要求所有" $F "中的开集在" $E
      "中也是开集, 一个充要条件是" $F "在" $E "中是开集."
      )
   (H3 "第3.11节 连续映射")
   (H3 "第3.12节 同胚, 等价距离")
   (H3 "第3.13节 极限")
   (H3 "第3.14节 Cauchy序列, 完备空间")
   (H3 "第3.15节 初等延拓定理")
   (H3 "第3.16节 紧空间")
   (H3 "第3.17节 紧集")
   (H3 "第3.18节 局部紧空间")
   (H3 "第3.19节 连通空间和连通集合")
   (H3 "第3.20节 两度量空间之积")
   
   ))