#lang racket
(provide analysis1_godement.html)
(require SMathML)
(define (|[^]| a b)
  (^ a (bra0 b)))
(define (MBL label . exp*)
  (MB (Mtable
       #:attr*
       '((columnalign "left center right")
         (width "100%")
         (displaystyle "true"))
       (Mtr (Mtd label)
            (apply Mtd exp*)
            (Mtd (Mphantom label))))))
(define ((associative-law op) x y z)
  (&= (op x (@ (op y z)))
      (op (@ (op x y)) z)))
(define ((commutative-law op) x y)
  (&= (op x y) (op y x)))
(define ((distributive-law-right * +) x y z)
  (&= (* x (@ (+ y z)))
      (+ (* x y) (* x z))))
(define $. (Mi "."))
(define-infix*
  (&.* $.))
(define analysis1_godement.html
  (TnTmPrelude
   #:title "分析I Godement"
   #:css "styles.css"
   (H1. "分析I Godement")
   (P "中正的评价: 小说书一样的数学书.")
   (P "我并没有遵照原有的章节编号方式.")
   (H2 "前言")
   (P "1946年和1990年之间我有着数千名学生; "
      "在非常经济的法国体制之下, "
      "阶梯教室可以容纳两百人甚至更多, "
      "所以这并非难以做到的事情. "
      "在诸多场合之下, 我想要写一本书, "
      "其只假定最低限度的数学知识以及对于数学的品味, "
      "就能将读者引至一个起点, "
      "那里他 (或者她) 可以毫无困难地进入二十世纪的更为抽象或者更为复杂的理论之中. "
      "在几番尝试之后, 我于1996年春开始为Springer出版社写下这本书.")
   (P "Springer是一家历史悠久的出版社, "
      "在一般科学出版领域以及特别是数学出版领域有着无可比拟的经验, "
      "到目前为止似乎Springer就是最佳的出版商. "
      "我与其数学部门打交道的六年来充分证明了这一点. "
      "此外Catriona Byrne在该部门负责作者关系, 他已是我的老朋友了, "
      "因此我毫无疑虑地将我的法语作品交付给一家外国出版商, "
      "尽管其并非来自我们的教区 (parish), "
      "但是它对于其专门业务的了解可谓是最顶级的.")
   (Hr)
   (P "这并非一本迎合为了其他目的而不得不学习数学的诸多学生的标准教科书, "
      "尽管或许这本书对于他们来说也会有所助益; "
      "在我写作的时候, 我想着的是那些仅为了数学本身而对于数学感兴趣的读者. "
      "对于许多法国学生来说, 特别是最聪明的一些人, "
      "数学仅仅是通向上层阶级的电梯. "
      "{原注1: 在19世纪的剑桥, Math Tripos的赢得者比起科学家, "
      "更有可能成为法官或者主教.} "
      "我的目的不是为了帮助有着大好前景的年轻人在法国"
      (Em "Ecole polytechnique")
      "的入学竞争中跻身前列以至于三十年后他们会发现他们"
      "服务于某家公营或者私营企业, 或者是成为了头目, "
      "那里或许生产着战斗机, 导弹, 军事电子设备, 核武器, "
      "或者他们可以设计各种金融手段使得他们的公司增长超出他们所能控制的极限, "
      "在这两种情况下他们都至少可以挣得超过Fields奖获得者的二十倍的财富. "
      "{原注2: 我所知道的一位我最聪明的学生在三十五年后的今天是一家控股公司的负责人, "
      "这家公司控制着诸多业务, 其中有一系列超市. "
      "他出售Camembert奶酪, 保鲜膜包裹的肉类, "
      "Tampax卫生棉条, 橙汁, 面条, 芥末, 诸如此类. "
      "如果你不得不做选择, 那么这是一种挥霍大脑灰质的更为文明的方式.}")
   (P "因而本书的目的仅是数学分析的过去面貌. "
      "前两卷的主题是任何人都必须知道的基本想法&mdash;&mdash;"
      "收敛, 连续, 初等函数, 积分, 渐进, Fourier级数和积分. "
      "第II卷也处理了解析函数的经典理论中可用Fourier级数解释的部分 (Weierstrass), "
      "而其他部分 (Cauchy) 则会在第III卷的开头看到. "
      "我并不会犹豫在很早的阶段引入被认为是相对高级的主题, "
      "只要它们可以没有技术困难地进行解释: "
      "由任意可数集索引的级数, " $RR "或者" $CC
      "中的Radon测度的定义和基本性质, 半连续函数的积分, "

      )
   (H2. "集合与函数")
   (H2. "收敛: 离散变量")
   (H3. "收敛序列和级数")
   (H4. "引论: 什么是一个实数?")
   (H4. "代数运算和序关系: " $RR "的公理")
   (P "我们可以将这些公理分为四组.")
   (P "首先的一组是牵涉两大基本运算的代数公式; "
      "其可应用于有理数, 应用于实数, 应用于复数, "
      "其陈述了装备了两个运算的" $RR "或者"
      $CC ", 就像" $QQ "一样, 是一个交换"
      (Em "域") " (与人们在代数中所说的一致) "
      "{译注: 默认域是不可交换的是Bourbaki的习惯, "
      "但这种习惯并不流行}:"
      (Ol (Li ((associative-law &+) $x $y $z)
              "对于所有的" (&cm $x $y $z) "成立;")
          (Li ((commutative-law &+) $x $y)
              "对于所有的" (&cm $x $y) "成立;")
          (Li "存在一个元素" $0 "使得"
              (&= (&+ $0 $x) $x)
              "对于所有的" $x "成立;")
          (Li "给定" $x "存在一个" $y "使得"
              (&= (&+ $x $y) $0) ";")
          (Li ((associative-law &i*) $x $y $z)
              "对于所有的" (&cm $x $y $z) "成立;")
          (Li ((commutative-law &i*) $x $y)
              "对于所有的" (&cm $x $y) "成立;")
          (Li "存在一个元素" (&!= $1 $0) "使得"
              (&= (&.* $1 $x) $x)
              "对于所有的" $x "成立;")
          (Li "对于每个" (&!= $x $0) ", 存在一个"
              $y "使得" (&= (&i* $x $y) $1) ";")
          (Li ((distributive-law-right &i* &+) $x $y $z)
              "对于所有的" (&cm $x $y $z) "成立.")))
   (P "分析教程的角色不是要建立这些公理的推论, "
      "但是在代数的" (Q "引人注目的恒等式")
      "之中, 存在一个我们经常要使用的, 即"
      (Em "二项式公式") ", 其推广了关系"
      (&= (^ (@+ $x $y) $2) (&+ $x^2 (&i* $2 $x $y) $y^2)) ":"
      (MBL "(1.1)"
           (&= (^ (@+ $x $y) $n)
               (&+ $x^n (&/ (&i* $n (^ $x (&- $n $1)) $y) (&fact $1))
                   (&/ (&i* $n (@- $n $1) (^ $x (&- $n $2)) $y^2) (&fact $2))
                   (&/ (&i* $n (@- $n $1) (@- $n $2)
                            (^ $x (&- $n $3)) $y^3)
                       (&fact $3))
                   $..h $y^n)))
      "即"
      (MBL "(1.2)"
           (&= (^ (@+ $x $y) $n)
               (sum (&= $p $0) $n
                    (&i* (comb $n $p)
                         (^ $x (&- $n $p))
                         $y^p))))
      "其中我们置" (&= (&fact $0) $1) ", "
      (&= (&fact $p) (&.* $1 $2 $..h $p))
      ", 以及"
      (MB (&= (comb $s $p)
              (&/ (&i* $s (@- $s $1) $..h
                       (@ $s $- $p $+ $1))
                  (&fact $p)))
          "&nbsp;对于&nbsp;"
          (&cm (∈ $s $CC) (∈ $p $NN)))
      "而"
      (MB (&= (comb $s $p)
              (Choice0
               ((&/ (&fact $s)
                    (&i* (&fact (@- $s $p))
                         (&fact $p)))
                ", 如果" (&<= $0 $p $s))
               ($0 ", 如果" (&> $p $s))))
          "&nbsp;对于&nbsp;"
          (∈ $s $NN) ".")
      "非常简单的证明来源于将对应于指数" $n
      "的公式右侧乘以" (&+ $x $y)
      ", 然后检查结果的确就是对应于指数"
      (&+ $n $1) "的公式右侧 (归纳证明).")
   (P "二项式公式可以写作以下形式"
      (MBL "(1.4)"
           (&= (&/ (^ (@+ $x $y) $n) (&fact $n))
               (sum (&= (&+ $p $q) $n)
                    (&/ (&i* $x^p $y^q)
                        (&i* (&fact $p) (&fact $q))))))
      "其中" $sum "遍历满足" (&= (&+ $p $q) $n)
      "的整数序对" (∈ $p $q $NN) ". 如果我们一般记"
      (MBL "(1.5)" (&= (|[^]| $x $n) (&/ $x^n (&fact $n))))
      "即所谓的" (Em "divided powers") ", 那么我们有"
      (MBL "(1.6)" (&= (|[^]| (@+ $x $y) $n)
                       (sum (&i* (|[^]| $x $p)
                                 (|[^]| $y $q)))))
      "以这种形式, 此关系可以扩展至任意数目的项, 例如"
      (MBL "(1.7)"
           (&= (|[^]| (@+ $x $y $z $y) $n)
               (sum (&= (&+ $p $q $r $s) $n)
                    (&i* (|[^]| $x $p)
                         (|[^]| $y $q)
                         (|[^]| $z $r)
                         (|[^]| $u $s)))))
      
      )
   (H4. "局部或者渐近性质")
   
   (H4. "极限的概念; 连续性和可微性")
   
   (H4. "收敛序列: 定义和例子")
   
   (H4. "级数的语言")
   
   (H4. "调和级数的奇迹")
   
   (H4. "极限上的代数操作")
   
   (H2. "收敛: 连续变量")
   (H2. "幂函数, 指数函数, 对数函数, 三角函数")

   ))
