#lang racket
(provide analysis_munkres.html)
(require SMathML)
(define (dd f a u)
  (app (&prime f) (&\; a u)))
(define analysis_munkres.html
  (TmPrelude
   #:title "流形上的分析"
   #:css "styles.css"
   (H1 "流形上的分析")
   (H2 "第2章 微分")
   (H3 "第5节 导数")
   (P "先来回顾单实变元的实值函数的导数的定义. 令" $A "是" $RR
      "的一个子集, 考虑函数" (func $phi $A $RR) ". 对于"
      (∈ $a $A) ", 若" $A "包含" $a "的一个邻域, 那么" $phi
      "在点" $a "的导数被定义为"
      (MB (&= (app $phi^ $a)
              (lim $t $0
                   (~ (&- (app $phi (&+ $a $t))
                          (app $phi $a))
                      $t))))
      "在这个极限存在的情况下, 我们称" $phi "在点" $a "是可微/可导的.")
   (P "那么, 若" $f "是一个从" $RR^m "的某个子集到" $RR^n
      "的函数时, 该如何合理地推广导数的定义呢?")
   (P "这是第一个尝试. 令" $A "是" $RR^m "的一个子集, 而函数"
      (func $f $A $RR^n) ". 对于" (∈ $a $A) ", 假设" $A "包含" $a
      "的一个邻域, 考虑" (B "非零") "向量" (∈ $u $RR^m)
      ", 那么" $f "在点" $a "沿着方向" $u "的导数被定义为"
      (MB (&= (dd $f $a $u)
              (lim $t $0
                   (~ (&- (app $f (&+ $a (&i* $t $u)))
                          (app $f $a))
                      $t))))
      "这个定义的确是有用的, 然而并没有勾勒出&quot;导数就是线性近似&quot;的完整神韵.")
   (P "以下是Munkres对于导数/微分的定义, 条件与前一段相同. 若存在"
      (∈ $B (^ $RR (&c* $n $m))) "使得"
      (MB (&= (lim $h $0
                   (~ (&- (app $f (&+ $a $h)) (app $f $a) (&i* $B $h))
                      (&abs $h))) $0))
      "其中" (&abs $h) "代表" $h "的确界范数, 但是使用Euclid范数也完全是等价的, 那么称" $f
      "在点" $a "可微/可导. 这个" $B "是唯一的, 其被称为" $f "在点" $a "的导数. 实际上, "
      "导数应该是一个类型为" (&-> $RR^m $RR^n) "的线性映射, Munkres这里的矩阵是线性映射"
      "的具体的矩阵表示.")
   (P "让我们看一个简单的例子, 令" (func $f $RR^m $RR^n) "是一个仿射函数, 即存在"
      (∈ $B (^ $RR (&c* $n $m))) "和" (∈ $b $RR^n) "满足"
      (MB (&= (app $f $x) (&+ (&i* $B $x) $b)))
      "那么" $f "在" $RR^m "的每个点上的导数都是" $B ". 这相当合理, 因为度量每个点的"
      "&quot;变化率&quot;的量自然是这个仿射函数的&quot;线性部分&quot;.")
   (P "可微性, 很自然地蕴涵了方向导数的存在性. 令" (&sub $A $RR^m) "且"
      (func $f $A $RR^n) ", 设" $A "包含点" $a "的一个邻域, 以及" $f "在点"
      $a "是可微的, 那么" $f "在点" $a "的所有方向上的导数都是存在的, 且"
      (MB (&= (dd $f $a $u) (ap (app (@ap $D $f) $a) $u)) ".")
      
      )
   ))