#lang racket
(provide analysis_dieudonne.html)
(require SMathML)
(define (&d x y) (appl $d x y))
(define analysis_dieudonne.html
  (TmPrelude
   #:title "分析专著"
   #:css "styles.css"
   (H1 "分析专著")
   (P "Treatise on Analysis是Dieudonn&eacute;所著多卷本分析专著. 我仅是抄书.")
   (H2 "第3章 度量空间")
   (P "本章和第5章一起构成了这第一卷的核心, 其建立了表述分析结果的几何语言. "
      "这种语言使得这些结果能够以最一般的形式呈现, 也使得其证明尽可能简单清晰.")
   (H3 "第3.1节 距离和度量空间")
   (P "令" $E "是一个集合. " $E "上的一个距离是一个从" (&c* $E $E) "到实数集" $RR
      "的映射" $d ", 具有以下性质:"
      (Ol (Li "对于任意的" (∈ $x $y $E) ", " (&>= (&d $x $y) $0) ".")
          (Li "关系" (&= (&d $x $y) $0) "等价于" (&= $x $y) ".")
          (Li "对于任意的" (∈ $x $y $E) ", " (&= (&d $y $x) (&d $x $y)) ".")
          (Li "对于任意的" (∈ $x $y $z $E) ", "
              (&<= (&d $x $z) (&+ (&d $x $y) (&d $y $z)))
              " (&quot;三角不等式&quot;).")))
   (P "从三角不等式根据归纳可得对于任意的" (&> $n $2) "有"
      (MB (&<= (&d $x_1 $x_n)
               (&+ (&d $x_1 $x_2) (&d $x_2 $x_3) $..c
                   (&d (_ $x (&- $n $1)) $x_n))) "."))
   (P (B "(3.1.1) ") "如果" $d "是" $E "上的一个距离, 那么对于任意的"
      (∈ $x $y $z $E) "有"
      (MB (&<= (&abs (&- (&d $x $z) (&d $y $z))) (&d $x $y)) "."))
   
   (H3 "第3.2节 距离的例子")
   (P (B "(3.2.1) ") "函数" (&\|-> (tu0 $x $y) (&abs (&- $x $y)))
      "是实数集上的一个距离. "
      )
   (H3 "第3.3节 等距")
   (P "令" (&cm $E $E^) "是两个度量空间, " (&cm $d $d^)
      "分别是其上距离. 一个从" $E "到" $E^ "的双射" $f
      "被称为等距, 如果"
      (MB (&= (appl $d^ (app $f $x) (app $f $y))
              (&d $x $y)))
      "对于任意的" (∈ $x $y $E) "成立. 其逆映射" (inv $f)
      "是从" $E^ "到" $E "的等距. "
      )
   (H3 "第3.4节 球, 球面, 直径")
   
   (H3 "第3.5节 开集")
   (H3 "第3.6节 邻域")
   (H3 "第3.7节 集合的内部")
   (H3 "第3.8节 闭集, 簇点, 集合的闭包")
   (P "在一个度量空间" $E "中, 闭集被定义为开集的补. 空集是闭集, 整个空间"
      $E "也是闭集. 在实轴上, 区间" (: $lb $a $cm (&+ $inf) $lb) "和"
      (: $rb (&- $inf) $cm $a $rb) "是闭集. 整数集" $ZZ "相对于实轴是闭集. 区间"
      (: $lb $a $cm $b $lb) "和" (: $rb $a $cm $b $rb)
      "在实轴上非开非闭.")
   (P (B "(3.8.1) ") "闭球是闭集; 球面是闭集.")
   (P (B "(3.8.2) ") "任意的闭区间族之交是闭集.")
   (P (B "(3.8.3) ") "有限闭集之并是闭集.")
   (P (B "(3.8.4) ") "在离散空间中, 每个集合都是闭集.")
   (P "点" (∈ $x $E) "是" $E "的子集" $A "的簇点, 如果" $x
      "的每个邻域与" $A "的交均非空. " $A "的所有簇点构成的集合被称为" $A
      "的闭包, 记作" (OverBar $A) ". 说" $x "不是" $A "的簇点意味着"
      $x "就在" (&- $E $A) "的内部, 换言之:")
   (P (B "(3.8.5) ") $A "的闭包是" $A "的外部的补.")
   (P "开球" 
      )
   (H3 "第3.9节 稠密子集, 可分空间")
   (H3 "第3.10节 度量空间的子空间")
   (H3 "第3.11节 连续映射")
   (H3 "第3.12节 同胚, 等价距离")
   (H3 "第3.13节 极限")
   (H3 "第3.14节 Cauchy序列, 完备空间")
   (H3 "第3.15节 初等延拓定理")
   (H3 "第3.16节 紧空间")
   (H3 "第3.17节 紧集")
   (H3 "第3.18节 局部紧空间")
   (H3 "第3.19节 连通空间和连通集合")
   (H3 "第3.20节 两度量空间之积")
   
   ))