#lang racket
(provide automated_ch5)
(require (except-in SMathML H3. H4. $!=)
         "automated_utils.rkt")
(define automated_ch5
  (Tm*
   (H2. "可判定问题")
   (P "我们已经考虑了各种用于验证一阶公式的逻辑有效性的算法 "
      "(例如tableau, 归结, 等等), 如果该公式的确是有效的. "
      "但是, 这些算法不能在一般情况下告诉我们何时一阶公式不是有效的. "
      "我们将会在第7章看到, 并不存在这样的系统性过程. "
      "然而, 存在过程对于特定种类的公式行之有效, "
      "或者对于特定种类的模型下的有效性行之有效, "
      "而我们会在本章讨论其中一些比较重要的情形. "
      "往往这些问题自然地推广了数学和泛代数中的常见判定问题, "
      "例如方程求解或" (Q "word问题") ".")
   (H3. "判定问题")
   (P "一阶逻辑存在三类自然且紧密关联的我们或许想要某种算法解决方案的问题. "
      "通过对于公式进行否定, 我们可以根据taste选择"
      "是基于有效性还是不可满足性来呈现这些问题. "
      (Ol (Li "确认一个逻辑有效 (或者不可满足) "
              "公式的确是有效的 (相应地, 不可满足的), "
              "但是决不对于非有效 (或者可满足) 公式进行确认.")
          (Li "确认一个逻辑非有效 (或者可满足) "
              "公式的确是非有效的 (相应地, 可满足的), "
              "但是决不对于有效 (或者不可满足) 公式进行确认.")
          (Li "测试一个公式是有效的还是非有效的 "
              "(或者可满足的还是不可满足的)."))
      "显然(3)包裹了(1)和(2). 反过来, "
      "(1)和(2)的解可以一并使用以解决(3): "
      "只需并行运行有效性和非有效性 "
      "(或者可满足性和不可满足性) 的验证过程. "
      "到目前为止, 我们已经显式呈现了(1)的解, "
      "例如tableau或归结. "
      "但是, 这些方法并不能解决(3). "
      "给定一个可满足公式, "
      "这些算法尽管并不会错误地声称可满足公式是不可满足的, "
      "但是也并不总是会终止. "
      "例如, 以下证明非有效公式的尝试不过只是保持着徒劳的搜索:"
      (CodeB "# tab &lt;&lt;forall x. p(x)>>;;
# meson &lt;&lt;forall x. p(x)>>;;"))
   (P "如果转而尝试" (Code "resolution")
      ", 我们的确会得到以失败作结的终止. "
      "但是, "
      )
   (H3. "AE片段")
   (P "我们已经机械化了的所有一阶逻辑证明过程"
      "最终都是由Herbrand定理所澄清的: "
      "公式的Skolem化无量词形式是不可满足的当且仅当"
      "存在某个ground实例 (复数) 的有限合取是命题不可满足的. "
      "一般而言, 可能的ground实例的集合是无限的, "
      "而使用合一来指导我们的搜索并不能改变这一基础事实. "
      "然而, 在Skolem化形式并不包含除了零元函数 "
      "(即常量) 之外的函数这种特殊情形下, "
      "ground实例的数目是有限的. "
      "例如, 回忆一下Łoś公式:"
      (CodeB "let los =
 &lt;&lt;(forall x y z. P(x,y) /\\ P(y,z) ==> P(x,z)) /\\
   (forall x y z. Q(x,y) /\\ Q(y,z) ==> Q(x,z)) /\\
   (forall x y. P(x,y) ==> P(y,x)) /\\
   (forall x y. P(x,y) \\/ Q(x,y))
   ==> (forall x y. P(x,y)) \\/ (forall x y. Q(x,y))>>;;"))
   (P "如果我们对于其否定进行Skolem化以作为反驳的前奏, "
      "那么结果包含四个常量符号和三个变量, "
      "但是不含有非零元函数:"
      (CodeB "# skolemize(Not los);;
- : fol formula =
&lt;&lt;(((~P(x,y) \\/ ~P(y,z)) \\/ P(x,z)) /\\
   ((~Q(x,y) \\/ ~Q(y,z)) \\/ Q(x,z)) /\\
   (~P(x,y) \\/ P(y,x)) /\\ (P(x,y) \\/ Q(x,y))) /\\
  ~P(c_x,c_y) /\\ ~Q(c_x',c_y')>>"))
   (P "这三个自由变量每个都只能由四个常量(项)之一替换, "
      "于是总共只有" (&= $4^3 64) "个ground实例. "
      "因此, Skolem化了的形式的不可满足性等价于这"
      64 "个ground实例之合取的命题不可满足性. "
      "我们之前的过程" (Code "davisputnam")
      "可以相当快速地证明, 仅需尝试这些可能性中的" 45 "个:"
      (CodeB "# davisputnam los;;
0 ground instances tried; 0 items in list
...
44 ground instances tried; 109 items in list
- : int = 45"))
   (P "然而, 现在我们知道我们本也可以联合 "
      "(conjoin) 所有的ground实例, "
      "然后一劳永逸地测试命题可满足性. "
      "这种一般性方法可以实现如下:"
      (CodeB "let aedecide fm =
  let sfm = skolemize(Not fm) in
  let fvs = fv sfm
  and cnsts,funcs = partition (fun (_,ar) -> ar = 0) (functions sfm) in
  if funcs &lt;> [] then failwith &quot;Not decidable&quot; else
  let consts = if cnsts = [] then [&quot;c&quot;,0] else cnsts in
  let cntms = map (fun (c,_) -> Fn(c,[])) consts in
  let alltuples = groundtuples cntms [] 0 (length fvs) in
  let cjs = simpcnf sfm in
  let grounds = map
   (fun tup -> image (image (subst (fpf fvs tup))) cjs) alltuples in
  not(dpll(unions grounds));;")
      "{译注: 首先, 个人感觉为了和前文保持一致, "
      (Code "skolemize(Not fm)") "应该改成"
      (Code "skolemize(Not(generalize fm))")
      ", 不然的话" (Code "fm")
      "必须限定为没有自由变量的公式, 或者说句子. "
      "其次, 可能是因为统筹原因, "
      "这里一些代码的功能其实就是"
      (Code "herbfuns")
      ", 没有必要重复再写一遍. "
      "还有, 最好在" (Code "dpll")
      "之前把平凡子句去除, 尽管并不会出错.}")
   (P "就我们的实现而言, 对于Łoś公式上的测试来说, "
      (Code "aedecide") "碰巧比" (Code "davisputnam")
      "快得多. 但是, 我们对此并不真的感兴趣, "
      "也不会对于中间可能性的相对表现感兴趣, "
      "例如每十个ground实例取一个进行测试 "
      "(这在Davis和Putnam的原始论文中有所考虑). "
      "实际上, 要义在于通过对于ground实例数目设置上界, "
      (Code "aedecide") "总是能够给出yes/no的回答; "
      "如果原本的公式不是有效的, 那么它也会告诉我们, "
      "而不是无限进行下去. {译注: 设置上界的实际含义是"
      "限定Herbrand宇宙为有限集合的情形.}")
   (P "对于许多一般性的定理证明过程而言, "
      "我们也可以相当简单地在这样的情形下保持终止. "
      "例如, 我们可以修改我们的Davis-Putnam过程的内部循环, "
      "以使得公式在有效时返回" (Q $true)
      " (而非ground实例的数目), "
      "而若ground实例之集合穷竭时则返回" (Q $false)
      ". 即便是一些基于合一的过程, "
      "对于输入公式的否定的Skolem化版本, "
      "如果其中没有函数符号, 也能够保证终止. "
      "{译注: 指的是没有元数大于等于一的函数符号.} "
      "或是出于巧合或者根据设计, "
      "终止性对于其他一些重要子集中的公式也能够保证 "
      "(Fermueller, Leitsch, Tammet和Zamov 1993; de Nivelle 1995).")
   (P "我们该如何根据原始问题预料到Skolem化形式只有零元函数符号呢? "
      "出于简单性的考量, 设要被测试可满足性的公式已经处于NNF形式. "
      "首先, 原始公式必须不能含有非零元函数符号, "
      "这是因为Skolem化不会" (Em "去除")
      "任何的函数符号. 其次, 我们必须不能有具有形式"
      (∃ $y (Appl $P $x $y)) "的子公式, "
      "其中该存在量化的作用域里有自由或者全称量化的变量"
      $x ". {译注: 这里的自由其实指的是全局的自由, "
      "这里的全称量化指的是在该存在量化的作用域外被全称量化, "
      "但不管怎么说" $x "相当于这个子公式而言是自由出现的. "
      "那么, 本来也就只有三种情形, 全局自由, 在外层被全称绑定, "
      "在外层被存在绑定, 这里只是排除了在外层被存在绑定的情况.} "
      "这是因为, 其会导致引入的Skolem函数(至少)以" $x
      "作为一个参数. 对于一个句子而言, "
      "一种简单保证该现象不会发生的充分条件是"
      "在任何抵达子公式的路径中, "
      "存在量词都出现在全称量词之前:"
      (MB (∃ $x_1
             (: $..c
                (∃ $x_n
                   (: $..c
                      (∀ $y_1
                         (: $..c
                            (∀ $y_m $)))))))))
   (P "这种性质很难精确陈述, "
      "因为量词和命题联结词相互嵌套的方式可以相当复杂. "
      "{译注: 个人认为编写程序来判断是否具有这种形式似乎并不复杂?} "
      "如果我们将公式置于前束范式, 那么描述能够变得更为容易, "
      "因为我们可以言称一个公式在这要求的子集里当且仅当其具有形式:"
      (MB (∃ $x_1 $..h $x_n
             (∀ $y_1 $..h $y_m
                (Appl $P $x_1 $..h $x_n $y_1 $..h $y_m))))
      "其中" $n "和" $m "都可以为零. "
      "{译注: 当然, 这个公式应该是封闭的.} "
      "既然所有的" (Q $exists) "都出现在" (Q $forall)
      "之前, 这样的公式被称为是处于" (Q "EA子集")
      "之中. 然而, 这里我们讨论的是可满足性问题, "
      "其是应用于我们想要证明的公式的否定. "
      "我们需要我们用于测试有效性的" (Em "原始")
      "公式具有以下形式:"
      (MB (∀ $x_1 $..h $x_n
             (∃ $y_1 $..h $y_m
                (Appl $P $x_1 $..h $x_n $y_1 $..h $y_m))))
      "也就是说, 处于" (Q "AE子集") "或者直接说" (Q "AE")
      ". 之前的评注指出AE公式的有效性是可判定的, "
      "或者说等价地, EA公式的可满足性是可判定的. "
      "{译注: 从技术性的角度来说, 这里的EA公式得是封闭的, "
      "但AE公式可以不是封闭的, 因为全称闭包保持有效性. "
      "当然, 我们首先应该记住这些公式都不应该含有"
      "元数大于等于一的函数符号.}")
   (P "尽管前束范式的系统运用可以简化公式的分类, "
      
      )
   (H3. "Miniscoping and the monadic fragment")
   (H3. "三段论")
   (H3. "有限模型性质")
   (H3. "量词消去")
   (H3. "Presburger算术")
   (H3. "复数")
   (H3. "实数")
   (H3. "环, 理想和word问题")
   (H3. "Gr&ouml;bner基")
   (H3. "几何定理证明")
   (H3. "将判定过程进行组合")
   (H3. "深入阅读")
   (P "许多逻辑学教材讨论了判定问题. "
      "关于判定问题在逻辑有效性方面可判定与不可判定的情形, "
      "可参见Börger, Grädel和Gurevich (2001), Ackermann (1954) "
      "以及Dreben和Goldfarb (1979), "
      "此外Hilbert和Ackermann (1950) 对此也有简要论述. "
      "需要注意的是, 判定问题通常从可满足性而非有效性的对偶角度加以处理, "
      "因此在将此类文献与本文的讨论相对照时, 需要在量词前缀中互换"
      $forall "与" $exists "的角色. Rabin (1991) 对可判定理论进行了综述, "
      "其中一些我们已在本章中加以讨论.")
   (P "三段论在诸多逻辑史著作中有详尽讨论, "
      "如Bocheński (1961), Dumitriu (1977), "
      "Kneale和Kneale (1962) 以及Kneebone (1963).")
   (P "文献中还有若干其他数学理论的量词消去结果. "
      "两个较为困难的例子是Abel群理论 (Szmielew 1955) "
      "与Boole代数理论 (Tarski 1949). "
      "Kreisel和Krivine (1971) 有一章专门讨论量词消去, "
      "内容涵盖可分Boole代数理论 (以及作为特例的原子Boole代数). "
      "其他标准模型论教材, 如Chang和Keisler (1992), "
      "Hodges (1993b) 以及Marcja和Toffalori (2003), "
      "也讨论了量词消去及模型完备性, " $o "-极小性等相关概念; "
      "模型完备性的一种表述 (A. Robinson 1963; MacIntyre 1991) 为: "
      "对于理论" $T ", 每个公式都" $T "-等价于一个纯全称公式 "
      "(或者等价地, 纯存在公式). "
      "Ershov, Lavrov, Taimanov和Taitslin (1965) "
      "在文末对量词消去方法成功应用的各类理论进行了综述. "
      "Soloray (私人通信) 也向本书作者介绍了一种适用于"
      "各类实与复向量空间的量词消去过程.")
   (P "Presburger算术及若干相关理论的处理可见于Enderton (1972), "
      "而Smoryński (1980) 则对Presburger与Skolem"
      "的不同量词消去程序作了详细阐述. "
      "该书包含大量相关主题的内容, "
      "其中包括对相应乘法理论的讨论. "
      "Smoryński (1981) 给出了Presburger算术量词消去的一个精彩应用. "
      "Yap (2000) 进一步深入探讨了相关可判定性问题, "
      "并包含许多其他相关材料. "
      "Presburger算术的其他处理方法还包括"
      "Omega测试 (Pugh 1992) 与Williams (1976) 的方法. "
      "Weispfenning (1999) 给出了一种适用于"
      "实数与整数混合线性算术的量词消去过程.")

   (H3. "练习")
   ))
