#lang racket
(provide automated.html)
(require SMathML)
(define $epsilonv (Mi "&varepsilon;"))
(define $loves (Mi "loves"))
(define (&loves x y)
  (appl $loves x y))
(define (App f x)
  (ap f (bra0 x)))
(define $cos (Mi "cos"))
(define (Ramsey s t)
  (appl $R s t))
(define $Disj (Mo "&Vee;"))
(define $Conj (Mo "&Wedge;"))
(define-bigop*
  (Disj $Disj)
  (Conj $Conj))
(define (_prime A x)
  (_^ A x $prime))
(define (|[;]| . x*)
  (bra0 (apply &\; x*)))
(define (_cm A . x*)
  (_ A (apply &cm x*)))
(define $dual (Ms "dual"))
(define (&dual p)
  (APP $dual p))
(define $.
  (Mo "." #:attr* '((lspace "0"))))
(define (∃ . x*)
  (let-values (((x* P*) (split-at-right x* 1)))
    (: $exists (apply : x*) $. (car P*))))
(define (∀ . x*)
  (let-values (((x* P*) (split-at-right x* 1)))
    (: $forall (apply : x*) $. (car P*))))
(define $exists!
  (Mo "&exist;!" #:attr* '((lspace "0") (rspace "0"))))
(define (∃! . x*)
  (let-values (((x* P*) (split-at-right x* 1)))
    (: $exists! (apply : x*) $. (car P*))))
(define $phiv (Mi "&phiv;"))
(define (qstroke x A B)
  (: A (_ $\| x) B))
(define (subst-eval x q p v)
  (&= (&eval (@psubst x q p) v)
      (&eval p (@ext v x (&eval q v)))))
(define Γ $Gamma:normal)
(define Δ $Delta:normal)
(define (deriv^ x . y*)
  (set-attr*
   (apply
    Mtable
    (Mtr (Mtd $) (Mtd x))
    (map (lambda (y)
           (Mtr (Mtd $=) (Mtd y)))
         y*))
   'columnalign "center left"))
(define todo.svg
  (Svg
   #:attr* '((width "320")
             (height "160")
             (stroke "black")
             (style "display: block; margin: auto;"))
   (Path #:attr* '((x "0")
                   (y "0")
                   (d "M 0 0 h 320 v 160 h -320 z")
                   (fill "none")))
   (Text #:attr* '((x "130") (y "80")) "欠一张图")))
(define ((tcomment #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "tcomment")))
   (B (format "译者注记~a." n)) " " x*))
(define $d:form
  (Mo "d" #:attr* '((lspace "0") (rspace "0"))))
(define (&d x)
  (ap $d:form x))
(define (&d/d y x)
  (&/ (&d y) (&d x)))
(define -- "&mdash;&mdash;")
(define (format-num section index)
  (and index
       (format "~a.~a" (cadr (reverse section)) index)))
(define (format-head name section index)
  (let ((num (format-num section index)))
    (if num
        (B name (format "~a. " num))
        (B name ". "))))
(define (Entry name class)
  (define (present %entry attr* . html*)
    (define id (%entry-id %entry))
    (define Attr* (attr*-set attr* 'class class 'id id))
    (define section (%entry-section %entry))
    (define index (%entry-index %entry))
    (define head (format-head name section index))
    `(div ,Attr* ,head . ,html*))
  (define (cite %entry)
    (define id (%entry-id %entry))
    (define href (string-append "#" id))
    (define section (%entry-section %entry))
    (define index (%entry-index %entry))
    (define num (format-num section index))
    (Cite `(a ((href ,href)) ,name ,num)))
  (lambda (#:id [id #f] #:auto? [auto? #t])
    (lambda (#:attr* [attr* '()] . html*)
      (cons (build-%entry #:id id #:auto? auto? #:present present #:cite cite)
            (cons attr* html*)))))
(define-syntax-rule (define-Entry* (id name class) ...)
  (begin (define id (Entry name class))
         ...))
(define-Entry*
  (Corollary "推论" "corollary")
  (Definition "定义" "definition")
  (Remark "评注" "remark")
  (Theorem "定理" "theorem")
  (Warning "警告" "warning")
  (Example "例子" "example")
  (Proposition "命题" "proposition"))
(define (H3. #:attr* [attr* '()] #:id [id #f]
             #:switch? [switch? #f] #:auto? [auto? #t] . html*)
  `(,(build-%heading #:present h3-present #:cite heading-cite
                     #:level 3 #:id id #:switch? switch?
                     #:auto? auto?)
    ,attr* . ,html*))
(define (H4. #:attr* [attr* '()] #:id [id #f]
             #:switch? [switch? #f] #:auto? [auto? #t] . html*)
  `(,(build-%heading #:present h4-present #:cite heading-cite
                     #:level 4 #:id id #:switch? switch?
                     #:auto? auto?)
    ,attr* . ,html*))
(define $space:2ex (&space 2))
(define (@@ . x*)
  (apply @ (add-between x* $space:2ex)))
(define (APP . x*)
  (apply : (add-between x* $space:2ex)))
(define $atoms (Ms "atoms"))
(define (&atoms p)
  (app $atoms p))
(define $eval (Ms "eval"))
(define (&eval p v)
  (APP $eval p v))
(define $true (Mi "true"))
(define $false (Mi "false"))
(define $~ (Mo "~"))
(define &~
  (make-op $~
           (err0 '&~)
           (lambda (x) (: $~ x))))
(define $& (Mo "&amp;"))
(define $\| (Mo "|"))
(define $<-> (Mo "&harr;"))
(define $--> (Mo "&xrarr;"))
(define $!= (Mo "&vDash;"))
(define (!= . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (: (apply &cm a*) $!= (car b*))))
(define (G!= . x*)
  (apply != Γ x*))
(define $!- (Mo "&vdash;"))
(define (!- . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (: (apply &cm a*) $!- (car b*))))
(define (G!- . x*)
  (apply !- Γ x*))
(define $\|=> (Mo "|&rArr;"))
(define $o* (Mo "&otimes;"))
(define $NAND (Mo "NAND"))
(define $NOR (Mo "NOR"))
(define-infix*
  (&NAND $NAND)
  (&NOR $NOR)
  (&o* $o*)
  (&\|=> $\|=>)
  (&--> $-->)
  (&conj $conj)
  (&disj $disj)
  (&& $&)
  (&\| $\|)
  (&=> $=>)
  (&<-> $<->))
(define Σ $Sigma:normal)
(define Σ_1 (_ Σ $1))
(define (ext f x v)
  (ap (@\|-> x v) f))
(define $psubst (Ms "psubst"))
#;
(define (&psubst s p)
  (APP $psubst s p))
(define &psubst
  (case-lambda
    ((s p) (APP $psubst s p))
    ((x q p) (&psubst (@\|=> x q) p))))
(define $not (Mi "not"))
(define (&not x)
  (app $not x))
(define-@lized-op*
  (@∃ ∃)
  (@∀ ∀)
  (@dual &dual)
  (@compose &compose)
  (@NAND &NAND)
  (@NOR &NOR)
  (@o* &o*)
  (@<=> &<=>)
  (@\|=> &\|=>)
  (@psubst &psubst)
  (@ext ext)
  (@\|-> &\|->)
  (@=> &=>)
  (@conj &conj)
  (@disj &disj)
  (@neg &neg)
  (@c* &c*))
(define automated.html
  (TnTmPrelude
   #:title "实用逻辑和自动推理手册"
   #:css "styles.css"
   (H1. "实用逻辑和自动推理手册")
   (H2 "前言")
   (P "本书是关于可以执行" (Em "自动推理")
      "的计算机程序的. 我对" (Q "推理")
      "的理解相当狭义: 重点在于形式演绎推理, "
      "而非诸如扑克博弈或医学诊断之类的问题. 另一方面, 我对"
      (Q "自动") "的理解则相当宽泛, "
      "包括人与机器协同推理的交互式方案, "
      "并且我始终关注演绎推理在现实世界问题中的应用. "
      "事实上, 除了其本身固有的魅力之外, "
      "这一学科因其工业应用而日益重要.")
   (P "本书旨在作为该领域以及逻辑推理本身的入门导引. "
      "读者无需具备数理逻辑的先修知识, 但不可避免地, "
      "拥有一定的数学背景和计算机编程经验 "
      "(尤其是函数式语言, 如 OCaml, F#, Standard ML, Haskell或LISP) "
      "将大有裨益. 与该领域众多专题性著作不同, "
      "本书力求提供一个广泛而均衡的综合性导论, "
      "并具有两个显著特点."
      (Ul (Li "纯逻辑与自动定理证明以紧密交织的方式加以阐述. "
              "逻辑学的成果在发展过程中始终着眼于其在自动定理证明中的作用, "
              "并尽可能以显式计算的方式加以展开.")
          (Li "自动定理证明方法的阐述均参照实际的具体实现, "
              "读者若能方便地使用计算机, 即可亲自进行实验. "
              "所有代码均采用高层次函数式语言OCaml编写.")))
   (P "尽管这种编排方式有待商榷, "
      "但我是在审慎考虑并广泛尝试了各种替代方案之后才采用的. "
      "更详细的自我辩护将在后文给出, "
      "但大多数读者可能希望直接跳到正文部分, 从第 xvi 页的"
      (Q "如何阅读本书") "开始.")
   (H3 "意识形态面向")
   (P "本节将更详细地阐述本书背后的写作理念, 并尝试为之辩护. "
      "我还将描述本书的关注重点以及未涵盖的主要主题. "
      "要充分理解讨论中提出的某些观点, 需要具备相关学科知识. "
      "读者可以选择跳过或略读此部分内容.")
   (P "我的首要目标是对自动定理证明领域的众多核心成果进行广泛而均衡的讨论. "
      "此外, 主要对纯数理逻辑感兴趣的读者应当发现, "
      "本书涵盖了数理逻辑主流基础教材中的大部分传统成果: "
      "紧致性, Löwenheim-Skolem定理, 证明系统的完备性, 插值, Gödel定理, 等等. "
      "但我始终力求以具体的, 显式的和算法化的方式来呈现这些结果, "
      "即使这并非自动证明器代码的直接需要, "
      "其通常都会涉及可以实际进行实验和使用的真实代码, "
      "至少在原则上如此. 例如:"
      (Ul (Li "第5.13节中插值定理的证明包含了一个构造插值公式的算法, "
              "该算法利用了先前的定理证明代码;")
          (Li "第5.5节通过显式地交替运行证明与反驳代码来演示基于有限模型性质的可判定性, "
              "而非笼统地援引定理7.13.")))
   (P "我希望许多读者能和我一样欣赏这种具体的, 亲身实践的风格. "
      "形式逻辑通常需要对繁琐的句法细节给予相当程度的关注. "
      "这对初学者而言可能颇为痛苦, "
      "因此教师和作者往往不得不在两种令人不快的选择之间权衡: "
      "(i) 以令人煎熬的详尽程度将一切和盘托出, "
      "或 (ii) 大量含糊其辞以掩盖粗疏的解释. "
      "尽管教师有充分的理由对方式(i)望而却步, 但我的教学经验表明, "
      "许多学生仍然不满于从未被告知事情全貌的感觉. "
      "通过在计算机上实现这些内容, 我认为我们可以两全其美: "
      "细节以精确的形式呈现, 但我们大体上可以让计算机去应对那些令人不快的后果.")
   (P "诚然, 过去150年来数学变得更加抽象化, 更倾向集合论, 而远离了构造性方法. "
      "这在当代模型论中尤为明显, 一些处于学科历史根基的传统主题正被逐渐淡化. "
      "但逆流而行的并非只有我一人, "
      "因为计算机的兴起正在帮助恢复显式算法方法在数学多个领域中的地位. "
      "这在代数几何及相关领域中尤为显著 "
      "(Cox, Little和O'Shea 1992; Schenk 2003), "
      "其中计算机代数, 特别是Gröbner基 (见第5.11节), 已经产生了相当大的影响. "
      "但类似的思想也正在其他领域被探索, "
      "甚至包括范畴论 (Rydeheard和Burstall 1988), "
      "后者通常被视为抽象非构造性数学的精髓. "
      "关于算法化视角在一般数学中的价值, "
      "我无法比Knuth (1974) 的这段话说得更好:"
      (Blockquote
       "有三年时间, 我在加州理工学院为数学专业的二年级学生讲授抽象代数课程, "
       "其中最困难的主题总是矩阵的" (Q "Jordan标准型")
       ". 到第三年, 我尝试了一种新方法, "
       "从算法的角度来审视这一课题, 一切突然变得清晰明了. "
       "同样的事情也发生在关于由生成元和关系定义的有限群的讨论中, "
       "以及另一门课程中的二次型约化理论上. "
       "通过以算法的方式呈现这些主题, "
       "数学定理的目的和意义变得一目了然." (Br)
       "后来, 在撰写一本关于计算机算术的书 [Knuth (1969)] 时, "
       "我发现初等数论中几乎每一个定理都以自然的, "
       "有充分动机的方式出现在使计算机进行高速数值计算的问题中. "
       "因此我认为, 传统的数论课程完全可以改用这种视角, "
       "为已然优美的理论增添一层实用的动机."))
   (P "就逻辑而言, 这种方法似乎尤为自然. 从最早期开始, "
      "逻辑学的发展就受到将推理归结为计算这一愿望的驱动: "
      (Em "logos") "一词, 即" (Q "logic")
      "的词根, 不仅意味着逻辑思维, 还意味着计算或" (Q "算账")
      ". 更近一些, 正是逻辑中的可判定性问题促使Turing等人精确定义了"
      (Q "可计算函数") "的概念, 并建立了界定算法方法范围的抽象模型. "
      "逻辑与计算之间的这种关系可以追溯到中世纪之前, 并一直延续至今. "
      "例如, 计算机系统设计与验证中的问题正在激发更多的逻辑学研究, "
      "而逻辑原理在程序设计语言的设计中也发挥着日益重要的作用. "
      "因此, 逻辑推理不仅可以被视为现代计算机时代的众多受益者之一, "
      "更可以被视为其最重要的思想源泉.")
   (P "本书的另一个可能令某些读者感到意外的特点, 是其系统性的模型论取向; "
      "相比之下, 许多其他教材如Goubault-Larrecq和Mackie (1997) 将证明论置于核心地位. "
      "我在较晚的章节 (第6章) 才引入传统的证明系统, "
      "而且几乎不提及, 更不利用自然演绎或相继式演算证明的结构性质. "
      "尽管这些主题引人入胜, "
      "但我认为经典逻辑的所有传统计算机证明方法完全可以在不借助它们的情况下很好地呈现. "
      "事实上, 用于自动定理证明的特殊反驳完备演算 (二元归结, 超归结, 等等) "
      "同样提供了关于证明范式 (canonical form) 的强有力的结果. "
      "在某些情况下, 这些结果甚至比Gentzen式证明论的结果更便于推导理论性成果 (Matiyasevich 1975), "
      "正如我们在第5.10节中仿照Lifschitz (1980) 对零点定理 (Nullstellensatz) 的证明所示. "
      "无论如何, 对于自动推理而言, "
      "特定证明系统的细节远不如对相应搜索空间的探查方式那样重要. "
      "例如, 请注意tableau方法和逆方法之间的巨大差异, "
      "尽管二者都可以被理解为对无切相继式证明的搜索.")
   (P "我希望为所描述的所有方法提供完整的, 经过仔细解释的代码. "
      "(根据我的经验, 人们很容易低估从一个看似简明的算法到具体实现之间的难度.) "
      "为了呈现几乎与通常用于描述算法的伪代码一样可读的真实可执行代码, "
      "使用一种非常高层次的语言似乎是必要的, "
      "这样就可以忽略数据表示和内存分配等具体问题. "
      "为此我选择了函数式编程语言Objective CAML (OCaml). "
      "OCaml是Edinburgh ML的后裔, "
      "后者是一种专门为编写定理证明器而设计的编程语言, "
      "已有多个主要系统用它编写.")
   (P "使用OCaml (而非诸如C或Java) 的一个缺点是许多读者对它并不熟悉. "
      "然而, 我只使用了一个简单的子集, 在附录2中有简要说明; "
      "代码风格是纯函数式的, 没有赋值或顺序执行 (除了产生诊断输出). "
      "在少数情况下 (例如在二元决策图的代码中传递状态), "
      "命令式代码可能更为简洁, 但坚持使用尽可能简单的子集似乎是值得的. "
      "纯函数式编程对于我所希望鼓励的那种探索式修改尤为方便, "
      "因为人们不必担心一个计算对其他计算产生意外的副作用.")
   (P "最后, 我以来源于McCarthy (1963) 的一段引文作为结尾, "
      "它精妙地概括了本书所蕴含的理念, "
      "暗示了逻辑作为一门真正" (Em "应用")
      "科学的潜在新角色."
      (Blockquote
       "我们有理由期望, 计算与数理逻辑之间的关系在下一个世纪将像"
       "上一个世纪分析学与物理学之间的关系那样富有成果."))
   (H4 "本书没有涵盖的内容")
   (P "尽管我力求涵盖广泛的主题, 但有所取舍是必要的, "
      "以防止本书变得庞大到难以驾驭. "
      "我聚焦于经典单类 (one-sorted) 一阶逻辑中的理论, "
      "因为在这一连贯的框架下, 自动推理的许多核心方法都可以得到展示. "
      "因此, 我不无遗憾地将一些重要领域排除在深入讨论之外, "
      "包括模型检查, 归纳定理证明, 多类 (many-sorted) 逻辑, 模态逻辑, "
      "描述逻辑, 直觉主义逻辑, lambda演算, 高阶逻辑和类型论. "
      "然而, 我相信本书将为读者深入研究上述任何领域做好充分的准备, "
      "其中许多领域恰恰最适合通过与经典一阶逻辑的对比来加以理解.")
   (P "另一个指导原则是, 只有在我认为自己能够以较为初等的水平来呈现某一主题, "
      "而无需过多技术细节或艰深理论的情况下, 才会将其纳入. "
      "这意味着我忽略了例如有序paramodulation, "
      "圆柱代数分解以及Gödel第二不完备性定理等内容. "
      "但在这些情况下, 我尽量提供了充足的参考文献, "
      "以便有兴趣的读者能够自行深入探究.")
   (H3 "致谢")
   (P "本书经过多年以随性的方式逐步演变为目前的形态. "
      "在此期间, 我先后在剑桥大学计算机实验室, "
      "Åbo Akademi大学/TUCS以及Intel公司工作, 并曾短期访问其他机构; "
      "我最要感谢的是Tania和Yestin, 感谢他们陪伴我辗转各地, "
      "并容忍我在这个项目上投入的过多时间. "
      "要在此公正地描述多年来结识的朋友和同事们对我思想的塑造程度, 是不可能的. "
      "但我要特别感谢Mike Gordon, 是他最初给了我进入这一迷人领域的机会.")
   (P "我撰写本书的部分原因在于, 据我所知, "
      "尚无现有教材能够涵盖我所希望覆盖的逻辑学与自动推理领域的广泛主题. "
      "因此, 本书的总体风格和方法是我自己的, "
      "任何现有教材都无需为其不良影响承担责任. "
      "但在纯逻辑方面, 我主要遵循了Kreisel和Krivine (1971) 对基本元定理的阐述方式. "
      "他们优雅的发展路径恰好契合我的目的, 纯粹以模型论为基础, "
      "并使用自动定理证明的常用工具, 如Skolem化和(所谓的)Herbrand定理. "
      "例如, 第5.13节中那个极具算法美感的插值定理证明, 本质上就是他们的成果.")
   (P "尽管我从事自动推理研究已近 20 年, "
      "但我仍时常在文献中发现先前不曾注意到的旧成果, "
      "或通过与同事的私人交流而得知它们. "
      "在这方面, 我感谢Grigori Mints向我指出了"
      "Lifschitz利用归结证明对零点定理的证明 (第5.10节), "
      "感谢Loïc Pottier告知我Hörmander的实数量词消去算法 (第5.9节), "
      "也感谢Lars Hörmander本人回答了我关于这一过程起源的问题.")
   (P "我非常幸运地拥有众多朋友和同事, 他们评阅了本书的草稿, "
      "给予了令人振奋的鼓励, 采用并改进了相关代码, 甚至据此进行教学. "
      "他们的影响往往使我的思路更加清晰, 有时还使我免于严重的错误, "
      "但不消说, 他们无需为文中任何残留的缺陷负责. "
      "在此衷心感谢Rob Arthan, Jeremy Avigad, Clark Barrett, Robert Bauer, "
      "Bruno Buchberger, Amine Chaieb, Michael Champigny, Ed Clarke, "
      "Byron Cook, Nancy Day, Torkel Franzén "
      "(令人惋惜的是, 他未能看到本书的最终完成), "
      "Dan Friedman, Mike Gordon, Alexey Gotsman, Jim Grundy, "
      "Tom Hales, Tony Hoare, Peter Homeier, Joe Hurd, Robert Jones, "
      "Shuvendu Lahiri, Arthur van Leeuwen, Sean McLaughlin, "
      "Wojtek Moczydlowski, Magnus Myreen, Tobias Nipkow, "
      "Michael Norrish, John O'Leary, Cagdas Ozgenc, Heath Putnam, "
      "Tom Ridge, Konrad Slind, Jørgen Villadsen, Norbert Voelker, "
      "Ed Westbrook, Freek Wiedijk, Carl Witty, Burkhart Wolff, "
      "以及无疑还有许多其他通信者, "
      "他们的贡献随着时间的流逝而被我疏忽地遗忘了, "
      "感谢他们无价的帮助.")
   (P "即使在网络时代, 能够使用优质的图书馆仍然至关重要. "
      "我要感谢剑桥大学图书馆, 计算机实验室和DPMMS图书馆, "
      "Åbo Akademi的数学和计算机科学图书馆, "
      "以及近年来波特兰州立大学图书馆和Intel图书馆的工作人员, "
      "他们经常帮助我查找晦涩的参考文献. "
      "我还要感谢无与伦比的Powell's书店 (www.powells.com), "
      "它已被证明是经典逻辑学和计算机科学文献的宝库.")
   (P "最后, 我要感谢Frances Nex极其细致入微的文字编辑工作, "
      "以及剑桥大学出版社的Catherine Appleton, Charlotte Broom, "
      "Clare Dennison和David Tranah, 他们不顾我的一再拖延, "
      "将本书引领至出版, 并提供了宝贵的建议, "
      "出版社匿名审稿人的有益评论也为此提供了有力的支持.")
   (H3 "如何阅读本书")
   (P "本书的设计是按顺序从头到尾阅读的. "
      "然而, 在学习了第1章以及第2章和第3章各自的大部分内容之后, "
      "读者便可根据自己的兴趣选读其他部分. "
      "为此, 我尽量将一些重要的交叉引用明确标出, "
      "并尽可能避免使用过于繁复或非标准的记号.")
   (P "每章末尾都附有若干练习题. "
      "这些练习几乎从不是常规性的, 有些还非常困难. "
      "这反映了我的信念: 解决一个真正具有挑战性的问题, "
      "比费力做完大量琐碎的操练题更为有趣, 也更富有教益. "
      "如果大多数题目看起来太难, 读者不必灰心. "
      "它们全部是可选的, 也就是说, "
      "不做任何练习也可以理解正文的内容.")
   (H4 "本书所使用的数学")
   (P "数学在本书中扮演着双重角色: 主题本身以数学方式处理, "
      "同时自动推理也被应用于数学中的一些问题. "
      "但在大多数情况下, 所需的数学知识并不十分高深: "
      "基础代数, 集合与函数, 归纳法, 以及也许最根本的, "
      "对证明这一概念的理解. "
      "在少数地方会用到更高深的分析和代数知识, "
      "不过我已尽量在行文中加以解释. "
      "附录1是相关数学背景的摘要, 读者可在需要时查阅, "
      "或者甚至在一开始就浏览一遍.")
   (H4 "本书中的软件")
   (P "本书的一个重要组成部分是配套软件, "
      "其中包含用OCaml编程语言编写的各种定理证明技术的简单实现. "
      "尽管不详细研究代码一般也能理解本书, 但解释往往围绕代码展开, "
      "代码被用作替代冗长而形式化的语法过程描述的手段. "
      "(例如, 第6.4-6.8节中一阶逻辑的完备性证明, "
      "以及第7.6节中Robinson算术的" Σ_1 "-完备性证明, "
      "本质上都是关于某些特定OCaml函数总能正确运行的详细非形式论证.) "
      "因此, 如果至少没有对代码如何工作的一个粗略印象, "
      "你可能会觉得本书某些部分相当吃力.")
   (P "由于我预计许多读者几乎没有或完全没有编程经验, "
      "至少在OCaml这样的函数式语言方面是如此, "
      "我在附录2中概述了一些关键概念. "
      "我并不自欺欺人地以为阅读这份简短的附录"
      "就能将一个新手变成熟练的函数式程序员, "
      "但我希望它至少能提供一些方向指引, "
      "其中也包含了读者在需要时可以进一步查阅的参考文献. "
      "事实上, 整本书都可以被视为函数式编程的一个大型案例研究, "
      "展示了许多重要的概念, 如结构化数据类型, "
      "递归, 高阶函数, 延续和抽象数据类型.")
   (P "我希望许多读者不仅会阅读代码, 还会实际运行它, "
      "将其应用于新的问题, 甚至尝试修改或扩展它. "
      "但要做到这些, 你需要一个OCaml解释器 (再次参见附录2). "
      "定理证明代码本身几乎全部以分散的方式列在正文中. "
      "由于读者实际手动输入代码大概收益甚微, "
      "所有代码均可从本书的网站 (www.cambridge.org/9780521899574) 下载, "
      "然后只需几次按键即可加载到OCaml解释器中, "
      "或者一次一个片段地复制粘贴.")
   (P "将来, 我希望在同一网址提供代码的更新, 也许还有其他语言的移植版本. "
      "关于如何运行代码的更多细节可以在那里找到, "
      "从而可以一边跟随书中的解释一边并行地试验代码, "
      "但我在这里只提几个重要的要点. "
      "最简单的方式大概是加载与本书相关的全部代码, "
      "例如在包含代码的目录 (文件夹) 中启动OCaml解释器"
      (Code "ocaml") ", 然后输入:"
      (CodeB "#use &quot;init.ml&quot;;;"))
   (P "默认环境被设置为自动将法式≪引用≫中的内容解析为一阶公式. "
      "若要使用第1章中的某些代码, 你需要将其改为解析算术表达式:"
      (CodeB "let default_parser = make_parser parse_expression;;")
      "若要使用第2章中关于命题逻辑的代码, "
      "则需要将其改为解析命题公式:"
      (CodeB "let default_parser = parse_prop_formula;;"))
   (P "除此之外, 你基本上可以随意选取你感兴趣的任何部分的代码来使用. "
      "在极少数情况下, 作为讲解流程的一部分, "
      "某个函数会先给出一个基础版本, "
      "随后再替换为同名的更完善或更高效的版本. "
      "在这种情况下, 默认环境始终会提供最新的版本; "
      "如果你希望严格跟随讲解的顺序, "
      "可能需要从源文件中复制粘贴较早的版本.")
   (P "这些代码主要是为教学目的而编写的, "
      "我始终将清晰性和/或简洁性置于效率之上. "
      "尽管如此, 它们有时在实际应用中也可能确实有用. "
      "无论如何, 在使用之前, "
      "请仔细阅读网站上列出的(极少的)法律限制条款. "
      "另外请注意, Stålmarck算法 (第2.10节) 受专利保护, 因此"
      (Code "stal.ml") "文件中的代码不应用于商业用途.")
   (H2. "引论")
   (P "本章我们引入了逻辑推理和机械化它的想法, "
      "简要触及了重要的历史性发展. "
      "我们通过讨论逻辑学中的一些最为基础的想法"
      "以及刻画符号方法是如何在计算机上实现的"
      "来为后续内容奠定基础.")
   (H3. "什么是逻辑推理?")
   (P "存在许多理由相信某个东西为真. "
      "它或许似乎是显而易见的, "
      "或许至少第一眼看上去是令人信服的, "
      "可能我们的父母之前告诉过我们, "
      "也可能是其与相关科学实现的结果达成了惊人的一致性. "
      "尽管往往是可靠的, 但是这些判断的方法也并非万无一失, "
      "其也曾被用于说服人们地球是平的, 圣诞老人是存在的, "
      "原子不可被进一步划分为更小的粒子.")
   (P (Em "逻辑") "推理相较于其他推理的不同之处在于"
      "其会避免任何未经澄清的假设, "
      "并将自身限制于不会出错且超越理性置辩的推理. "
      "为了避免作出任何无法保证的假设, "
      "逻辑推理不能依赖于要被推理的对象或者概念的任何特殊性质. "
      "这意味着逻辑推理必须从所有这样的特殊特征之中抽象出来, "
      "并在应用于其他领域时同等有效 (valid). "
      "论证之所以被接受为逻辑性的(论证), "
      "在于其与某种一般" (Em "形式")
      "的相合, 而非因为其所处理的特定" (Em "内容")
      ". 例如, 将以下的传统例子:"
      (Blockquote
       (Pre "所有人都是要死的
Socrates是一个人
因此Socrates是要死的"))
      "与下列从数学之中抽出的推理进行比较:"
      (Blockquote
       (Pre "所有正整数都是四个整数的平方之和
" 15 "是一个正整数
因此" 15 "是四个整数的平方之和"))
      "这两个论证都是正确的, 并且具有共同的模式:"
      (Blockquote
       (Pre "所有的" $X "都是" $Y "
" $a "是" $X "
因此" $a "是" $Y)))
   (P "这个推理模式是逻辑有效的, 因为其有效性并不依赖于内容: "
      (Q "正整数") "和" (Q "要死的") "的含义是无关紧要的. "
      "我们可以将" $X ", " $Y ", " $a
      "替换为任何我们喜欢的东西, 只要尊重语法范畴即可, "
      "而语句仍然保持有效. "
      "与之相对的是, 考虑以下推理:"
      (Blockquote
       (Pre "所有的雅典人都是希腊人
Socrates是一个雅典人
因此Socrates是要死的")))
   (P "尽管这个结论是全然正确的, 但是这个论证并非逻辑有效的, "
      "因为其依赖于所牵涉的项的内容. "
      "其他的具有同样的似是而非形式的论证当然也可能是假的, 例如"
      (Blockquote
       (Pre "所有的雅典人都是希腊人
Socrates是一个雅典人
因此Socrates没有胡须")))
   (P "然而, 第一个论证可以转变为一个逻辑有效的论证, "
      "通过将隐式的假设" (Q "所有的希腊人都是要死的")
      "显式化. 现在这个论证是以下一般的逻辑有效的形式的一个实例:"
      (Blockquote
       (Pre "所有的" $G "都是" $M "
所有的" $A "都是" $G "
" $s "是" $A "
因此" $s "是" $M)))
   (P "第一眼看上去, 这种对于推理的法医鉴识式分析似乎并不令人印象非常深刻. "
      "逻辑有效的推理从未告诉过我们任何关于世界的本质上新颖的东西"
      "&mdash;&mdash;正如Wittgenstein (1922) 所言, "
      (Q "当我知道天气要么下雨要么不下雨时, 我对于天气一无所知")
      ". 换言之, 如果我们" (Em "的确")
      "从推理的链条之中学到了关于世界的什么新东西, "
      "那么它必然包含" (Em "并非") "纯粹逻辑的步骤. "
      "Schilpp (1944) 中引用Russell所言:"
      (Blockquote
       "Hegel从纯粹逻辑之中推导出了世界的全部本质, "
       "包括小行星的不存在性, 其之所以能够做到这点, "
       "只是因为他逻辑无能.")
      "{原注: 为了对于Hegel公平一些, 我必须要说词汇" (Em "逻辑")
      "直到相当的最近都常以更为宽泛的含义使用, "
      "而我们所考虑的逻辑在那时应该被称为" (Em "演绎逻辑")
      ", 用以和" (Em "归纳逻辑") "进行区分, "
      "后者从观察到的数据之中得出结论, "
      "如在物质科学 (physical sciences) 里的那样.}")
   (P "但是逻辑分析可以清晰地揭示关于真实世界的"
      (Em "事实") "之间的必要关系, "
      "直接地表明何处掺入了或许不能保证的假设. "
      "例如, 根据" (Q "如果刚刚下过雨, 那么地面是潮湿的")
      "可以逻辑推出" (Q "如果地面并非超市, 那么刚刚就不可能下过雨")
      ". 这是被称为" (Em "逆否") "的一般原理的一个实例: 从"
      (Q "如果" $P "那么" $Q) "可以推出"
      (Q "如果非" $Q "那么非" $P)
      ". 然而, 从" (Q "如果" $P "那么" $Q) "到"
      (Q "如果" $Q "那么" $P) "一般" (Em "并非")
      "有效, 在这种情况下就是我们发现我们不能推出"
      (Q "如果地面是潮湿的, 那么刚刚下过雨")
      ", 因为也可能是由于爆裂的水管或者灌溉设施什么的才导致了潮湿.")
   (P "或许正如Locke (1689) 所言, 这样的例子可能是"
      (Em "琐碎的") ", 不过这种初等的逻辑谬误我们也经常会遇到. "
      "更为重要的是, 数学之中的演绎远非琐碎所能概括, "
      "而是一直使人类历史之中的一些伟大智者深深着迷, "
      "经常也使得他们感到挫败. "
      "从简单而不可辩驳的假设出发, 经过漫长而复杂的逻辑演绎链条, "
      "可以通往复杂且违反直觉的定理, 正如Hobbes所发现的 (Aubrey 1898):"
      (Blockquote
       "在一位绅士的私人书房里, Euclid的原本摊开着, "
       "翻到的是第1卷第47命题 [Pythagoras定理]. "
       "他读了这个命题. 天哪, 他说道 "
       "(他时不时会用一句有力的誓语来加强语气), "
       "这不可能! 于是他读了该命题的证明, "
       "证明将他引回到某个前置命题; 他读了那个命题. "
       "那个命题又将他引回到另一个命题, 他也读了. "
       "如此层层回溯 [et sic deinceps], "
       "最终他被严格地说服了那个真理. "
       "这使他爱上了几何学."))
   (P "的确, Euclid的开创性作品" (Em "几何原本")
      "建立了一种特定的推理风格, "
      "其经完善之后构成了如今数学的脊骨. "
      "这种风格在于先断言少量" (Em "公理") --
      "这些公理被认为具有数学内容" --
      "然后运用纯粹的逻辑推理从中推导出结论. "
      "Euclid本人并未完全实现逻辑与非逻辑的彻底分离, "
      "但他的工作最终由Hilbert (1899) 和Tarski (1959) 加以完善, "
      "他们使得一些假设显式化, 例如" (Q "Pasch公理") ".")
   (P "{原注: 可以说, 这种方法在Socrates的论辩术中已有预兆, "
      "Plato对此有所记述. 苏格拉底会引导他那些不幸的对话者, "
      "从他们自己的观点出发, 经过一连串看似不可避免的推论, "
      "从而赢得辩论. 当荒谬的结论被推导出来时, "
      "最初的立场便站不住脚了. 要使这种方法具有其令人叹服的力量, "
      "每一步推理都必须毫无疑义, 且不能暗中引入任何隐含的假设.}")
   (H3. "Calculemus!")
   (P (Q "推理就是算账 (reckoning).")
      " 在本书的卷首语中我们引用了Hobbes关于逻辑推理和数值计算之间的相似性的阐述. "
      "尽管Hobbes应该因为使得这个想法更为广为人知而受到嘉奖, "
      "这个想法本身即便在1651年也不是全新的. "
      "的确由Plato和Aristotle所使用以代表推理或者逻辑思维的希腊词汇"
      (Em "logos") "在其他上下文中也可能表示计算或者算账. "
      "当古希腊哲学家的作品在中世纪的欧洲广为人知的时候, " (Em "logos")
      "一般被翻译为" (Em "ratio") ", 这是代表算账的拉丁词汇 "
      "(因而有了英语词汇rational, ratiocination, 等等). "
      "即便在如今的英语里, 我们有时也能听到"
      (Q "I reckon that ...") ", 这里的" (Q "reckon")
      "指的是某种推理而并非字面意义上的要去计算.")
   (P "然而, 推理和算账之间的联系在Gottfried Wilhelm von Leibniz (1646–1716) "
      "的作品之前几乎只是一种暗示性的口号. "
      "Leibniz相信一个根据计算进行推理的系统必须包含两个基本组件:"
      (Ul (Li "一种通用语言 (" (Em "characteristica universalis")
              "), 由此可以表达任意的东西;")
          (Li "一种推理演算 (" (Em "calculus ratiocinator")
              "), 用于判定以" (Em "characteristica")
              "表达的断言的真假.")))
   (P "Leibniz梦想着有朝一日不能达成一致意见的双方不会陷入徒劳的争辩, "
      "而是将他们的不一致转换为" (Em "characteristica")
      ", 然后彼此言称" (Q "calculemus") " (让我们计算吧). "
      "他甚至可能设想过让机器来完成这些计算. "
      "那时候, 各种机械计算装置已被设计和建造出来, "
      "Leibniz本人也在1671年设计了一台能够进行乘法运算的机器, "
      "并说道:"
      (Blockquote
       "杰出之人不应像奴隶一样, 将大量时间耗费在计算的苦役上, "
       "如果使用机器的话, 这些工作完全可以放心地交给任何人去做."))
   (P "因此, Leibniz预见了使自动推理成为可能的基本要素: "
      "一种精确表达思想的语言, "
      "在该语言中操纵思想的计算规则, "
      "以及这种计算的机械化. "
      "莱布尼茨在实现这些构想方面的具体成就是有限的, "
      "且直到近年来才为人所知. "
      "但尽管他的工作对技术发展的直接影响有限, "
      "他的梦想在今天仍然引起共鸣.")
   (H3. "符号化")
   (P "Leibniz将注意力放在建立合适的语言这一基本的首要步骤上是正确的. "
      "然而, 他太过雄心壮志以至于想要表达人类思维的所有方面. "
      "最终的进步来自于扩展已经在数学中所使用的符号记号的应用范围. "
      "例如, 如今我们会说" (Q (&<= $x^2 (&+ $y $z))) "而非"
      (Q $x "乘上自身小于等于" $y "与" $z "之和")
      ". 随着时间推移, 越来越多的数学开始以形式符号记号表达, "
      "取代了自然语言渲染. 对此我们可以找到几个坚实的理由.")
   (P "首先, 一套精心选择的符号形式通常更加简短, 减少了无关信息的干扰, "
      "有助于更简洁更直观地表达思想 (至少对于内行人而言是如此). "
      "例如, 莱布尼茨本人发明的微分记号" (&d/d $y $x)
      ", 巧妙地传达了小差分之比的思想, 并使得像链式法则"
      (&= (&d/d $y $x) (&d* (&d/d $y $u) (&d/d $u $x)))
      "这样的定理, 凭借与普通代数的类比, 看起来就显得合情合理.")
   (P "其次, 使用更加规范化的表达形式可以避免日常语言中的一些歧义, "
      "从而更精确地传达含义. "
      "对词语确切含义的疑虑在许多领域都很常见, 尤其是在法律领域. "
      "数学也无法免于类似的根本分歧, 即对一个定理究竟在说什么, "
      "或其成立条件究竟是什么的争论, "
      "而且对这些问题的共识会随时间而改变 "
      "(Lakatos 1976; Lakatos 1980).")
   (P "最后, 也许也是最重要的一点, "
      "一套精心选择的符号记法能够使数学推理本身变得更加容易. "
      "一个简单但极为出色的例子是数的" (Q "位值 (positional)")
      "表示法, 其中一个数由一串数字符号表示, 每个符号隐含地乘以"
      (Q "基数 (base)") "的某个幂次. 在十进制中, 基数为" 10
      ", 我们将数码序列" (Q 179) "理解为:"
      (MB (&= 179 (&+ (&c* $1 (^ 10 $2))
                      (&c* $7 (^ 10 $1))
                      (&c* $9 (^ 10 $0)))) "."))
   
   (H3. "Boole的逻辑代数" #:id "algebra-of-logic")
   (P "词汇" (Em "algebra") "来源于阿拉伯语的" (Q "al-jabr")
      ", 最早在九世纪由Mohammed al-Khwarizmi (约780-850) 使用, "
      "而他的名字正是" (Q "算法 (algorithm)") "一词的词源. "
      (Q "al-jabr") "一词的字面意思是" (Q "重新结合")
      ", 但花拉子密用它来特指他通过合并 (" (Q "重新结合")
      ") 同类项来解方程的方法, 例如从" (&= (&+ $x $4) (&- $6 $x))
      "变换到" (&= (&i* $2 $x) (&- $6 $4)) ", 进而得到解"
      (&= $x $1) ". 在此后的几个世纪里, 历经欧洲文艺复兴时期, "
      "代数的含义本质上一直是用于解方程的运算规则.")
   (P "在十九世纪, 传统意义上的代数达到了它的极限. "
      "此前的核心关注点之一是求解越来越高次的方程, "
      "但Niels Henrik Abel (1802-1829) 在1824年证明, "
      "对于五次及五次以上的多项式方程, "
      "不存在利用此前对低次方程有效的"
      (Q "根式") "表达式来求解的一般方法. "
      "然而与此同时, 代数的范围也在扩展并走向一般化. "
      "传统上, 变量代表的是实数, 通常是有待确定的未知数. "
      "但很快, 将所有常规的代数运算规则应用于" (Q "虚")
      "量" $i "并假定其具有形式性质" (&= $i^2 $-1)
      ", 成为了标准做法. "
      "尽管这一做法在很长一段时间内缺乏严格的证明, "
      "但它确实行之有效.")
   (P "代数方法甚至被应用于通常意义上并非数的对象, "
      "如矩阵和Hamilton的 " (Q "四元数") ", 即使代价是放弃通常的乘法"
      (Q "交换律") (&= (&i* $x $y) (&i* $y $x))
      ". 人们逐渐认识到, 符号的潜在解释可以被忽略, "
      "只要一劳永逸地确立了所使用的运算规则在该解释下都是有效的. "
      "George Boole (1815-1864) 对这一状况做了颇具远见的描述:"
      (Blockquote
       "凡熟悉符号代数理论现状者皆知, "
       "分析过程的有效性并不取决于所使用符号的解释, "
       "而仅仅取决于它们的组合法则. "
       "凡不影响所假定关系之真实性的解释体系, "
       "都同样可以被接受; 事实上, "
       "同一过程在一种解释方案下可以代表一个关于数的性质的问题的解, "
       "在另一种解释方案下可以代表一个几何问题的解, "
       "在第三种解释方案下则可以代表一个动力学或光学问题的解. "
       "(Boole 1847)"))
   (P "Boole进而指出, 尽管如此, 由于历史或文化的偶然因素, "
      "当时所有的代数所涉及的对象在某种意义上都是量化的 (quantitative). "
      "转而他引入了一种代数, 其对象要被解释为真或假的" (Q "真值")
      ", 而其中的变量则表示" (Em "命题")
      ". 使用命题这个词汇, 我们指的是一个断言, "
      "其作出了对于事实的声明, "
      "因而可以有意义地被认为要么为真要么为假. "
      "{译注: 这里说的断言, 和类型论里的判断, "
      "在技术意义上不同, 作者只是生活化地使用这个名词.} "
      "例如, " (Q (&< $1 $2)) ", " (Q "所有人都是要死的")
      ", " (Q "月球由奶酪构成") ", "
      (Q "存在无限多个素数" $p "使得" (&+ $p $2) "也是素数")
      "都是命题的例子. 根据我们现有的知识水平, "
      "前两个命题为真, 第三个为假, 第四个的真值则是未知的 "
      "(此即所谓的孪生素数猜想, 数学界的著名开放问题).")
   (P "{原注: 实际上Boole给出了两种不同但有关联的解释: "
      "一种是" (Q "类的代数") ", 另一种是" (Q "命题的代数")
      "; 我们将会专注于后者.} "
      "{译注: 这里说的类, 应该指的是某个固定集合的子集.}")
   (P "我们熟悉对数施加各种算术运算, 如一元的" (Q "负 (minus)")
      " (取相反数) 以及二元的" (Q "乘") " (乘法) 和" (Q "加")
      " (加法). 以完全类似的方式, "
      "我们可以使用所谓的逻辑联结词来组合真值, "
      "例如一元的" (Q "非") " (逻辑否定或补) 以及二元的"
      (Q "与") " (合取) 和" (Q "或") " (析取). 而且, "
      "在书写表达式时, 我们可以用字母来代表任意命题, "
      "正如代数中用字母代表数一样. "
      "Boole在对于他的系统的精确表述中, "
      "以及对于许多逻辑常量和联结词使用熟悉的代数符号时, "
      "强调了其与普通算术之间的联系:"
      (let ((TrTd* (lambda x* (apply Tr (map Td x*)))))
        (Table
         #:attr* '((align "center")
                   (border "1")
                   (style "border-collapse: collapse;"))
         (TrTd* $0 "假")
         (TrTd* $1 "真")
         (TrTd* (&i* $p $q) (Span $p "且" $q))
         (TrTd* (&+ $p $q) (Span $p "或" $q)))))
   (P "在这种解释之下, 许多令人熟悉的代数定律仍然成立. 例如, "
      (Q $p "且" $q) "总是和" (Q $q "且" $p)
      "具有相同的真值, 所以我们可以认为交换律"
      (commute &i* $p $q) "成立. 类似地, 既然" $0
      "是假, 那么" (Q $0 "且" $p) "不论" $p
      "是什么总是为假, 即" (&= (&i* $0 $p) $0)
      ". 但是, 命题的布尔代数满足额外的定律, "
      "其没有算术的对应物, 特别是"
      (&= $p^2 $p) ", 其中" $p^2
      "是" (&i* $p $p) "的缩写.")
   (P "在日常英语里, 词汇" (Q "或")
      "是有歧义的. 复合命题" (Q $p "或" $q)
      "可以解释为可兼的或 (" $p "或" $q
      "或两者都成立), 也可以解释为不可兼的 ("
      $p "或" $q "但是不能两者都成立). "
      "日常使用里经常隐含了两种情况是互斥的 "
      "(例如" (Q "我会明天做或者后天做")
      "). Boole原本的系统限制了这种代数, 以使得"
      (&+ $p $q) "只有在" (&= (&i* $p $q) $0)
      "时才有意义, 就像在普通代数里"
      (&/ $x $y) "只有在" (&!= $y $0)
      "时才有意义. 然而, 遵循Boole的继任者"
      "William Stanley Jevons (1835–1882), "
      "习惯上我们允许不加限制的" (Q "或")
      ", 并以可兼的方式解释它. "
      "我们总是会按照如今标准的含义理解"
      (Q "或") ", " (Q $p "或" $q) "的意思是"
      (Q $p "或" $q "或两者都成立") ".")
   ((tcomment)
    "个人认为这一小节的叙述有点将命题和命题的真值混为一谈了, "
    "但是这算是传统实践.")
   (H4. "机械化")
   (P "甚至在Boole之前, 用于逻辑推演的机器就已经被开发出来了, "
      "其中最著名的是由Charles Stanhope "
      "(第三代Stanhope伯爵, 1753–1816) 发明的"
      (Q "Stanhope演示器") ". 受此启发, Jevons (1870) 随后设计并建造了他的"
      (Q "逻辑机器") ", 这是一种类似钢琴的装置, "
      "能够在Boole的类代数中执行某些运算. "
      "然而, 由于机械工程的局限性以及逻辑学本身发展的缓慢, "
      "推理的机械化真正开始蓬勃发展是在稍晚的时期, 即现代计算机时代的开端. "
      "我们将在本书后续章节中结合技术发展进一步介绍这段历史. "
      "Jevons的原始机器现陈列于Oxford科学史博物馆.")
   (H4. "逻辑形式")
   (P "在1.1节中, 我们谈到了论证" (Q "具有相同的形式")
      ", 但并未对此给出精确的定义. "
      "事实上, 对于用英语或其他自然语言表达的论证而言, "
      "要做到这一点是很困难的, "
      "因为自然语言往往无法清楚地呈现句子的逻辑结构: "
      "表面上的相似性可能掩盖根本性的结构差异, 反之亦然. "
      "例如, 英语中的" (Q "is") "既可以表示"
      (Q "具有...的性质") " (" (Q $4 " is even") "), 也可以表示"
      (Q "和...相同") " (" (Q (&+ $2 $2) " is " $4)
      "). 这个例子以及类似的情况常常引发哲学上的混淆.")
   (P "一旦我们拥有了逻辑概念的精确符号体系 "
      "(如Boole的逻辑代数), 我们就可以简单地说: "
      "两个论证具有相同的形式, "
      "如果它们都是相同的形式表达式的实例, "
      "实例化是通过一致地将变量替换为其他命题得到的. "
      "并且我们可以利用形式语言对逻辑上有效的论证给出数学上精确的定义. "
      "这并不意味着逻辑形式和纯逻辑论证的定义"
      "在哲学上是一个无足轻重的问题; 恰恰相反. "
      "但我们满足于不去解决这个问题, "
      "而是通过采纳一个精确的数学定义来巧妙地绕过它, "
      "正如Hertz (1894) 回避了力学中" (Q "力")
      "的含义这一问题一样. 在积累了足够的具体经验之后, "
      "我们将简要探讨 (第7.8节) 我们对逻辑论证的界定"
      "如何与一些传统的哲学区分相对应.")
   (H3. "句法和语义")
   (P "逻辑学的一个独特之处在于它严格区分符号表达式与其所代表的对象. "
      "这一点值得特别强调, 因为在日常数学中, "
      "我们常常不自觉地从符号直接过渡到符号所指称的数学对象. "
      "例如, 当我们读写" (Q 12) "时, 我们将其视为一个数, 即集合"
      $NN "的一个元素, 而非用来表示该数的两个数码符号的序列. "
      "然而, 当我们想要精确地进行形式化操作时, "
      "无论是逐位相加十进制数, "
      "还是运用代数法则重排符号表达式, 我们都需要维持这种区分. "
      "毕竟, 当推导出诸如" (&= (&+ $x $y) (&+ $y $x))
      "这样的等式时, 整个的要义在于两边所指称的数学对象是相同的; "
      "如果我们只考虑潜在意义 (underlying meaning), "
      "那么我们就不能直接讨论这样的形式操作.")
   (P "因此, 通常我们关注的是: "
      "(i) 某个特定的合法形式表达式集合, 以及 "
      "(ii) 它们对应的意义. 这两者被严格区分开来, "
      "但通过一种解释联系在一起, "
      "解释将表达式映射至它们的意义:"
      (MB "[表达式]" (^^ $-> "解释") "[意义]"))
   (P "形式化表达式与其意义之间的区分在语言学中同样重要, "
      "我们将借用该学科的一些术语. 语言学有两个传统的子领域: "
      "句法学, 关注句子的语法构成; 语义学, 关注句子的意义. "
      "类似地, 在逻辑学中, 我们通常将那些" (Q "如同代数运算")
      "般脱离意义而独立考察的方法称为" (Q "句法的")
      ", 而将意义起重要作用的方法称为" (Q "语义的")
      ". " (Q "句法") "和" (Q "语义")
      "这两个词在语言学中还有更具体的含义, "
      "这些含义同样被逻辑学所采纳."
      (Ul (Li "一种语言的" (Em "句法") "是一套语法规则体系, "
              "规定了如何生成或识别合乎语法的短语和句子. "
              "例如, 我们会认为" (Q "I went to the shop")
              "是合乎语法的英语, 而" (Q "I shop to the went")
              "则不是, 因为名词和动词的位置被交换了. "
              "在逻辑系统中同样如此, "
              "我们通常也会有规则告诉我们如何生成或识别合式表达式, "
              "例如允许" (Q (&+ $x $1)) "但不允许"
              (Q (M $+ $1 $c*)) ".")
          (Li "一个特定单词, 符号, 记号或短语的" (Em "语义") "就是它的意义. "
              "更广泛地说, 一种语言的语义是一种系统性地为该语言中所有 "
              "(合乎语法的) 表达式赋予意义的方式. 用语言学术语来说, "
              "选择一种解释恰好就等同于为该语言给出一套语义.")))
   (H4. "对象语言和元语言")
   (P "我们将要描述执行逻辑推理的形式规则, "
      "然而又要用...逻辑来对这些规则进行推理, 这可能会令人困惑! "
      "在这方面, 将我们所谈论的(形式)逻辑与"
      "我们用来对其进行推理的(日常直觉)逻辑之间的区别牢记在心是有益的. "
      "为了强调这一对比, 我们有时会使用以下语言学术语. "
      "元语言是用来谈论另一种不同的对象语言的语言, "
      "类似地, 元逻辑是用来对于对象逻辑进行推理的. "
      "因此, 我们通常将关于形式逻辑和自动推理系统所推导出的定理称为元定理, 而不仅仅是定理. "
      "这样做不(只)是为了听起来更宏大, 而是为了强调它们与在那些形式系统内部表达的"
      (Q "定理") "之间的区别. 同样, 应用于形式化数学证明的元逻辑推理通常被称为元数学 "
      "(参见第7.1节). 顺便提一下, 我们所选用的编程语言OCaml源自Edinburgh ML, "
      "后者是专门为编写定理证明程序而设计的 (Gordon, Milner和Wadsworth 1979), 其名称代表"
      (Q "元语言 (Meta Language)") ". 这种对象-元的区分 (Tarski 1936; Carnap 1937) "
      "并不局限于逻辑语言. 例如, 在一堂用英语讲授的俄语课上, "
      "我们可以将俄语视为对象语言, 而将英语视为元语言.")
   (H4. "抽象和具体句法")
   (P "句法的细节并无根本性的重要意义. "
      "数学有时是打印的, 有时是手写的, "
      "人们做出各种本质上任意的选择, "
      "这些选择并不改变符号组合使用的结构方式. "
      "在计算机上实现逻辑的机械化时, 为简便起见, "
      "我们将限制自己只使用标准的ASCII字符集, "
      "其中包括无重音的拉丁字母, 数字以及一些常见的标点符号和空格. "
      "对于许多逻辑学家使用的花体字母和特殊符号, "
      "我们将用其他字母或单词来替代, 例如用"
      (Q "forall") "代替" (Q $forall)
      ". 不过, 在理论讨论中我们仍将继续使用通常的符号. "
      "这种不断的转换对于此前未见过或未理解这些符号的读者"
      "而言甚至可能是有帮助的.")
   (P "无论符号表达式是如何读写的, "
      "以一种更能反映其结构的形式来操作它们会更加方便. "
      "考虑普通代数中的表达式"
      (Q (&- (&+ $x (&c* $y $z)) $w))
      ". 这种线性形式掩盖了有意义的结构. "
      "要理解哪些运算符作用于哪些子表达式, "
      "甚至要弄清什么构成一个子表达式, "
      "我们需要了解优先级和结合性的规则, 例如"
      (Q $c*) "比" (Q $+) (Q "绑定更紧")
      ". 举例来说, 尽管在线性形式中它们看起来很相似, "
      (Q (&c* $y $z)) "是一个子表达式, 而" (Q (&+ $x $y))
      "却不是. 即使我们通过完全加括号将结构显式化, 写成"
      (Q (&- (@+ $x (@c* $y $z)) $w))
      ", 对表达式进行基本的有用操作, "
      "如查找子表达式或对变量的特定值求值, "
      "也会变得难以精确描述; "
      "人们需要在公式中来回移动以匹配括号.")
   (P (Q "树") "结构则好得多: "
      "正如家谱树能清晰地展示家族成员之间的关系, "
      "表达式的树形表示能够显示其结构, "
      "并使大多数重要的操作变得直截了当. "
      "如同在家谱学中一样, "
      "习惯上将树画成在印刷页面上向下生长的形式, "
      "因此同一个表达式可以表示如下:"
      todo.svg)
   (P "通常我们将人们使用的(主要是线性的)格式称为具体句法, "
      "而将用于操作的结构性(通常是树状的)形式称为抽象句法. "
      "像上面这样的树通常被称为抽象句法树 (AST), "
      "它们作为形式语言的内部表示被广泛应用于各种符号处理程序中, "
      "包括将高级编程语言翻译为机器指令的编译器.")
   (P "尽管树形结构使表达式的结构更加清晰, "
      "大多数人还是不愿意用树来思考或交流, "
      "而更倾向于使用结构性较弱的具体句法. "
      "因此, 在我们的定理证明程序中, "
      "我们需要将输入从具体句法转换为抽象句法, "
      "并将输出从抽象句法转换回具体句法. "
      "这两项任务, 在计算机科学家那里分别被称为句法分析和美观打印, "
      "如今已被很好地理解并且相当常规. "
      "编写解析器和美观打印器的少量额外开销, "
      "可以通过树形结构在内部操作上带来的更大便利得到充分回报. "
      "存在一些对于诸如" (Q "波兰记号") ", "
      (Q "逆波兰记号 (RPN)") ", 以及LISP的" (Q "S-表达式")
      "这样的具体句法系统的狂热倡导者, "
      "其中我们的表达式按照这些记号分别会记作"
      (CodeB "- + x × y z w")
      (CodeB "x y z × + w -")
      (CodeB "(- (+ x (× y z)) w)")
      "但是我们会使用更为传统的记号, 有着像" (Q $+)
      "这样的中缀运算符, 以及优先级和括号规则.")
   (H3. "符号计算和OCaml" #:id "symbolic-computation-and-ocaml")
   (P "现代计算的早期人们普遍相信计算机基本上是用来进行数值计算的设备 (Ceruzzi 1983). "
      "其输入和输出设备确实也在某种程度上偏向于这一方向: "
      "当Samuels在1948年于IBM写下第一个跳棋程序时, "
      "他不得不将输出编码为一个数字, 因为这就是唯一可以打印的内容了. "
      "然而, 远在Turing从理论上构造通用机器 (参见第7.5节) 之前, "
      "人们就已经认识到计算机的潜在应用范围要广泛得多. "
      "例如, Ada Lovelace在1842年就观察到 (Huskey和Huskey 1980):"
      (Blockquote
       "许多不熟悉数学研究的人想象, "
       "因为[Babbage的分析]引擎的任务是以数字符号给出其结果, "
       "所以其过程的性质必然是算术的和数值的, 而非代数的和解析的. "
       "这是一个错误. 该引擎能够对其数值量进行排列和组合, "
       "恰如它们是字母或任何其他一般性符号一样; "
       "事实上, 如果做了相应的安排, "
       "它完全可以以代数符号形式输出其结果."))
   (P "如今已有许多执行符号计算的程序, 其中包括各种相当成功的"
      (Q "计算机代数系统")
      " (CAS). 定理证明程序与计算机代数系统有着很强的家族相似性, "
      "甚至在它们能够解决的某些问题上存在重叠 (例如参见第5.11节).")
   (P "从事符号计算的人的关注点影响了他们偏好的编程语言. "
      "许多系统程序员青睐C, 数值分析人员偏好FORTRAN, 诸如此类, "
      "而符号计算程序员通常更喜欢更高级的语言, "
      "这些语言使典型的符号操作更加便捷, "
      "将程序员从内存表示等显式细节中解放出来. "
      "我们选择使用Objective CAML (OCaml)作为本书编程示例的载体. "
      "我们的代码没有使用OCaml中任何较为特殊的特性, "
      "应当很容易移植到相关的函数式语言, "
      "如F#, Standard ML或Haskell.")
   (P "我们坚持使用显式的OCaml代码, 对于没有计算机编程经验的读者, "
      "或者只了解C或Java等命令式低级语言的读者来说, 可能会感到不安. "
      "然而, 我们希望借助附录2以及本章末尾推荐的一些标准教材的额外学习, "
      "有决心的读者能够掌握足够的OCaml知识来跟上讨论并动手实践代码. "
      "作为OCaml中符号计算的一个温和入门, "
      "我们现在将在普通代数这一许多读者所熟悉的领域中实现一些简单的操作.")
   (P "第一个任务是定义一个数据类型以表示代数表达式的抽象句法. "
      "我们允许表达式由诸如" (Code "0") ", " (Code "1") ", "
      (Code "33") "这样的数值常量以及诸如" (Code "x") "和"
      (Code "y") "这样的命名变量通过加法 (" (Q (Code "+"))
      ") 和乘法 (" (Q (Code "*")) ") 运算构筑而成. "
      "以下是相应的递归数据类型声明:"
      (CodeB "type expression =
   Var of string
 | Const of int
 | Add of expression * expression
 | Mul of expression * expression;;"))
   (P "也就是说, 一个表达式要么是由一个字符串标识的变量, "
      "要么是由其整数值标识的常量, "
      "要么是一个加法或乘法运算符作用于两个子表达式. ("
      (Q (Code "*")) "表示一个类型构造器的定义域是一个笛卡尔积, "
      "因此它可以接受两个表达式作为参数. "
      "这与所定义的乘法运算毫无关系!) "
      "我们可以使用这个类型定义所引入的句法构造器"
      "来创建任何特定表达式的符号表示, 例如"
      (&+ (&c* $2 $x) $y) ":"
      (CodeB "# Add(Mul(Const 2,Var &quot;x&quot;),Var &quot;y&quot;);;
- : expression = Add (Mul (Const 2, Var &quot;x&quot;), Var &quot;y&quot;)"))
   (P "符号计算的一个简单但具有代表性的例子是应用指定的变换规则, 如"
      (&--> (&+ $0 $x) $x) "和" (&--> (&+ $3 $5) $8)
      ", 来" (Q "化简") "一个表达式. "
      "每条规则在OCaml中通过一个起始模式和一个终止模式来表达, "
      "例如" (Code "Add(Const(0),x) -> x") "对应变换"
      (&--> (&+ $0 $x) $x) ". (特殊模式" (Q (Code "_"))
      "可以匹配任何内容, 因此最后一行确保了当没有其他模式匹配时, "
      (Code "expr") "将被原样返回.) "
      "当函数被调用时, OCaml会按顺序遍历这些规则, "
      "并应用第一条起始模式与输入表达式" (Code "expr")
      "匹配的规则, 将像" (Code "x")
      "这样的变量替换为相应的子表达式."
      (CodeB "let simplify1 expr =
  match expr with
    Add(Const(m),Const(n)) -> Const(m + n)
  | Mul(Const(m),Const(n)) -> Const(m * n)
  | Add(Const(0),x) -> x
  | Add(x,Const(0)) -> x
  | Mul(Const(0),x) -> Const(0)
  | Mul(x,Const(0)) -> Const(0)
  | Mul(Const(1),x) -> x
  | Mul(x,Const(1)) -> x
  | _ -> expr;;"))
   (P "然而, 仅化简一次并不一定足够; "
      "我们更希望反复化简, 直到无法再取得进展为止. "
      "为此, 让我们以自底向上的方式对表达式树进行遍历来应用上述函数, "
      "这将以级联的方式进行化简. 按照传统的OCaml递归风格, "
      "我们首先尽可能地化简所有直接子表达式, "
      "然后对结果应用" (Code "simplify1") ":"
      (CodeB "let rec simplify expr =
  match expr with
    Add(e1,e2) -> simplify1(Add(simplify e1,simplify e2))
  | Mul(e1,e2) -> simplify1(Mul(simplify e1,simplify e2))
  | _ -> simplify1 expr;;"))
   (P "与简单的自底向上遍历相比, "
      "一种更精细的方法是将自顶向下和自底向上的化简混合使用. "
      "例如, 如果" $E "非常大, 那么将" (&c* $0 $E) "直接化简为"
      $0 "而不检查" $E "的内容似乎更为高效. "
      "然而, 这需要谨慎实现, 以确保所有可化简的子项都被化简, "
      "同时避免无限循环的危险. 不管怎样, "
      "以下是我们的化简函数作用于表达式"
      (&+ (&c* (@+ (&c* $0 $x) $1) $3) 12) "的效果:"
      (CodeB "# let e = Add(Mul(Add(Mul(Const(0),Var &quot;x&quot;),Const(1)),Const(3)),
              Const(12));;
val e : expression =
  Add (Mul (Add (Mul (Const 0, Var &quot;x&quot;), Const 1), Const 3), Const 12)
# simplify e;;
- : expression = Const 15"))
   (P "走到这一步, 使用标准的OCaml函数式编程技术是很直接的: "
      "用递归数据类型表示树结构, 通过模式匹配和递归来定义函数. "
      "我们希望此前未使用过类似语言的读者能够开始理解为什么OCaml对符号计算具有吸引力. "
      "当然, 那些钟爱其他编程语言的读者完全可以将我们的代码翻译成他们所喜欢的语言.")
   (P "按照计划, 我们将实现一个句法分析器和美观打印器, "
      "用于在抽象句法树和具体字符串 (如" (Q (Code "x + 0"))
      ") 之间进行转换, 并将它们设置为由OCaml自动调用, "
      "以完成表达式的输入和输出. "
      "我们的具体句法以普通代数记号为蓝本, "
      "但在两个方面我们将参照计算机语言而非传统数学的做法. "
      "我们允许任意长的" (Q "词")
      "作为变量, 而数学家传统上大多使用带上标和下标的单个字母; "
      "鉴于ASCII字符集的有限性, 这一点尤为重要. "
      "此外, 我们要求乘法必须用一个显式的中缀符号来书写 ("
      (Q (Code "x * y")) "), 而不是简单的并置 ("
      (Q (Code "x y")) "), 因为后者我们稍后将用于函数应用. "
      "在日常数学中, 我们通常依赖诸如变量名和背景知识"
      "之类的非正式线索来一眼看出" (app $f (&+ $x $1))
      "表示函数应用而" (&i* $y (@+ $x $1))
      "表示乘法, 但这种依赖上下文的解析实现起来要复杂一些.")
   (H3. "句法分析 (parsing)")
   (P "将具体句法转换为抽象句法是一个已被充分理解的课题, "
      "因为它对编程语言的编译器, 解释器和翻译器具有核心重要性. "
      "现在的惯例是将这一转换分为两个独立的阶段:"
      (Ul (Li "词法分析 (扫描) 将输入的字符序列分解为"
              (Q "词元 (token)") " (粗略地说, 就是词);")
          (Li "句法分析将词元的线性序列转换为抽象句法树.")))
   (P "例如, 词法分析可能会将输入" (Q (Code "v10 + v11"))
      "拆分为三个词元" (Q (Code "v10")) ", "
      (Q (Code "+")) "和" (Q (Code "v11"))
      ", 将相邻的alphanumeric字符合并成词, "
      "并丢弃这些记号之间任意数量的空格 (甚至可能包括换行符). "
      "这样, 句法分析只需处理词元序列, 而可以忽略更底层的细节.")
   (H4. "词法分析")
   
   (H4. "句法分析")
   (H3. "美观打印 (prettyprinting)")
   (H3. "深入阅读")
   (P "我们在此仅列出一般性的参考文献, "
      "以及那些后续章节中不会深入讨论的主题的相关文献. "
      "更具体和更技术性的参考文献将在后续各章末尾给出.")
   (P "Davis (2000) 和Devlin (1997) 是关于逻辑及其机械化发展的综合性著作, "
      "同时也涉及计算机科学和语言学中的相关课题. "
      "关于逻辑的入门教材有很多, "
      "如Hodges (1977), Mates (1972) 和Tarski (1941). "
      "有两本逻辑著作与本书一样附带了计算机程序, "
      "分别是Keisler (1996) 以及Barwise和Etchemendy (1991). "
      "此外还有若干著作仔细探讨了逻辑推理在数学中的作用, "
      "例如Garnier和Taylor (1996).")
   (P "Bochénski (1961), Dumitriu (1977) 以及Kneale和Kneale (1962) "
      "是关于逻辑史的详尽而严谨的学术著作. "
      "Kneebone (1963) 是一部数理逻辑综述, 其中也包含大量历史资料, "
      "而Marciszewski和Murawski (1995) 则与本书一样强调机械化这一主题. "
      "关于Jevons的逻辑钢琴以及其他早期" (Q "推理机器")
      "的生动介绍 (可以追溯至十三世纪西班牙神秘主义者"
      "Ramon Lull的工作), 参见Gardner (1958). "
      "MacKenzie (2001) 是关于自动定理证明发展及其应用的历史概述.")
   (P "有许多哲学逻辑导论著作更深入地讨论了诸如"
      "逻辑后承 (logical consequence) 的概念等议题, "
      "例如Engel (1991), Grayling (1990) 和Haack (1978). "
      "具有哲学倾向的读者或许会有兴趣审视Mill (1865) 和Mauthner (1901) "
      "关于逻辑后承不过是一种心理偶然现象的主张, "
      "以及Frege (1879) 和Husserl (1900) 针锋相对的论战式回应.")
   (P "关于OCaml和函数式编程的更多参考文献, 请参见附录2. "
      "我们所描述的基本句法分析技术几乎"
      "在每一本编译技术著作中都有详细阐述. "
      "由Aho, Sethi和Ullman (1986) 所著的" (Q "龙书")
      "长期以来被视为经典, "
      "不过对于主要兴趣不在句法分析方面的读者来说, "
      "其关于句法分析的论述可能过于详尽. "
      "对哪些句法分析任务是可判定的, "
      "哪些是不可判定的进行详细的理论分析, "
      "自然引向可计算性理论. Davis, Sigal和Weyuker (1994) "
      "不仅全面地涵盖了这方面的内容, 而且本身也是一本逻辑教材. "
      "关于美观打印的更多内容, 参见Oppen (1980b) 和Hughes (1995).")
   (P "与本书风格相同的, 面向实现的定理证明讨论, "
      "还见于Huet (1986), Newborn (2001) 和Paulson (1992), "
      "而Gordon (1988) 也以类似风格描述了定理证明器在程序验证环境中的应用. "
      "其他关于自动定理证明的综合性教材包括"
      "Chang和Lee (1973), Duffy (1991) 和Fitting (1990), "
      "此外还有一些更专门的著作将在后文中提及.")
   (H3. "练习")
   
   (H2. "命题逻辑")
   (P "我们将会仔细研究命题逻辑, 在OCaml之中定义其形式句法, "
      "连带着句法分析和打印支持. "
      "我们将会讨论一些关键性的命题算法, 并证明紧致性定理, "
      "还会指明命题定理证明的丰富应用.")
   (H3. "命题逻辑的句法")
   (P "命题逻辑是" (Ref "algebra-of-logic")
      "所呈现的Boole的命题代数的一种现代版本. "
      "{原注: 诚然如此, 命题逻辑有时被称为" (Q "Boole代数")
      ". 但是, 这容易令人感到困惑, "
      "因为数学家将一切满足特定公理的代数结构都称为Boole代数, "
      "大致上这些公理是通常的代数律连带着" (&= $x^2 $x)
      " (Halmos 1963).} {译注: 这说的是Boole环, 可以被定义为含幺元的幂等环.} "
      "其牵涉被称为" (Em "公式") "的表达式, 而公式的意图是表示命题, "
      "即可以被认为是真或者假的断言. "
      "{原注: 当查阅文献时, 读者或许会发现用的是术语" (Em "合式公式")
      " (缩写为wff) 而非仅仅" (Q "公式")
      ". 这是为了强调在具体句法之中, 我们仅仅关心具有句法合法形式的字符串, "
      "而非任意的符号的(字符)串.} "
      "这些公式可以由常量" (Q "true") "和" (Q "false")
      "以及一些基本的" (Em "原子命题") " (或者说" (Em "原子")
      ") 通过各种逻辑联结词 (" (Q "not") ", " (Q "and")
      ", " (Q "or") ", 等等) 构筑而成. "
      "原子命题类似于通常代数之中的变量, "
      "有时我们将其称为" (Em "命题变量") "或者"
      (Em "Boole变量") ". 正如词汇" (Q "原子")
      "所暗示的, 我们并不会分析其内在结构; "
      "当我们在下一章中处理一阶逻辑时则要进行考虑.")
   (H4. "OCaml中的表示")
   (P "我们使用一个OCaml数据类型来表示命题公式, "
      "这可以类比于" (Ref "symbolic-computation-and-ocaml")
      "里的表达式类型. 我们允许" (Q "常量")
      "命题" (Code "False") "和" (Code "True")
      "以及原子命题" (Code "Atom p")
      ", 并且可以由它们通过使用幺元运算符" (Code "Not")
      "以及二元联结词" (Code "And") ", " (Code "Or")
      ", " (Code "Imp") " (" (Q "implies")
      "), " (Code "Iff") " (" (Q "if and only if")
      ") 构筑公式. 我们将对于这些联结词的确切含义的讨论推后, "
      "先来处理立即有用的部分.")
   (P "原子命题的潜在集合很大程度上是任意的, "
      "尽管对于某些目的而言其应该是无限的, "
      "以避免限制我们所能考虑的公式的复杂度. "
      "在抽象处理之中原始命题往往就是用数字索引的. "
      "我们令原子命题的潜在类型" (Code "'a")
      "为公式类型的定义的一个参数, "
      "由此许多基本函数可以不管该类型为何而一样工作. "
      "当我们考虑扩展至一阶逻辑时, "
      "这种乍看上去空洞的泛化有助于避免重复工作. "
      "出于相同的理由, 我们包含了两个额外的公式类型构造子"
      (Code "Forall") "和" (Code "Exists")
      ". 这些在本章中大致上会被忽略, "
      "不过其作用将会在之后变得清晰."
      (CodeB "type ('a)formula = False
                 | True
                 | Atom of 'a
                 | Not of ('a)formula
                 | And of ('a)formula * ('a)formula
                 | Or of ('a)formula * ('a)formula
                 | Imp of ('a)formula * ('a)formula
                 | Iff of ('a)formula * ('a)formula
                 | Forall of string * ('a)formula
                 | Exists of string * ('a)formula;;"))
   (H4. "具体句法")
   (P "正如我们之前所见, Boole对于逻辑联结词使用了传统的代数符号, 例如"
      (Q $+) ". 这使得许多逻辑事实看起来令人迷惑地熟悉, 例如"
      (MB (&= (&i* $p (@+ $q $r))
              (&+ (&i* $p $q) (&i* $p $r)))))
   (P "但是有些逻辑事实看起来就相当奇怪了, "
      "例如若是将第一个公式中的" (Q "and") "和" (Q "or")
      "系统地交换, 则可以得到以下事实:"
      (MB (&= (&+ $p (&i* $q $r))
              (&i* (@+ $p $q) (@+ $p $r))))
      "{译注: 注意这里遵循惯例, 乘法先于加法进行计算.}")
   (P "以逻辑的伪装这是在说如果" $p "成立或者" $q "和" $r
      "都成立, 那么" $p "或" $q "成立, 且" $p "或" $r
      "成立, 反之亦然. 稍加思考则可令读者确信的确如此; "
      "回忆一下" (Q $p "或" $q) "是可兼的, 即包含同时成立的情况.")
   (P "为了避免困惑或者是由通常代数产生误导性的类比, "
      "我们将会对于联结词使用如今业已标准化了的特殊符号. "
      "下表的每一行我们给出了每种构造的英语读法, "
      "之后跟着的是我们在讨论中所采用的标准符号化, "
      "然后是我们在程序中所支持的ASCII近似化, "
      "相应的抽象句法构造, 以及其他一些可能会用到的符号化. "
      "(最后一列如果只是阅读本书则可以忽略, "
      "但是在参考其他文献时则会很有用.)"
      (let ((TrTd* (lambda x* (apply Tr (map Td x*)))))
        (Table
         #:attr* '((align "center")
                   (border "1")
                   (style "border-collapse: collapse;"))
         (TrTd* "英语" "符号" "ASCII" "OCaml" "其他符号")
         (TrTd* "false" $bottom (Code "false") (Code "False") (&cm $0 $F))
         (TrTd* "true" $top (Code "true") (Code "True") (&cm $1 $T))
         (TrTd* (Span "not " $p) (&neg $p) (Code "~p") (Code "Not p")
                (&cm (OverBar $p) (&- $p) (&~ $p)))
         (TrTd* (Span $p " and " $q) (&conj $p $q)
                (Code "p /\\ q") (Code "And(p,q)")
                (&cm (&i* $p $q) (&& $p $q) (&d* $p $q)))
         (TrTd* (Span $p " or " $q) (&disj $p $q) (Code "p \\/ q")
                (Code "Or(p,q)") (&cm (&+ $p $q) (&\| $p $q)))
         (TrTd* (Span $p " implies " $q) (&=> $p $q)
                (Code "p ==> q") (Code "Imp(p,q)")
                (&cm (&-> $p $q) (&sup $p $q)))
         (TrTd* (Span $p " iff " $q) (&<=> $p $q)
                (Code "p &lt;=> q") (Code "Iff(p,q)")
                (&cm (&<-> $p $q) (&equiv $p $q) (&~ $p $q))))))
   (P "符号" (Q $disj) "来源于拉丁词汇" (Q "vel")
      "的首字母, 其意为可兼或. " $top
      "的形状类似于" (Q "true") "的首字母, 而" $bottom
      "和" $conj "不过是" $top "和" $disj
      "的镜像, 体现了一种对偶原则, "
      "这将在第2.4节中加以解释. "
      "否定的符号与算术取负的符号足够相似, 因此容易记忆. "
      "有些读者可能在非形式化的数学中见过推出和"
      (Q "当且仅当") "的符号.")
   (P "和普通代数一样, 我们需要建立联结词的优先级规则, "
      "并且若有必要可以通过括号来覆写规则. "
      "我们所采用的(颇为标准的)优先级顺序已经在上表中指明, 其中"
      (Q $neg) "是最高的, " (Q $<=>) "是最低的. 例如, "
      (&=> $p (&disj (&conj $q (&neg $r)) $s)) "意思是"
      (&=> $p (@disj (@conj $q (@neg $r)) $s))
      ". 或许赋予" $conj "和" $disj
      "相等的优先级更为合适, 但是只有少数作者这么做 "
      "(Dijkstra和Scholten 1990), "
      "我们还是从众赋予" $conj "更高的优先级.")
   (P "我们所有的二元联结词都以向右结合的方式进行句法分析, 于是"
      (&conj $p $q $r) "的意思是" (&conj $p (@conj $q $r))
      ", 诸如此类. 在非形式化的实践里, 形式如"
      (&=> $p $q $r) "这样的迭代推出经常用作"
      (Q (&=> $p $q) "且" (&=> $q $r))
      "的缩写, 就像" (&<= $x $y $z) "是"
      (Q (&<= $x $y) "且" (&<= $y $z))
      "的缩写. 但是对于我们而言, "
      (&=> $p $q $r) "指的是"
      (&=> $p (@=> $q $r)) ", 不是一个意思.")
   (P "在非形式化的讨论里, 我们不会使得" (Code "Atom")
      "构造子显式化, 但是会使用诸如" (&cm $p $q $r)
      "这样的名字代表一般的公式, 而" (&cm $x $y $z)
      "代表一般的原子. 例如, 当我们讨论"
      (&<=> $x $p) "时, 我们往往指的是具有形式"
      (Code "Iff(Atom(x),p)") "的公式.")
   (P "{译注: 实际情况是, 这个记号约定基本上废的, "
      (&cm $p $q $r) "除了用于公式的元变量, "
      "也一般用作原子命题的名字, "
      "虽然一般不用作原子命题的元变量. "
      "问题在于, 这足够引起混淆了, 例如"
      (&=> $p $q) "到底指的是一个具体的公式, "
      "还是一个公式的形式/模式, "
      "只能通过上下文判断.}")
   (H4. "通用句法分析和打印")
   (P "我们为公式建立了自动化的句法分析和打印支持, "
      "正如我们在第1.7–1.8节中对普通代数表达式所做的那样. "
      "由于具体细节对当前目的而言并不重要, "
      "代码的详细描述推迟到附录3中给出. "
      "不过我们确实想要强调的是, "
      "既然公式的类型是以原子命题的类型为参数的, "
      "那么句法分析和打印函数也同样是参数化的. "
      "函数" (Code "parse_formula") "的类型为:"
      (CodeB "# parse_formula;;
- : (string list -> string list -> 'a formula * string list) *
    (string list -> string list -> 'a formula * string list) ->
    string list -> string list -> 'a formula * string list
= &lt;fun>"))
   
   (H4. "原始命题")
   (P "尽管许多函数将会是通用的 (generic), "
      "但是如果我们固定在一个确定的原始命题类型上, "
      "对于某些操作进行实验会更加简单. "
      "据此我们定义了以下的原始命题类型, 其由名字索引 (即字符串):"
      (CodeB "type prop = P of string;;")
      "我们定义以下函数来获取一个命题的名字:"
      (CodeB "let pname(P s) = s;;"))
   (P "现在我们只需提供一个原子命题的解析器, 这相当直截了当. "
      "出于附录3中解释的原因, 我们需要检查第一个输入字符是否不是左括号, "
      "除此之外, 我们只需将输入流中的第一个标记作为原始命题的名称即可:"
      (CodeB "let parse_propvar vs inp =
  match inp with
    p::oinp when p &lt;> &quot;(&quot; -> Atom(P(p)),oinp
  | _ -> failwith &quot;parse_propvar&quot;;;")
      "现在我们将其提供给通用的公式解析器, "
      "其中对于目前未使用的中缀原子解析器传入一个总是失败的函数, "
      "对于非命题变量的上下文则传入一个空列表:"
      
      )
   
   (H4. "句法操作")
   (P "如果我们能有对应于公式构造子的句法操作"
      "作为正常的OCaml函数可用是很方便的:"
      (CodeB "let mk_and p q = And(p,q) and mk_or p q = Or(p,q)
and mk_imp p q = Imp(p,q) and mk_iff p q = Iff(p,q)
and mk_forall x p = Forall(x,p) and mk_exists x p = Exists(x,p);;"))
   (P "对偶地, 往往能够解构公式而不需要显式的模式匹配也是方便的. "
      "以下这个函数解构了一个" (Em "等价")
      " (或者说" (Em "biimplication") ", 或者说" (Em "biconditional")
      "), 即将具有形式" (&<=> $p $q) "的公式转换为序对" (tu0 $p $q) ":"
      (CodeB "let dest_iff fm =
  match fm with Iff(p,q) -> (p,q) | _ -> failwith &quot;dest_iff&quot;;;"))
   (P "类似地, 以下函数将一个" (Em "合取") "公式" (&conj $p $q)
      "分解为两个" (Em "合取分量(conjunct)") $p "和" $q ":"
      (CodeB "let dest_and fm =
  match fm with And(p,q) -> (p,q) | _ -> failwith &quot;dest_and&quot;;;")
      "而以下函数将一个合取递归地分解为一个合取分量的列表:"
      (CodeB "let rec conjuncts fm =
  match fm with And(p,q) -> conjuncts p @ conjuncts q | _ -> [fm];;"))
   (P "下列类似的函数将一个" (Em "析取") "公式" (&disj $p $q)
      "分解为" (Em "析取分量(disjunct)") $p "和" $q
      ", 一个是在顶层, 一个则是递归的:"
      (CodeB "let dest_or fm =
  match fm with Or(p,q) -> (p,q) | _ -> failwith &quot;dest_or&quot;;;

let rec disjuncts fm =
  match fm with Or(p,q) -> disjuncts p @ disjuncts q | _ -> [fm];;")
      "以下是推出式的一个顶层解构子:"
      (CodeB "let dest_imp fm =
  match fm with Imp(p,q) -> (p,q) | _ -> failwith &quot;dest_imp&quot;;;"))
   (P "一个推出式" (&=> $p $q) "里的公式" $p "和" $q
      "分别被称为其" (Em "前件") "和" (Em "后件")
      ", 而我们也应该定义相应的函数:"
      (CodeB "let antecedent fm = fst(dest_imp fm);;
let consequent fm = snd(dest_imp fm);;"))
   (P "我们经常需要通过对公式进行递归来定义函数, "
      "正如我们在第1.6节中对化简所做的那样. "
      "有两种递归模式似乎足够常见, 因此有必要定义通用函数. "
      "下面这个函数将一个函数应用于公式中的所有原子, 但保持其余结构不变. "
      "例如, 它可以用来将某个特定的原子命题系统地替换为另一个公式:"
      (CodeB "let rec onatoms f fm =
  match fm with
    Atom a -> f a
  | Not(p) -> Not(onatoms f p)
  | And(p,q) -> And(onatoms f p,onatoms f q)
  | Or(p,q) -> Or(onatoms f p,onatoms f q)
  | Imp(p,q) -> Imp(onatoms f p,onatoms f q)
  | Iff(p,q) -> Iff(onatoms f p,onatoms f q)
  | Forall(x,p) -> Forall(x,onatoms f p)
  | Exists(x,p) -> Exists(x,onatoms f p)
  | _ -> fm;;"))
   (P "下面这个函数是列表迭代器"
      (Code "itlist") "之于公式的类比, "
      "它将一个二元函数迭代地作用于公式中的所有原子:"
      (CodeB "let rec overatoms f fm b =
  match fm with
    Atom(a) -> f a b
  | Not(p) -> overatoms f p b
  | And(p,q) | Or(p,q) | Imp(p,q) | Iff(p,q) ->
        overatoms f p (overatoms f q b)
  | Forall(x,p) | Exists(x,p) -> overatoms f p b
  | _ -> b;;"))
   (P "一个特别常见的应用是收集与原子相关联的某种属性的集合; "
      "最简单的情形就是返回所有原子的集合. "
      "我们可以通过将一个函数" $f "连同一个" (Q "append")
      "操作迭代地作用于所有原子来实现这一点, "
      "最后将结果转换为集合以去除重复项. "
      "(我们也可以在过程中使用" (Code "union")
      "来逐步去除重复项, 但当涉及的集合较大时, "
      "当前的实现方式可能更为高效.)"
      (CodeB "let atom_union f fm = setify (overatoms (fun h t -> f(h)@t) fm []);;"))
   (P "我们很快将会看到对于如何使用这些非常一般的函数的刻画.")
   (H3. "命题逻辑的语义")
   (P "既然命题公式意在表示可能为真或者为假的断言, "
      "一个公式的最终含义只是两个" (Em "真值")
      (Q "true") "和" (Q "false") "中的一个. "
      "然而, 正如像" (&+ $x $y $1)
      "这样的一个代数表达式当我们知道变量" $x "和" $y
      "所代表的东西之后只有一个确切的含义, "
      "一个命题公式的含义依赖于被分配给其原子公式的真值. "
      "这种分配在一个" (Em "赋值(valuation)")
      "之中进行编码, 赋值是一个从原子的集合到真值的集合"
      (setE $false $true) "的函数. 给定一个公式" $p "和一个赋值" $v
      ", 然后我们可以根据下列递归定义的函数求得总体的真值:"
      (CodeB "let rec eval fm v =
  match fm with
    False -> false
  | True -> true
  | Atom(x) -> v(x)
  | Not(p) -> not(eval p v)
  | And(p,q) -> (eval p v) &amp; (eval q v)
  | Or(p,q) -> (eval p v) or (eval q v)
  | Imp(p,q) -> not(eval p v) or (eval q v)
  | Iff(p,q) -> (eval p v) = (eval q v);;"))
   (P "这是我们对于命题逻辑的数学" (Em "定义")
      ", 意在作为对于我们的直觉的自然形式化. "
      "{原注: 我们也可以选择将部分求值了的"
      (Code "eval p") ", 即一个从赋值到值的函数, "
      "视为公式" (Code "p") "的语义, 而非将赋值当作额外的参数. "
      "这主要只是一种术语问题.} "
      "(implication的语义并不显然, 之后我们将详细讨论.) "
      "每个逻辑联结词都由OCaml的内置类型" (Code "bool")
      "上的一个相应的运算子所解释. "
      "为了完全明确这些运算子的含义, "
      "我们可以枚举所有可能的输入组合并观察相应的输出, "
      "例如对于" (Code "&amp;") "运算子:"
      (CodeB "# false &amp; false;;
- : bool = false
# false &amp; true;;
- : bool = false
# true &amp; false;;
- : bool = false
# true &amp; true;;
- : bool = true"))
   (P "我们可以将这些信息排列在一张真值表中, "
      "展示如何由一个公式的立即子公式的真值来确定该公式被赋予的真值:"
      (MB (set-attr*
           (&Table
            ($p $q (&conj $p $q) (&disj $p $q) (&=> $p $q) (&<=> $p $q))
            ("false" "false" "false" "false" "true" "true")
            ("false" "true" "false" "true" "true" "false")
            ("true" "false" "false" "true" "false" "false")
            ("true" "true" "true" "true" "true" "true"))
           'frame "solid" 'rowlines "solid" 'columnlines "solid"))
      "当然了, 出于完整性的考量, 我们也应该包括幺元否定的真值表:"
      (MB (set-attr*
           (&Table
            ($p (&neg $p))
            ("false" "true")
            ("true" "false"))
           'frame "solid" 'rowlines "solid" 'columnlines "solid")))
   (P "让我们尝试在一个赋值下对公式" (&=> (&conj $p $q) (&conj $q $r))
      "求值, 其中" (&cm $p $q $r) "分别被设为" (Q "true")
      ", " (Q "false") "和" (Q "true")
      ". (我们不必费心去定义那些未出现在公式中的原子的值, "
      "OCaml会发出我们还没有完成的警告.)"
      (CodeB "# eval &lt;&lt;p /\\ q ==> q /\\ r>>
       (function P&quot;p&quot; -> true | P&quot;q&quot; -> false | P&quot;r&quot; -> true);;
...
- : bool = true"))
   (P "然而在另一个赋值下, 该公式可以求值为" (Q "false")
      "; 读者可能会发现手动验证这些结果是有益的练习:"
      (CodeB "eval &lt;&lt;p /\\ q ==> q /\\ r>>
     (function P&quot;p&quot; -> true | P&quot;q&quot; -> true | P&quot;r&quot; -> false);;"))
   (H4. "机械化了的真值表")
   (P "我们期望对于一个公式的求值独立于赋值如何给没有出现在公式之中的原子分配真值. "
      "让我们通过定义一个提取公式之中所出现的原子命题的集合的函数来使得我们的表述精确化. "
      "以抽象的数学术语来说, 我们将通过公式上的递归定义" $atoms "如下:"
      (eqn*
       ((&atoms $bottom)   $= $empty)
       ((&atoms $top)      $= $empty)
       ((&atoms $x)        $= (setE $x))
       ((&atoms (&neg $p)) $= (&atoms $p))
       ((&atoms (&conj $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))
       ((&atoms (&disj $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))
       ((&atoms (&=> $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))
       ((&atoms (&<=> $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))))
   (P "作为公式上的结构归纳证明的一个简单例子 "
      "(见附录1和2), 我们将会证明" (&atoms $p)
      "总是有限的, 因而我们可以基于ML的列表来解释它而并没有曲解其含义. "
      "(当然了, 我们需要记住一般情况下列表相等性和集合相等性并不相同.) "
      "{译注: 我的理解大概就是这里可以使用列表表示集合, 仅此而已.}")
   ((Theorem)
    "对于任意的命题公式" $p ", 集合" (&atoms $p) "是有限的.")
   ((proof)
    "对公式的结构进行归纳证明." (Br)
    "若" $p "是" $bottom "或" $top ", 则" (&atoms $p)
    "是空集; 若" $p "是一个原子命题, 则" (&atoms $p)
    "是一个单元素集. 在所有这些情况下, 它们都是有限的." (Br)
    "若" $p "的形式为" (&neg $q) ", 则由归纳假设, "
    (&atoms $q) "是有限的, 且根据定义, "
    (&= (&atoms (&neg $q)) (&atoms $q)) "." (Br)
    "若" $p "的形式为" (&conj $q $r) ", " (&disj $q $r)
    ", " (&=> $q $r) "或" (&<=> $q $r) ", 则"
    (&= (&atoms $p) (&union (&atoms $q) (&atoms $r)))
    ". 由归纳假设, " (&atoms $q) "和" (&atoms $r)
    "都是有限的, 而两个有限集的并集仍然是有限的.")
   (P "类似地, 我们可以形式化地澄清以上所提及的直觉上显然的事实.")
   ((Theorem #:id "same-on-atoms")
    "对于任意的命题公式" $p ", 如果两个赋值" $v "和" $v^
    "在集合" (&atoms $p) "上相合, 即对于每个" (∈ $x (&atoms $p))
    "都有" (&= (app $v $x) (app $v^ $x)) ", 那么"
    (&= (&eval $p $v) (&eval $p $v^)) ".")
   ((proof)
    "对" $p "的结构进行归纳证明." (Br)
    "如果" $p "是" $bottom "或者" $top
    ", 那么其真值解释是独立于赋值的." (Br)
    "如果" $p "是一个原子" $x ", 那么"
    (&= (&atoms $x) (setE $x))
    ", 而根据题设我们有"
    (&= (app $v $x) (app $v^ $x)) ". 因此, "
    (&= (&eval $p $v) (app $v $x)
        (app $v^ $x) (&eval $p $v^))
    "." (Br)
    "如果" $p "具有形式" (&conj $q $r) ", " (&disj $q $r)
    ", " (&=> $q $r) "或" (&<=> $q $r) ", 那么"
    (&= (&atoms $p) (&union (&atoms $q) (&atoms $r)))
    ". 既然赋值在两个集合之并上是相合的, 那么其在"
    (&atoms $q) "和" (&atoms $r) "上更是相合的了. "
    "因此, 我们可以应用归纳假设以得出"
    (&= (&eval $q $v) (&eval $q $v^)) "和"
    (&= (&eval $r $v) (&eval $r $v^))
    ". 既然" $p "的赋值是这些子赋值的函数, 那么"
    (&= (&eval $p $v) (&eval $p $v^)) ".")
   (P "以上" $atoms "的定义可以被直接翻译为一个OCaml函数, "
      "例如对于" (Q $union) "使用" (Code "union") "而对于"
      (Q (setE $x)) "使用" (Code "[x]")
      ". 然而, 我们更倾向于基于既有的迭代子"
      (Code "atom_union") ":"
      (CodeB "let atoms fm = atom_union (fun a -> [a]) fm;;")
      "例如:"
      (CodeB "# atoms &lt;&lt;p /\\ q \\/ s ==> ~p \\/ (r &lt;=> s)>>;;
- : prop list = [P &quot;p&quot;; P &quot;q&quot;; P &quot;r&quot;; P &quot;s&quot;]"))
   (P "鉴于对于一个命题公式" $p
      "的解释只依赖于赋值在有限集合" (&atoms $p)
      " (设其有" $n "个元素) 上的动作, "
      "并且对于每个原子命题只有两种选择可作, "
      "于是最终的真值完全由对于这些原子的总共" $2^n
      "种选择所确定. 因此, 我们可以自然地将真值表形式的枚举"
      "从基本运算推广至任意的公式. "
      "为了在OCaml中实现这个, 我们从定义一个函数开始, "
      "其会测试一个函数" (Code "subfn")
      "是否会在原子" (Code "ats")
      "的所有可能赋值上返回" (Code "true")
      ", 对于其他所有原子则使用既有的赋值" (Code "v")
      ". 所有赋值的空间是通过相继修饰" (Code "v")
      "以设定每个原子" (Code "p") "为" (Q "true")
      "和" (Q "false") "与递归调用探索的:"
      (CodeB "let rec onallvaluations subfn v ats =
  match ats with
    [] -> subfn v
  | p::ps -> let v' t q = if q = p then t else v(q) in
             onallvaluations subfn (v' false) ps &amp;
             onallvaluations subfn (v' true) ps;;"))
   (P "我们可以将其应用于一个函数, "
      "这个函数绘制真值表的一行, 然后返回" (Q "true")
      ". (这个返回值是重要的, 因为" (Q (Code "&amp;"))
      "只有在其第一个参数是" (Code "true")
      "的情况下才会对于第二个参数进行求值.) "
      "这可以用来绘制一个公式的整个真值表:"
      (CodeB "let print_truthtable fm =
  let ats = atoms fm in
  let width = itlist (max ** String.length ** pname) ats 5 + 1 in
  let fixw s = s^String.make(width - String.length s) ' ' in
  let truthstring p = fixw (if p then &quot;true&quot; else &quot;false&quot;) in
  let mk_row v =
     let lis = map (fun x -> truthstring(v x)) ats
     and ans = truthstring(eval fm v) in
     print_string(itlist (^) lis (&quot;| &quot;^ans)); print_newline(); true in
  let separator = String.make (width * length ats + 9) '-' in
  print_string(itlist (fun s t -> fixw(pname s) ^ t) ats &quot;| formula&quot;);
  print_newline(); print_string separator; print_newline();
  let _ = onallvaluations mk_row (fun x -> false) ats in
  print_string separator; print_newline();;")
      "{译注: 老实说我不喜欢这种代码写法, "
      "其将求值和副作用混在了一起. "
      "我宁愿单独再写一个类似的函数专门处理副作用.}")
   (P "请注意, 我们以宽度为" (Code "width")
      "的列进行打印, 列宽足以容纳所有原子的名字以及"
      (Code "true") "和" (Code "false")
      ", 外加一个末尾空格. 这样, "
      "表格中的所有项就能整齐地对齐. 例如:"
      (CodeB "# print_truthtable &lt;&lt;p /\\ q ==> q /\\ r>>;;
p     q     r     | formula
---------------------------
false false false | true
false false true  | true
false true  false | true
false true  true  | true
true  false false | true
true  false true  | true
true  true  false | false
true  true  true  | true
---------------------------
- : unit = ()"))
   (H4. "形式语言和自然语言")
   (P "命题逻辑为我们提供了一种形式化的方式, "
      "来表达英语或其他自然语言中某些复杂的命题. "
      "练习将英语中的复合命题形式化 (即翻译为形式逻辑) 是很有益的. "
      "正如在两种自然语言之间进行翻译一样, "
      "我们不能总是期望逐词对应. "
      "但只要对非形式命题的结构有一定的了解, "
      "通常就可以进行相当直接的形式化.")
   (P "在命题逻辑中, 除了上面给出的优先级规则之外, "
      "我们还可以使用标准的数学括号技术将命题组合在一起, "
      "例如区分" (Q (&conj $p (@disj $q $r)))
      "和" (Q (&disj (@conj $p $q) $r))
      ". 括号在英语和大多数其他语言中的用法截然不同 "
      "(用来插入像这样的旁注). "
      "在英语中表示优先级是一件更加临时且笨拙的事情, "
      "通常通过插入额外的标点符号和" (Q "噪音词")
      "来给短语加括号, 从而消除歧义. "
      "例如, 我们可以将上述两个例子分别表述为"
      (Q $p ", and also either " $q " or " $r) "和"
      (Q "either both " $p " and " $q ", or else " $r)
      ". 对于复杂的命题, 这种方式会变得非常繁琐, "
      "而这实际上也是需要形式语言的部分原因.")
   (P "一般来说, 像" (Q "and") ", " (Q "or") "和" (Q "not")
      "这样的结构可以相当直接地从英语翻译为相应的逻辑联结词. "
      "联结词" (Q "not") "在英语中也可以隐含在前缀如"
      (Q "dis-") "和" (Q "un-") "中, 因此我们可以将"
      (Q "You are either honest and kind, or dishonest, or unkind")
      "翻译为" (Q (&disj (&conj $H $K) (&neg $H) (&neg $K)))
      ". 然而, 有时英语短语暗示着超越纯粹真值函数之外的细微含义. 例如, "
      (Q "and") "常常表示因果关系 (" (Q "he dropped the plate and it broke")
      ") 或时间顺序 (" (Q "she climbed into bed and turned out the light")
      "). " (Q "but") "一词可以说与" (Q "and") "有着相同的真值函数解释, "
      "但它表达的是各组成命题之间以一种出人意料或令人遗憾的方式相连. 同样, "
      (Q "unless") "可以合理地翻译为" (Q "or")
      ", 但由此导致的" (Q $p " unless " $q) "与"
      (Q $q " unless " $p) "之间的对称似乎令人意外.")
   (P "更成问题的是推出式或条件式" (&=> $p $q)
      "与其预期的英语表述" (Q $p " implies " $q)
      "或" (Q "if " $p " then " $q) "之间的关系. "
      "在这一点上表面上的不协调困扰着许多形式逻辑的初学者, "
      "并且至少使一个人永远放弃了这门学科 (Waugh 1991). "
      "事实上, 关于推出式的意义的争论可以追溯到两千多年前的"
      "墨伽拉-斯多噶学派逻辑学家 (Bochénski 1961). "
      "据Sextus Empiricus记载, "
      "公元前二世纪亚历山大图书馆的馆长Callimachus曾说"
      (Q "连屋顶上的乌鸦都在争论哪些条件句是真的") ".")
   (P "首先, 让我们明确一点: 如果我们对" (&=> $p $q)
      "采用" (Em "任何") "真值函数语义, 即根据"
      $p "和" $q "的真值来定义" (&=> $p $q)
      "的真值, 那么我们所选择的语义是唯一合理的. "
      "按照直觉理解, 推出最基本的原则是: 如果"
      $p "和" (&=> $p $q) "都为真, 那么" $q "也为真; "
      "因此, 如果" $p "为真而" $q "为假, 则" (&=> $p $q)
      "必须为假. 此外, " (&=> (&conj $p $q) $p)
      "总是为真这一点也是合理的, "
      "而只有我们所选择的语义才能在"
      $p "和" $q "取任意真值的情况下使之为真.")
   
   (H3. "有效性, 可满足性, 重言")
   (P "我们称一个赋值" $v (Em "满足")
      "一个公式" $p ", 如果" (&eval $p $v)
      "为真. 一个公式被称为是:"
      (Ul (Li (Em "重言") "或者" (Em "逻辑有效的")
              ", 如果其被" (Em "所有")
              "公式满足, 或者等价地说, "
              "如果其真值表的每一行的值都为真;")
          (Li (Em "可满足的")
              ", 如果其被某个赋值满足, "
              "即其真值表至少有一行的值为真;")
          (Li (Em "不可满足的") "或者说" (Em "矛盾")
              ", 如果没有赋值可以满足它, "
              "即其真值表的每一行的值都为假.")))
   (P "注意到一个重言也是可满足的, 另外正如名字所暗示的, "
      "一个公式是不可满足的恰当其不是可满足的. "
      "而且, 在任何赋值中, " (&eval (@neg $p) $v)
      "为假当且仅当" (&eval $p $v)
      "为真. 因此, " $p "是一个重言当且仅当"
      (&neg $p) "是不可满足的.")
   (P "最简单的重言是" (Q $top)
      "; 一个稍微有趣点的重言例子是"
      (&=> (&conj $p $q) (&disj $p $q)) " ("
      (Q "如果" $p "和" $q "都为真, 那么" $p "和" $q "至少有一个为真")
      "), 而一个许多人第一眼看上去会比较惊讶的例子是" (Q "Peirce律")
      (&=> (@=> (@=> $p $q) $p) $p) ":"
      (CodeB "# print_truthtable &lt;&lt;((p ==> q) ==> p) ==> p>>;;
p     q     | formula
---------------------
false false | true
false true  | true
true  false | true
true  true  | true
---------------------"))
   (P "对于我们首先在OCaml中生成其真值表的公式"
      (&=> (&conj $p $q) (&conj $q $r))
      ", 它是可满足的, 因为其真值表的最后一列有"
      (Q "true") ", 但它不是重言, 因为其也有"
      (Q "false") ". 最简单的矛盾是" (Q $bottom)
      ", 另一个简单的矛盾是" (Q (&conj $p (&neg $p)))
      " (" (Q $p "既为真又为假") "):"
      (CodeB "# print_truthtable &lt;&lt;p /\\ ~p>>;;
p     | formula
---------------
false | false
true  | false
---------------"))
   (P "从直觉上来说, 重言" (Q "总是为真")
      ", 可满足公式" (Q "有时(但可能并不总是)为真")
      ", 矛盾" (Q "总是为假")
      ". 的确如此, 重言意在形式化地捕获引论章节以非技术性方式"
      "所讨论的逻辑真性 (logical truth) 的概念, "
      "到目前为止的话我们是在命题逻辑中定义了重言. "
      "重言恰可以类比于诸如"
      (&= (&- $x^2 $y^2) (&i* (@+ $x $y) (@- $x $y)))
      "这样的代数等式, 其构成变量的值不论为何都是"
      "一般为真的 (universally true). "
      "可满足公式可以类比于至少有解的等式, "
      "但不必总是有效, 例如"
      (&= (&+ $x^2 $2) (&i* $3 $x))
      ". {译注: 英语里等式和方程都是equation就是了.} "
      "矛盾可以类比于无解的等式, 例如"
      (&= (&d* $0 $x) $1)
      ". {译注: 这里当然都是在实数域上讨论方程.}")
   (P "将(不)可满足性的想法从公式推广至公式的集合是有用的: "
      "公式的集合" Γ "被称为是可满足的, "
      "如果存在一个赋值" $v "能够" (Em "同时")
      "满足集合里的所有公式. 注意到" (Q "同时") ": "
      (setE (&conj $p (&neg $q)) (&conj (&neg $p) $q))
      "是不可满足的, 即便其每个公式都是可满足的. "
      "当所关心的集合有限时, 设"
      (&= Γ (setE $p_1 $..h $p_n))
      ", " Γ "的可满足性等价于单一公式"
      (&conj $p_1 $..c $p_n)
      "的可满足性, 读者可从定义看出来. "
      "然而, 在我们之后的工作里, "
      "考虑无限的公式集合的可满足性也是必要的, "
      "其就无法直接归约为单一公式的可满足性了. "
      "我们也会使用记号" (G!= $q) "来表达"
      (Q "对于所有使得每个" (∈ $p Γ) "都为真的赋值, "
         "该赋值也使得" $q "为真")
      ". 注意到在有限的" (&= Γ (setE $p_1 $..h $p_n))
      "这种情况下, " (G!= $q) "等价于断言"
      (&=> (&conj $p_1 $..c $p_n) $q)
      "是一个重言. 在" (&= Γ $empty)
      "的情况下, " (!= $empty $q) "一般记为"
      (!= $q) ", 意即" $q "是一个重言. "
      "{译注: " (G!= $q)
      "一般读作" Γ "语义蕴涵" $q ".}")
   (H4. "重言和可满足性检查")
   (P "虽然我们可以通过检查真值表来确定公式的状态, "
      "但让计算机完成所有工作会更简单. "
      "以下函数通过检查公式是否在所有赋值下均求值为"
      (Q (Code "true")) "来测试该公式是否为重言式."
      (CodeB "let tautology fm =
  onallvaluations (eval fm) (fun s -> false) (atoms fm);;"))
   (P "注意到一旦任意的求值碰到" (Q (Code "false"))
      ", 那么根据" (Code "onallvaluations")
      "的编写方式, 其会立即返回, "
      "而不是坚持对于所有可能的赋值进行求值. "
      "{译注: 说立即返回其实稍有不准确之处, "
      "因为鉴于它是(非尾)递归的, "
      "所以返回时还需要走过之前途径了的"
      (Code "and") ". 这一点其实可以优化, 但就"
      (Code "onallvaluations")
      "这个函数而言没有必要优化.}"
      (CodeB "# tautology &lt;&lt;p \\/ ~p>>;;
- : bool = true
# tautology &lt;&lt;p \\/ q ==> p>>;;
- : bool = false
# tautology &lt;&lt;p \\/ q ==> q \\/ (p &lt;=> q)>>;;
- : bool = false
# tautology &lt;&lt;(p \\/ q) /\\ ~(p /\\ q) ==> (~p &lt;=> q)>>;;
- : bool = true"))
   (P "使用之前注意到的其间关系, "
      "我们可以基于重言定义可满足性和不可满足性:"
      (CodeB "let unsatisfiable fm = tautology(Not fm);;

let satisfiable fm = not(unsatisfiable fm);;"))
   (H4. "替换")
   (P "和代数恒等式一样, "
      "我们期望能够将一个重言中的原子命题一致地替换为其他公式, "
      "然后仍然得到一个重言. "
      "我们可以将这种用公式去替换原子的函数定义如下, 其中"
      (Code "subfn") "是一个有限部分函数 (见附录2):"
      (CodeB "let psubst subfn = onatoms (fun p -> tryapplyd subfn p (Atom p));;"))
   (P "例如, 使用替换函数" (&\|=> $p (&conj $p $q))
      ", 其将" $p "映射为" (&conj $p $q)
      ", 但在其他情况下则是未定义的, 我们得到:"
      (CodeB "# psubst (P&quot;p&quot; |=> &lt;&lt;p /\\ q>>) &lt;&lt;p /\\ q /\\ p /\\ q>>;;
- : prop formula = &lt;&lt;(p /\\ q) /\\ q /\\ (p /\\ q) /\\ q>>")
      "{译注: 原文" $\|=> "这个符号竖线和箭头是连在一起的, 类似于"
      $\|-> ", 但是因为HTML entity里面没有这个符号, "
      "我只能退而求其次使用这种记法了.}")
   (P "我们将会证明重言中的替换将会产生重言, "
      "这是通过一个更为一般的结果完成的, "
      "这个更为一般的结果可以利用公式上的结构归纳直接证明:")
   ((Theorem #:id "subst-eval")
    "对于任意的原子命题" $x "与任意的公式" $p "和" $q
    ", 以及任意的赋值" $v ", 我们有"
    (MB (&= (&eval (@psubst (@\|=> $x $q) $p) $v)
            (&eval $p (@ext $v $x (&eval $q $v)))) "."))
   (P "{原注: 记号" (ext $v $x $a) "表示这样一个函数" $v^
      ", 其映射" (&= (app $v^ $x) $a) "而对于" (&!= $y $x)
      "则映射" (&= (app $v^ $y) (app $v $y))
      "; 记号" (&\|=> $x $a) "则表示这样的函数, "
      "其将" $x "映射为" $a ", 对于其他参数则是未定义的. (见附录1) "
      "在我们的OCaml实现里对于有限部分函数使用对应的运算符"
      (Q (Code "|->")) "和" (Q (Code "|=>")) "; 见附录2.}")
   ((proof)
    "根据" $p "的结构上的归纳. 如果" $p "是" $bottom "或"
    $top ", 那么赋值并不发挥作用, 于是等式显然成立. 如果"
    $p "是一个原子" $y ", 那么我们需要区分两种情况. 如果"
    (&= $y $x) ", 那么使用替换和求值的定义, 我们发现:"
    (MB (deriv
         (&eval (@psubst (@\|=> $x $q) $x) $v)
         (&eval $q $v)
         (&eval $x (@ext $v $x (&eval $q $v)))))
    "从另一方面而言, 如果" (&!= $y $x) ", 那么:"
    (MB (deriv
         (&eval (@psubst (@\|=> $x $q) $y) $v)
         (&eval $y $v)
         (&eval $y (@ext $v $x (&eval $q $v)))))
    "对于其他种类的公式, 求值和替换都遵循着公式的结构, "
    "故结果很容易根据归纳假设推出. 例如, 如果" $p
    "具有形式" (&neg $r) ", 那么根据定义并使用" $r
    "的归纳假设可知:"
    (MB (deriv
         (&eval (@psubst (@\|=> $x $q) (@neg $r)) $v)
         (&eval (@neg (@psubst (@\|=> $x $q) $r)) $v)
         (&not (&eval (@psubst (@\|=> $x $q) $r) $v))
         (&not (&eval $r (@ext $v $x (&eval $q $v))))
         (&eval (@neg $r) (@ext $v $x (&eval $q $v)))))
    "二元联结词的情况都遵循着相同的本质模式, "
    "只不过有两个不同的公式" $r "和" $s
    ", 而非只有" $r ".")
   ((Corollary)
    "如果" $p "是一个重言, " $x "是任意的原子(命题), "
    $q "是任意的公式, 那么" (&psubst (@\|=> $x $q) $p)
    "也是一个重言.")
   ((proof)
    "根据之前的定理, 对于任意的赋值" $v ", 我们有:"
    (MB (&= (&eval (@psubst (@\|=> $x $q) $p) $v)
            (&eval $p (@ext $v $x (&eval $q $v)))))
    "但是既然" $p "是一个重言, 那么其对于任何赋值都会求值为真, "
    "包括出现在这个等式右边的赋值. 因此, "
    (&= (&eval (@psubst (@\|=> $x $q) $p) $v) $true)
    ". 既然" $v "是任意的, 这意味着该公式也是重言.")
   (P "请注意, 这一结果仅适用于对原子进行替换, 而非对任意命题进行替换. "
      "例如, " (&=> (&conj $p $q) (&conj $q $p))
      "是一个重言, 但是如果我们将" (&conj $p $q)
      "替换为" (&disj $p $q) ", 就不复如此了. "
      "这与普通代数中的情况完全一样, "
      "而我们的替换函数是一个从原子名字出发的函数, "
      "这一点有助于强制施加这样的限制. 不过, "
      "主要结果可以很容易地推广到同时对多个原子进行替换的情形. "
      "这些替换总是可以通过逐个重复执行单个替换来完成, "
      "但可能需要引入额外的替换来更换变量, "
      "以避免后续替换对先前替换产生虚伪的影响. "
      "例如, 我们期望能够在" (&conj $x $y)
      "中同时将" $y "替换为" $x "和" $x "替换为" $y
      ", 从而得到" (&conj $y $x)
      ". 然而, 如果我们按顺序依次执行这些替换, 就会得到:"
      (MB (deriv^
           (&psubst (@\|=> $x $y)
                    (@psubst (@\|=> $y $x)
                             (@conj $x $y)))
           (&psubst (@\|=> $x $y) (@conj $x $x))
           (&conj $y $y))))
   (P "然而, 通过使用替换对于变量进行适切的重命名, "
      "这样的问题总是可以避免的. 例如:"
      (MB (deriv^
           (&psubst
            $z $y
            (@psubst
             $y $x
             (@psubst
              $x $z (@conj $x $y))))
           (&psubst
            $z $y
            (@psubst
             $y $x (@conj $z $y)))
           (&psubst
            $z $y
            (@conj $z $x))
           (&conj $y $x))))
   (P "通过列举一些常见的重言式来培养对命题逻辑的直觉是很有帮助的. "
      "其中一些简单而直观, 例如排中律" (Q (&disj $p (&neg $p)))
      ", 它表明每个命题非真即假. "
      "一个更令人意外的重言式" -- "这无疑是因为" (Q $=>)
      "与直觉上的推出概念之间存在较大出入" -- "为:"
      (CodeB "# tautology &lt;&lt;(p ==> q) \\/ (q ==> p)>>;;
- : bool = true"))
   (P "如果" (&=> $p $q) "是一个重言 {译注: 这里的" $p
      "和" $q "是一般公式的元变量}, 即任何满足" $p
      "的赋值也都满足" $q ", 那么我们称" $q
      "是" $p "的一个" (Em "逻辑推论")
      ". 如果" (&<=> $p $q) "是一个重言, "
      "即一个赋值满足" $p "当且仅当其满足" $q
      ", 那么我们称" $p "和" $q "是" (Em "逻辑等价的")
      ". {译注: 这里引入的逻辑推论和逻辑等价都是语义而非句法概念.} "
      "许多重要的重言都具有后者的形式, 并且如果" $p
      "是一个重言, 那么平凡地" (&<=> $p $top)
      "也是一个重言, 读者很容易确认这一事实. "
      "在代数里, 给定一个合法的等式如" (&= (&i* $2 $x) (&+ $x $x))
      ", 那么我们可以在任意的其他表达式里将" (&i* $2 $x)
      "替换为" (&+ $x $x) "而不改变其值. "
      "类似地, 如果一个赋值满足" (&<=> $p $q)
      ", 那么我们可以在另一个公式" $r
      "里将" $p "替换为" $q
      "或者反过来而不改变这个赋值是否满足" $r
      ", 即便" $p "或" $q "并非原子. "
      "{译注: 不改变" $r "在这个赋值下的解释结果.} "
      "既然我们还没有形式化地定义非原子的替换, "
      "我们可以想象通过使用" (Q "模式")
      "项的某个原子" $x "来将替换位置确定下来.")
   ((Theorem #:id "eval-subst")
    "对于任意的赋值" $v "和公式" $p "与" $q "满足"
    (&= (&eval $p $v) (&eval $q $v))
    ", 对于任意的原子" $x "和公式" $r
    ", 我们有"
    (MB (&= (&eval (@psubst $x $p $r) $v)
            (&eval (@psubst $x $q $r) $v)) "."))
   ((proof)
    "根据" (Ref "subst-eval") ", 我们有"
    (MB (subst-eval $x $p $r $v))
    "和"
    (MB (subst-eval $x $q $r $v))
    "但是既然根据题设有"
    (&= (&eval $p $v) (&eval $q $v))
    ", 这些当然都是相等的.")
   ((Corollary)
    "如果" $p "和" $q "是逻辑等价的, 那么"
    (MB (&= (&eval (@psubst $x $p $r) $v)
            (&eval (@psubst $x $q $r) $v)) ".")
    "特别地, " (&psubst $x $p $r)
    "是一个重言当且仅当" (&psubst $x $q $r)
    "是一个重言.")
   ((proof)
    "既然" $p "和" $q "是逻辑等价的, 我们有"
    (&= (&eval $p $v) (&eval $q $v))
    "对于任意的赋值" $v
    "成立, 而这个结果可由之前的定理直接推出.")
   (H4. "一些重要的重言")
   (P "闲话少说, 下面列出一些重言式. "
      "其中许多如果用Boole本人的符号重写, "
      "就对应于普通代数的定律, 例如"
      (&<=> (&conj $p $bottom) $bottom)
      "对应于" (&= (&d* $p $0) $0) ".")
   (eqn*
    ((&neg $top) $<=> $bottom)
    ((&neg $bottom) $<=> $top)
    ((&neg (&neg $p)) $<=> $p)
    ((&conj $p $bottom) $<=> $bottom)
    ((&conj $p $top) $<=> $p)
    ((&conj $p $p) $<=> $p)
    ((&conj $p (&neg $p)) $<=> $bottom)
    ((&conj $p $q) $<=> (&conj $q $p))
    ((&conj $p (@conj $q $r))
     $<=>
     (&conj (@conj $p $q) $r))
    ((&disj $p $bottom) $<=> $p)
    ((&disj $p $top) $<=> $top)
    ((&disj $p $p) $<=> $p)
    ((&disj $p (&neg $p)) $<=> $top)
    ((&disj $p $q) $<=> (&disj $q $p))
    ((&disj $p (@disj $q $r))
     $<=>
     (&disj (@disj $p $q) $r))
    ((&conj $p (@disj $q $r))
     $<=>
     (&disj (@conj $p $q) (@conj $p $r)))
    ((&disj $p (@conj $q $r))
     $<=>
     (&conj (@disj $p $q) (@disj $p $r)))
    ((&=> $bottom $p) $<=> $top)
    ((&=> $p $top) $<=> $top)
    ((&=> $p $bottom) $<=> (&neg $p))
    ((&=> $p $p) $<=> $top)
    ((&=> $p $q)
     $<=>
     (&=> (&neg $q) (&neg $p)))
    ((&=> $p $q)
     $<=>
     (@<=> $p (&conj $p $q)))
    ((&=> $p $q)
     $<=>
     (@<=> $q (&disj $p $q)))
    ((@<=> $p $q) $<=> (@<=> $q $p))
    ((@<=> $p (@<=> $q $r))
     $<=>
     (@<=> (@<=> $p $q) $r)))
   (P "以上最后几个重言式或许尤其令人惊讶, "
      "因为我们在日常数学中并不习惯" (Q "等式中嵌套等式")
      "的情形. 实际上, 它们表明" (Q $<=>)
      "是一个对称且具有结合律的运算符 (类似于算术中的" (Q $+)
      "), 即迭代等价 (iterated equivalences) "
      "的顺序和结合方式在逻辑上没有任何差别. "
      "Dijkstra和Scholten (1990) 给出了一些涉及等价的其他重言式, "
      "这些重言式可以在OCaml中加以验证; 他们将其中第二个重言式称为"
      (Q "黄金法则") "."
      (CodeB "# tautology &lt;&lt;p \\/ (q &lt;=> r) &lt;=> (p \\/ q &lt;=> p \\/ r)>>;;
- : bool = true
# tautology &lt;&lt;p /\\ q &lt;=> ((p &lt;=> q) &lt;=> p \\/ q)>>;;
- : bool = true"))
   (P "我们的重言式列表里还有一个对应于逆否原理的重言, 即"
      (&=> $p $q) "和其逆否式" (&=> (&neg $q) (&neg $p))
      "的等价, 或者" (&=> $p (&neg $q)) "和"
      (&=> $q (&neg $p)) "的等价. (例如, "
      (Q "those who mind don't matter") "和"
      (Q "those who matter don't mind")
      "是逻辑等价的.) "
      "与之形成对比的是, 我们可以确认" (&=> $p $q) "和"
      (&=> $q $p) "并非等价, 这是常见谬误:"
      (CodeB "# tautology &lt;&lt;(p ==> q) &lt;=> (~q ==> ~p)>>;;
- : bool = true
# tautology &lt;&lt;(p ==> ~q) &lt;=> (q ==> ~p)>>;;
- : bool = true
# tautology &lt;&lt;(p ==> q) &lt;=> (q ==> p)>>;;
- : bool = false"))
   (H3. "De Morgan律, 充足性, 对偶性")
   (P "以下重要的重言被称为" (Em "De Morgan律")
      ", 其是以Augustus De Morgan的名字命名的, "
      "他和Boole几乎是同时代的人物, "
      "对于逻辑领域作出了重要贡献."
      (MB (&<=> (&neg (@disj $p $q))
                (&conj (&neg $p) (&neg $q))))
      (MB (&<=> (&neg (@conj $p $q))
                (&disj (&neg $p) (&neg $q)))))
   (P "第一个重言的一个日常例子是"
      (Q "I can not speak either Finnish or Swedish")
      "和"
      (Q "I can not speak Finnish and I can not speak Swedish")
      "意思相同. 第二个重言的一个例子是"
      (Q "I am not a wife and mother")
      "和"
      (Q "either I am not a wife or I am not a mother (or both)")
      "是相同的. De Morgan律的变体, 同样也很容易看出来是重言, 为:"
      (MB (&<=> (&disj $p $q)
                (&neg (@conj (&neg $p) (&neg $q)))))
      (MB (&<=> (&conj $p $q)
                (&neg (@disj (&neg $p) (&neg $q))))))
   (P "这些重言之所以是有趣的, 是因为它们展示了对于联结词"
      $conj "和" $disj ", 如何用其中一个表达另外一个. "
      "根据之前关于替换的定理, 这意味着比如说我们可以"
      (Q "重写") "任意公式为一个与之逻辑等价但并不包含"
      (Q $disj) "的公式, 只需系统地将具有形式"
      (&disj $q $r) "的子公式替换为"
      (&neg (@conj (&neg $q) (&neg $r)))
      ". 关于用某些逻辑联结词表达其他逻辑联结词, "
      "还有许多其他选项. 例如, 使用下列等价, "
      "对于任意的公式我们都可以找出一个与之等价的"
      "仅仅使用原子公式, " $conj ", " $neg
      "的公式. 以术语来说, " (setE $conj $neg)
      "是联结词的一个" (Em "充足集合(adequate set)") "."
      (eqn*
       ($bottom $<=> (&conj $p (&neg $p)))
       ($top $<=> (&neg (@conj $p (&neg $p))))
       ((&disj $p $q)
        $<=>
        (&neg (@conj (&neg $p) (&neg $q))))
       ((&=> $p $q)
        $<=>
        (&neg (@conj $p (&neg $q))))
       ((@<=> $p $q)
        $<=>
        (&conj (&neg (@conj $p (&neg $q)))
               (&neg (@conj (&neg $p) $q)))))
      "{译注: 所谓的逻辑常量" $bottom "和"
      $top "是零元联结词.}")
   (P "类似地, 下列经OCaml验证的等价表明"
      (setE $=> $bottom) "也是充足的:"
      (CodeB "forall tautology
 [&lt;&lt;true &lt;=> false ==> false>>;
  &lt;&lt;~p &lt;=> p ==> false>>;
  &lt;&lt;p /\\ q &lt;=> (p ==> q ==> false) ==> false>>;
  &lt;&lt;p \\/ q &lt;=> (p ==> false) ==> q>>;
  &lt;&lt;(p &lt;=> q) &lt;=> ((p ==> q) ==> (q ==> p) ==> false) ==> false>>];;
- : bool = true"))
   (P "单独一个联结词是否足以表达所有其他联结词? "
      "对于我们已经引入的联结词而言, 答案是否定的. "
      "我们至少需要一个二元联结词, 否则我们永远无法引入涉及多个变量 "
      "(从而依赖于多个变量的赋值) 的公式. "
      "而且事实上, 即使是整个集合"
      (setE $top $conj $disj $=> $<=>)
      ", 如果没有" $neg "或" $bottom
      ", 也不构成一个充足集, "
      "因此更不用说其中任何单个二元联结词了. "
      "要看出这一点, 注意所有这些二元联结词在两个参数均为"
      (Q "真") "时都给出结果" (Q "真")
      ". (换言之, 它们各自真值表的最后一行, 最终列都是"
      (Q "真") ".) 因此, 由这些组件构建的任何公式, "
      "在将所有原子都映射为" (Q "真")
      "的赋值下, 必定求值为" (Q "真")
      ", 所以否定是不可表达的.")
   (P "然而, 对于二元真值函数而言, 存在"
      (&= (^ $2 (^ $2 $2)) 16)
      "种真值表, 而常规的二元联结词只覆盖了其中四种情况. "
      "(真值表有" (&= $2^2 $4)
      "行, 每一行可以在两种真值里选择一个.) "
      "或许某个以其他" 12 "种函数之一为其真值表的联结词可以是充足的? "
      "正如以上所论证的, 任意单独的充足联结词都必须以"
      (Q "假") "作为其真值表最后一行的值, 不然的话否定无法表达. "
      "根据类似的论证, 我们也可以看出来真值表第一行的值必然为"
      (Q "真") ". 那么, 留给我们的选择自由就只剩中间两行的情况了, "
      "总计有四种可能性. 其中有两种可能是平凡的, "
      "因为它们只是对于其中一个参数进行否定, "
      "故无法用来构建求值依赖于多于一个单一原子的值的表达式. "
      "不过, 其他两种情况单独都是充足的: "
      "一种是" (Q "not and") "运算"
      (&= (&NAND $p $q) (&neg (@conj $p $q)))
      ", 另一种是" (Q "not or") "运算"
      (&= (&NOR $p $q) (&neg (@disj $p $q)))
      ". 这两个的真值表如下:"
      (MB (set-attr*
           (&Table
            ($p $q (&NAND $p $q) (&NOR $p $q))
            ("false" "false" "true" "true")
            ("false" "true" "true""false")
            ("true" "false" "true" "false")
            ("true" "true" "false" "false"))
           'frame "solid" 'rowlines "solid" 'columnlines "solid")))
   (P "例如, 我们可以通过"
      (&= (&neg $p) (&NAND $p $p))
      "来表达否定, 然后得到"
      (&= (&conj $p $q) (&neg (@NAND $p $q)))
      ", 不过我们已经知道" (setE $conj $neg)
      "是充足的了; " $NOR "以类似的方式成立. "
      "实际上, 一旦我们有了一个联结词的充足集合, "
      "那么我们也可以找出各种公式, "
      "其语义分别对应于其他" 12 "种真值函数. "
      "当我们于第2.6节讨论析取范式时, "
      "这会变得清晰起来.")
   (P "联结词" $NAND "和" $NOR
      "的单独充足性对于电子设计师而言是众所周知的: "
      "对应的门是数字电路的基本构建块 (见第2.7节). "
      "在纯粹逻辑学家之间, 这两个联结词其中之一会被习惯上记为"
      (&\| $p $q) ", 而" (Q $\|) "会被称为"
      (Q "Sheffer竖线") " (Sheffer 1913).")
   (P "{原注: 如今人们通常将竖线解释为" $NAND
      ", 但Sheffer最初用他的竖线表示的是" $NOR
      ", 并且Nicod (1917) 将其用于命题逻辑的一个精简表述中. "
      "这一思想早在30年前就已为Peirce所熟知. "
      "Schönfinkel (1924) 将其扩展为一种" (Q "量词竖线")
      ", 其中" (qstroke $x (app $phiv $x) (app $psi $x)) "意为"
      (&neg (∃ $x (&conj (app $phiv $x) (app $psi $x))))
      ", 这进而引发了人们对将同样的精简方法"
      "应用于更一般的数学表达式的兴趣, "
      "并由此推动了他对组合子的发展.}")
   (H4. "对偶性")
   (P "在第1.4节里我们注意到我们需要在" (Q "或") "的"
      (Q "可兼") "和" (Q "不可兼") "解读之间作出选择. "
      "无疑" (Q "and") "和" (Q "inclusive or")
      "之间的令人满意的对称是选择可兼解读的一个强烈动机. "
      "设我们现在有一个公式, 只牵涉联结词"
      (&cm $bottom $top $conj $disj)
      ". {译注: 漏了一个联结词, 即"
      $neg ".} 当我们言称其" (Em "对偶(dual)")
      "时, 我们指的是系统交换" (Q $conj) "和"
      (Q $disj) "以及" (Q $top) "和" (Q $bottom)
      "所得到的结果, 因而有以下定义:"
      (CodeB "let rec dual fm =
  match fm with
    False -> True
  | True -> False
  | Atom(p) -> fm
  | Not(p) -> Not(dual p)
  | And(p,q) -> Or(dual p,dual q)
  | Or(p,q) -> And(dual p,dual q)
  | _ -> failwith &quot;Formula involves connectives ==> or &lt;=>&quot;;;")
      "例如:"
      (CodeB "# dual &lt;&lt;p \\/ ~p>>;;
- : prop formula = &lt;&lt;p /\\ ~p>>"))
   (P "稍加思索即可发现" (&= (&dual (@dual $p)) $p)
      ". 对偶的关键语义性质如下:")
   ((Theorem #:id "dual-theorem")
    "对于任意的赋值" $v ", "
    (&= (&eval (@dual $p) $v)
        (&not (&eval $p (@compose $not $v)))) ".")
   ((proof)
    "这个结果可以由公式上的形式结构归纳证明 (见练习2.5), "
    "但是或许基于De Morgan律使用更为直接的推理来得比较简单. 令"
    (&* $p) "是对于公式" $p "的所有原子取否定, "
    "并且将" $bottom "替换为" (&neg $top) ", 将"
    $top "替换为" (&neg $bottom) "所得到的结果. "
    "然后, 我们有"
    (&= (&eval $p (@compose $not $v))
        (&eval (&* $p) $v))
    ". {译注: 这一结果若想严格说明, 还是用结构归纳比较好.} "
    "现在使用De Morgan律, 我们可以不断将" (&* $p)
    "中新引入的否定从原子那里拉出来, "
    "从而给出一个逻辑等价的形式:"
    (eqn*
     ((&conj (&neg $p) (&neg $q))
      $<=>
      (&neg (@disj $p $q)))
     ((&disj (&neg $p) (&neg $q))
      $<=>
      (&neg (@conj $p $q))))
    "通过这种做法, 我们交换了" (Q $conj) "和" (Q $disj)
    ", 并且使得新引入的否定符号浮上来了, "
    "最后我们在顶层恰有一个额外的否定符号, "
    "这就是" (&neg (@dual $p))
    ", 由此得出定理.")
   ((Corollary)
    "如果" $p "和" $q "是逻辑等价的, 那么"
    (&dual $p) "和" (&dual $q)
    "也是逻辑等价的. 如果" $p
    "是一个重言, 那么" (&neg (@dual $p))
    "也是一个重言.")
   ((proof)
    (&= (&eval (@dual $p) $v)
        (&not (&eval $p (@compose $not $v)))
        (&not (&eval $q (@compose $not $v)))
        (&eval (@dual $q) $v))
    ". 如果" $p "是一个重言, 那么" $p
    "和" $top "是逻辑等价的. 因此, "
    (&dual $p) "和" (&= (&dual $top) $bottom)
    "也是逻辑等价的, 由此得出结果.")
   (P "例如, 既然" (&conj $p (@disj $q $r)) "和"
      (&disj (@conj $p $q) (@conj $p $r))
      "是等价的, 那么" (&disj $p (@conj $q $r))
      "和" (&conj (@disj $p $q) (@disj $p $r))
      "也是等价的. 既然" (&disj $p (&neg $p))
      "是一个重言, 那么" (&neg (@conj $p (&neg $p)))
      "也是一个重言.")
   (H3. "化简和否定范式")
   (P "在普通代数中, 将表达式系统地变换为"
      "等价的标准形式或范式是很常见的做法. "
      "其中一种方法涉及展开与消去, 例如从"
      (&+ (&i* (@+ $x $y) (@- $y $x)) $y $x^2)
      "得到范式" (&+ $y^2 $y)
      ". 通过将表达式化为范式, "
      "我们有时可以看出表面上不同的表达式实际上是等价的. "
      "此外, 如果范式选取得当, 它还能提供有价值的信息. "
      "例如, 观察" (&+ $y^2 $y) "我们可以看出" $x
      "的值是无关紧要的, 而从初始形式来看这一点完全不明显. "
      "在逻辑中, 公式的范式具有极其重要的地位, "
      "并且正如在代数中一样, 范式往往能够提供重要的信息.")
   (P "在开始正式构建规范形式之前, "
      "最好先对于公式进行常规的化简以消除(不必要的)命题常量"
      (Q $bottom) "和" (Q $top)
      ", 这完全可以类比于第1.6节的代数例子. 每当"
      (Q $bottom) "和" (Q $top)
      "以组合形式出现, 总是存在一个重言"
      "澄清其与某种更为简单的公式之间的等价性, 例如"
      (&<=> (&conj $bottom $p) $bottom) ", "
      (&<=> (&disj $bottom $p) $p) ", "
      (&<=> (&=> $p $bottom) (&neg $p))
      ". 此外, 我们也会消除双重否定" (&neg (&neg $p))
      ". {译注: 这里的" $p "你将其理解为对象语言里的变量 "
      "(即原子(命题), 但不是代表原子的元变量), "
      "或者元语言里代表命题公式的元变量, 其实都说得通. "
      "不过这里作者应该更倾向于元变量的理解吧.} "
      "以下这段代码只是通过模式匹配逐情形考虑每种可能:"
      (CodeB "let psimplify1 fm =
  match fm with
    Not False -> True
  | Not True -> False
  | Not(Not p) -> p
  | And(p,False) | And(False,p) -> False
  | And(p,True) | And(True,p) -> p
  | Or(p,False) | Or(False,p) -> p
  | Or(p,True) | Or(True,p) -> True
  | Imp(False,p) | Imp(p,True) -> True
  | Imp(True,p) -> p
  | Imp(p,False) -> Not p
  | Iff(p,True) | Iff(True,p) -> p
  | Iff(p,False) | Iff(False,p) -> Not p
  | _ -> fm;;")
      "{原注: 注意到对于" (&=> $p $bottom) ", "
      (&<=> $p $bottom) ", " (&<=> $bottom $p)
      "导致" (&neg $p) "的子句都被置于了相应的组的最下方, "
      "这是为了使得例如" (&=> $bottom $bottom)
      "被化简为" $top ", 而不是" (&neg $bottom)
      ", 后者在同一层次仍需进一步化简.} "
      "{译注: 不过, 作者在这里仍然出现了疏漏, "
      (&<=> $bottom $bottom) "根据这个定义会被化简为"
      (&neg $bottom) ", 而不是" $top ".} "
      )
   (P "然后我们以递归的自底而上方式应用化简:"
      (CodeB "let rec psimplify fm =
  match fm with
    Not p -> psimplify1 (Not(psimplify p))
  | And(p,q) -> psimplify1 (And(psimplify p,psimplify q))
  | Or(p,q) -> psimplify1 (Or(psimplify p,psimplify q))
  | Imp(p,q) -> psimplify1 (Imp(psimplify p,psimplify q))
  | Iff(p,q) -> psimplify1 (Iff(psimplify p,psimplify q))
  | _ -> fm;;")
      "{译注: 在勘误里, 对于" (Code "psimplify1")
      "的补救措施是添加对于" (&<=> $bottom $bottom)
      "的特殊处理, 然而我觉得这仍然不那么令人满意. "
      "比如说, 对于公式" (&=> (@=> $p $bottom) $bottom)
      "和" (&<=> (@<=> $p $bottom) $bottom)
      " (其中" $p "是字面上的原子命题, 而不是代表公式的元变量), "
      "目前的过程" (Code "psimplify") "会将其都化简为"
      (&neg (&neg $p)) ", 然而我们知道这个结果又可以化简为"
      $p ". 个人认为更好的解决之道是让返回" (&neg $p)
      " (这里则是元变量) 的子句应该考虑" (Code "psimplify1")
      "里面对于" $neg "部分的化简方式, "
      "而这又迫使我们最好重新组织代码, "
      "对于每种联结词都编写一个函数, 如此复用比较方便, "
      "我编写了下列Scheme函数以说明我的想法:"
      (CodeB "(define (psimplify exp)
  (define (Not exp)
    (match exp
      (,b (guard (boolean? b)) (not b))
      ((not ,e1) e1)
      (,else `(not ,exp))))
  (define (And e1 e2)
    (cond ((eq? e1 #f) #f)
          ((eq? e2 #f) #f)
          ((eq? e1 #t) e2)
          ((eq? e2 #t) e1)
          (else `(and ,e1 ,e2))))
  (define (Or e1 e2)
    (cond ((eq? e1 #t) #t)
          ((eq? e2 #t) #t)
          ((eq? e1 #f) e2)
          ((eq? e2 #f) e1)
          (else `(or ,e1 ,e2))))
  (define (Imp e1 e2)
    (cond ((eq? e1 #f) #t)
          ((eq? e2 #t) #t)
          ((eq? e1 #t) e2)
          ((eq? e2 #f) (Not e1))
          (else `(=> ,e1 ,e2))))
  (define (Iff e1 e2)
    (cond ((eq? e1 #t) e2)
          ((eq? e2 #t) e1)
          ((eq? e1 #f) (Not e2))
          ((eq? e2 #f) (Not e1))
          (else `(&lt;=> ,e1 ,e2))))
  (define (simp exp)
    (match exp
      ((not ,e1) (Not (simp e1)))
      ((and ,e1 ,e2) (And (simp e1) (simp e2)))
      ((or ,e1 ,e2) (Or (simp e1) (simp e2)))
      ((=> ,e1 ,e2) (Imp (simp e1) (simp e2)))
      ((&lt;=> ,e1 ,e2) (Iff (simp e1) (simp e2)))
      (,else exp)))
  (simp exp))"))
   (P "例如:"
      (CodeB "# psimplify &lt;&lt;(true ==> (x &lt;=> false)) ==> ~(y \\/ false /\\ z)>>;;
- : prop formula = &lt;&lt;~x ==> ~y>>"))
   (P "如果我们先应用这个化简函数, 就几乎可以忽略命题常量, 这会使事情更加方便. "
      "然而, 我们需要记住两个平凡的例外情况: "
      "虽然在化简后的公式中" (Q $bottom) "和" (Q $top)
      "不能以组合的形式出现, 但整个公式本身可能就是其中之一, 例如:"
      (CodeB "# psimplify &lt;&lt;((x ==> y) ==> true) \\/ ~false>>;;
- : prop formula = &lt;&lt;true>>")
      "{译注: 通过简单的结构归纳可以证明, 经过" (Code "psimplify")
      "化简得到的公式, 除非本身就是" $bottom "或者" $top
      ", 否则就不可能含有这两个逻辑常量.}")
   (P "一个" (Em "文字(literal)") "要么是一个原子公式, "
      "要么是原子公式的否定. 我们称一个文字是" (Em "否定性的(negative)")
      ", 如果其具有形式" (&neg $p) ", 否则就将其称为"
      (Em "肯定性的(positive)") ". 这可由以下OCaml函数进行测试, "
      "注意这两个函数都只应该应用于文字:"
      (CodeB "let negative = function (Not p) -> true | _ -> false;;

let positive lit = not(negative lit);;"))
   (P "当我们之后言及" (Em "否定") "一个文字" $l
      "时, 记作" (&- $l) ", 我们指的是当文字为肯定性时应用否定, "
      "而当其为否定性时" (Em "移除")
      "否定 (而非要双重否定, 因为这样的话它就并非文字了). "
      "两个文字被称为" (Em "互补的")
      ", 如果一个是另一个的否定:"
      (CodeB "let negate = function (Not p) -> p | p -> Not p;;"))
   (P "一个公式被称为具有" (Em "否定范式")
      " (NNF), 如果其只由文字通过使用二元联结词" (Q $conj)
      "和" (Q $disj) "构造而成, 或者其为退化情形"
      (Q $bottom) "和" (Q $top) "之一. 换言之, "
      "其并不牵涉二元联结词" (Q $=>) "和" (Q $<=>)
      ", 而且" (Q $neg) "只能应用于原子公式. "
      "NNF公式的例子包括" $bottom ", " $p ", " (&conj $p $q) ", "
      (&disj $p (@disj (&conj $q (@neg $r)) $s))
      ", 而非NNF公式的例子包括" (&=> $p $p)
      " (牵涉其他二元联结词), 也包括" (&neg (&neg $p))
      "和" (&conj $p (&neg (@disj $q $r)))
      " (牵涉非原子公式的否定).")
   (P "我们可以将任意的公式转换为逻辑等价的NNF公式. "
      "和上一节一样, 我们可以基于其他联结词消去"
      (Q $=>) "和" (Q $<=>)
      ", 然后我们可以不断应用De Morgan律和双重否定律:"
      (eqn*
       ((&neg (@conj $p $q))
        $<=>
        (&disj (&neg $p) (&neg $q)))
       ((&neg (@disj $p $q))
        $<=>
        (&conj (&neg $p) (&neg $q)))
       ((&neg (&neg $p)) $<=> $p))
      "将否定下推至原子公式, 这恰好是"
      (Ref "dual-theorem")
      "的证明里所考虑的变换的反向. "
      "(当前的变换可以类比于如下普通代数里的过程: "
      "先将减法替换为其定义"
      (&= (&- $x $y) (&+ $x (&- $y)))
      ", 然后使用"
      (&= (&- (@+ $x $y)) (&+ (&- $x) (&- $y))) ", "
      (&= (&- (@i* $x $y)) (&i* (@- $x) $y)) "和"
      (&= (&- (@- $x)) $x)
      "系统地将负号 (negation) 下推.) "
      "这在OCaml里编程是相当直接的, "
      "而且实际上在我们递归地将否定下推时可以一并消去"
      (Q $=>) "和" (Q $<=>) ", 无需单独步骤 (phase)."
      (CodeB "let rec nnf fm =
  match fm with
    And(p,q) -> And(nnf p,nnf q)
  | Or(p,q) -> Or(nnf p,nnf q)
  | Imp(p,q) -> Or(nnf(Not p),nnf q)
  | Iff(p,q) -> Or(And(nnf p,nnf q),And(nnf(Not p),nnf(Not q)))
  | Not(Not p) -> nnf p
  | Not(And(p,q)) -> Or(nnf(Not p),nnf(Not q))
  | Not(Or(p,q)) -> And(nnf(Not p),nnf(Not q))
  | Not(Imp(p,q)) -> And(nnf p,nnf(Not q))
  | Not(Iff(p,q)) -> Or(And(nnf p,nnf(Not q)),And(nnf(Not p),nnf q))
  | _ -> fm;;"))
   (P "这段代码对于" (Q $=>) "和" (Q $<=>)
      "的消去, 不论肯定还是否定, 是由以下重言所澄清的:"
      (eqn*
       ((&=> $p $q) $<=> (&disj (&neg $p) $q))
       ((&neg (@=> $p $q))
        $<=>
        (&conj $p (&neg $q)))
       ((@<=> $p $q)
        $<=>
        (&disj (&conj $p $q)
               (&conj (&neg $p) (&neg $q))))
       ((&neg (@<=> $p $q))
        $<=>
        (&disj (&conj $p (&neg $q))
               (&conj (&neg $p) $q))))
      "尽管出于某些目的我们可能更倾向于其他变式, 例如"
      (eqn*
       ((@<=> $p $q)
        $<=>
        (&conj (@disj $p (&neg $q))
               (@disj (&neg $p) $q)))
       ((&neg (@<=> $p $q))
        $<=>
        (&conj (@disj $p $q)
               (@disj (&neg $p) (&neg $q))))))
   (P "为了完结, 我们重新定义" (Code "nnf")
      "以包含一个初始的化简, "
      "然后再调用刚才的定义. "
      "(这不是递归定义, 而是使用之前的定义对于"
      (Code "nnf") "进行重定义, 因为这里没有"
      (Code "rec") "关键词.)"
      (CodeB "let nnf fm = nnf(psimplify fm);;"))
   (P "NNF公式(可能)要比本来的公式显著更大. "
      "诚然如此, 因为每次一个公式" (Q (&<=> $p $q))
      "扩展的时候, 公式" $p "和" $q
      "都会得到复制, 最坏情况下具有" $n
      "个联结词的公式可以扩展为具有超过"
      $2^n "个联结词的NNF" -- "见之后的练习2.6. "
      "这种指数膨胀似乎在保持逻辑等价时很难避免, "
      "但是我们至少可以避免进行指数量的" (Em "计算")
      ", 通过以更高效的方式重写" (Code "nnf")
      "函数 (练习2.7). 如果目标只是将否定下推到原子层次, "
      "我们也可以保留" (Q $<=>) "以避免潜在的指数膨胀, "
      "使用诸如"
      (&<=> (&neg (@<=> $p $q))
            (@<=> (&neg $p) $q))
      "这样的重言:"
      (CodeB "let rec nenf fm =
  match fm with
    Not(Not p) -> nenf p
  | Not(And(p,q)) -> Or(nenf(Not p),nenf(Not q))
  | Not(Or(p,q)) -> And(nenf(Not p),nenf(Not q))
  | Not(Imp(p,q)) -> And(nenf p,nenf(Not q))
  | Not(Iff(p,q)) -> Iff(nenf p,nenf(Not q))
  | And(p,q) -> And(nenf p,nenf q)
  | Or(p,q) -> Or(nenf p,nenf q)
  | Imp(p,q) -> Or(nenf(Not p),nenf q)
  | Iff(p,q) -> Iff(nenf p,nenf q)
  | _ -> fm;;")
      "化简也还是要加进去的:"
      (CodeB "let nenf fm = nenf(psimplify fm);;")
      "{译注: 实际上对于" $<=> "的否定使用的重言是"
      (&<=> (&neg (@<=> $p $q))
            (@<=> $p (&neg $q))) ".}")
   (P "这个函数当然有着自身的用途. "
      "不过, NNF的诱人之处在于我们可以区分原子公式的"
      (Q "肯定性") "和" (Q "否定性")
      "出现. 联结词" (Q $conj) "和" (Q $disj)
      "和联结词" (Q $neg) ", " (Q $=>) ", "
      (Q $<=>) "的不同之处在于其是" (Em "单调的")
      ", 意即其真值函数" $f "具有性质"
      (&=> (&conj (&<= $p $p^) (&<= $q $q^))
           (&<= (appl $f $p $q)
                (appl $f $p^ $q^)))
      ", 其中" (Q $<=) "是" (Q $=>)
      "的真值函数. {译注: 换言之, 是满足"
      (&<= $false $true) "的偏序.} "
      "换种说法, 也就是以下的公式都是重言:"
      (CodeB "# tautology &lt;&lt;(p ==> p') /\\ (q ==> q') ==> (p /\\ q ==> p' /\\ q')>>;;
- : bool = true
# tautology &lt;&lt;(p ==> p') /\\ (q ==> q') ==> (p \\/ q ==> p' \\/ q')>>;;
- : bool = true"))
   (P "这导致了, 如果一个原子" $x "在某个NNF公式"
      $p "中只以肯定形式出现, "
      "那么我们可以推出对于整个公式而言的一个相应的单调性质:"
      (MB (&=> (@=> $x $x^)
               (@=> $p (&psubst $x $x^ $p))))
      "而如果该原子只以否定形式出现, 那么我们有一个反单调性, 因为"
      (&=> (@=> $p $p^) (@=> (&neg $p^) (&neg $p)))
      "是一个重言:"
      (MB (&=> (@=> $x $x^)
               (@=> (&psubst $x $x^ $p) $p))))
   (H3. "析取范式和合取范式" #:id "dnf-cnf")
   (P "一个公式被称为是具有" (Em "析取范式")
      " (DNF), 当其具有以下形式:"
      (MB (&disj $D_1 $D_2 $..c $D_n))
      "而每个析取分量" $D_i "都具有形式:"
      (MB (&conj (_cm $l $i $1) (_cm $l $i $2)
                 $..c (_cm $l $i $m_i)))
      "并且每个" (_cm $l $i $j) "都是一个文字. "
      "因此, DNF公式也具有NNF形式, "
      "只是添加了其为" (Q "合取的析取")
      "这一额外限制, 不能使得" (Q $conj)
      "和" (Q $disj) "任意交错. "
      "{译注: DNF应该也和NNF一样具有" $bottom
      "和" $top "两种退化情形.} "
      "这全然类似于代数里全然展开的"
      (Q "积之和") "表达式, 例如"
      (&+ $x^3 (&i* $x^2 $y) (&i* $x $y) $z) ".")
   (P "对偶地, 一个公式被称为是具有" (Em "合取范式")
      " (CNF), 当其具有形式:"
      (MB (&conj $C_1 $C_2 $..c $C_n))
      "而每个合取分量" $C_i "都具有形式:"
      (MB (&disj (_cm $l $i $1) (_cm $l $i $2)
                 $..c (_cm $l $i $m_i)))
      "并且每个" (_cm $l $i $j) "都是一个文字. "
      "因此, CNF公式也具有NNF形式, "
      "只是添加了其为" (Q "析取的合取")
      "这一额外限制. 这类似于普通代数里全然分解了的"
      (Q "和之积") "形式, 例如"
      (&i* (@+ $x $1) (@+ $y $2) (@+ $z $3))
      ". 在普通代数里, 我们总是可以将表达式展开为积之和, "
      "但一般并不总是能分解为和之积 (例如考虑"
      (&- (&+ $x^2 $y^2) $1)
      "). 这种非对称性并不存在于逻辑中, "
      "这我们可以从" $conj "和" $disj
      "的对偶性中料想得到. "
      "首先我们将会展示如何将一个公式变换为一个等价的DNF, "
      "然后这个变换很容易调整为产生一个等价的CNF.")
   (H4. "通过真值表得到DNF")
   (P "如果一个公式牵涉原子" (setE $p_1 $..h $p_n)
      ", 那么其真值表的每一行都确定了对于"
      (setE $p_1 $..h $p_n)
      "的一个特定真值指派方式, "
      "由此又确定了一类赋值, "
      "其对于该原子集合有着相同的指派 "
      "(我们并不关心这些赋值对于其他原子的指派是什么). "
      "现在给定任意的赋值" $v ", 考虑公式:"
      (MB (&conj $l_1 $..c $l_n))
      "其中"
      (MB (&= $l_i
              (Choice0
               ($p_i ", 如果" (&= (app $v $p_i) $true))
               ((&neg $p_i) ", 如果" (&= (app $v $p_i) $false))))))
   (P "根据构造, 一个赋值" $w "满足" (&conj $l_1 $..c $l_n)
      "当且仅当" $w "和" $v "在" (&cm $p_1 $..h $p_n)
      "上的值是相合的. 现在原本公式的真值表里那些最后一列为"
      (Q $true) "的行恰好确定了满足该公式的所有类. "
      "{译注: 这个类可以理解为等价类, 划分方式就是"
      (&cm $p_1 $..h $p_n) "上的指派.} "
      "据此, 对于" $k "个" (Q "真") "行的每一个, "
      "我们都可以挑选一个相对应的赋值" $v_i
      " (为了确定起见, 可以令除了"
      (setE $p_1 $..h $p_n)
      "之外的所有变量都映射为" (Q $false)
      "), 然后构造上述公式:"
      (MB (&= $D_i (&conj (_cm $l $i $1)
                          $..c
                          (_cm $l $i $n))) "."))
   (P "既然析取" (&disj $D_1 $..c $D_k)
      "和原本的公式恰好由相同的那些赋值满足, "
      "那么因而其是逻辑等价的; "
      "而且, 根据构造的方式, 其又必然具有DNF形式.")
   (P "为了在OCaml中实现这个过程, "
      "我们从函数" (Code "list_conj")
      "和" (Code "list_disj")
      "开始, 其分别将一个公式列表"
      (|[;]| $p_1 $..h $p_n)
      "映射为迭代的合取"
      (&conj $p_1 $..c $p_n)
      "和迭代的析取"
      (&disj $p_1 $..c $p_n)
      ". 在列表为空的特殊情形下, 我们分别返回"
      $top "和" $bottom
      ". 这些选择避免了之后的一些特殊情形区分, "
      "并且也是自然的, 如果我们将这些公式想成是"
      (Q "所有的" (&cm $p_1 $..h $p_n) "都为真")
      " (如果没有任何" $p_i ", 那就是空虚为真) 和"
      (Q "某个" (&cm $p_1 $..h $p_n) "为真")
      " (如果没有任何" $p_i ", 那就必然为假)."
      (CodeB "let list_conj l = if l = [] then True else end_itlist mk_and l;;

let list_disj l = if l = [] then False else end_itlist mk_or l;;"))
   (P "接下来我们有一个函数" (Code "mk_lits")
      ", 其对于一个公式列表" (Code "pvs")
      ", 制作一个由这些公式或其否定构成的合取, "
      "否定与否是按照每个公式是否由赋值" $v
      "满足所决定的."
      (CodeB "let mk_lits pvs v =
  list_conj (map (fun p -> if eval p v then p else Not p) pvs);;"))
   (P "现在我们定义" (Code "allsatvaluations")
      ", 其和" (Code "allvaluations")
      "结构很像, 但是作用在于将满足" (Code "subfn")
      "的赋值收集为一个列表:"
      (CodeB "let rec allsatvaluations subfn v pvs =
  match pvs with
    [] -> if subfn v then [v] else []
  | p::ps -> let v' t q = if q = p then t else v(q) in
             allsatvaluations subfn (v' false) ps @
             allsatvaluations subfn (v' true) ps;;"))
   (P "使用这个函数, 我们可以挑选出满足公式的赋值列表, "
      "然后对于它用" (Code "make_lits")
      "进行map, 然后将结果收集为一个迭代析取. "
      "注意到在公式没有变量或者不可满足的情况下, "
      "这个过程会适切地返回" $bottom "或者" $top "."
      (CodeB "let dnf fm =
  let pvs = atoms fm in
  let satvals = allsatvaluations (eval fm) (fun s -> false) pvs in
  list_disj (map (mk_lits (map (fun p -> Atom p) pvs)) satvals);;")
      "{译注: 这些函数里的" (Code "pvs") "的含义并不完全相同, "
      "有的是原子名字的列表, 有的是原子公式的列表. "
      "不过, 我感到这里的" (Code "mk_lits")
      "有小小的低效之处. 其实它也可以设计为接受原子名字的列表, "
      "这样的话就不需要使用" (Code "eval") "而可以直接应用赋值本身了. "
      (Code "eval") "的工作其实也是要拆掉外面的" (Code "Atom")
      "然后喂给赋值. 以下是我在Scheme中重新实现的版本:"
      (CodeB "(define ((make-lits x*) v)
  (make-conj
   (map (lambda (x)
          (if (v x) x `(not ,x)))
        x*)))
(define (allsat f v a*)
  (if (null? a*)
      (if (f v) (list v) '())
      (let ((a (car a*))
            (a* (cdr a*)))
        (define ((v^ b) x)
          (if (eq? x a) b (v x)))
        (append (allsat f (v^ #f) a*)
                (allsat f (v^ #t) a*)))))
(define (dnf exp)
  (let* ((a* (atoms exp))
         (v* (allsat (curry ev exp)
                     (lambda (x) #f)
                     a*)))
    (make-disj
     (map (make-lits a*) v*))))"))
   (P "例如:"
      (CodeB "# let fm = &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>;;
val fm : prop formula = &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>
# dnf fm;;
- : prop formula = &lt;&lt;~p /\\ q /\\ r \\/ p /\\ ~q /\\ ~r \\/ p /\\ q /\\ ~r>>"))
   (P "不出所料, 这个结果的析取分量自然地对应于真值表里产生"
      (Q $true) "的三行, 由此确定了三类赋值:"
      (CodeB "# print_truthtable fm;;
p     q     r     | formula
---------------------------
false false false | false
false false true  | false
false true  false | false
false true  true  | true
true  false false | true
true  false true  | false
true  true  false | true
true  true  true  | false
---------------------------"))
   (P "这种方法无需初始化简或者预规范化, "
      "并且强调了DNF和真值表之间的关系. "
      "我们现在可以确认第2.4节中提出的论断: 给定任意一个"
      $n "元真值函数, 我们可以将其视为一个包含"
      $n "个原子命题和" $2^n"行的真值表, 并直接构造一个公式 "
      "(以析取范式的形式), 使得该真值函数就是它的解释. "
      "另一方面, 当" $n " (即原公式中原子命题的数量) 较大时, "
      "需要考虑所有" $2^n "个赋值这一点是相当不理想的. "
      "例如, 下面这个公式本身已经是一个简洁的析取范式, "
      "却会被膨胀成一个复杂得多的变体:"
      (CodeB "# dnf &lt;&lt;p /\\ q /\\ r /\\ s /\\ t /\\ u \\/ u /\\ v>>;;
..."))
   (H4. "通过变换得到DNF")
   (P "一种创建等价DNF形式的替代方法是将其与普通代数进行类比. "
      "在普通代数中, 为了得到完全展开的形式, 我们可以反复应用分配律"
      (disR $x $y $z) "和" (disL $x $y $z)
      ". 类似地, 从NNF形式的命题公式开始, "
      "我们可以通过基于以下重言将其反复重言以得到DNF形式:"
      (eqn*
       ((&conj $p (@disj $q $r))
        $<=>
        (&disj (&conj $p $q) (&conj $p $r)))
       ((&conj (@disj $p $q) $r)
        $<=>
        (&disj (&conj $p $r) (&conj $q $r)))))
   (P "为了将其编码为一个有效的OCaml函数而不过多次遍历公式树, "
      "我们需要一些小心. 我们从一个反复应用分配律的函数开始, "
      "假定其直接子公式已经具有DNF形式:"
      (CodeB "let rec distrib fm =
  match fm with
    And(p,(Or(q,r))) -> Or(distrib(And(p,q)),distrib(And(p,r)))
  | And(Or(p,q),r) -> Or(distrib(And(p,r)),distrib(And(q,r)))
  | _ -> fm;;"))
   (P "现在, 当输入公式为一个合取或析取时, "
      "我们首先递归地将其直接子公式转换为DNF, "
      "然后若有必要则使用之前的函数进行"
      (Q "分配 (distribute)") ":"
      (CodeB "let rec rawdnf fm =
  match fm with
    And(p,q) -> distrib(And(rawdnf p,rawdnf q))
  | Or(p,q) -> Or(rawdnf p,rawdnf q)
  | _ -> fm;;")
      "{译注: 证明" (Code "rawdnf") "和" (Code "distrib")
      "的正确性需要稍微细致一些的分析, "
      "鉴于这本书对于NNF和DNF(以及CNF)"
      "的定义和其他材料比起来也稍微细一些, "
      "以下是我在Scheme中编写程序时写下的关于句法的注释:"
      (CodeB ";&lt;literal> ::= &lt;var> | (not &lt;var>)
;&lt;nnf> ::= &lt;bool> | &lt;nnf0>
;&lt;nnf0> ::= &lt;literal>
;        |  (and &lt;nnf0> &lt;nnf0>)
;        |  (or &lt;nnf0> &lt;nnf0>)
;&lt;dnf> ::= &lt;bool> | &lt;dnf0>
;&lt;dnf0> ::= &lt;conj> | (or &lt;dnf0> &lt;dnf0>)
;&lt;conj> ::= &lt;literal> | (and &lt;conj> &lt;conj>)")
      "当然了, 证明的手段终归还是结构归纳.}")
   (P "例如:"
      (CodeB "# rawdnf &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>;;
- : prop formula =
&lt;&lt;(p /\\ ~p \\/ (q /\\ r) /\\ ~p) \\/ p /\\ ~r \\/ (q /\\ r) /\\ ~r>>"))
   (P "虽然这已然是DNF, 但是仍然很难阅读, "
      "因为迭代合取和析取混合结合在了一起. "
      "而且, 一些析取分量完全是冗余的: "
      (&conj $p (&neg $p)) "和"
      (&conj (@conj $q $r) (&neg $r))
      "都与" $bottom "逻辑等价, "
      "故可以省略而不破坏逻辑等价性.")
   (H4. "基于集合的表示")
   (P "为了使结合问题不再显得那么令人困扰, "
      "以及使得通过列表操作进行化简更为容易, "
      "将DNF表示为文字集合的集合是比较方便的, "
      "例如使用"
      (setE (setE $p $q)
            (setE (&neg $p) $r))
      "表示"
      (&disj (&conj $p $q)
             (&conj (&neg $p) $r))
      ". 既然DNF的逻辑结构总是合取的析取, "
      "并且析取与合取(的语义)都是结合的, 交换的, 幂等的, "
      "在这种翻译里没有什么本质性的东西会丢失, "
      "而且也容易映射回实际的公式. "
      "现在我们可以按如下方式写下DNF函数, "
      "使用OCaml列表表示集合, "
      "但是要注意在构造时避免重复:"
      (CodeB "let distrib s1 s2 = setify(allpairs union s1 s2);;

let rec purednf fm =
  match fm with
    And(p,q) -> distrib (purednf p) (purednf q)
  | Or(p,q) -> union (purednf p) (purednf q)
  | _ -> [[fm]];;")
      "{译注: 注意到在这种表示下, 单独的" (Code "True")
      "和" (Code "False") "会分别变成" (Code "[[True]]")
      "和" (Code "[[False]]")
      ". 虽然这可能是作者意料之中的事情, "
      "但我觉得还是有必要说一下. "
      "(后面有单独判断, 那没事了.) "
      "另外, 我不太清楚这里的" (Code "setify")
      "能否在列表元素顺序不同的情况下有效清理冗余列表. "
      "(看了一眼源代码, " (Code "union") "和" (Code "setify")
      "都会对于列表进行排序, 并且似乎用于比较的函数"
      (Code "Pervasives.compare")
      "对于列表会进行字典序比较, 那么其实就没有问题了.) "
      "虽然即便完全不清理, 得到的结果也是合理的. "
      "但是有一点我们可以证明, "
      "就是作为DNF的每个析取分量的合取里面不会有重复文字.}")
   (P "本质的结构是相同的; 这次的" (Code "distrib")
      "只是取两个集合的集合, "
      "然后返回所有从中可能取出的集合序对之并. "
      "如果我们将其应用于相同的例子, "
      "会得到相同的结果, modulo新的表示:"
      (CodeB "# purednf &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>;;
- : prop formula list list =
[[&lt;&lt;p>>; &lt;&lt;~p>>]; [&lt;&lt;p>>; &lt;&lt;~r>>]; [&lt;&lt;q>>; &lt;&lt;r>>; &lt;&lt;~p>>];
 [&lt;&lt;q>>; &lt;&lt;r>>; &lt;&lt;~r>>]]"))
   (P "但是, 得益于列表表示, 现在化简所得公式变得相当容易. "
      "首先我们定义一个函数" (Code "trivial")
      ", 用于检查同一列表中是否存在形如"
      $p "和" (&neg $p) "这样的互补文字. "
      "我们通过将文字划分为肯定文字和否定文字两组来实现这一点, "
      "然后检查肯定文字的集合与否定文字取反后的集合之间是否存在公共元素:"
      (CodeB "let trivial lits =
  let pos,neg = partition positive lits in
  intersect pos (image negate neg) &lt;> [];;")
      "现在我们可以通过过滤只留下无矛盾的析取分量, 例如"
      (CodeB "# filter (non trivial) (purednf &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>);;
- : prop formula list list = [[&lt;&lt;p>>; &lt;&lt;~r>>]; [&lt;&lt;q>>; &lt;&lt;r>>; &lt;&lt;~p>>]]"))
   (P "这已经给出了更小的DNF. "
      "另一种在许多场合下值得应用的优化是基于"
      (Em "subsumption") "的. 注意到如果"
      (&sube (setE (_prime $l $1) $..h (_prime $l $m))
             (setE $l_1 $..h $l_n))
      ", 那么每个满足"
      (&= $D (&conj $l_1 $..c $l_n))
      "的赋值也满足"
      (&= $D^ (&conj (_prime $l $1) $..c (_prime $l $m)))
      ". 因此, 析取" (&disj $D $D^) "逻辑等价于"
      $D^ ". 这种情况下, 我们称" $D^ " subsumes " $D
      ", 或者" $D " is subsumed by " $D^
      ". 以下是我们总体的函数, 其接受一个已经是NNF形式的公式, "
      "产生一个与之等价的DNF公式, 使用集合的集合表示, "
      "它首先会得到未经化简的DNF, 然后过滤掉矛盾和subsumed的析取分量:"
      (CodeB "let simpdnf fm =
  if fm = False then [] else if fm = True then [[]] else
  let djs = filter (non trivial) (purednf(nnf fm)) in
  filter (fun d -> not(exists (fun d' -> psubset d' d) djs)) djs;;")
      "{译注: 这里的" (Code "psubset")
      "是一个判断是否为真子集的谓词. "
      "个人认为还有一种可能效率更高的写法, "
      "那就是按照列表长度对于析取分量从大到小进行排序, "
      "然后判断析取分量是否冗余就只需要看它之后的项即可:"
      (CodeB "(define (simpdnf exp)
  (cond ((eq? exp #f) '())
        ((eq? exp #t) '(()))
        (else
         (let rec ((rest (sort (filter (compose not trivial?)
                                       (purednf (nnf exp)))
                               > #:key length)))
           (cond ((null? rest) '())
                 ((memf (lambda (d)
                          (subset? d (car rest)))
                        (cdr rest))
                  (rec (cdr rest)))
                 (else (cons (car rest)
                             (rec (cdr rest)))))))))"))
   (P "注意我们对" (Q $bottom) "和" (Q $top)
      "进行了特殊处理, 分别返回空列表和包含一个空合取式的单元素列表. "
      "此外, 在主代码中, 剔除矛盾析取项也可能产生空列表. "
      "如果所有析取分量确实都是矛盾的, 那么该公式在逻辑上必然等价于"
      (Q $bottom) ", 这与我们之前定义的" (Code "list_disj")
      "函数对空列表的解释是一致的. 要将所有内容转换回公式, 我们只需执行:"
      (CodeB "let dnf fm = list_disj(map list_conj (simpdnf fm));;"))
   (P "我们可以检验, 尽管我们的构造相当复杂, "
      "但是的确返回了逻辑等价的公式:"
      (CodeB "# let fm = &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>;;
val fm : prop formula = &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>
# dnf fm;;
- : prop formula = &lt;&lt;p /\\ ~r \\/ q /\\ r /\\ ~p>>
# tautology(Iff(fm,dnf fm));;
- : bool = true"))
   (P "注意到一个DNF公式是可满足的, 当且仅当其中某个析取分量是可满足的, 这直接由析取的语义可知. "
      "而每个析取分量本身是文字的合取, 它是可满足的当且仅当其中不包含两个互补文字 "
      "(并且当不包含时, 我们可以像使用真值表求DNF时那样找到一个满足的赋值). "
      "{译注: 实际上, 肯定文字对应的原子取真, 否定文字对应的原子取假就够了.} "
      "因此, 将一个公式转换为等价的DNF之后, 我们就能快速高效地判断它是否可满足. "
      "(事实上, 我们最新的DNF函数已经剔除了所有矛盾的析取分量, "
      "所以一个公式是可满足的当且仅当简化后的DNF中仍然包含至少一个析取分量.) "
      "{译注: 换言之, 最终的" (Code "dnf") "产生的结果不为"
      $bottom "就说明一定是可满足的.} "
      "然而, 这种方法并不一定优于真值表方法, 因为等价的DNF可能是指数级大的.")
   (H4. "CNF")
   (P "对于CNF而言, 我们将会使用和之前一样使用基于列表的表示, "
      "只不过现在隐式的解释为析取的合取而已. "
      "注意到根据De Morgan律, 我们有: 如果"
      (MB (&<=> (&neg $p)
                (Disj (&= $i $1) $m
                      (Conj (&= $j $1) $n
                            (_cm $p $i $j)))))
      "那么"
      (MB (&<=> $p
                (Conj (&= $i $1) $m
                      (Disj (&= $j $1) $n
                            (&- (_cm $p $i $j))))))
      "{译注: 这里的" $n "是常量, 然而实际上根据上下文来看, "
      "其应该是变量才对, 所以把" $n "改成" $n_i "更为合理.}")
   (P "因此, 以列表表示, 我们可以按照以下方式产生等价的CNF公式: "
      "首先对于初始公式进行否定 (并将其置于NNF形式), "
      "然后产生其DNF形式, 最后再对于所有的文字进行否定:"
      (CodeB "let purecnf fm = image (image negate) (purednf(nnf(Not fm)));;"))
   (P "基于形式列表操作, 消除CNF的冗余和subsumed的合取分量的代码是相同的, "
      "尽管解释是不同的. 例如, 现在平凡的合取分量表示"
      "包含某个文字和其否定的析取, 故等价于" $top
      "; 既然" (&<=> (&conj $top $C) $C)
      ", 将其排除于最终的合取之外也是同等合理的. "
      "只有两个退化情形需要以不同的方式处理:"
      (CodeB "let simpcnf fm =
  if fm = False then [[]] else if fm = True then [] else
  let cjs = filter (non trivial) (purecnf fm) in
  filter (fun c -> not(exists (fun c' -> psubset c' c) cjs)) cjs;;")
      "现在我们只需映射回作为公式的正确解释:"
      (CodeB "let cnf fm = list_conj(map list_disj (simpcnf fm));;")
      "例如:"
      (CodeB "# let fm = &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>;;
val fm : prop formula = &lt;&lt;(p \\/ q /\\ r) /\\ (~p \\/ ~r)>>
# cnf fm;;
- : prop formula = &lt;&lt;(p \\/ q) /\\ (p \\/ r) /\\ (~p \\/ ~r)>>
# tautology(Iff(fm,cnf fm));;
- : bool = true"))
   (P "正如我们可以快速检测一个DNF公式的可满足性一样, "
      "我们也可以快速检测一个CNF公式的有效性. "
      "{译注: 这里有效和重言同义.} "
      "事实上, 一个合取式" (&conj $C_1 $..c $C_n)
      "是有效的, 当且仅当每个" $C_i "都是有效的. "
      "而由于每个" $C_i "是文字的析取, "
      "它是有效的当且仅当它包含某个文字与其否定的析取; "
      "否则, 我们可以构造一个不满足它的赋值. "
      "再一次, 使用我们的简化CNF, 事情会更加简单: "
      "一个公式是有效的, 当且仅当其简化CNF恰好是" $top
      ". 同样, 这未必是一个好的实用算法, "
      "因为转换为CNF的过程中可能产生指数级的膨胀.")
   (H4. "原书的微妙bug")
   (P "鉴于我是事后才发现这些bug的, 所以我感觉单开一小节也不为过. "
      "事实上, 我之前的一些注记和注记里的程序也有错误.")
   (P "这些错误归根结底是因为忘了考虑" (Code "nnf")
      "的输出也可能是" (Code "True") "或者"
      (Code "False") ", 由此引发了意料之外的问题. 鉴于"
      (Q "垃圾进, 垃圾出")
      "原则, 在这里进行事后分析恐怕只是浪费时间, "
      "不如直接重写.")
   (CodeB "(define (subsume exp)
  (let rec ((rest (sort (filter (compose not trivial?) exp)
                        > #:key length)))
    (cond ((null? rest) '())
          ((memf (lambda (d)
                   (subset? d (car rest)))
                 (cdr rest))
           (rec (cdr rest)))
          (else (cons (car rest)
                      (rec (cdr rest)))))))
(define (purednf0 exp)
  (define (distrib s1 s2)
    (setlize (allpairs U s1 s2)))
  (define (dnf exp)
    (match exp
      ((and ,e1 ,e2)
       (distrib (dnf e1) (dnf e2)))
      ((or ,e1 ,e2)
       (U (dnf e1) (dnf e2)))
      (,else `((,exp)))))
  (cond ((eq? exp #f) '())
        ((eq? exp #t) '(()))
        (else (dnf exp))))
(define purednf
  (compose purednf0 nnf))
(define (simpdnf exp)
  (subsume (purednf exp)))
(define (dnf exp)
  (make-disj
   (map make-conj (simpdnf exp))))
(define (purecnf exp)
  (map (curry map negate)
       (purednf `(not ,exp))))
(define (simpcnf exp)
  (subsume (purecnf exp)))
(define (cnf exp)
  (make-conj
   (map make-disj (simpcnf exp))))")
   (P "因为译者更熟悉Scheme, 所以这里的代码也是用Scheme写成的. "
      "不过, 我也说明一下应该改什么. " (Code "purednf")
      "应该接受任意的公式输入, 在内部调用" (Code "nnf")
      ", 并且处理两个逻辑常量的特别情况. "
      "这么做的一个很大的好处就是现在" (Code "purednf")
      "和" (Code "purecnf") "是完全对称的过程了, "
      "它们都接受任意的公式, 分别产生DNF和CNF, "
      "但是都是以列表之列表的形式. "
      (Code "simpdnf") "和" (Code "simpcnf")
      "现在都无需再处理特别情形, "
      "实际上只是消除具有互补文字的冗余, "
      "并根据subsumption规则进行化简. "
      "这在DNF和CNF情况下都是完全一样的, "
      "所以我们将这个简化过程抽象为" (Code "subsume")
      ", 由此我们可以看到高度的对称之美.")
   (P "测试一下:"
      (CodeB "> (define peirce '(=> (=> (=> p q) p) p))
> (simpdnf peirce)
'(((not p)) (p))
> (dnf peirce)
'(or (not p) p)
> (simpcnf peirce)
'()
> (cnf peirce)
#t
> (define e0 '(&lt;=> p (&lt;=> q r)))
> (simpdnf e0)
'((p q r) (p (not q) (not r)) ((not p) q (not r)) ((not p) (not q) r))
> (simpcnf e0)
'(((not p) (not q) r) ((not p) q (not r)) (p (not q) (not r)) (p q r))
> (tautology? `(&lt;=> ,e0 ,(dnf e0)))
#t
> (tautology? `(&lt;=> ,e0 ,(cnf e0)))
#t"))
   (H3. "命题逻辑的应用")
   (P "我们已经完成了命题逻辑的基础学习, 确定了后续将要使用的主要概念, "
      "并将各种操作机械化, 包括重言式的识别. "
      "从某种角度来看, 我们的工作已经完成了. "
      "但对于许多更复杂的公式而言, 这些识别重言式的方法并不实用, "
      "在后续章节中我们将介绍更高效的算法. "
      "要测试这些算法, 甚至要证明其必要性, "
      "如果没有一批非平凡的命题公式作为储备, 是相当困难的. "
      "虽然在Pelletier (1986) 等文献集中有各种现成的命题问题可供使用, "
      "但我们将开发一些方法, 从简洁的描述出发生成整类有趣的命题问题.")
   (H4. "Ramsey定理")
   (P "我们首先考虑Ramsey的组合定理的一些特殊情形 "
      "(Ramsey 1930; Graham, Rothschild和Spencer 1980). "
      "一个简单的Ramsey型结果是: 在任何一个六人聚会中, "
      "必然存在三个人彼此都认识, 或者三个人彼此都不认识. "
      "习惯上我们基于图 (graph) 思考这样的问题, "
      "即一个顶点 (vertex) 集" $V
      "连带着由边 (edge) 所连接的特定点对, "
      "而边是从一个集合" $E "中取出的. "
      "一种对于" (Q "六人聚会") "结果的泛化 "
      "(尽管仍然远没有Ramsey定理一般) 是:")
   ((Theorem)
    "对于每个" (∈ $s $t $NN) ", 存在某个" (∈ $n $NN)
    "使得任意具有" $n "个顶点的图要么有一个大小为" $s
    "的完全连通子图, 要么有一个大小为" $t
    "的完全不连通子图 (可兼的或). 而且, 如果"
    (Q "Ramsey数") (Ramsey $s $t)
    "代表对于给定的" $s "和" $t
    "而言的最小的这样的" $n ", 那么我们有:"
    (MB (&<= (Ramsey $s $t)
             (&+ (Ramsey (&- $s $1) $t)
                 (Ramsey $s (&- $t $1)))) "."))
   ((proof)
    "对于" (&+ $s $t) "施行完全归纳. "
    )
   (H4. "数字电路")
   (P "数字计算机使用只能占据有限数量电压等级之一的电信号来运行. "
      "(相比之下, 在模拟计算机中, 电压等级可以连续变化.) "
      "几乎所有现代计算机都是二进制的, "
      "即只使用两个等级, 按惯例称为" $0 " (" (Q "低") ")和" $1
      " (" (Q "高") "). 在任何特定时刻, "
      "我们可以将二进制数字计算机中的每根内部或外部导线视为具有一个布尔值"
      -- $0 "对应" (Q "假") ", " $1 "对应" (Q "真") --
      "并将每个电路元件视为一个布尔函数, "
      "对其输入导线上的值进行运算, "
      "从而在输出导线上产生一个值. "
      "(当然, 采用这种观点时, 我们忽略了许多重要的物理层面, "
      "但我们在这里只关注逻辑结构.)")
   (P "数字电路的关键构建块, 即" (Em "逻辑门")
      ", 基本上对应于通常的逻辑联结词. 例如, 一个"
      (Q "AND门") "是对应于联结词" (Q "and")
      " (" $conj ") 的电路元素: 其有两个输入和一个输出, "
      "并且输出导线是高电平的 (为真), 恰当两个输入都是高电平的. "
      "类似地, 一个" (Q "NOT门") ", 或者说" (Em "反相器")
      ", 有一个输入导线和一个输出导线, "
      "并且当输入为低时输出为高, 输入为高时输出为低, "
      "因而对应于" (Q "not") "联结词. "
      "因此, 数字电路和公式之间存在着紧密的对应, "
      "其可以大致总结如下:"
      (MB (set-attr*
           (&Table
            ("数字设计" "命题逻辑")
            ("电路" "公式")
            ("逻辑门" "命题联结词")
            ("输入导线" "原子")
            ("内部导线" "子表达式")
            ("电平" "真值"))
           'columnalign "left"
           'frame "solid" 'rowlines "solid" 'columnlines "solid")))
   
   (H4. "加法")
   (H4. "乘法")
   (H4. "素性和因数分解")
   (H4. "命题逻辑的力量")
   (P "本节仅仅初步展示了某些问题如何可以归约为" (Q "SAT")
      ", 即命题公式的可满足性检验. Cook (1971) 的著名工作表明, "
      "包括SAT本身在内的一大类组合问题, 在精确意义上彼此具有完全相同的难度. "
      "(粗略地说, 求解其中任何一个问题的算法都可以产生求解其他任何一个问题的算法, "
      "运行时间至多增加一个多项式因子.) "
      "这类NP完全问题如今已知包含许多看起来非常困难且具有重大实际意义的问题 "
      "(Garey和Johnson 1979).")
   (P "我们的" (Code "tautology") "或" (Code "satisfiable")
      "函数在最坏情况下可能需要关于输入公式规模的指数级时间, "
      "因为它们可能需要在其" $n "个原子命题的全部"
      $2^n "个赋值上对公式求值. "
      "我们后续将要开发的算法在实践中要高效得多, "
      "但其最坏情况复杂度同样是指数级的. "
      "若能找到SAT或任何其他NP完全问题的多项式时间算法, "
      "就能由此得到所有NP完全问题的多项式时间算法. "
      "由于迄今为止尚未找到这样的算法, 人们普遍相信这是不可能的, "
      "但在撰写本书时这一点尚未被证明. 这就是著名的P=NP问题, "
      "它或许是离散数学和计算机科学中最突出的开放性问题. "
      "Baker, Gill和Solovay (1975) 给出了一些理由, "
      "说明为何许多看似可行的攻克该问题的方法不太可能奏效.")
   (P "尽管如此, 许多其他问题可归约为SAT这一事实也具有积极的意义. "
      "人们已经在SAT算法及其高效实现上投入了大量精力. "
      "实践中常常发现, 将问题仔细归约为SAT, "
      "然后使用这些工具之一来求解, "
      "其效果优于除最精良的专用算法之外的所有方法.")
   (H3. "定义性CNF")
   (P "我们已经观察到, 对CNF公式进行重言式检查是容易的, "
      "对DNF公式进行可满足性检验同样如此 ("
      (Ref "dnf-cnf") "). 遗憾的是, "
      "将公式转换为这两种范式中任一种的逻辑等价形式这一简单操作, "
      "都可能导致公式规模呈指数级膨胀. 这并非我们特定实现的缺陷, "
      "而是原则上不可避免的 (Reckhow 1976).")
   (P "然而, 如果我们要求一种比逻辑等价更弱的性质, 就可以做得好得多. "
      "我们将会展示如何将任意的公式" $p "转换为某个CNF公式" $p^
      ", 其使得" $p^ "最差也只会是" $p "的数倍大, "
      "并且" $p "和" $p^ "是" (Em "等可满足的(equisatisfiable)")
      ", 即" $p^ "是可满足的当且仅当" $p
      "是可满足的, 即便一般它们并不逻辑等价. "
      "我们可以对偶化这个过程以给出一个DNF公式, "
      "其和原本的公式是" (Em "等有效的(equivallid)")
      ", 即其是一个重言当且仅当原本的公式是一个重言. "
      "这两种过程都不能直接产生平凡的重言或者可满足性测试, "
      "因为CNF和DNF恰好颠倒了. 不过, "
      "它们至少为更高级的算法提供了一个有用的简化起点.")
   (P "其基本思想最初由Tseitin (1968) 提出, "
      "后来又以多种方式加以改进 (Wilson 1990), "
      "核心是引入新的原子命题作为子公式的缩略或者说" (Q "定义")
      ", 因此得名" (Q "定义性CNF")
      ". 理解这一方法的最佳途径大概是考察一个简单的典型例子. "
      "假设我们想将以下公式转换为CNF:"
      (MB (&conj (@disj $p (@conj $q (&neg $r))) $s) "."))
   (P "我们引入一个新的原子" $p_1 "来对于" (&conj $q (&neg $r))
      "进行缩略, 这个原子没有在公式的其他地方用过. "
      "然后我们将缩略了的公式与" $p_1 "的"
      (Q "定义") "结合在一起:"
      (MB (set-attr*
           (&Table
            ((&conj (@<=> $p_1 (&conj $q (&neg $r))) $))
            ((&conj (@disj $p $p_1) $s)))
           'columnalign "left")))
   (P "接着我们继续施行相同种类的步骤, 引入另一个原子"
      $p_2 "作为对于" (&disj $p $p_1) "的缩略:"
      (MB (set-attr*
           (&Table
            ((&conj (@<=> $p_1 (&conj $q (&neg $r))) $))
            ((&conj (@<=> $p_2 (&disj $p $p_1)) $))
            ((&conj $p_2 $s)))
           'columnalign "left"))
      "然后引入" $p_3 "作为对于"
      (&conj $p_2 $s) "的缩略:"
      (MB (set-attr*
           (&Table
            ((&conj (@<=> $p_1 (&conj $q (&neg $r))) $))
            ((&conj (@<=> $p_2 (&disj $p $p_1)) $))
            ((&conj (@<=> $p_3 (&conj $p_2 $s)) $))
            ($p_3))
           'columnalign "left"))
      "最后, 我们使用传统方法将每个合取分量转换为CNF形式:"
      (MB (set-attr*
           (&Table
            ((&conj (@disj (&neg $p_1) $q)
                    (@disj (&neg $p_1) (&neg $r))
                    (@disj $p_1 (&neg $q) $r) $))
            ((&conj (@disj (&neg $p_2) $p $p_1)
                    (@disj $p_2 (&neg $p))
                    (@disj $p_2 (&neg $p_1)) $))
            ((&conj (@disj (&neg $p_3) $p_2)
                    (@disj (&neg $p_3) $s)
                    (@disj $p_3 (&neg $p_2) (&neg $s)) $))
            ($p_3))
           'columnalign "left")))
   (P "我们可以看出来作为结果的公式只能比原本的公式"
      "在规模上大上一个较小的常量因子. "
      "引入的定义性合取分量的数目是由"
      "原本公式里的联结词数目所划定上界的. "
      "并且, 最终将每个合取分量变为CNF的展开只会导致较小的膨胀, "
      "因为这些分量的形式都比较简单. "
      "即便是最坏的情况下, 也就是" (&<=> $p (@<=> $q $r))
      ", 其等价的CNF形式里也只有" 11 "个二元联结词:"
      (CodeB "# cnf &lt;&lt;p &lt;=> (q &lt;=> r)>>;;
- : prop formula =
&lt;&lt;(p \\/ q \\/ r) /\\
  (p \\/ ~q \\/ ~r) /\\ (q \\/ ~p \\/ ~r) /\\ (r \\/ ~p \\/ ~q)>>"))
   (P "由此我们关于公式大小的声明得到了澄清. "
      "对于等可满足性, 我们只需表明每一定义性步骤都是保持可满足性的, "
      "因为总体上这个变换是一系列这样的步骤之后跟着一个逻辑等价的变换.")
   ((Theorem)
    "如果" $x "没有出现在" $q "里, 那么公式"
    (&psubst $x $q $p) "和" (&conj (@<=> $x $q) $p)
    "是等可满足的.")
   ((proof)
    "如果" (&psubst $x $q $p) "是可满足的, 比如说由一个赋值"
    $v "所满足, 那么根据" (Ref "subst-eval")
    ", 经过修饰的赋值" (&= $v^ (ext $v $x (&eval $q $v)))
    "能够满足" $p ". 这个赋值也能够满足" (&<=> $x $q)
    ", 因为根据构造, 我们有" (&= (app $v^ $x) (&eval $q $v))
    ", 并且鉴于" $x "没有出现在" $q
    "之中, 这个值又和" (&eval $q $v^)
    "相同 (" (Ref "same-on-atoms")
    "). 因此, " $v^ "满足" (&conj (@<=> $x $q) $p)
    ", 于是该公式也是可满足的." (Br)
    "反过来, 设某个赋值" $v "满足" (&conj (@<=> $x $q) $p)
    ". 因为其满足第一个合取分量, 故有"
    (&= (app $v $x) (&eval $q $v)) ", 因而"
    (ext $v $x (&eval $q $v)) "就是" $v
    ". 根据" (Ref "subst-eval") ", 赋值" $v "满足"
    (&psubst $x $q $p) ".")
   (P "这个证明的第二部分实际上说明了从右到左的推出"
      (&=> (&conj (@<=> $x $q) $p)
           (&psubst $x $q $p))
      "是一个重言. {译注: 并且, 无需" $x
      "不能出现在" $q "中的条件.} "
      "然而, 相反方向的推出是不行的, "
      "所以我们没有逻辑等价. "
      "这是因为, 若某个赋值" $v "满足"
      (&psubst $x $q $p) ", 鉴于" $x
      "没有出现在" $q "中, 所以"
      (&= $v^ (ext $v $x (&not (app $v $x))))
      "也能够满足" (&psubst $x $q $p)
      ". 但是, " $v "和" $v^
      "之中必然有不能满足"
      (&<=> $x $q) "的赋值.")
   (H4. "定义性CNF的实现")
   (P "对于新的命题变量, 我们将使用具有形式"
      (Code "p_n") "的风格化名称. "
      "下面的函数返回这样一个原子, "
      "同时返回递增后的索引以备下次使用. "
      "{译注: 对于Scheme和许多其他Lisp方言而言, "
      "我们有" (Code "gensym") "这种便利设施可用, "
      "无需费心于freshness问题.}"
      (CodeB "let mkprop n = Atom(P(&quot;p_&quot;^(string_of_num n))),n +/ Int 1;;")
      "为简单起见, 假设初始公式已经通过" (Code "nenf")
      "进行了预简化, 使得否定仅作用于原子, 并且推出式已被消除. "
      "主递归函数" (Code "maincnf")
      "接受一个三元组作为输入, "
      "其由一个要被转换的公式, "
      "一个给出了已经作出的" (Q "定义") "的有限部分函数, "
      "以及当前变量索引计数器的值构成. "
      "这个函数会返回一个类似的三元组, "
      "由被转换了的公式, 增长了的定义, "
      "以及跨越了已在定义中使用过了的变量的新计数器构成. "
      "其做的一切就是将顶层的二元联结词分解为类型构造器和其直接子公式, "
      "然后将其作为参数" (Code "op") "和" (Code "(p,q)")
      "传递给另一个一般函数" (Code "defstep")
      ", 这个函数进行了主要的工作. "
      "{译注: 这里说的类型构造器不是严格意义上的.} "
      "(两个函数" (Code "maincnf") "和" (Code "defstep")
      "是互递归的, 因而我们将其作为一个整体输入: "
      "注意到以下的代码没有双分号.)"
      (CodeB "let rec maincnf (fm,defs,n as trip) =
  match fm with
    And(p,q) -> defstep mk_and (p,q) trip
  | Or(p,q) -> defstep mk_or (p,q) trip
  | Iff(p,q) -> defstep mk_iff (p,q) trip
  | _ -> trip"))
   (P "在" (Code "defstep") "内部, 对于" (Code "maincnf")
      "的递归调用将左子公式" (Code "p") "进行转换, "
      "返回被转换了的公式" (Code "fm1")
      ", 增长了的定义列表" (Code "defs1")
      ", 以及计数器" (Code "n1")
      ". 右子公式" (Code "q")
      "连带着新的定义列表和计数器用在了另一个递归调用里, "
      "给出了一个被转换的公式" (Code "fm2")
      "以及进一步修饰了的定义" (Code "defs2")
      "和计数器" (Code "n2")
      ". 然后, 我们通过应用传入的构造器" (Code "op")
      "来构造合适的复合公式" (Code "fm'")
      ". 接着, 我们检查是否已经有定义对应于该公式. "
      "若是如此, 则返回定义变量. "
      "否则的话, 我们创建一个新的变量并插入一个新的定义, "
      "之后返回该变量作为简化了的公式, 当然调用"
      (Code "mkprop") "所得到的新计数器也要返回."
      (CodeB "and defstep op (p,q) (fm,defs,n) =
  let fm1,defs1,n1 = maincnf (p,defs,n) in
  let fm2,defs2,n2 = maincnf (q,defs1,n1) in
  let fm' = op fm1 fm2 in
  try (fst(apply defs2 fm'),defs2,n2) with Failure _ ->
  let v,n3 = mkprop n2 in (v,(fm'|->(v,Iff(v,fm'))) defs2,n3);;")
      "{译注: 这个优化的正确性实际上并非完全显然, 而是需要证明. "
      "这里我们需要用到" (Ref "eval-subst")
      ". 首先我们要把这Tseitin变换的中间步骤的整个表达式 (包括定义) "
      "的当前焦点部分挖去, 换上新鲜变量" $y
      ", 然后我们设这个模板是" $r
      ", 优化所使用的定义里的变量和公式分别为" $x "和" $q
      ", 那么前后两个表达式分别为"
      (MB (&psubst $y $q $r) "和" (&psubst $y $x $r))
      "如果赋值" $v "满足其中任何一个公式, "
      "那么因为定义是合取分量之一, 所以"
      (&= (&eval $x $v) (&eval $q $v))
      ". 由此可知, 根据" (Ref "eval-subst") ", 我们有"
      (MB (&= (&eval (@psubst $y $q $r) $v)
              (&eval (@psubst $y $x $r) $v)))
      "换言之, 若" $v "满足其中一个表达式, "
      "那么必然" $v "也满足另一个表达式. "
      "也就是说, 优化前后的两个表达式是逻辑等价的, "
      "这比等可满足还要强.}")
   (P "我们需要保证我们新引入的原子没有出现在初始公式里. "
      "{译注: 更准确地说, 对于这里的情况, 以及后面可能出现的情况, "
      "新要引入的原子一般要保证和初始公式里的每个原子以及"
      "已经引入的新原子都不同. 许多过程的正确性都依赖于这一点. "
      "就这里的情况而言, freshness是为了保证新原子能够"
      "唯一地标识Tseitin变换的中间步骤的位置, "
      "这里说的中间步骤是包括所有已经引入的定义的.} "
      "这种繁琐的工作在后续还会多次出现, "
      "因此我们现在实现一个更通用的解决方案. "
      (Code "max_varindex") "函数返回参数" (Code "n")
      "和可能的" (Code "m") "中更大的那个, "
      "如果字符串参数" (Code "s") "是" (Code "pfx")
      "后面跟着对应于数字" (Code "m") "的字符串的话:"
      (CodeB "let max_varindex pfx =
  let m = String.length pfx in
  fun s n ->
    let l = String.length s in
    if l &lt;= m or String.sub s 0 m &lt;> pfx then n else
    let s' = String.sub s m (l - m) in
    if forall numeric (explode s') then max_num n (num_of_string s')
    else n;;")
      "{译注: 原文对于" (Code "max_varindex")
      "的描述真是非常绕, 实际上就是看看字符串" (Code "s")
      "是不是恰好为" (Code "pfx") "后面跟着数码的形式. "
      "如果是, 那就试图得到这些数码所表示的数字, "
      "然后比大小. 如果不是这样的形式, 就不用比较了, "
      "直接返回" (Code "n") "即可.}")
   (P "现在我们可以实现整体的函数了. "
      "首先对公式进行化简并将否定下推, 得到" (Code "fm'")
      ". 然后, 我们使用这个公式以选择合适的起始变量索引, "
      "具体做法是看看既有的形式为" (Q (Code "p_n"))
      "的所有变量, 然后给其中最大的" $n "加上一. "
      "然后我们调用主函数, 这里我们将其保留为参数"
      (Code "fn") "以允许未来的修改, "
      "而主函数的参数是从没有定义和之前选取的变量索引开始的. "
      "然后我们以集合之集合表示返回作为结果的CNF:"
      (CodeB "let mk_defcnf fn fm =
  let fm' = nenf fm in
  let n = Int 1 +/ overatoms (max_varindex &quot;p_&quot; ** pname) fm' (Int 0) in
  let (fm'',defs,_) = fn (fm',undefined,n) in
  let deflist = map (snd ** snd) (graph defs) in
  unions(simpcnf fm'' :: map simpcnf deflist);;"))
   (P "我们的第一个定义性CNF函数知识将其应用于" (Code "maincnf")
      ", 然后将结果转换回公式的形式:"
      (CodeB "let defcnf fm = list_conj(map list_disj(mk_defcnf maincnf fm));;"))
   (P "在示例公式上进行测试, 得到了预期的结果, "
      "与上面手工推导得到的结果一致, "
      "只是合取分量的顺序以及每个合取分量内文字的顺序有所不同."
      (CodeB "# defcnf &lt;&lt;(p \\/ (q /\\ ~r)) /\\ s>>;;
- : prop formula =
&lt;&lt;(p \\/ p_1 \\/ ~p_2) /\\
  (p_1 \\/ r \\/ ~q) /\\
  (p_2 \\/ ~p) /\\
  (p_2 \\/ ~p_1) /\\
  (p_2 \\/ ~p_3) /\\
  p_3 /\\
  (p_3 \\/ ~p_2 \\/ ~s) /\\ (q \\/ ~p_1) /\\ (s \\/ ~p_3) /\\ (~p_1 \\/ ~r)>>"))
   (P "与其将每个定义单独转换为CNF, 我们本可以先形成最终的合取式, "
      "然后调用一次旧的CNF函数. 这样编程会稍微简单一些, "
      "并且能消除更多被subsumed的合取分量, "
      "例如这个例子里的" (&disj $p_3 (&neg $p_2) (&neg $s))
      " is subsumed by " $p_3
      ". 然而, 对于非常大的公式, subsumption测试会变得极其缓慢, "
      "因为(在我们的简单实现里)其对于大小为" $n
      "的公式大约要执行" $n^2 "次运算. "
      "{译注: 我感觉可能没有那么糟糕, "
      "因为作者会进行预排序. 对于排序好了的集合, "
      "subsumption测试是线性的. 不过, 排序总是反复进行, "
      "然而我期望作者的实现里对于已经排序好的列表进行排序应该不太耗费代价. "
      "不过, 鉴于作者的实现里每个公式都要对于所有公式进行一次"
      "subsumption测试, 我感觉这种计算量不会很小.}")
   (P "{译注: 以下是个人以Scheme实现的Tseitin变换, 其大致相当于原文"
      (Code "maincnf") "和" (Code "nenf")
      "功能复合, 不过没有实现原文的小优化 "
      "(为了简单和可读性起见):"
      (CodeB "(define (fresh-var)
  (gensym 'p_))
(define (tseitin exp)
  (define (tseitin exp d*)
    (match exp
      ((,op ,e1 ,e2)
       (let*-values (((l1 d*) (tseitin e1 d*))
                     ((l2 d*) (tseitin e2 d*)))
         (let ((x (fresh-var))
               (e `(,op ,l1 ,l2)))
           (values x (cons `(&lt;=> ,x ,e) d*)))))
      (,else (values exp d*))))
  (tseitin (nenf exp) '()))")
      "这里的变量名" (Code "l1") "和" (Code "l2")
      "暗示了内部的" (Code "tseitin")
      "所返回的第一个值是" (Q "文字") ".}")
   (H4. "优化")
   (P "我们可以通过避免一些明显冗余的定义来优化该过程. "
      "首先, 当处理初始公式里的迭代合取时, "
      "我们可以只是将合取分量分别置于CNF形式, "
      "然后将它们连接起来. "
      "{原注: 注意到这里最初要调用的" (Code "nenf")
      "带来了收益, 因为它可以暴露原本隐藏在嵌套否定之下的CNF结构, "
      "例如" (&neg (@disj $p (&conj $q $r)))
      "在这变换之后就已然变成了CNF形式.} "
      "并且, 如果合取分量本身又是析取, "
      "那么我们可以忽略析取分量是文字的情况, "
      "只对于其他子公式引入定义.")
   (P "编码相当简单: "
      "首先我们向下历经任意多层嵌套的合取, "
      "然后再向下历经任意多层嵌套的析取, "
      "在我们开始定义性工作之前. "
      "然而, 我们仍然需要将公式的不同部分的定义性变换链接起来, "
      "于是我们维持了和之前相同的具有三个参数的整体结构. 函数"
      (Code "subcnf") "和" (Code "defstep")
      "的结构大致相同, 除了它只是处理链接记录事务 (linkage housekeeping) "
      "而不引入新的定义, 并且其还有要被递归调用的函数作为额外的参数"
      (Code "sfn") ":"
      (CodeB "let subcnf sfn op (p,q) (fm,defs,n) =
  let fm1,defs1,n1 = sfn(p,defs,n) in
  let fm2,defs2,n2 = sfn(q,defs1,n1) in (op fm1 fm2,defs2,n2);;"))
   (P "首先这用来定义第一个函数, 其递归地向下历经析取, "
      "然后对于析取分量执行定义性变换 "
      "{译注: 根据前文可知, 定义性变换对于文字不会引入新的定义}:"
      (CodeB "let rec orcnf (fm,defs,n as trip) =
  match fm with
    Or(p,q) -> subcnf orcnf mk_or (p,q) trip
  | _ -> maincnf trip;;")
      "当然我们还需要一个函数, 其向下历经合取, "
      "然后对于合取分量调用" (Code "orcnf") ":"
      (CodeB "let rec andcnf (fm,defs,n as trip) =
  match fm with
    And(p,q) -> subcnf andcnf mk_and (p,q) trip
  | _ -> orcnf trip;;"))
   (P "现在整体的函数是相同的, 除了" (Code "andcnf")
      "被用作代替" (Code "maincnf")
      ". 我们将实际从集合之集合表示重构公式单独分离为一个函数, "
      "因为之后拦截中间结果是有用的. "
      "{译注: 意即之后会用到中间结果, 也就是集合之集合表示.}"
      (CodeB "let defcnfs fm = mk_defcnf andcnf fm;;

let defcnf fm = list_conj (map list_disj (defcnfs fm));;")
      "这对于之前我们的运行示例的确给出了远为简单的结果:"
      (CodeB "# defcnf &lt;&lt;(p \\/ (q /\\ ~r)) /\\ s>>;;
- : prop formula =
&lt;&lt;(p \\/ p_1) /\\ (p_1 \\/ r \\/ ~q) /\\ (q \\/ ~p_1) /\\ s /\\ (~p_1 \\/ ~r)>>"))
   (P "如果再仔细一些, 可以设计出一种定义性CNF过程, "
      "使其输出的大小始终至少不逊于朴素算法 (Boy de la Tour 1990). "
      "不过, 我们现在得到的函数" (Code "defcnf")
      "已经相当不错, 完全能够满足我们的需要. "
      "关于一种可能的优化, 参见练习2.11.")
   (P "{译注: 以下是我在Scheme中实现的优化了的定义性CNF过程:"
      (CodeB "(define (tseitin exp)
  (define (lookup e d*)
    (match d*
      (((&lt;=> ,x ,p) . ,d*)
       (if (equal? e p)
           x
           (lookup e d*)))
      (,else #f)))
  (define (Exp step op e1 e2 d*)
    (let*-values (((e1 d*) (step e1 d*))
                  ((e2 d*) (step e2 d*)))
      (values `(,op ,e1 ,e2) d*)))
  (define (CNF exp d*)
    (match exp
      ((and ,e1 ,e2) (Exp CNF 'and e1 e2 d*))
      (,else (Conjunct exp d*))))
  (define (Conjunct exp d*)
    (match exp
      ((or ,e1 ,e2) (Exp Conjunct 'or e1 e2 d*))
      (,else (Literal exp d*))))
  (define (Literal exp d*)
    (match exp
      ((,op ,e1 ,e2)
       (let-values (((e d*) (Exp Literal op e1 e2 d*)))
         (define x (lookup e d*))
         (if x
             (values x d*)
             (let ((x (fresh-var)))
               (values x (cons `(&lt;=> ,x ,e) d*))))))
      (,else (values exp d*))))
  (CNF (nenf exp) '()))")
      "这里的变量命名遵循我个人的编程习惯. "
      (Code "CNF") "代表返回的表达式具有CNF形式, "
      (Code "Conjunct") "代表返回的表达式具有CNF的合取分量形式, "
      "而其本身应该是文字的析取. "
      (Code "Literal") "代表返回的表达式是一个文字. "
      "上述陈述存在一个漏洞, "
      "实际上逻辑常量需要谨慎单独对待. "
      "不过, 就这里的情形而言, "
      "逻辑常量不会造成任何问题, 所以我也没有特意处理. "
      "但是读者必须记住, 这是例外情况, 必须总是关心.}")
   (H4. "3-CNF")
   (P "注意到在之前未经优化的定义性CNF转换之后, "
      "作为结果的公式具有" (Q "3-CNF")
      "形式, 也就是说每个合取分量"
      (Em "至多拥有三个")
      "文字. 读者可以通过确认以下事实来验证这一点: "
      "对于每个联结词" (Q $o*) "而言, 定义" (&<=> $p (&o* $q $r))
      "在CNF转换下得到结果里每个合取分量至多只能拥有三个文字. "
      "{译注: 记号" (&<=> $p (&o* $q $r)) "里, "
      $p "是原子的元变量, " $q "和" $r
      "是文字的元变量, " $o* "只能是" $conj
      ", " $disj ", " $<=> "里面选一个.} "
      "然而, 最后的优化破坏了这一性质, "
      "因为它选择保留了已然是CNF的结构. "
      "如果3-CNF被认为是重要的, "
      "可以在仍然分别处理各个合取分量的同时恢复这一性质. "
      "一种粗糙但够用的方法是简单地省略中间函数" (Code "orcnf")
      " {译注: 这种方法相当于令每个合取分量只有一个文字}:"
      (CodeB "let rec andcnf3 (fm,defs,n as trip) =
  match fm with
    And(p,q) -> subcnf andcnf3 mk_and (p,q) trip
  | _ -> maincnf trip;;

let defcnf3 fm = list_conj (map list_disj(mk_defcnf andcnf3 fm));;")
      "{译注: 这里的代码作者搞错了, 可能是之前的版本, "
      "我已根据官网代码进行修正.}")
   (P "本节的结果表明, 我们可以将SAT问题" --
      "即测试任意公式的可满足性" --
      "归约为测试一个仅大数倍的CNF公式的可满足性. "
      "事实上, 根据上述内容, 我们只需要能够测试" (Q "3-SAT")
      ", 即3-CNF公式的可满足性. "
      "正因如此, 许多实用算法假设输入为CNF, "
      "而理论结果也往往只考虑CNF或3-CNF公式.")
   (H3. "Davis-Putnam过程")
   (P "Davis-Putnam过程是一种用于判定"
      "具有合取范式的命题公式的可满足性的方法. "
      "实际上有两种显著不同的算法都被常称为" (Q "Davis-Putnam")
      ", 但我们将分别讨论它们, 并尽量在术语上加以区分. "
      "Davis和Putnam (1960) 提出的原始算法将简称为"
      (Q "Davis-Putnam") " (DP), 而由Davis, Logemann和Loveland (1962) "
      "发展出的后来更为流行的变体将被称为"
      (Q "Davis-Putnam-Loveland-Logemann")
      " (DPLL). 按照历史顺序, 我们首先考虑DP.")
   (P "我们发现" (Q "集合的集合") "表示法在将公式转换为CNF时非常有用, "
      "我们也将在DP和DPLL过程中使用这种表示法. CNF公式的隐式"
      (Q "集合的集合") "表示通常被称为子句形式, "
      "每个合取分量被称为一个子句. 前面的辅助函数" (Code "simpcnf")
      "已经将公式置于子句形式, 而" (Code "defcnfs")
      "做了类似的事情, 只不过使用的是定义性CNF. 我们将直接使用后者, "
      "避免从集合的集合表示重新构造公式的最后一步. "
      "在我们的讨论中, 我们书写子句的时候仍会包括隐式的逻辑联结词, "
      "但应理解我们实际上执行的是集合操作.")
   (P "退化情形应该铭记在心: 包含空子句的列表对应于公式"
      (Q $bottom) ", 而子句的空列表则对应于" (Q $top)
      "; 这种解释在后文中经常使用. "
      "DP过程通过一系列其他的过程相继对于子句形式的公式进行变换, "
      "保持子句形式以及其与原本公式的等可满足性. "
      "这个过程在子句形式包含空子句 (这种情况下原本的公式必然是不可满足的) "
      "或者子句形式本身为空 (这种情况下原本的公式必然是可满足的) "
      "时会终止. 以下是DP过程所使用的三种基本的可满足性保持变换:"
      (Ul (Li "(I) 1-文字规则,")
          (Li "(II) 肯定否定规则,")
          (Li "(III) 消除原子公式的规则.")))
   (P "规则I和II总是使公式变得更简单, 减少文字的总数. "
      "因此它们总是被尽可能多地应用, 而第三条规则" --
      "它可能大幅增加公式的大小" --
      "只在前两条规则都不适用时才使用. "
      "然而, 从逻辑的角度来看, 我们可以将I视为III的特殊情形, "
      "因此我们将复用III保持可满足性的论证来证明I也具有同样的性质.")
   (H4. "1-文字规则")
   (P "这条规则适用于某个子句是" (Em "单元子句(unit clause)")
      "的情形, 也就是说, 该子句只是一个单独的文字, "
      "而非超过一个文字的析取. 如果" $p "是这样一个单元子句, "
      "那么我们可以通过以下方法得到一个新的公式:"
      (Ul (Li "移除其他子句里的所有" (&- $p) "实例,")
          (Li "移除所有包含" $p "的子句, 包含该单元子句本身.")))
   (P "之后我们将会证明这种变换保持可满足性. "
      "1-文字规则本身也被称为" (Em "单元传播")
      ", 因为它将" $p "为真的信息传播至其他子句里. "
      "为了以列表之列表的表示实现这一过程, "
      "我们寻找一个单元子句, 即长度为一的列表, "
      "然后令" (Code "u") "是其中单独的文字, 而"
      (Code "u'") "是其否定. 然后, 我们首先移除所有包含"
      (Code "u") "的子句, 然后从剩余的子句里移除"
      (Code "u'") "."
      (CodeB "let one_literal_rule clauses =
  let u = hd (find (fun cl -> length cl = 1) clauses) in
  let u' = negate u in
  let clauses1 = filter (fun cl -> not (mem u cl)) clauses in
  image (fun cl -> subtract cl [u']) clauses1;;"))
   (P "如果不存在单元子句, " (Code "find")
      "的应用会抛出异常. 这使得我们可以很方便地反复应用"
      (Code "one_literal_rule")
      "来消除多个单元子句, 直到失败表明已经没有更多的单元子句为止. "
      "注意, 即使初始公式中只有一个单元子句, "
      "规则的应用也可能通过删除其他文字而产生新的单元子句.")
   (H4. "肯定否定规则")
   (P "这个规则有时也被称为" (Em "纯文字")
      "规则, 其利用了某些文字" (Em "仅肯定出现")
      "或者" (Em "仅否定出现") "的事实, "
      "然后我们可以删除所有包含这种文字的子句, "
      "同时仍能保持可满足性. "
      "对于实现而言, 我们从将所有文字收集在一起开始, "
      "然后将其划分为肯定 (" (Code "pos")
      ") 和否定 (" (Code "neg'")
      "). 从这些值我们得到" (Code "pure")
      ", 其包含了所有只肯定出现或者只否定出现的文字, "
      "然后据此我们消除所有含有其中任意文字的子句. "
      "如果没有纯文字了, 我们会选择失败, "
      "这样更适合整体的过程."
      (CodeB "let affirmative_negative_rule clauses =
  let neg',pos = partition negative (unions clauses) in
  let neg = image negate neg' in
  let pos_only = subtract pos neg and neg_only = subtract neg pos in
  let pure = union pos_only (image negate neg_only) in
  if pure = [] then failwith &quot;affirmative_negative_rule&quot; else
  filter (fun cl -> intersect cl pure = []) clauses;;"))
   (P "如果任意某个赋值可以满足原本的子句集合, "
      "那么其也必然满足新的集合, 因为新的集合是本来的集合的子集. "
      "反过来, 如果某个赋值" $v "满足新的集合, "
      "那么我们对于所有仅肯定文字" $p "置"
      (&= (app $v^ $p) $true)
      ", 对于所有仅否定文字" (&neg $n) "置"
      (&= (app $v^ $n) $false)
      ", 对于其他所有原子则置"
      (&= (app $v^ $a) (app $v $a))
      ". 根据构造方式, 其会满足被删除的子句, "
      "并且既然" $v^ "不会改变" $v
      "对于所有出现在新集合的子句里的原子的指派, "
      "其当然也满足这些没有被删除的子句, 故"
      $v^ "能够满足原本的子句集合.")
   (H4. "消除原子公式的规则")
   (P "这条规则是唯一一条可能使公式规模增大的规则, "
      "而且在最坏情况下, 这种增大可能是相当可观的. "
      "然而, 它能够彻底消除某个特定原子, "
      "而不需要对包含该原子的子句施加任何特殊要求. "
      "该规则以一个文字" $p "为参数, 要求" $p
      "在至少一个子句中肯定出现, "
      "并且在至少一个子句中否定出现. "
      "(如果纯文字规则已经被应用过, "
      "那么剩余的任何文字都满足这一性质. "
      "事实上, 如果我们还过滤掉了平凡的, 即重言的子句, "
      "那么没有任何文字会在同一个子句中既肯定出现又否定出现, "
      "但我们在陈述和证明下一个定理时不会依赖这一点.)")
   ((Theorem)
    "给定一个文字" $p ", 将子句集合" $S
    "划分为三类: 仅以正面方式包含" $p ", 仅以反面方式包含"
    $p ", 以及两者都不为真的:"
    (MB (&= $S (&union (setI (&disj $p $C_i)
                             (&<= $1 $i $m))
                       (setI (&disj (&- $p) $D_j)
                             (&<= $1 $j $n))
                       $S_0)))
    "其中" $C_i "和" $D_j "中没有任何一个应该包含文字" $p
    "或其否定, 并且如果" $p "或者" (&- $p)
    "出现在" $S_0 "的任意子句里, 那么两者都应该出现. 然后, "
    $S "是可满足的当且仅当" $S^ "是可满足的, 其中:"
    (MB (&= $S^ (&union (setI (&disj $C_i $D_j)
                              (&cm (&<= $1 $i $m)
                                   (&<= $1 $j $n)))
                        $S_0)) ".")
    "{译注: 仅以正面方式包含" $p
    ", 换成更容易理解的方式, "
    "其实就是包含" $p "但不包含" (&- $p)
    ". 仅以反面方式包含" $p ", 其实就是包含" (&- $p)
    "但不包含" $p ".}")
   ((proof)
    "不失一般性, 我们可以假定" $p "为肯定文字, "
    "即一个原子公式, 否则的话相同的论证也可以适用于"
    (&- $p) "." (Br)
    "如果一个赋值" $v "满足" $S ", 那么存在两种可能性. 如果"
    (&= (app $v $p) $false) ", 既然每个" (&disj $p $C_i)
    "都得到满足而" $p "没有被满足, 那么每个" $C_i
    "都得到了满足, 那么每个" (&disj $C_i $D_j)
    "就更被满足了. 如果" (&= (app $v $p) $true)
    ", 既然每个" (&disj (&- $p) $D_j) "都得到满足而"
    (&- $p) "没有被满足, 那么每个" $D_j
    "都得到了满足, 因而" (&disj $C_i $D_j)
    "亦是如此. " $S_0 "里的公式已经在原本的" $S
    "里了, 所以说仍然被" $v "所满足." (Br)
    "反过来, 设一个赋值" $v "满足" $S^
    ". 我们声明, " $v "要么满足所有的" $C_i
    ", 要么满足所有的" $D_j
    ". 诚然如此, 若该赋值没有满足某个特定的" $C_k
    ", 那么然而赋值能够对于" (&<= $1 $j $n)
    "满足所有的" (&disj $C_k $D_j)
    "这一事实立即表明了这个赋值满足所有的"
    $D_j "; 类似地, 如果该赋值不能满足某个"
    $D_l ", 那么其必然满足所有的" $C_i
    ". 现在, 若" $v "满足所有的" $C_i
    ", 那么我们置" (&= (app $v^ $p) $false)
    "而对于其他所有原子置"
    (&= (app $v^ $a) (app $v $a))
    ". 所有的" (&disj $p $C_i) "都被"
    $v^ "满足, 因为所有的" $C_i
    "都被" $v^ "满足. 所有的"
    (&disj (&- $p) $D_j)
    "也都被" $v^ "满足, 因为"
    (&- $p) "被" $v^ "满足. "
    "既然" $S_0 "的公式要么不牵涉" $p
    ", 要么就是重言, 所以它们仍然被" $v^
    "所满足. 另一情形全然是对称的: "
    "如果" $v "满足所有的" $D_j
    ", 那么置" (&= (app $v^ $p) $true)
    ", 推理是类似的. {译注: 原文是"
    (&= (app $v $p) $true)
    ", 可能是一个笔误.}")
   (P "规则III也常被称为" (Em "归结(resolution)")
      "规则, 我们将会在第3章里对其进行详细研究. "
      
      )
   (H4. "DP过程")
   (H4. "DPLL过程")
   (H4. "迭代DPLL")
   (H4. "回跳和学习")
   (H3. "Stålmarck方法")
   (H3. "二元决策图")
   (H3. "紧致性")
   (H3. "深入阅读")
   (P "关于Boolean代数的一般理论, 包括对Boole原始系统的命题, 集合论及其他解释, "
      "可参见例如Abian (1976), Davey和Priestley (1990) 以及Halmos (1963). "
      "许多逻辑教科书中都有关于Boolean代数的讨论, 如Bell和Slomson (1969), "
      "其中一些我们稍后会因其他技术主题而加以推荐. 最后, "
      "Halmos和Givant (1998) 以现代方式处理逻辑, 但采用了更为明确的代数风格.")
   (P "命题逻辑在许多标准逻辑教材中都有涉及, "
      "例如Church (1956), van Dalen (1994), Enderton (1972), Goodstein (1971), "
      "Hilbert和Ackermann (1950), Hodges (1977), Johnstone (1987), "
      "Kreisel和Krivine (1971), Mates (1972), Quine (1950) 以及Tarski (1941); "
      "其中许多也证明了紧致性定理. "
      "大多数关于自动定理证明的书籍也讨论了命题逻辑和经典判定方法, "
      "如Davis–Putnam方法, 不过往往在命题逻辑上着墨不多, "
      "便转向一阶逻辑 (即我们下一章的内容). Davis, Sigal和Weyuker (1994) "
      "将理论逻辑与自动定理证明相结合, 同时也是一本关于可计算性与复杂性的教科书. "
      "更侧重于自动定理证明的有Bibel (1987), Chang和Lee (1973), Duffy (1991), "
      "Fitting (1990), Loveland (1978), Newborn (2001) 以及"
      "Wos, Overbeek, Lusk和Boyle (1992).")
   (P "回跳和学习最早在DPLL中被应用于SAT求解器"
      "GRASP (Marques-Silva和Sakallah 1996) 和rel_sat (Bayardo和Schrag 1997). "
      "一些较新的基于DPLL的系统, 按大致的开发时间顺序排列, "
      "有SATO (Zhang 1997), Chaff (Moskewicz, Madigan, Zhao, Zhang和Malik 2001), "
      "BerkMin (Goldberg和Novikov 2002) 以及MiniSat (Eén和Sörensson 2003). "
      "描述这些系统的论文是了解基本DPLL算法各版本及巧妙实现技巧的宝贵信息来源. "
      "Nieuwenhuis, Oliveras和Tinelli (2006) 以及Krstić和Goel (2007) "
      "通过非确定性的抽象规则序列来描述迭代DPLL, "
      "使得具体实现可以被视为部署这些规则的方式. "
      "Kroening和Strichman (2008) 也讨论了" (Q "工业级")
      "SAT求解器的架构, 并讨论了命题逻辑的诸多扩展及其在应用中的使用. "
      "其中一些主题将在本书后面讨论, 但有些则不会, 特别是量化Boolean公式 (QBF), "
      "其中公式可以对原子进行量化. (这与下一章描述的一阶逻辑不同, "
      "一阶逻辑中的量化是针对论域中的元素, 而非命题.)")
   (P "我们讨论过的一些主题在通用教科书中尚未被广泛涵盖, "
      "读者必须查阅更专业的专著或研究论文. Stålmarck算法尤其如此, "
      "不过Sheeran和Stålmarck (2000) 对该理论及其成功的实际应用进行了综述. "
      "递归学习的思想 (Kunz和Pradhan 1994) 与Stålmarck方法有重要的共通之处.")
   (P "Bryant (1992) 的综述文章和Kropf (1999) "
      "的教科书讨论了BDD及其在形式化硬件验证自动方法中的作用. "
      "最引人注目的是, 当McMillan等人 (Coudert, Berthet和Madre 1989; "
      "Burch, Clarke, McMillan, Dill和Hwang 1992; Pixley 1990) "
      "将BDD表示与时序逻辑模型检查 (Clarke和Emerson 1981; "
      "Queille和Sifakis 1982) 相结合时, 后者经历了一场小型革命. "
      "关于模型检查的详细介绍, 可参见Clarke, Grumberg和Peled (1999), "
      "以及一些关于计算机科学中的逻辑的书籍, 如Huth和Ryan (1999).")
   
   (H3. "练习")
   (H2. "一阶逻辑")
   (P "我们现在从命题逻辑移至更为丰富的一阶逻辑, "
      "其中命题可以牵涉全称或者存在量化的非命题变量. "
      "我们将会展现一阶逻辑之中的证明是如何可以"
      "藉由Herbrand定理被朴素地机械化的. "
      "接着我们将会引入诸多改进, "
      "特别是合一 (unification), "
      "其可以使得自动化证明更加高效.")
   (H3. "一阶逻辑及其实现")
   (P "命题逻辑只允许我们从原始命题构建公式, "
      "原始命题本身可以独立地为真或者为假. "
      "然而, 这太过受限, 很难捕获命题的真假依赖于"
      (Em "非命题") "变量的值这种情况的推理模式. "
      "例如, 一个典型的关于数字的命题是" (Q (&< $m $n))
      ", 而其真值依赖于" $m "和" $n
      "的值. 如果我们只是为每个这样的命题引入一个不同的命题变量, "
      "那么我们就失去了根据其所含变量将不同实例相互关联的能力, "
      "例如断言" (&neg (@conj (&< $m $n) (&< $n $m)))
      ". {译注: 也就是说, 例如这里的" $m "和" $n
      "是在两个命题之间共享的, 由此建立联系.} "
      (Em "一阶(谓词)逻辑")
      "以两种方式扩展了命题逻辑以适应这种需求:"
      (Ul (Li "原子命题可以使用函数和谓词由非命题变量和常量构建而成;")
          (Li "非命题变量可以被" (Em "量词") "所" (Em "绑定") ".")))
   (P "我们对于" (Em "公式") " (从直觉上来说意在为真为假) 和"
      (Em "项") " (意在指称进行推理的论域中的" (Q "对象")
      ") 进行句法上的区分. 项是由(对象指称)变量通过函数构建的. "
      "{译注: 更准确地说, 应该是函数符号.} "
      "在讨论中, 我们使用记号" (appl $f $s $t $u)
      "代表由子项" (&cm $s $t $u) "使用函数" $f
      "构建的项, 或者有时使用中缀记号" (&+ $s $t) "而非"
      (appl $+ $s $t) ", 如果中缀记号更自然或者令人熟悉. "
      "所有这些符号都只应该理解为对于项的潜在抽象句法的呈现, "
      "这里的项要么是一个变量, 要么是一个函数应用于任意数目的其他"
      (Q "参数") "项:"
      (CodeB "type term = Var of string
          | Fn of string * term list;;"))
   (P "函数可以拥有任意数目的参数, 而这个数目被称为是函数的"
      (Em "元数(arity)") " (from a pun on the words unary, "
      "binary, ternary, quaternary, etc.). "
      "特别地, 我们可以将诸如" $1 "或者" $pi
      "这样的常量归为" (Em "零元")
      "函数, 即具有零个参数的函数. "
      "绝大多数数学表达式都可以相当直接地形式化为项, 例如"
      (Msqrt (&- $1 (app (^ $cos $2) (&+ $x $y))))
      "可以翻译为:"
      (CodeB "Fn(&quot;sqrt&quot;,[Fn(&quot;-&quot;,[Fn(&quot;1&quot;,[]);
                   Fn(&quot;power&quot;,[Fn(&quot;cos&quot;,[Fn(&quot;+&quot;,[Var &quot;x&quot;; Var &quot;y&quot;])]);
                               Fn(&quot;2&quot;,[])])])]);;"))
   (P "命题逻辑的所有逻辑联结词都可以延续到一阶逻辑之中. "
      "然而, 现在每个原子命题都被分析为了一个命名的"
      (Em "谓词") "或者说" (Em "关系")
      "应用于任意有限数目的项. 又一次, 对于谓词" $P
      "应用于参数" $s "和" $t "我们记" (appl $P $s $t)
      ", 但是有时也使用中缀记号" (&< $s $t) "而非"
      (appl $< $s $t) ", 如果这看起来更为自然. "
      "我们创建一个新的类型" (Code "fol")
      ", 其表示一阶原子命题, "
      "由此对于一阶公式我们有了自然的"
      (Code "fol formula") "类型:"
      (CodeB "type fol = R of string * term list;;")
      "例如, " (&< (&+ $x $y) $z)
      "可以形式化为以下的原子公式:"
      (CodeB "Atom(R(&quot;&lt;&quot;,[Fn(&quot;+&quot;,[Var &quot;x&quot;; Var &quot;y&quot;]); Var &quot;z&quot;]))"))
   (P "一个谓词可以只有零个参数, 这对应于简单命题变量的情况. "
      "我们将具有一个参数的函数和谓词称为" (Em "单元的(unary或monadic)")
      ", 具有两个参数的称为" (Em "二元的(binary或dyadic)")
      ", 而具有" $n "个参数的称为" $n "元的.")
   (P "在特定上下文中, 我们会考虑受限" (Em "语言")
      "中的项和/或类型. 形式化地说, 我们将" (Em "签名")
      "定义为一对集合, 其中一个集合是函数的列表, "
      "另一个集合是谓词的列表, 函数和集合都是由名字和元数构成的序对, "
      "而签名所对应的" (Em "语言")
      "是所有只使用签名里的函数和谓词构建而成的项和公式的集合 "
      "(不过变量可以是任意的). "
      "例如, 我们在第7章所使用的" (Em "算术语言") "具有以下签名:"
      (let ((sym (lambda (s) (Ms (string-append "&quot;" s "&quot;")))))
        (MB (tu0 (setE (tu0 (sym "0") $0)
                       (tu0 (sym "S") $1)
                       (tu0 (sym "+") $2)
                       (tu0 (sym "*") $2))
                 (setE (tu0 (sym "=") $2)
                       (tu0 (sym "<") $2)
                       (tu0 (sym "<=") $2))) "."))
      "于是诸如" (&+ $x (app $S $0)) "这样的项和诸如"
      (&< (app $S (app $S $0)) (&+ $x $y))
      "这样的公式都在该语言之中, 但是"
      (&+ $1 $x) "和" (app $P $0 $x)
      "不在. 对于" (Q "语言") "和" (Q "签名")
      "的确切形式化定义是不重要的 "
      "(这些随着材料的不同而发生变化, "
      "也有的作者会将语言和签名视为等同的), "
      "只要受限语言中的项和公式的概念清晰明确即可.")
   (H4. "量词")
   (P "现在我们来到另一和命题逻辑相较而言的主要改变: 量词的引入."
      (Ul (Li "公式" (∀ $x $p) ", 或者以OCaml表述是" (Code "Forall(x,p)")
              ", 其中" $x "是一个变量而" $p "是任意的公式, "
              "从直觉上来说意思是"
              (Q "对于" $x "的" (Em "所有") "值, " $p "为真")
              ". 出于这种理由, " $forall "被称为" (Em "全称量词")
              ", 这个符号是由" (Q "all") "的首字母颠倒得来的. "
              "{译注: 原文是" (Code "Forall(&quot;x&quot;,p)")
              ", 但是个人认为我的修改版本更为合理, 因为这里的"
              $x "是变量的元变量, 而不是一个具体的变量.}")
          (Li "与之可以类比的公式" (∃ $x $p)
              ", 或者以OCaml表述是" (Code "Exists(x,p)")
              ", 从直觉上来说意思是"
              (Q "存在一个" $x "使得" $p "为真")
              ", 即"
              (Q $p "对于" $x "的" (Em "某个") "值为真")
              ". 出于这种理由, " $exists "被称为"
              (Em "存在量词") ", 这个符号是由"
              (Q "exists") "的首字母颠倒得来的.")))
   (P "在公式" (∀ $x (App $P $x)) "和" (∃ $x (App $P $x))
      "里, 子公式" (App $P $x) "被称为是相应量词的"
      (Em "作用域(scope)")
      ". (在非形式化的讨论里, 我们经常用"
      (App $P $x) "这样的表达式代表"
      (Q "某个可能牵涉" (Q $x) "的任意公式")
      "). 这样的量词被称为是" (Em "绑定(bind)")
      "了其作用域内的" $x "的实例, "
      "而这些变量被称为是" (Em "绑定的(bound)")
      ". 不在某个量词的作用域内的变量实例被称为是" (Em "自由的(free)")
      ". 注意到相同的变量在同一公式里既自由出现又绑定出现, 例如"
      (&conj (appl $R $x $a) (∀ $x (appl $R $y $x)))
      ", 其中变量有一次自由出现, 还有一次绑定出现.")
   (P "从直觉上来说, 一个绑定变量只是一个回指对应绑定操作的占位符, "
      "而非通常意义下的独立变量. "
      "绑定变量可以与英语里的代词进行类比, "
      "代词回指在句子开头建立的某个特定名词: "
      (Q "Although the money was missing, John denied that he stole it")
      ". 绑定在数学记号里相当常见, 例如"
      (sum (&= $n $1) $inf (&/ $1 $n^2))
      "中的变量" $n ", "
      (integral (&- $inf) $inf (^ $e (&- $x^2)) $x)
      "中的变量" $x ", 以及"
      (setI $k^2 (∈ $k $NN))
      "中的变量" $k
      ". 它们也出现在编程语言里, 例如对于OCaml而言, 定义"
      (CodeB "let f(x) = 2 * x")
      "里的" (Code "x") ", 以及表达式"
      (CodeB "let a = 2 in a * a * a")
      "里的" (Code "a")
      ". 和逻辑学一样, 数学里的变量有时也在同一表达式里"
      "既自由出现又绑定出现, 例如在"
      (integral $0 $x (&i* $2 $x) $x)
      "里, 变量既有自由出现 (作为积分的上极限), "
      "又有绑定出现 (在积分的体里). "
      "类似地, " $x "真的在" (&d/d (@ $x^2) $x)
      "中既有自由出现又有绑定出现, "
      "尽管常规记号模糊了这一事实. "
      "我们可以将其分析为"
      (&\|-> $x $x^2) " (其中" $x "是绑定的) "
      "的导函数在点" $x "处求值 (这里的" $x
      "是一个自由变量). {译注: 然后, 根据惯例, "
      (&i* $2 $x) "又被理解为"
      (&\|-> $x (&i* $2 $x)) ".}")
   (P "在我们的具体句法里, 量词的作用域尽可能向右延伸, 例如"
      (∀ $x (&=> (app $P $x) (app $Q $x)))
      "代表" (∀ $x (@=> (app $P $x) (app $Q $x)))
      "而非" (&=> (@∀ $x (app $P $x)) (app $Q $x))
      ". (许多文献, 特别是较老的文献, 使用相反的约定, "
      "使得量词绑定得比联结词更为紧密. "
      "在查阅文献时读者应该记住这一点.) "
      "如果我们将全称量词或者存在量词相继应用于数个变量, "
      "那么我们通常只会写下一个量词符号, 例如"
      (∀ $x $y $z (&= (&+ $x (@+ $y $z)) (&+ (@+ $x $y) $z)))
      "而非"
      (∀ $x (∀ $y (∀ $z (&= (&+ $x (@+ $y $z)) (&+ (@+ $x $y) $z)))))
      ". 而且, 有时断言恰存在一个" $x "满足" $p
      "为真也是有用的. 我们将此记为" (∃! $x (App $P $x))
      ", 然后将其理解为"
      (∃ $x (&conj (App $P $x)
                   (∀ $y (&=> (App $P $y) (&= $y $x))))) ".")
   (P "从直觉上来说, 同种量词 (全为全称或者全为存在) "
      "的序列的排序不太重要: "
      (Q "对于" $x ", 对于" $y ", ...")
      "和"
      (Q "对于" $y ", 对于" $x ", ...")
      "意思应该是相同的. "
      "当我们之后精确定义逻辑等价时, 读者应该能够确认这一直觉. "
      "然而, 当不同种类的量词嵌套时, 或者导出量词" $exists!
      "牵涉其中时 (见练习3.1), 顺序往往就非常重要了. "
      "例如, 如果我们将" (&loves $x $y) "想成是"
      (Q $x " loves " $y) ", 公式"
      (∀ $x (∃ $y (&loves $x $y)))
      "断言了每个人都喜欢某个人, 而公式"
      (∃ $y (∀ $x (&loves $x $y)))
      "断言了某个人被所有人喜欢. "
      "举一个更为数学的例子, 考虑函数"
      (func $f $RR $RR)
      "的连续和一致连续的" $epsilon "-" $delta
      "定义. 连续性断言了给定" (&> $epsilon $0)
      ", 对于每个" $x ", 存在一个" (&> $delta $0)
      "使得每当" (&< (&abs (&- $x^ $x)) $delta) "时, 我们也有"
      (&< (&abs (&- (app $f $x^) (app $f $x))) $epsilon)
      "{译注: 原文的epsilon使用不太一致, 一会儿"
      $epsilon ", 一会儿" $epsilonv "}:"
      (MB (∀ $epsilon
             (&=> (&> $epsilon $0)
                  (∀ $x (∃ $delta
                           (&conj (&> $delta $0)
                                  (∀ $x^ (&=> (&< (&abs (&- $x^ $x)) $delta)
                                              (&< (&abs (&- (app $f $x^) (app $f $x)))
                                                  $epsilon)))))))) "."))
   (P "另一方面, 一致连续断言了给定" (&> $epsilon $0)
      ", 存在一个" (&> $delta $0) (Em "独立于") $x
      "使得对于任意的" $x "和" $x^ ", 每当"
      (&< (&abs (&- $x^ $x)) $delta) "时, 我们也有"
      (&< (&abs (&- (app $f $x^) (app $f $x))) $epsilon) ":"
      (MB (∀ $epsilon
             (&=> (&> $epsilon $0)
                  (∃ $delta
                     (&conj (&> $delta $0)
                            (∀ $x (∀ $x^ (&=> (&< (&abs (&- $x^ $x)) $delta)
                                              (&< (&abs (&- (app $f $x^) (app $f $x)))
                                                  $epsilon)))))))) "."))
   
   (H3. "句法分析和打印")
   (H3. "一阶逻辑的语义")
   (H3. "句法操作")
   (H3. "前束范式")
   (H3. "Skolem化")
   (H3. "canonical模型")
   (H3. "机械化Herbrand定理")
   (H3. "合一")
   (H3. "tableau")
   (H3. "归结")
   
   (H2. "相等性")
   (H3. "相等性公理")
   (H3. "范畴性和初等等价")
   (H3. "等式逻辑和完备性")
   (H3. "congruence闭包")
   (H3. "重写")
   
   (H2. "可判定问题")
   (H2. "交互式定理证明")
   (P "我们迄今为止的努力一直致力于让计算机完全自动地证明定理. "
      "然而, 在任何相对现实的计算能力限制下, "
      "全自动方法所能覆盖的范围仅限于当代数学中非常小的一部分. "
      "在这里, 我们提出一种替代方案: 一个交互式证明助手, "
      "它可以帮助精确地陈述和形式化证明, "
      "同时还能自动处理一些繁琐的细节. "
      "此外, 为了确保其可靠性, "
      "我们基于一个非常简单的逻辑内核来设计该证明助手.")
   (H3. "面向人类的方法")
   (P "我们已经投入了大量精力来让计算机完全自动地证明命题. "
      "我们所实现的方法相当强大, "
      "在某些类型的证明上甚至比 (大多数) 人做得更好. "
      "然而, 许多数学领域中那些极其复杂的逻辑推理链, "
      "几乎不可能被我们所介绍的这类系统化算法在合理的时间内发现. "
      "在实践中, 人类数学家通过直觉、对具体实例的实验、"
      "与相关结果的类比或外推、对问题背景的大胆推广 "
      "(例如在数论中使用复分析方法) "
      "以及纯粹的运气来找到这些推理链" --
      "参见Lakatos (1976), Polya (1954) 和Schoenfeld (1985), "
      "他们分别从不同角度尝试对数学发现的过程进行方法论分析. "
      "可以说, 几乎没有人类数学家会用我们所开发的那些方法来从事定理证明.")
   (P "面对系统化算法方法的局限性, "
      "一种自然的反应是尝试设计能以更接近人类风格进行推理的计算机程序. "
      "甚至在我们迄今讨论的那些方法被正式发展之前, "
      "一些研究者就凭直觉认为系统化方法不会有多大实际用处, "
      "并着手探索更面向人类的方法. 例如, "
      "Newell和Simon (1956) 设计了一个程序, 能够证明"
      (Em "数学原理") " (参见第6.4节) 中许多简单的逻辑定理. "
      "大约同一时期, Gelerntner (1959) 设计了一个证明器, "
      "能够利用人类风格的图形来引导或限制证明过程, "
      "从而证明Euclid几何中的事实. "
      "然而, 事实证明他们的基本思路, "
      "尤其是他们对系统化方法的悲观态度, "
      "并未完全得到验证. 例如, "
      "从Wu开始的几何定理证明的系统化方法 (参见第5.12节) 已经取得了显著成效, "
      "无疑超越了Gelerntner或其他使用面向人类方法的研究者所取得的任何成果. "
      "正如Wang (1960) 在展示他那个用于一阶逻辑AE片段 "
      "(第5.2节) 的简洁系统化程序时所评论的" --
      "该程序的效果远远超过了Newell和Simon的程序:"
      (Blockquote
       "作者 [...] 仍然不禁感到, "
       "这一对比揭示了他们方法中的一个根本性缺陷. "
       "杀鸡不必用牛刀. 然而总体印象却是, "
       "Newell-Shore-Simon连用牛刀杀鸡都没能成功."))
   (P "不过, 公平地说, 那些追求面向人类方法的研究者, "
      "其首要目标往往并非制造一个高效的定理证明器, "
      "尽管那可能是个令人心动的附带成果. "
      "他们的目标更多是通过形式化重构来理解人类的思维过程. "
      "从追求这一目标的角度看, 表现平庸可能恰恰意味着成功而非失败, "
      "因为人类本来就不太擅长解决逻辑谜题!")
   (P "在20世纪50年代对定理证明的" (Q "系统化") "和" (Q "面向人类")
      "两种方法进行了最初的探索之后, 前者几乎完全胜出. "
      "只有少数研究者继续追求面向人类的方法, 其中最著名的是Bledsoe, "
      "例如他尝试将人类在证明分析学中关于极限的定理时常用的方法形式化 (Bledsoe 1984). "
      "Bledsoe的学生Boyer与Moore一起开发了卓越的NQTHM证明器 (Boyer和Moore 1979), "
      "它往往能够对所提出的定理进行自动推广, 并用归纳法证明推广后的定理. "
      "NQTHM的成功, 以及将其方法纳入一个简洁概念框架的巨大困难, "
      "促使Bundy (1991) 在一个基于" (Em "证明规划")
      "的一般推理科学框架中重新构建了它的方法.")
   (P "面对面向人类方法在计算机化后的有限成功, 一种更为强硬的反应是指出, "
      "在某些情况下, 即使对人类而言, 系统化方法也更为优越. "
      "例如, Knuth和Bendix (1970) 认为完备化 (第4.7节) "
      "是对数学家处理等式公理时所进行的实验的一种有益的系统化. "
      "对计算领域中拟人化倾向的反感 (Dijkstra 1982b) 或许在某些圈子里推动了一种趋势, "
      "即让人类的证明变得更加系统化和句法驱动" --
      "简而言之, 更加机器化 (Dijkstra和Scholten 1990). "
      "而Wos则将他在应用自动推理方面取得的巨大成功归因于他充分发挥了计算机的优势, "
      "而非试图让它模仿人类思维:"
      (Blockquote
       "简单来说, 人的推理方式与本书所介绍的这类程序的推理方式之间存在大量差异. "
       "这些差异或许在一定程度上解释了为什么OTTER能够成功回答那些数十年悬而未决的问题, "
       "也解释了为什么使用它所产出的证明远比此前已知的更加优雅. "
       "(即使我知道需要做什么, 我也不会把OTTER重新设计成像数学家, "
       "逻辑学家或任何其他人那样工作, 而这并非出于对人类推理能力的不尊重.) "
       "(Wos和Pieper 1999)"))
   (H3. "交互式证明器和证明检查器")
   (P "经验表明, 无论是系统化算法方法还是启发式的面向人类方法, "
      "都无法自动证明范围广泛的高难度数学定理. 而且, "
      "没有迹象表明这些方法的渐进改进加上技术进步能够改变这一事实. "
      "有些人甚至可能会认为, 将人类自身都无法发展出来的证明自动化, "
      "本身就不是一件值得追求的事情."
      (Blockquote
       "[...] 我将数学证明视为我的理解的反映, 而" (Q "理解")
       "是我们无法委托给他人或机器的东西. (Dijkstra 1976b)"))
   (P "一个更为谦逊的目标是创建一个能够验证人类所发现的证明, "
      "或者在人类指导下提供有限辅助的系统. "
      "计算机至少应当充当一个谦恭的文书助手, "
      "检查证明的正确性, 防范人类常犯的错误, 如隐含假设和遗漏的特殊情况. "
      "理想情况下, 计算机可以通过自动化证明中的某些部分来实质性地辅助这一过程; "
      "毕竟, 证明中往往包含一些只是常规验证或适合自动化处理的部分, 例如代数恒等式. "
      "这种让机器与人类协作, 从证明草稿出发来完成定理证明的想法, "
      "早在Wang (1960) 那里就已经被设想过了, "
      "他在自动定理证明方面的工作仅仅是为这样一个系统奠定基础:"
      (Blockquote
       "作者最初的目标是以数学教科书为纲要" --
       "例如Landau的数系, Hardy-Wright的数论, Hardy的微积分, "
       "Veblen-Young的射影几何, 以及Bourbaki的各卷" --
       "让机器将所有证明形式化 (即填补其中的空白)."))
   (H4. "早期证明助手")
   (P "早期的计算机只支持批处理工作方式, 周转时间很长. "
      "但到了20世纪60年代, 一种更具交互性的工作方式开始普及. "
      "得益于此, 加上人们或许感觉到全自动系统的能力开始趋于平稳, "
      "对证明助手这一理念的兴趣日益增长. "
      "第一个有效的实现是SAM (半自动数学) 系列证明器:"
      (Blockquote
       "半自动数学是一种定理证明方法, "
       "它试图将自动逻辑程序与常规证明过程相结合, "
       "使得到的过程既高效又能接受人类以控制和引导形式进行的干预. "
       "由于它使数学家成为建立定理过程中的一个不可或缺的因素, "
       "这一方法有别于通常的定理证明尝试" --
       "在那些尝试中, 计算机独自寻求建立证明. "
       "(Guard, Oglesby, Bennett和Settle 1969)"))
   (P "1966年, 该系列系统中的第五个, 即SAM V, "
      "被用来构造了格论中一个此前未被证明的猜想的证明 (Bumcrot 1965). "
      "这无疑是半自动方法的一次成功, 因为计算机自动证明了一个现在被称为"
      (Q "SAM引理") "的结果, 而数学家则认识到它可以轻松地推导出Bumcrot猜想的证明.")
   (P "在SAM项目之后不久, 另外两个重要的证明检验系统问世: "
      "AUTOMATH (de Bruijn 1970; de Bruijn 1980; Nederpelt, Geuvers和Vrijer 1994) "
      "和Mizar (Trybulec 1978; Trybulec和Blair 1985). "
      "这两个系统都以不同的方式产生了深远的影响, "
      "并且都被用来检验过非平凡的数学内容. "
      "尽管我们也将这些系统称为" (Q "交互式")
      "的, 但我们只是松散地使用这个术语, 作为" (Q "自动")
      "的反义词. AUTOMATH和Mizar实际上都是围绕批处理使用方式设计的. "
      "然而, 它们所处理的文件由一个证明或证明草稿组成, "
      "系统检验其正确性, 而非一个需要自动证明的命题.")
   (H4. "LCF")
   (P "许多成功的证明检查器, 包括Mizar在内, 自动化能力相对较弱, "
      "要求用户以相当详细的方式描述证明, 只留给机器很小的空白去填补. "
      "例如, Mizar的自动化能力相当有限, 仅限于在精确逻辑意义上"
      (Q "显然") "的步骤 (Davis 1981; Rudnicki 1987). "
      "在一定程度上, 这种弱势是一种有意的设计选择. "
      "如果证明草稿中的空白过大, 那么对于没有机器辅助的人类读者来说, "
      "这个草稿就很难理解" -- "而既然现在的重点是帮助人类数学家, "
      "而非展示自动化的高超技艺, 那这似乎是一个不可取的特性. "
      "这一限制还大大缩小了填补证明空白或判断"
      "该空白中隐含的推理是否非显然所需的搜索范围, "
      "从而使证明检验过程可以变得相当高效. "
      "由于Mizar是为批处理使用而设计的, "
      "即在一次交互中检验可能很长的证明文本, 这一点尤为重要.")
   (P "然而, Mizar对显然推理的定义往往与人类对什么是显然的定义不一致, "
      "而且这种偏差似乎是不可避免的. 一个特别的困难在于, "
      "人们认为显然的东西可能包含关于正在被形式化的数学分支的领域特定知识. "
      "例如, 代数恒等式通常是显然或常规的, "
      "但将它们分解为Mizar能接受为显然的步骤却可能十分繁琐. "
      "更重要的是, 一旦某个结果被形式化之后, "
      "可能被视为显然的新事实似乎没有尽头 (Zammit 1999b). "
      "例如, 人们可能已经证明了在某个抽象数学分支中出现的某个二元运算符"
      (Q $o*) "满足结合律和交换律. 从那时起, 比如说"
      (&= (&o* $w (@o* $x (@o* $y $z)))
          (&o* (@o* $x $z) (@o* $w $y)))
      "这样的等式可能就被视为显然的, "
      "人们不会在一个更有趣的证明中为此多费笔墨. "
      "然而, 从结合律和交换律出发对此进行纯逻辑推导需要这些律的多个实例, "
      "因此它在Mizar的意义上并非显然.")
   (P "一个证明检查器的最初设计者几乎不可能预见到它未来的所有应用, "
      "以及那些可能因此而被视为" (Q "显然")
      "的新事实. 这表明理想的证明检验器应该是可编程的, "
      "即普通用户应当能够根据需要扩展其内置的自动化功能. "
      "只要定理证明器的基本机制是简明的且有良好的文档说明, "
      "并且源代码是公开的, 用户就没有理由不能对其进行扩展或修改" --
      "我们希望许多读者会对本书中讨论的代码做类似的事情. "
      "然而, 如果我们想要限制用户只进行逻辑上可靠的扩展, 困难就出现了, "
      "因为不可靠性会使机器检验据说更容易出错的人类证明这一整个理念都变得可疑. "
      "即使是我们在本书中实现的那些独立的自动定理证明程序, "
      "往往也比它们表面看上去更加微妙, "
      "如果发现它们偶尔包含导致不正确性的bug, 我们也不会感到意外. "
      "将大量特殊的证明方法集成到一个强大的交互式系统中而不损害可靠性, "
      "这一任务的难度要大得多.")
   (P "对这一困难的一个有影响力的解决方案是在Robin Milner领导的"
      "Edinburgh LCF项目中引入的 (Gordon, Milner和Wadsworth 1979). "
      "最初的Edinburgh LCF系统旨在支持基于" (Q "可计算函数逻辑")
      " (Scott 1993) 的PPλ逻辑中的证明" --
      "LCF这个名称由此而来. 但正如Gordon (1982) 所强调的, "
      "其核心思想同样适用于支持传统数学的更正统的逻辑, 随后许多"
      (Q "LCF风格") "的证明检查器都是基于相同的原则设计的 (Gordon 2000). "
      "LCF方法的基础是两个关键思想, 其中一个保证了灵活的可编程性, "
      "另一个则确保了逻辑可靠性."
      (Ul (Li "该系统在一种交互式编程语言中实现, "
              "用户通过该编程语言的顶层循环进行交互. 因此, "
              "用户拥有一种通用编程语言的全部能力来实现新的证明过程.")
          (Li "系统区分了一个特殊的已证定理类型 (比如说"
              (Code "thm") "), 使得任何" (Code "thm")
              "类型的东西必须是通过构造被证明的, 而非仅仅被断言的. "
              "这通过将" (Code "thm") "设为一个抽象类型来强制实现, "
              "其唯一的构造器对应于经过批准的推理方法.")))
   (P "最初的LCF项目引入了一种全新的编程语言, 名为ML (元语言), "
      "专门为实现LCF风格的证明器而设计" --
      "我们自己的实现语言Objective CAML就是它的直接后裔. "
      "我们将在OCaml中使用LCF方法实现一个一阶逻辑的证明器, "
      "但首先我们需要确定一组合适的经过批准的推理规则.")
   (H3. "一阶逻辑的证明系统")
   (P "像一阶逻辑这样的形式语言旨在成为非形式数学记号的精确版本. "
      "给定这样一种语言, 一个形式证明系统应当将数学证明中允许的步骤形式化和系统化. "
      "(这些正是Leibniz所梦想的" (Em "characteristica")
      "和" (Em "calculus") ".) "
      "抽象地说, 我们可以将证明系统简单地视为一种" (Q "可证明性")
      "关系, 通过一组我们视为允许的证明步骤的规则归纳定义. "
      "我们始终用" (G!- $p) "来表示" (Q $p "可从假设" Γ "证明")
      ", 当我们想要明确指出特定的证明系统时, 偶尔会在"
      (Q "turnstile") "符号" $!- "上附加下标.")
   (P "对于纯粹的等式推理, 一个自然的证明系统是由Birkhoff规则定义的系统 (参见第4.3节). "
      "这些规则很好地形式化了人们通常使用等式进行推理的方式, "
      "尽管用它们来证明定理可能需要极大的技巧, 但每条规则本身都相当简单. "
      "此外, 这些规则是完备的 {译注: 且是可靠的 (sound)}: " (!- Δ (&= $s $t))
      " (" (Q (&= $s $t) "可从" Δ "证明")") 当且仅当" (!= Δ (&= $s $t))
      " (" (Q (&= $s $t) "是" Δ "的逻辑推论")
      "). 我们自然希望一般一阶逻辑的证明系统也具备所有这些性质.")
   (P "第一个适用于一阶逻辑的证明系统是由Frege (1879) 发展出来的. "
      "虽然这项工作现在被视为现代逻辑演化中的关键, "
      "但在Frege生前却未受到多少重视, "
      "类似的思想由Peano, Peirce和Russell等人部分独立地发展起来. "
      "Frege的证明系统实际上远远超出了一阶逻辑的范围, "
      "并被用来支持他的" (Q "逻辑主义")
      "论题, 即所有数学都可以归约为逻辑. 在研究Frege的工作时, "
      "Russell意识到他自己的许多哲学分析早已被Frege对算术的形式化发展所预见, "
      "而且往往以更精练的形式呈现 (Frege 1893). "
      "但Russell注意到Frege的工作有一个严重的缺陷: 该逻辑系统是不一致的, "
      "实际上可以通过利用一个现在通常被称为Russell悖论的逻辑二律背反来证明任何事实, "
      "无论真假 (参见第7.1节). 尽管Peano对形式系统的表述有限, "
      "但独立发现了Russell悖论的Zermelo (1908) 声称Peano的方法同样受到该悖论的影响.")
   (P "实际上是Hilbert和Ackermann (1950) "
      "在其简短教科书1928年的原版中分离出了一阶逻辑, "
      "提出了一套精确的形式规则体系, 并提出了这些规则的完备性问题. "
      "可以说, 完备性隐含在Skolem (1922) 的一篇更早的论文中, "
      "但它首先由Gödel (1930) 明确地证明了. 此后, "
      "许多不同类型的一阶逻辑形式证明系统被引入并被证明是完备的. "
      "我们可以大致将其区分为三类:"
      (Ul (Li "Hilbert或Frege系统 (Frege 1879; Hilbert和Ackermann 1950),")
          (Li "自然演绎 (Gentzen 1935; Prawitz 1965),")
          (Li "相继式演算 (Gentzen 1935).")))
   
   (H3. "一阶逻辑的LCF实现")
   (H2. "限制")
   ))