#lang racket
(provide automated.html)
(require SMathML)
(define Γ $Gamma:normal)
(define todo.svg
  (Svg
   #:attr* '((width "320")
             (height "160")
             (stroke "black")
             (style "display: block; margin: auto;"))
   (Path #:attr* '((x "0")
                   (y "0")
                   (d "M 0 0 h 320 v 160 h -320 z")
                   (fill "none")))
   (Text #:attr* '((x "130") (y "80")) "欠一张图")))
(define ((tcomment #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "tcomment")))
   (B (format "译者注记~a." n)) " " x*))
(define $d:form
  (Mo "d" #:attr* '((lspace "0") (rspace "0"))))
(define (&d x)
  (ap $d:form x))
(define (&d/d y x)
  (&/ (&d y) (&d x)))
(define -- "&mdash;&mdash;")
(define (format-num section index)
  (and index
       (format "~a.~a" (cadr (reverse section)) index)))
(define (format-head name section index)
  (let ((num (format-num section index)))
    (if num
        (B name (format "~a. " num))
        (B name ". "))))
(define (Entry name class)
  (define (present %entry attr* . html*)
    (define id (%entry-id %entry))
    (define Attr* (attr*-set attr* 'class class 'id id))
    (define section (%entry-section %entry))
    (define index (%entry-index %entry))
    (define head (format-head name section index))
    `(div ,Attr* ,head . ,html*))
  (define (cite %entry)
    (define id (%entry-id %entry))
    (define href (string-append "#" id))
    (define section (%entry-section %entry))
    (define index (%entry-index %entry))
    (define num (format-num section index))
    (Cite `(a ((href ,href)) ,name ,num)))
  (lambda (#:id [id #f] #:auto? [auto? #t])
    (lambda (#:attr* [attr* '()] . html*)
      (cons (build-%entry #:id id #:auto? auto? #:present present #:cite cite)
            (cons attr* html*)))))
(define-syntax-rule (define-Entry* (id name class) ...)
  (begin (define id (Entry name class))
         ...))
(define-Entry*
  (Definition "定义" "definition")
  (Remark "评注" "remark")
  (Theorem "定理" "theorem")
  (Warning "警告" "warning")
  (Example "例子" "example")
  (Proposition "命题" "proposition"))
(define (H3. #:attr* [attr* '()] #:id [id #f]
             #:switch? [switch? #f] #:auto? [auto? #t] . html*)
  `(,(build-%heading #:present h3-present #:cite heading-cite
                     #:level 3 #:id id #:switch? switch?
                     #:auto? auto?)
    ,attr* . ,html*))
(define (H4. #:attr* [attr* '()] #:id [id #f]
             #:switch? [switch? #f] #:auto? [auto? #t] . html*)
  `(,(build-%heading #:present h4-present #:cite heading-cite
                     #:level 4 #:id id #:switch? switch?
                     #:auto? auto?)
    ,attr* . ,html*))
(define $space:2ex (&space 2))
(define (@@ . x*)
  (apply @ (add-between x* $space:2ex)))
(define (APP . x*)
  (apply : (add-between x* $space:2ex)))
(define $atoms (Ms "atoms"))
(define (&atoms p)
  (app $atoms p))
(define $eval (Ms "eval"))
(define (&eval p v)
  (APP $eval p v))
(define $true (Mi "true"))
(define $false (Mi "false"))
(define $~ (Mo "~"))
(define &~
  (make-op $~
           (err0 '&~)
           (lambda (x) (: $~ x))))
(define $& (Mo "&amp;"))
(define $\| (Mo "|"))
(define $<-> (Mo "&harr;"))
(define $--> (Mo "&xrarr;"))
(define $!= (Mo "&vDash;"))
(define (!= . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (: (apply &cm a*) $!= (car b*))))
(define (G!= . x*)
  (apply != Γ x*))
(define-infix*
  (&!= $!=)
  (&--> $-->)
  (&conj $conj)
  (&disj $disj)
  (&& $&)
  (&\| $\|)
  (&=> $=>)
  (&<-> $<->))
(define Σ $Sigma:normal)
(define Σ_1 (_ Σ $1))
(define-@lized-op*
  (@=> &=>)
  (@conj &conj)
  (@disj &disj)
  (@neg &neg)
  (@c* &c*))
(define automated.html
  (TnTmPrelude
   #:title "实用逻辑和自动推理手册"
   #:css "styles.css"
   (H1. "实用逻辑和自动推理手册")
   (H2 "前言")
   (P "本书是关于可以执行" (Em "自动推理")
      "的计算机程序的. 我对" (Q "推理")
      "的理解相当狭义: 重点在于形式演绎推理, "
      "而非诸如扑克博弈或医学诊断之类的问题. 另一方面, 我对"
      (Q "自动") "的理解则相当宽泛, "
      "包括人与机器协同推理的交互式方案, "
      "并且我始终关注演绎推理在现实世界问题中的应用. "
      "事实上, 除了其本身固有的魅力之外, "
      "这一学科因其工业应用而日益重要.")
   (P "本书旨在作为该领域以及逻辑推理本身的入门导引. "
      "读者无需具备数理逻辑的先修知识, 但不可避免地, "
      "拥有一定的数学背景和计算机编程经验 "
      "(尤其是函数式语言, 如 OCaml, F#, Standard ML, Haskell或LISP) "
      "将大有裨益. 与该领域众多专题性著作不同, "
      "本书力求提供一个广泛而均衡的综合性导论, "
      "并具有两个显著特点."
      (Ul (Li "纯逻辑与自动定理证明以紧密交织的方式加以阐述. "
              "逻辑学的成果在发展过程中始终着眼于其在自动定理证明中的作用, "
              "并尽可能以显式计算的方式加以展开.")
          (Li "自动定理证明方法的阐述均参照实际的具体实现, "
              "读者若能方便地使用计算机, 即可亲自进行实验. "
              "所有代码均采用高层次函数式语言OCaml编写.")))
   (P "尽管这种编排方式有待商榷, "
      "但我是在审慎考虑并广泛尝试了各种替代方案之后才采用的. "
      "更详细的自我辩护将在后文给出, "
      "但大多数读者可能希望直接跳到正文部分, 从第 xvi 页的"
      (Q "如何阅读本书") "开始.")
   (H3 "意识形态面向")
   (P "本节将更详细地阐述本书背后的写作理念, 并尝试为之辩护. "
      "我还将描述本书的关注重点以及未涵盖的主要主题. "
      "要充分理解讨论中提出的某些观点, 需要具备相关学科知识. "
      "读者可以选择跳过或略读此部分内容.")
   (P "我的首要目标是对自动定理证明领域的众多核心成果进行广泛而均衡的讨论. "
      "此外, 主要对纯数理逻辑感兴趣的读者应当发现, "
      "本书涵盖了数理逻辑主流基础教材中的大部分传统成果: "
      "紧致性, Löwenheim-Skolem定理, 证明系统的完备性, 插值, Gödel定理, 等等. "
      "但我始终力求以具体的, 显式的和算法化的方式来呈现这些结果, "
      "即使这并非自动证明器代码的直接需要, "
      "其通常都会涉及可以实际进行实验和使用的真实代码, "
      "至少在原则上如此. 例如:"
      (Ul (Li "第5.13节中插值定理的证明包含了一个构造插值公式的算法, "
              "该算法利用了先前的定理证明代码;")
          (Li "第5.5节通过显式地交替运行证明与反驳代码来演示基于有限模型性质的可判定性, "
              "而非笼统地援引定理7.13.")))
   (P "我希望许多读者能和我一样欣赏这种具体的, 亲身实践的风格. "
      "形式逻辑通常需要对繁琐的句法细节给予相当程度的关注. "
      "这对初学者而言可能颇为痛苦, "
      "因此教师和作者往往不得不在两种令人不快的选择之间权衡: "
      "(i) 以令人煎熬的详尽程度将一切和盘托出, "
      "或 (ii) 大量含糊其辞以掩盖粗疏的解释. "
      "尽管教师有充分的理由对方式(i)望而却步, 但我的教学经验表明, "
      "许多学生仍然不满于从未被告知事情全貌的感觉. "
      "通过在计算机上实现这些内容, 我认为我们可以两全其美: "
      "细节以精确的形式呈现, 但我们大体上可以让计算机去应对那些令人不快的后果.")
   (P "诚然, 过去150年来数学变得更加抽象化, 更倾向集合论, 而远离了构造性方法. "
      "这在当代模型论中尤为明显, 一些处于学科历史根基的传统主题正被逐渐淡化. "
      "但逆流而行的并非只有我一人, "
      "因为计算机的兴起正在帮助恢复显式算法方法在数学多个领域中的地位. "
      "这在代数几何及相关领域中尤为显著 "
      "(Cox, Little和O'Shea 1992; Schenk 2003), "
      "其中计算机代数, 特别是Gröbner基 (见第5.11节), 已经产生了相当大的影响. "
      "但类似的思想也正在其他领域被探索, "
      "甚至包括范畴论 (Rydeheard和Burstall 1988), "
      "后者通常被视为抽象非构造性数学的精髓. "
      "关于算法化视角在一般数学中的价值, "
      "我无法比Knuth (1974) 的这段话说得更好:"
      (Blockquote
       "有三年时间, 我在加州理工学院为数学专业的二年级学生讲授抽象代数课程, "
       "其中最困难的主题总是矩阵的" (Q "Jordan标准型")
       ". 到第三年, 我尝试了一种新方法, "
       "从算法的角度来审视这一课题, 一切突然变得清晰明了. "
       "同样的事情也发生在关于由生成元和关系定义的有限群的讨论中, "
       "以及另一门课程中的二次型约化理论上. "
       "通过以算法的方式呈现这些主题, "
       "数学定理的目的和意义变得一目了然." (Br)
       "后来, 在撰写一本关于计算机算术的书 [Knuth (1969)] 时, "
       "我发现初等数论中几乎每一个定理都以自然的, "
       "有充分动机的方式出现在使计算机进行高速数值计算的问题中. "
       "因此我认为, 传统的数论课程完全可以改用这种视角, "
       "为已然优美的理论增添一层实用的动机."))
   (P "就逻辑而言, 这种方法似乎尤为自然. 从最早期开始, "
      "逻辑学的发展就受到将推理归结为计算这一愿望的驱动: "
      (Em "logos") "一词, 即" (Q "logic")
      "的词根, 不仅意味着逻辑思维, 还意味着计算或" (Q "算账")
      ". 更近一些, 正是逻辑中的可判定性问题促使Turing等人精确定义了"
      (Q "可计算函数") "的概念, 并建立了界定算法方法范围的抽象模型. "
      "逻辑与计算之间的这种关系可以追溯到中世纪之前, 并一直延续至今. "
      "例如, 计算机系统设计与验证中的问题正在激发更多的逻辑学研究, "
      "而逻辑原理在程序设计语言的设计中也发挥着日益重要的作用. "
      "因此, 逻辑推理不仅可以被视为现代计算机时代的众多受益者之一, "
      "更可以被视为其最重要的思想源泉.")
   (P "本书的另一个可能令某些读者感到意外的特点, 是其系统性的模型论取向; "
      "相比之下, 许多其他教材如Goubault-Larrecq和Mackie (1997) 将证明论置于核心地位. "
      "我在较晚的章节 (第6章) 才引入传统的证明系统, "
      "而且几乎不提及, 更不利用自然演绎或相继式演算证明的结构性质. "
      "尽管这些主题引人入胜, "
      "但我认为经典逻辑的所有传统计算机证明方法完全可以在不借助它们的情况下很好地呈现. "
      "事实上, 用于自动定理证明的特殊反驳完备演算 (二元归结, 超归结, 等等) "
      "同样提供了关于证明范式 (canonical form) 的强有力的结果. "
      "在某些情况下, 这些结果甚至比Gentzen式证明论的结果更便于推导理论性成果 (Matiyasevich 1975), "
      "正如我们在第5.10节中仿照Lifschitz (1980) 对零点定理 (Nullstellensatz) 的证明所示. "
      "无论如何, 对于自动推理而言, "
      "特定证明系统的细节远不如对相应搜索空间的探查方式那样重要. "
      "例如, 请注意tableau方法和逆方法之间的巨大差异, "
      "尽管二者都可以被理解为对无切相继式证明的搜索.")
   (P "我希望为所描述的所有方法提供完整的, 经过仔细解释的代码. "
      "(根据我的经验, 人们很容易低估从一个看似简明的算法到具体实现之间的难度.) "
      "为了呈现几乎与通常用于描述算法的伪代码一样可读的真实可执行代码, "
      "使用一种非常高层次的语言似乎是必要的, "
      "这样就可以忽略数据表示和内存分配等具体问题. "
      "为此我选择了函数式编程语言Objective CAML (OCaml). "
      "OCaml是Edinburgh ML的后裔, "
      "后者是一种专门为编写定理证明器而设计的编程语言, "
      "已有多个主要系统用它编写.")
   (P "使用OCaml (而非诸如C或Java) 的一个缺点是许多读者对它并不熟悉. "
      "然而, 我只使用了一个简单的子集, 在附录2中有简要说明; "
      "代码风格是纯函数式的, 没有赋值或顺序执行 (除了产生诊断输出). "
      "在少数情况下 (例如在二元决策图的代码中传递状态), "
      "命令式代码可能更为简洁, 但坚持使用尽可能简单的子集似乎是值得的. "
      "纯函数式编程对于我所希望鼓励的那种探索式修改尤为方便, "
      "因为人们不必担心一个计算对其他计算产生意外的副作用.")
   (P "最后, 我以来源于McCarthy (1963) 的一段引文作为结尾, "
      "它精妙地概括了本书所蕴含的理念, "
      "暗示了逻辑作为一门真正" (Em "应用")
      "科学的潜在新角色."
      (Blockquote
       "我们有理由期望, 计算与数理逻辑之间的关系在下一个世纪将像"
       "上一个世纪分析学与物理学之间的关系那样富有成果."))
   (H4 "本书没有涵盖的内容")
   (P "尽管我力求涵盖广泛的主题, 但有所取舍是必要的, "
      "以防止本书变得庞大到难以驾驭. "
      "我聚焦于经典单类 (one-sorted) 一阶逻辑中的理论, "
      "因为在这一连贯的框架下, 自动推理的许多核心方法都可以得到展示. "
      "因此, 我不无遗憾地将一些重要领域排除在深入讨论之外, "
      "包括模型检查, 归纳定理证明, 多类 (many-sorted) 逻辑, 模态逻辑, "
      "描述逻辑, 直觉主义逻辑, lambda演算, 高阶逻辑和类型论. "
      "然而, 我相信本书将为读者深入研究上述任何领域做好充分的准备, "
      "其中许多领域恰恰最适合通过与经典一阶逻辑的对比来加以理解.")
   (P "另一个指导原则是, 只有在我认为自己能够以较为初等的水平来呈现某一主题, "
      "而无需过多技术细节或艰深理论的情况下, 才会将其纳入. "
      "这意味着我忽略了例如有序paramodulation, "
      "圆柱代数分解以及Gödel第二不完备性定理等内容. "
      "但在这些情况下, 我尽量提供了充足的参考文献, "
      "以便有兴趣的读者能够自行深入探究.")
   (H3 "致谢")
   (P "本书经过多年以随性的方式逐步演变为目前的形态. "
      "在此期间, 我先后在剑桥大学计算机实验室, "
      "Åbo Akademi大学/TUCS以及Intel公司工作, 并曾短期访问其他机构; "
      "我最要感谢的是Tania和Yestin, 感谢他们陪伴我辗转各地, "
      "并容忍我在这个项目上投入的过多时间. "
      "要在此公正地描述多年来结识的朋友和同事们对我思想的塑造程度, 是不可能的. "
      "但我要特别感谢Mike Gordon, 是他最初给了我进入这一迷人领域的机会.")
   (P "我撰写本书的部分原因在于, 据我所知, "
      "尚无现有教材能够涵盖我所希望覆盖的逻辑学与自动推理领域的广泛主题. "
      "因此, 本书的总体风格和方法是我自己的, "
      "任何现有教材都无需为其不良影响承担责任. "
      "但在纯逻辑方面, 我主要遵循了Kreisel和Krivine (1971) 对基本元定理的阐述方式. "
      "他们优雅的发展路径恰好契合我的目的, 纯粹以模型论为基础, "
      "并使用自动定理证明的常用工具, 如Skolem化和(所谓的)Herbrand定理. "
      "例如, 第5.13节中那个极具算法美感的插值定理证明, 本质上就是他们的成果.")
   (P "尽管我从事自动推理研究已近 20 年, "
      "但我仍时常在文献中发现先前不曾注意到的旧成果, "
      "或通过与同事的私人交流而得知它们. "
      "在这方面, 我感谢Grigori Mints向我指出了"
      "Lifschitz利用归结证明对零点定理的证明 (第5.10节), "
      "感谢Loïc Pottier告知我Hörmander的实数量词消去算法 (第5.9节), "
      "也感谢Lars Hörmander本人回答了我关于这一过程起源的问题.")
   (P "我非常幸运地拥有众多朋友和同事, 他们评阅了本书的草稿, "
      "给予了令人振奋的鼓励, 采用并改进了相关代码, 甚至据此进行教学. "
      "他们的影响往往使我的思路更加清晰, 有时还使我免于严重的错误, "
      "但不消说, 他们无需为文中任何残留的缺陷负责. "
      "在此衷心感谢Rob Arthan, Jeremy Avigad, Clark Barrett, Robert Bauer, "
      "Bruno Buchberger, Amine Chaieb, Michael Champigny, Ed Clarke, "
      "Byron Cook, Nancy Day, Torkel Franzén "
      "(令人惋惜的是, 他未能看到本书的最终完成), "
      "Dan Friedman, Mike Gordon, Alexey Gotsman, Jim Grundy, "
      "Tom Hales, Tony Hoare, Peter Homeier, Joe Hurd, Robert Jones, "
      "Shuvendu Lahiri, Arthur van Leeuwen, Sean McLaughlin, "
      "Wojtek Moczydlowski, Magnus Myreen, Tobias Nipkow, "
      "Michael Norrish, John O'Leary, Cagdas Ozgenc, Heath Putnam, "
      "Tom Ridge, Konrad Slind, Jørgen Villadsen, Norbert Voelker, "
      "Ed Westbrook, Freek Wiedijk, Carl Witty, Burkhart Wolff, "
      "以及无疑还有许多其他通信者, "
      "他们的贡献随着时间的流逝而被我疏忽地遗忘了, "
      "感谢他们无价的帮助.")
   (P "即使在网络时代, 能够使用优质的图书馆仍然至关重要. "
      "我要感谢剑桥大学图书馆, 计算机实验室和DPMMS图书馆, "
      "Åbo Akademi的数学和计算机科学图书馆, "
      "以及近年来波特兰州立大学图书馆和Intel图书馆的工作人员, "
      "他们经常帮助我查找晦涩的参考文献. "
      "我还要感谢无与伦比的Powell's书店 (www.powells.com), "
      "它已被证明是经典逻辑学和计算机科学文献的宝库.")
   (P "最后, 我要感谢Frances Nex极其细致入微的文字编辑工作, "
      "以及剑桥大学出版社的Catherine Appleton, Charlotte Broom, "
      "Clare Dennison和David Tranah, 他们不顾我的一再拖延, "
      "将本书引领至出版, 并提供了宝贵的建议, "
      "出版社匿名审稿人的有益评论也为此提供了有力的支持.")
   (H3 "如何阅读本书")
   (P "本书的设计是按顺序从头到尾阅读的. "
      "然而, 在学习了第1章以及第2章和第3章各自的大部分内容之后, "
      "读者便可根据自己的兴趣选读其他部分. "
      "为此, 我尽量将一些重要的交叉引用明确标出, "
      "并尽可能避免使用过于繁复或非标准的记号.")
   (P "每章末尾都附有若干练习题. "
      "这些练习几乎从不是常规性的, 有些还非常困难. "
      "这反映了我的信念: 解决一个真正具有挑战性的问题, "
      "比费力做完大量琐碎的操练题更为有趣, 也更富有教益. "
      "如果大多数题目看起来太难, 读者不必灰心. "
      "它们全部是可选的, 也就是说, "
      "不做任何练习也可以理解正文的内容.")
   (H4 "本书所使用的数学")
   (P "数学在本书中扮演着双重角色: 主题本身以数学方式处理, "
      "同时自动推理也被应用于数学中的一些问题. "
      "但在大多数情况下, 所需的数学知识并不十分高深: "
      "基础代数, 集合与函数, 归纳法, 以及也许最根本的, "
      "对证明这一概念的理解. "
      "在少数地方会用到更高深的分析和代数知识, "
      "不过我已尽量在行文中加以解释. "
      "附录1是相关数学背景的摘要, 读者可在需要时查阅, "
      "或者甚至在一开始就浏览一遍.")
   (H4 "本书中的软件")
   (P "本书的一个重要组成部分是配套软件, "
      "其中包含用OCaml编程语言编写的各种定理证明技术的简单实现. "
      "尽管不详细研究代码一般也能理解本书, 但解释往往围绕代码展开, "
      "代码被用作替代冗长而形式化的语法过程描述的手段. "
      "(例如, 第6.4-6.8节中一阶逻辑的完备性证明, "
      "以及第7.6节中Robinson算术的" Σ_1 "-完备性证明, "
      "本质上都是关于某些特定OCaml函数总能正确运行的详细非形式论证.) "
      "因此, 如果至少没有对代码如何工作的一个粗略印象, "
      "你可能会觉得本书某些部分相当吃力.")
   (P "由于我预计许多读者几乎没有或完全没有编程经验, "
      "至少在OCaml这样的函数式语言方面是如此, "
      "我在附录2中概述了一些关键概念. "
      "我并不自欺欺人地以为阅读这份简短的附录"
      "就能将一个新手变成熟练的函数式程序员, "
      "但我希望它至少能提供一些方向指引, "
      "其中也包含了读者在需要时可以进一步查阅的参考文献. "
      "事实上, 整本书都可以被视为函数式编程的一个大型案例研究, "
      "展示了许多重要的概念, 如结构化数据类型, "
      "递归, 高阶函数, 延续和抽象数据类型.")
   (P "我希望许多读者不仅会阅读代码, 还会实际运行它, "
      "将其应用于新的问题, 甚至尝试修改或扩展它. "
      "但要做到这些, 你需要一个OCaml解释器 (再次参见附录2). "
      "定理证明代码本身几乎全部以分散的方式列在正文中. "
      "由于读者实际手动输入代码大概收益甚微, "
      "所有代码均可从本书的网站 (www.cambridge.org/9780521899574) 下载, "
      "然后只需几次按键即可加载到OCaml解释器中, "
      "或者一次一个片段地复制粘贴.")
   (P "将来, 我希望在同一网址提供代码的更新, 也许还有其他语言的移植版本. "
      "关于如何运行代码的更多细节可以在那里找到, "
      "从而可以一边跟随书中的解释一边并行地试验代码, "
      "但我在这里只提几个重要的要点. "
      "最简单的方式大概是加载与本书相关的全部代码, "
      "例如在包含代码的目录 (文件夹) 中启动OCaml解释器"
      (Code "ocaml") ", 然后输入:"
      (CodeB "#use &quot;init.ml&quot;;;"))
   (P "默认环境被设置为自动将法式≪引用≫中的内容解析为一阶公式. "
      "若要使用第1章中的某些代码, 你需要将其改为解析算术表达式:"
      (CodeB "let default_parser = make_parser parse_expression;;")
      "若要使用第2章中关于命题逻辑的代码, "
      "则需要将其改为解析命题公式:"
      (CodeB "let default_parser = parse_prop_formula;;"))
   (P "除此之外, 你基本上可以随意选取你感兴趣的任何部分的代码来使用. "
      "在极少数情况下, 作为讲解流程的一部分, "
      "某个函数会先给出一个基础版本, "
      "随后再替换为同名的更完善或更高效的版本. "
      "在这种情况下, 默认环境始终会提供最新的版本; "
      "如果你希望严格跟随讲解的顺序, "
      "可能需要从源文件中复制粘贴较早的版本.")
   (P "这些代码主要是为教学目的而编写的, "
      "我始终将清晰性和/或简洁性置于效率之上. "
      "尽管如此, 它们有时在实际应用中也可能确实有用. "
      "无论如何, 在使用之前, "
      "请仔细阅读网站上列出的(极少的)法律限制条款. "
      "另外请注意, Stålmarck算法 (第2.10节) 受专利保护, 因此"
      (Code "stal.ml") "文件中的代码不应用于商业用途.")
   (H2. "引论")
   (P "本章我们引入了逻辑推理和机械化它的想法, "
      "简要触及了重要的历史性发展. "
      "我们通过讨论逻辑学中的一些最为基础的想法"
      "以及刻画符号方法是如何在计算机上实现的"
      "来为后续内容奠定基础.")
   (H3. "什么是逻辑推理?")
   (P "存在许多理由相信某个东西为真. "
      "它或许似乎是显而易见的, "
      "或许至少第一眼看上去是令人信服的, "
      "可能我们的父母之前告诉过我们, "
      "也可能是其与相关科学实现的结果达成了惊人的一致性. "
      "尽管往往是可靠的, 但是这些判断的方法也并非万无一失, "
      "其也曾被用于说服人们地球是平的, 圣诞老人是存在的, "
      "原子不可被进一步划分为更小的粒子.")
   (P (Em "逻辑") "推理相较于其他推理的不同之处在于"
      "其会避免任何未经澄清的假设, "
      "并将自身限制于不会出错且超越理性置辩的推理. "
      "为了避免作出任何无法保证的假设, "
      "逻辑推理不能依赖于要被推理的对象或者概念的任何特殊性质. "
      "这意味着逻辑推理必须从所有这样的特殊特征之中抽象出来, "
      "并在应用于其他领域时同等有效 (valid). "
      "论证之所以被接受为逻辑性的(论证), "
      "在于其与某种一般" (Em "形式")
      "的相合, 而非因为其所处理的特定" (Em "内容")
      ". 例如, 将以下的传统例子:"
      (Blockquote
       (Pre "所有人都是要死的
Socrates是一个人
因此Socrates是要死的"))
      "与下列从数学之中抽出的推理进行比较:"
      (Blockquote
       (Pre "所有正整数都是四个整数的平方之和
" 15 "是一个正整数
因此" 15 "是四个整数的平方之和"))
      "这两个论证都是正确的, 并且具有共同的模式:"
      (Blockquote
       (Pre "所有的" $X "都是" $Y "
" $a "是" $X "
因此" $a "是" $Y)))
   (P "这个推理模式是逻辑有效的, 因为其有效性并不依赖于内容: "
      (Q "正整数") "和" (Q "要死的") "的含义是无关紧要的. "
      "我们可以将" $X ", " $Y ", " $a
      "替换为任何我们喜欢的东西, 只要尊重语法范畴即可, "
      "而语句仍然保持有效. "
      "与之相对的是, 考虑以下推理:"
      (Blockquote
       (Pre "所有的雅典人都是希腊人
Socrates是一个雅典人
因此Socrates是要死的")))
   (P "尽管这个结论是全然正确的, 但是这个论证并非逻辑有效的, "
      "因为其依赖于所牵涉的项的内容. "
      "其他的具有同样的似是而非形式的论证当然也可能是假的, 例如"
      (Blockquote
       (Pre "所有的雅典人都是希腊人
Socrates是一个雅典人
因此Socrates没有胡须")))
   (P "然而, 第一个论证可以转变为一个逻辑有效的论证, "
      "通过将隐式的假设" (Q "所有的希腊人都是要死的")
      "显式化. 现在这个论证是以下一般的逻辑有效的形式的一个实例:"
      (Blockquote
       (Pre "所有的" $G "都是" $M "
所有的" $A "都是" $G "
" $s "是" $A "
因此" $s "是" $M)))
   (P "第一眼看上去, 这种对于推理的法医鉴识式分析似乎并不令人印象非常深刻. "
      "逻辑有效的推理从未告诉过我们任何关于世界的本质上新颖的东西"
      "&mdash;&mdash;正如Wittgenstein (1922) 所言, "
      (Q "当我知道天气要么下雨要么不下雨时, 我对于天气一无所知")
      ". 换言之, 如果我们" (Em "的确")
      "从推理的链条之中学到了关于世界的什么新东西, "
      "那么它必然包含" (Em "并非") "纯粹逻辑的步骤. "
      "Schilpp (1944) 中引用Russell所言:"
      (Blockquote
       "Hegel从纯粹逻辑之中推导出了世界的全部本质, "
       "包括小行星的不存在性, 其之所以能够做到这点, "
       "只是因为他逻辑无能.")
      "{原注: 为了对于Hegel公平一些, 我必须要说词汇" (Em "逻辑")
      "直到相当的最近都常以更为宽泛的含义使用, "
      "而我们所考虑的逻辑在那时应该被称为" (Em "演绎逻辑")
      ", 用以和" (Em "归纳逻辑") "进行区分, "
      "后者从观察到的数据之中得出结论, "
      "如在物质科学 (physical sciences) 里的那样.}")
   (P "但是逻辑分析可以清晰地揭示关于真实世界的"
      (Em "事实") "之间的必要关系, "
      "直接地表明何处掺入了或许不能保证的假设. "
      "例如, 根据" (Q "如果刚刚下过雨, 那么地面是潮湿的")
      "可以逻辑推出" (Q "如果地面并非超市, 那么刚刚就不可能下过雨")
      ". 这是被称为" (Em "逆否") "的一般原理的一个实例: 从"
      (Q "如果" $P "那么" $Q) "可以推出"
      (Q "如果非" $Q "那么非" $P)
      ". 然而, 从" (Q "如果" $P "那么" $Q) "到"
      (Q "如果" $Q "那么" $P) "一般" (Em "并非")
      "有效, 在这种情况下就是我们发现我们不能推出"
      (Q "如果地面是潮湿的, 那么刚刚下过雨")
      ", 因为也可能是由于爆裂的水管或者灌溉设施什么的才导致了潮湿.")
   (P "或许正如Locke (1689) 所言, 这样的例子可能是"
      (Em "琐碎的") ", 不过这种初等的逻辑谬误我们也经常会遇到. "
      "更为重要的是, 数学之中的演绎远非琐碎所能概括, "
      "而是一直使人类历史之中的一些伟大智者深深着迷, "
      "经常也使得他们感到挫败. "
      "从简单而不可辩驳的假设出发, 经过漫长而复杂的逻辑演绎链条, "
      "可以通往复杂且违反直觉的定理, 正如Hobbes所发现的 (Aubrey 1898):"
      (Blockquote
       "在一位绅士的私人书房里, Euclid的原本摊开着, "
       "翻到的是第1卷第47命题 [Pythagoras定理]. "
       "他读了这个命题. 天哪, 他说道 "
       "(他时不时会用一句有力的誓语来加强语气), "
       "这不可能! 于是他读了该命题的证明, "
       "证明将他引回到某个前置命题; 他读了那个命题. "
       "那个命题又将他引回到另一个命题, 他也读了. "
       "如此层层回溯 [et sic deinceps], "
       "最终他被严格地说服了那个真理. "
       "这使他爱上了几何学."))
   (P "的确, Euclid的开创性作品" (Em "几何原本")
      "建立了一种特定的推理风格, "
      "其经完善之后构成了如今数学的脊骨. "
      "这种风格在于先断言少量" (Em "公理") --
      "这些公理被认为具有数学内容" --
      "然后运用纯粹的逻辑推理从中推导出结论. "
      "Euclid本人并未完全实现逻辑与非逻辑的彻底分离, "
      "但他的工作最终由Hilbert (1899) 和Tarski (1959) 加以完善, "
      "他们使得一些假设显式化, 例如" (Q "Pasch公理") ".")
   (P "{原注: 可以说, 这种方法在Socrates的论辩术中已有预兆, "
      "Plato对此有所记述. 苏格拉底会引导他那些不幸的对话者, "
      "从他们自己的观点出发, 经过一连串看似不可避免的推论, "
      "从而赢得辩论. 当荒谬的结论被推导出来时, "
      "最初的立场便站不住脚了. 要使这种方法具有其令人叹服的力量, "
      "每一步推理都必须毫无疑义, 且不能暗中引入任何隐含的假设.}")
   (H3. "Calculemus!")
   (P (Q "推理就是算账 (reckoning).")
      " 在本书的卷首语中我们引用了Hobbes关于逻辑推理和数值计算之间的相似性的阐述. "
      "尽管Hobbes应该因为使得这个想法更为广为人知而受到嘉奖, "
      "这个想法本身即便在1651年也不是全新的. "
      "的确由Plato和Aristotle所使用以代表推理或者逻辑思维的希腊词汇"
      (Em "logos") "在其他上下文中也可能表示计算或者算账. "
      "当古希腊哲学家的作品在中世纪的欧洲广为人知的时候, " (Em "logos")
      "一般被翻译为" (Em "ratio") ", 这是代表算账的拉丁词汇 "
      "(因而有了英语词汇rational, ratiocination, 等等). "
      "即便在如今的英语里, 我们有时也能听到"
      (Q "I reckon that ...") ", 这里的" (Q "reckon")
      "指的是某种推理而并非字面意义上的要去计算.")
   (P "然而, 推理和算账之间的联系在Gottfried Wilhelm von Leibniz (1646–1716) "
      "的作品之前几乎只是一种暗示性的口号. "
      "Leibniz相信一个根据计算进行推理的系统必须包含两个基本组件:"
      (Ul (Li "一种通用语言 (" (Em "characteristica universalis")
              "), 由此可以表达任意的东西;")
          (Li "一种推理演算 (" (Em "calculus ratiocinator")
              "), 用于判定以" (Em "characteristica")
              "表达的断言的真假.")))
   (P "Leibniz梦想着有朝一日不能达成一致意见的双方不会陷入徒劳的争辩, "
      "而是将他们的不一致转换为" (Em "characteristica")
      ", 然后彼此言称" (Q "calculemus") " (让我们计算吧). "
      "他甚至可能设想过让机器来完成这些计算. "
      "那时候, 各种机械计算装置已被设计和建造出来, "
      "Leibniz本人也在1671年设计了一台能够进行乘法运算的机器, "
      "并说道:"
      (Blockquote
       "杰出之人不应像奴隶一样, 将大量时间耗费在计算的苦役上, "
       "如果使用机器的话, 这些工作完全可以放心地交给任何人去做."))
   (P "因此, Leibniz预见了使自动推理成为可能的基本要素: "
      "一种精确表达思想的语言, "
      "在该语言中操纵思想的计算规则, "
      "以及这种计算的机械化. "
      "莱布尼茨在实现这些构想方面的具体成就是有限的, "
      "且直到近年来才为人所知. "
      "但尽管他的工作对技术发展的直接影响有限, "
      "他的梦想在今天仍然引起共鸣.")
   (H3. "符号化")
   (P "Leibniz将注意力放在建立合适的语言这一基本的首要步骤上是正确的. "
      "然而, 他太过雄心壮志以至于想要表达人类思维的所有方面. "
      "最终的进步来自于扩展已经在数学中所使用的符号记号的应用范围. "
      "例如, 如今我们会说" (Q (&<= $x^2 (&+ $y $z))) "而非"
      (Q $x "乘上自身小于等于" $y "与" $z "之和")
      ". 随着时间推移, 越来越多的数学开始以形式符号记号表达, "
      "取代了自然语言渲染. 对此我们可以找到几个坚实的理由.")
   (P "首先, 一套精心选择的符号形式通常更加简短, 减少了无关信息的干扰, "
      "有助于更简洁更直观地表达思想 (至少对于内行人而言是如此). "
      "例如, 莱布尼茨本人发明的微分记号" (&d/d $y $x)
      ", 巧妙地传达了小差分之比的思想, 并使得像链式法则"
      (&= (&d/d $y $x) (&d* (&d/d $y $u) (&d/d $u $x)))
      "这样的定理, 凭借与普通代数的类比, 看起来就显得合情合理.")
   (P "其次, 使用更加规范化的表达形式可以避免日常语言中的一些歧义, "
      "从而更精确地传达含义. "
      "对词语确切含义的疑虑在许多领域都很常见, 尤其是在法律领域. "
      "数学也无法免于类似的根本分歧, 即对一个定理究竟在说什么, "
      "或其成立条件究竟是什么的争论, "
      "而且对这些问题的共识会随时间而改变 "
      "(Lakatos 1976; Lakatos 1980).")
   (P "最后, 也许也是最重要的一点, "
      "一套精心选择的符号记法能够使数学推理本身变得更加容易. "
      "一个简单但极为出色的例子是数的" (Q "位值 (positional)")
      "表示法, 其中一个数由一串数字符号表示, 每个符号隐含地乘以"
      (Q "基数 (base)") "的某个幂次. 在十进制中, 基数为" 10
      ", 我们将数码序列" (Q 179) "理解为:"
      (MB (&= 179 (&+ (&c* $1 (^ 10 $2))
                      (&c* $7 (^ 10 $1))
                      (&c* $9 (^ 10 $0)))) "."))
   
   (H3. "Boole的逻辑代数" #:id "algebra-of-logic")
   (P "词汇" (Em "algebra") "来源于阿拉伯语的" (Q "al-jabr")
      ", 最早在九世纪由Mohammed al-Khwarizmi (约780-850) 使用, "
      "而他的名字正是" (Q "算法 (algorithm)") "一词的词源. "
      (Q "al-jabr") "一词的字面意思是" (Q "重新结合")
      ", 但花拉子密用它来特指他通过合并 (" (Q "重新结合")
      ") 同类项来解方程的方法, 例如从" (&= (&+ $x $4) (&- $6 $x))
      "变换到" (&= (&i* $2 $x) (&- $6 $4)) ", 进而得到解"
      (&= $x $1) ". 在此后的几个世纪里, 历经欧洲文艺复兴时期, "
      "代数的含义本质上一直是用于解方程的运算规则.")
   (P "在十九世纪, 传统意义上的代数达到了它的极限. "
      "此前的核心关注点之一是求解越来越高次的方程, "
      "但Niels Henrik Abel (1802-1829) 在1824年证明, "
      "对于五次及五次以上的多项式方程, "
      "不存在利用此前对低次方程有效的"
      (Q "根式") "表达式来求解的一般方法. "
      "然而与此同时, 代数的范围也在扩展并走向一般化. "
      "传统上, 变量代表的是实数, 通常是有待确定的未知数. "
      "但很快, 将所有常规的代数运算规则应用于" (Q "虚")
      "量" $i "并假定其具有形式性质" (&= $i^2 $-1)
      ", 成为了标准做法. "
      "尽管这一做法在很长一段时间内缺乏严格的证明, "
      "但它确实行之有效.")
   (P "代数方法甚至被应用于通常意义上并非数的对象, "
      "如矩阵和Hamilton的 " (Q "四元数") ", 即使代价是放弃通常的乘法"
      (Q "交换律") (&= (&i* $x $y) (&i* $y $x))
      ". 人们逐渐认识到, 符号的潜在解释可以被忽略, "
      "只要一劳永逸地确立了所使用的运算规则在该解释下都是有效的. "
      "George Boole (1815-1864) 对这一状况做了颇具远见的描述:"
      (Blockquote
       "凡熟悉符号代数理论现状者皆知, "
       "分析过程的有效性并不取决于所使用符号的解释, "
       "而仅仅取决于它们的组合法则. "
       "凡不影响所假定关系之真实性的解释体系, "
       "都同样可以被接受; 事实上, "
       "同一过程在一种解释方案下可以代表一个关于数的性质的问题的解, "
       "在另一种解释方案下可以代表一个几何问题的解, "
       "在第三种解释方案下则可以代表一个动力学或光学问题的解. "
       "(Boole 1847)"))
   (P "Boole进而指出, 尽管如此, 由于历史或文化的偶然因素, "
      "当时所有的代数所涉及的对象在某种意义上都是量化的 (quantitative). "
      "转而他引入了一种代数, 其对象要被解释为真或假的" (Q "真值")
      ", 而其中的变量则表示" (Em "命题")
      ". 使用命题这个词汇, 我们指的是一个断言, "
      "其作出了对于事实的声明, "
      "因而可以有意义地被认为要么为真要么为假. "
      "{译注: 这里说的断言, 和类型论里的判断, "
      "在技术意义上不同, 作者只是生活化地使用这个名词.} "
      "例如, " (Q (&< $1 $2)) ", " (Q "所有人都是要死的")
      ", " (Q "月球由奶酪构成") ", "
      (Q "存在无限多个素数" $p "使得" (&+ $p $2) "也是素数")
      "都是命题的例子. 根据我们现有的知识水平, "
      "前两个命题为真, 第三个为假, 第四个的真值则是未知的 "
      "(此即所谓的孪生素数猜想, 数学界的著名开放问题).")
   (P "{原注: 实际上Boole给出了两种不同但有关联的解释: "
      "一种是" (Q "类的代数") ", 另一种是" (Q "命题的代数")
      "; 我们将会专注于后者.} "
      "{译注: 这里说的类, 应该指的是某个固定集合的子集.}")
   (P "我们熟悉对数施加各种算术运算, 如一元的" (Q "负 (minus)")
      " (取相反数) 以及二元的" (Q "乘") " (乘法) 和" (Q "加")
      " (加法). 以完全类似的方式, "
      "我们可以使用所谓的逻辑联结词来组合真值, "
      "例如一元的" (Q "非") " (逻辑否定或补) 以及二元的"
      (Q "与") " (合取) 和" (Q "或") " (析取). 而且, "
      "在书写表达式时, 我们可以用字母来代表任意命题, "
      "正如代数中用字母代表数一样. "
      "Boole在对于他的系统的精确表述中, "
      "以及对于许多逻辑常量和联结词使用熟悉的代数符号时, "
      "强调了其与普通算术之间的联系:"
      (let ((TrTd* (lambda x* (apply Tr (map Td x*)))))
        (Table
         #:attr* '((align "center")
                   (border "1")
                   (style "border-collapse: collapse;"))
         (TrTd* $0 "假")
         (TrTd* $1 "真")
         (TrTd* (&i* $p $q) (Span $p "且" $q))
         (TrTd* (&+ $p $q) (Span $p "或" $q)))))
   (P "在这种解释之下, 许多令人熟悉的代数定律仍然成立. 例如, "
      (Q $p "且" $q) "总是和" (Q $q "且" $p)
      "具有相同的真值, 所以我们可以认为交换律"
      (commute &i* $p $q) "成立. 类似地, 既然" $0
      "是假, 那么" (Q $0 "且" $p) "不论" $p
      "是什么总是为假, 即" (&= (&i* $0 $p) $0)
      ". 但是, 命题的布尔代数满足额外的定律, "
      "其没有算术的对应物, 特别是"
      (&= $p^2 $p) ", 其中" $p^2
      "是" (&i* $p $p) "的缩写.")
   (P "在日常英语里, 词汇" (Q "或")
      "是有歧义的. 复合命题" (Q $p "或" $q)
      "可以解释为可兼的或 (" $p "或" $q
      "或两者都成立), 也可以解释为不可兼的 ("
      $p "或" $q "但是不能两者都成立). "
      "日常使用里经常隐含了两种情况是互斥的 "
      "(例如" (Q "我会明天做或者后天做")
      "). Boole原本的系统限制了这种代数, 以使得"
      (&+ $p $q) "只有在" (&= (&i* $p $q) $0)
      "时才有意义, 就像在普通代数里"
      (&/ $x $y) "只有在" (&!= $y $0)
      "时才有意义. 然而, 遵循Boole的继任者"
      "William Stanley Jevons (1835–1882), "
      "习惯上我们允许不加限制的" (Q "或")
      ", 并以可兼的方式解释它. "
      "我们总是会按照如今标准的含义理解"
      (Q "或") ", " (Q $p "或" $q) "的意思是"
      (Q $p "或" $q "或两者都成立") ".")
   ((tcomment)
    "个人认为这一小节的叙述有点将命题和命题的真值混为一谈了, "
    "但是这算是传统实践.")
   (H4. "机械化")
   (P "甚至在Boole之前, 用于逻辑推演的机器就已经被开发出来了, "
      "其中最著名的是由Charles Stanhope "
      "(第三代Stanhope伯爵, 1753–1816) 发明的"
      (Q "Stanhope演示器") ". 受此启发, Jevons (1870) 随后设计并建造了他的"
      (Q "逻辑机器") ", 这是一种类似钢琴的装置, "
      "能够在Boole的类代数中执行某些运算. "
      "然而, 由于机械工程的局限性以及逻辑学本身发展的缓慢, "
      "推理的机械化真正开始蓬勃发展是在稍晚的时期, 即现代计算机时代的开端. "
      "我们将在本书后续章节中结合技术发展进一步介绍这段历史. "
      "Jevons的原始机器现陈列于Oxford科学史博物馆.")
   (H4. "逻辑形式")
   (P "在1.1节中, 我们谈到了论证" (Q "具有相同的形式")
      ", 但并未对此给出精确的定义. "
      "事实上, 对于用英语或其他自然语言表达的论证而言, "
      "要做到这一点是很困难的, "
      "因为自然语言往往无法清楚地呈现句子的逻辑结构: "
      "表面上的相似性可能掩盖根本性的结构差异, 反之亦然. "
      "例如, 英语中的" (Q "is") "既可以表示"
      (Q "具有...的性质") " (" (Q $4 " is even") "), 也可以表示"
      (Q "和...相同") " (" (Q (&+ $2 $2) " is " $4)
      "). 这个例子以及类似的情况常常引发哲学上的混淆.")
   (P "一旦我们拥有了逻辑概念的精确符号体系 "
      "(如Boole的逻辑代数), 我们就可以简单地说: "
      "两个论证具有相同的形式, "
      "如果它们都是相同的形式表达式的实例, "
      "实例化是通过一致地将变量替换为其他命题得到的. "
      "并且我们可以利用形式语言对逻辑上有效的论证给出数学上精确的定义. "
      "这并不意味着逻辑形式和纯逻辑论证的定义"
      "在哲学上是一个无足轻重的问题; 恰恰相反. "
      "但我们满足于不去解决这个问题, "
      "而是通过采纳一个精确的数学定义来巧妙地绕过它, "
      "正如Hertz (1894) 回避了力学中" (Q "力")
      "的含义这一问题一样. 在积累了足够的具体经验之后, "
      "我们将简要探讨 (第7.8节) 我们对逻辑论证的界定"
      "如何与一些传统的哲学区分相对应.")
   (H3. "句法和语义")
   (P "逻辑学的一个独特之处在于它严格区分符号表达式与其所代表的对象. "
      "这一点值得特别强调, 因为在日常数学中, "
      "我们常常不自觉地从符号直接过渡到符号所指称的数学对象. "
      "例如, 当我们读写" (Q 12) "时, 我们将其视为一个数, 即集合"
      $NN "的一个元素, 而非用来表示该数的两个数码符号的序列. "
      "然而, 当我们想要精确地进行形式化操作时, "
      "无论是逐位相加十进制数, "
      "还是运用代数法则重排符号表达式, 我们都需要维持这种区分. "
      "毕竟, 当推导出诸如" (&= (&+ $x $y) (&+ $y $x))
      "这样的等式时, 整个的要义在于两边所指称的数学对象是相同的; "
      "如果我们只考虑潜在意义 (underlying meaning), "
      "那么我们就不能直接讨论这样的形式操作.")
   (P "因此, 通常我们关注的是: "
      "(i) 某个特定的合法形式表达式集合, 以及 "
      "(ii) 它们对应的意义. 这两者被严格区分开来, "
      "但通过一种解释联系在一起, "
      "解释将表达式映射至它们的意义:"
      (MB "[表达式]" (^^ $-> "解释") "[意义]"))
   (P "形式化表达式与其意义之间的区分在语言学中同样重要, "
      "我们将借用该学科的一些术语. 语言学有两个传统的子领域: "
      "句法学, 关注句子的语法构成; 语义学, 关注句子的意义. "
      "类似地, 在逻辑学中, 我们通常将那些" (Q "如同代数运算")
      "般脱离意义而独立考察的方法称为" (Q "句法的")
      ", 而将意义起重要作用的方法称为" (Q "语义的")
      ". " (Q "句法") "和" (Q "语义")
      "这两个词在语言学中还有更具体的含义, "
      "这些含义同样被逻辑学所采纳."
      (Ul (Li "一种语言的" (Em "句法") "是一套语法规则体系, "
              "规定了如何生成或识别合乎语法的短语和句子. "
              "例如, 我们会认为" (Q "I went to the shop")
              "是合乎语法的英语, 而" (Q "I shop to the went")
              "则不是, 因为名词和动词的位置被交换了. "
              "在逻辑系统中同样如此, "
              "我们通常也会有规则告诉我们如何生成或识别合式表达式, "
              "例如允许" (Q (&+ $x $1)) "但不允许"
              (Q (M $+ $1 $c*)) ".")
          (Li "一个特定单词, 符号, 记号或短语的" (Em "语义") "就是它的意义. "
              "更广泛地说, 一种语言的语义是一种系统性地为该语言中所有 "
              "(合乎语法的) 表达式赋予意义的方式. 用语言学术语来说, "
              "选择一种解释恰好就等同于为该语言给出一套语义.")))
   (H4. "对象语言和元语言")
   (P "我们将要描述执行逻辑推理的形式规则, "
      "然而又要用...逻辑来对这些规则进行推理, 这可能会令人困惑! "
      "在这方面, 将我们所谈论的(形式)逻辑与"
      "我们用来对其进行推理的(日常直觉)逻辑之间的区别牢记在心是有益的. "
      "为了强调这一对比, 我们有时会使用以下语言学术语. "
      "元语言是用来谈论另一种不同的对象语言的语言, "
      "类似地, 元逻辑是用来对于对象逻辑进行推理的. "
      "因此, 我们通常将关于形式逻辑和自动推理系统所推导出的定理称为元定理, 而不仅仅是定理. "
      "这样做不(只)是为了听起来更宏大, 而是为了强调它们与在那些形式系统内部表达的"
      (Q "定理") "之间的区别. 同样, 应用于形式化数学证明的元逻辑推理通常被称为元数学 "
      "(参见第7.1节). 顺便提一下, 我们所选用的编程语言OCaml源自Edinburgh ML, "
      "后者是专门为编写定理证明程序而设计的 (Gordon, Milner和Wadsworth 1979), 其名称代表"
      (Q "元语言 (Meta Language)") ". 这种对象-元的区分 (Tarski 1936; Carnap 1937) "
      "并不局限于逻辑语言. 例如, 在一堂用英语讲授的俄语课上, "
      "我们可以将俄语视为对象语言, 而将英语视为元语言.")
   (H4. "抽象和具体句法")
   (P "句法的细节并无根本性的重要意义. "
      "数学有时是打印的, 有时是手写的, "
      "人们做出各种本质上任意的选择, "
      "这些选择并不改变符号组合使用的结构方式. "
      "在计算机上实现逻辑的机械化时, 为简便起见, "
      "我们将限制自己只使用标准的ASCII字符集, "
      "其中包括无重音的拉丁字母, 数字以及一些常见的标点符号和空格. "
      "对于许多逻辑学家使用的花体字母和特殊符号, "
      "我们将用其他字母或单词来替代, 例如用"
      (Q "forall") "代替" (Q $forall)
      ". 不过, 在理论讨论中我们仍将继续使用通常的符号. "
      "这种不断的转换对于此前未见过或未理解这些符号的读者"
      "而言甚至可能是有帮助的.")
   (P "无论符号表达式是如何读写的, "
      "以一种更能反映其结构的形式来操作它们会更加方便. "
      "考虑普通代数中的表达式"
      (Q (&- (&+ $x (&c* $y $z)) $w))
      ". 这种线性形式掩盖了有意义的结构. "
      "要理解哪些运算符作用于哪些子表达式, "
      "甚至要弄清什么构成一个子表达式, "
      "我们需要了解优先级和结合性的规则, 例如"
      (Q $c*) "比" (Q $+) (Q "绑定更紧")
      ". 举例来说, 尽管在线性形式中它们看起来很相似, "
      (Q (&c* $y $z)) "是一个子表达式, 而" (Q (&+ $x $y))
      "却不是. 即使我们通过完全加括号将结构显式化, 写成"
      (Q (&- (@+ $x (@c* $y $z)) $w))
      ", 对表达式进行基本的有用操作, "
      "如查找子表达式或对变量的特定值求值, "
      "也会变得难以精确描述; "
      "人们需要在公式中来回移动以匹配括号.")
   (P (Q "树") "结构则好得多: "
      "正如家谱树能清晰地展示家族成员之间的关系, "
      "表达式的树形表示能够显示其结构, "
      "并使大多数重要的操作变得直截了当. "
      "如同在家谱学中一样, "
      "习惯上将树画成在印刷页面上向下生长的形式, "
      "因此同一个表达式可以表示如下:"
      todo.svg)
   (P "通常我们将人们使用的(主要是线性的)格式称为具体句法, "
      "而将用于操作的结构性(通常是树状的)形式称为抽象句法. "
      "像上面这样的树通常被称为抽象句法树 (AST), "
      "它们作为形式语言的内部表示被广泛应用于各种符号处理程序中, "
      "包括将高级编程语言翻译为机器指令的编译器.")
   (P "尽管树形结构使表达式的结构更加清晰, "
      "大多数人还是不愿意用树来思考或交流, "
      "而更倾向于使用结构性较弱的具体句法. "
      "因此, 在我们的定理证明程序中, "
      "我们需要将输入从具体句法转换为抽象句法, "
      "并将输出从抽象句法转换回具体句法. "
      "这两项任务, 在计算机科学家那里分别被称为句法分析和美观打印, "
      "如今已被很好地理解并且相当常规. "
      "编写解析器和美观打印器的少量额外开销, "
      "可以通过树形结构在内部操作上带来的更大便利得到充分回报. "
      "存在一些对于诸如" (Q "波兰记号") ", "
      (Q "逆波兰记号 (RPN)") ", 以及LISP的" (Q "S-表达式")
      "这样的具体句法系统的狂热倡导者, "
      "其中我们的表达式按照这些记号分别会记作"
      (CodeB "- + x × y z w")
      (CodeB "x y z × + w -")
      (CodeB "(- (+ x (× y z)) w)")
      "但是我们会使用更为传统的记号, 有着像" (Q $+)
      "这样的中缀运算符, 以及优先级和括号规则.")
   (H3. "符号计算和OCaml" #:id "symbolic-computation-and-ocaml")
   (P "现代计算的早期人们普遍相信计算机基本上是用来进行数值计算的设备 (Ceruzzi 1983). "
      "其输入和输出设备确实也在某种程度上偏向于这一方向: "
      "当Samuels在1948年于IBM写下第一个跳棋程序时, "
      "他不得不将输出编码为一个数字, 因为这就是唯一可以打印的内容了. "
      "然而, 远在Turing从理论上构造通用机器 (参见第7.5节) 之前, "
      "人们就已经认识到计算机的潜在应用范围要广泛得多. "
      "例如, Ada Lovelace在1842年就观察到 (Huskey和Huskey 1980):"
      (Blockquote
       "许多不熟悉数学研究的人想象, "
       "因为[Babbage的分析]引擎的任务是以数字符号给出其结果, "
       "所以其过程的性质必然是算术的和数值的, 而非代数的和解析的. "
       "这是一个错误. 该引擎能够对其数值量进行排列和组合, "
       "恰如它们是字母或任何其他一般性符号一样; "
       "事实上, 如果做了相应的安排, "
       "它完全可以以代数符号形式输出其结果."))
   (P "如今已有许多执行符号计算的程序, 其中包括各种相当成功的"
      (Q "计算机代数系统")
      " (CAS). 定理证明程序与计算机代数系统有着很强的家族相似性, "
      "甚至在它们能够解决的某些问题上存在重叠 (例如参见第5.11节).")
   (P "从事符号计算的人的关注点影响了他们偏好的编程语言. "
      "许多系统程序员青睐C, 数值分析人员偏好FORTRAN, 诸如此类, "
      "而符号计算程序员通常更喜欢更高级的语言, "
      "这些语言使典型的符号操作更加便捷, "
      "将程序员从内存表示等显式细节中解放出来. "
      "我们选择使用Objective CAML (OCaml)作为本书编程示例的载体. "
      "我们的代码没有使用OCaml中任何较为特殊的特性, "
      "应当很容易移植到相关的函数式语言, "
      "如F#, Standard ML或Haskell.")
   (P "我们坚持使用显式的OCaml代码, 对于没有计算机编程经验的读者, "
      "或者只了解C或Java等命令式低级语言的读者来说, 可能会感到不安. "
      "然而, 我们希望借助附录2以及本章末尾推荐的一些标准教材的额外学习, "
      "有决心的读者能够掌握足够的OCaml知识来跟上讨论并动手实践代码. "
      "作为OCaml中符号计算的一个温和入门, "
      "我们现在将在普通代数这一许多读者所熟悉的领域中实现一些简单的操作.")
   (P "第一个任务是定义一个数据类型以表示代数表达式的抽象句法. "
      "我们允许表达式由诸如" (Code "0") ", " (Code "1") ", "
      (Code "33") "这样的数值常量以及诸如" (Code "x") "和"
      (Code "y") "这样的命名变量通过加法 (" (Q (Code "+"))
      ") 和乘法 (" (Q (Code "*")) ") 运算构筑而成. "
      "以下是相应的递归数据类型声明:"
      (CodeB "type expression =
   Var of string
 | Const of int
 | Add of expression * expression
 | Mul of expression * expression;;"))
   (P "也就是说, 一个表达式要么是由一个字符串标识的变量, "
      "要么是由其整数值标识的常量, "
      "要么是一个加法或乘法运算符作用于两个子表达式. ("
      (Q (Code "*")) "表示一个类型构造器的定义域是一个笛卡尔积, "
      "因此它可以接受两个表达式作为参数. "
      "这与所定义的乘法运算毫无关系!) "
      "我们可以使用这个类型定义所引入的句法构造器"
      "来创建任何特定表达式的符号表示, 例如"
      (&+ (&c* $2 $x) $y) ":"
      (CodeB "# Add(Mul(Const 2,Var &quot;x&quot;),Var &quot;y&quot;);;
- : expression = Add (Mul (Const 2, Var &quot;x&quot;), Var &quot;y&quot;)"))
   (P "符号计算的一个简单但具有代表性的例子是应用指定的变换规则, 如"
      (&--> (&+ $0 $x) $x) "和" (&--> (&+ $3 $5) $8)
      ", 来" (Q "化简") "一个表达式. "
      "每条规则在OCaml中通过一个起始模式和一个终止模式来表达, "
      "例如" (Code "Add(Const(0),x) -> x") "对应变换"
      (&--> (&+ $0 $x) $x) ". (特殊模式" (Q (Code "_"))
      "可以匹配任何内容, 因此最后一行确保了当没有其他模式匹配时, "
      (Code "expr") "将被原样返回.) "
      "当函数被调用时, OCaml会按顺序遍历这些规则, "
      "并应用第一条起始模式与输入表达式" (Code "expr")
      "匹配的规则, 将像" (Code "x")
      "这样的变量替换为相应的子表达式."
      (CodeB "let simplify1 expr =
  match expr with
    Add(Const(m),Const(n)) -> Const(m + n)
  | Mul(Const(m),Const(n)) -> Const(m * n)
  | Add(Const(0),x) -> x
  | Add(x,Const(0)) -> x
  | Mul(Const(0),x) -> Const(0)
  | Mul(x,Const(0)) -> Const(0)
  | Mul(Const(1),x) -> x
  | Mul(x,Const(1)) -> x
  | _ -> expr;;"))
   (P "然而, 仅化简一次并不一定足够; "
      "我们更希望反复化简, 直到无法再取得进展为止. "
      "为此, 让我们以自底向上的方式对表达式树进行遍历来应用上述函数, "
      "这将以级联的方式进行化简. 按照传统的OCaml递归风格, "
      "我们首先尽可能地化简所有直接子表达式, "
      "然后对结果应用" (Code "simplify1") ":"
      (CodeB "let rec simplify expr =
  match expr with
    Add(e1,e2) -> simplify1(Add(simplify e1,simplify e2))
  | Mul(e1,e2) -> simplify1(Mul(simplify e1,simplify e2))
  | _ -> simplify1 expr;;"))
   (P "与简单的自底向上遍历相比, "
      "一种更精细的方法是将自顶向下和自底向上的化简混合使用. "
      "例如, 如果" $E "非常大, 那么将" (&c* $0 $E) "直接化简为"
      $0 "而不检查" $E "的内容似乎更为高效. "
      "然而, 这需要谨慎实现, 以确保所有可化简的子项都被化简, "
      "同时避免无限循环的危险. 不管怎样, "
      "以下是我们的化简函数作用于表达式"
      (&+ (&c* (@+ (&c* $0 $x) $1) $3) 12) "的效果:"
      (CodeB "# let e = Add(Mul(Add(Mul(Const(0),Var &quot;x&quot;),Const(1)),Const(3)),
              Const(12));;
val e : expression =
  Add (Mul (Add (Mul (Const 0, Var &quot;x&quot;), Const 1), Const 3), Const 12)
# simplify e;;
- : expression = Const 15"))
   (P "走到这一步, 使用标准的OCaml函数式编程技术是很直接的: "
      "用递归数据类型表示树结构, 通过模式匹配和递归来定义函数. "
      "我们希望此前未使用过类似语言的读者能够开始理解为什么OCaml对符号计算具有吸引力. "
      "当然, 那些钟爱其他编程语言的读者完全可以将我们的代码翻译成他们所喜欢的语言.")
   (P "按照计划, 我们将实现一个句法分析器和美观打印器, "
      "用于在抽象句法树和具体字符串 (如" (Q (Code "x + 0"))
      ") 之间进行转换, 并将它们设置为由OCaml自动调用, "
      "以完成表达式的输入和输出. "
      "我们的具体句法以普通代数记号为蓝本, "
      "但在两个方面我们将参照计算机语言而非传统数学的做法. "
      "我们允许任意长的" (Q "词")
      "作为变量, 而数学家传统上大多使用带上标和下标的单个字母; "
      "鉴于ASCII字符集的有限性, 这一点尤为重要. "
      "此外, 我们要求乘法必须用一个显式的中缀符号来书写 ("
      (Q (Code "x * y")) "), 而不是简单的并置 ("
      (Q (Code "x y")) "), 因为后者我们稍后将用于函数应用. "
      "在日常数学中, 我们通常依赖诸如变量名和背景知识"
      "之类的非正式线索来一眼看出" (app $f (&+ $x $1))
      "表示函数应用而" (&i* $y (@+ $x $1))
      "表示乘法, 但这种依赖上下文的解析实现起来要复杂一些.")
   (H3. "句法分析 (parsing)")
   (P "将具体句法转换为抽象句法是一个已被充分理解的课题, "
      "因为它对编程语言的编译器, 解释器和翻译器具有核心重要性. "
      "现在的惯例是将这一转换分为两个独立的阶段:"
      (Ul (Li "词法分析 (扫描) 将输入的字符序列分解为"
              (Q "词元 (token)") " (粗略地说, 就是词);")
          (Li "句法分析将词元的线性序列转换为抽象句法树.")))
   (P "例如, 词法分析可能会将输入" (Q (Code "v10 + v11"))
      "拆分为三个词元" (Q (Code "v10")) ", "
      (Q (Code "+")) "和" (Q (Code "v11"))
      ", 将相邻的alphanumeric字符合并成词, "
      "并丢弃这些记号之间任意数量的空格 (甚至可能包括换行符). "
      "这样, 句法分析只需处理词元序列, 而可以忽略更底层的细节.")
   (H4. "词法分析")
   
   (H4. "句法分析")
   (H3. "美观打印 (prettyprinting)")
   (H3. "深入阅读")
   (P "我们在此仅列出一般性的参考文献, "
      "以及那些后续章节中不会深入讨论的主题的相关文献. "
      "更具体和更技术性的参考文献将在后续各章末尾给出.")
   (P "Davis (2000) 和Devlin (1997) 是关于逻辑及其机械化发展的综合性著作, "
      "同时也涉及计算机科学和语言学中的相关课题. "
      "关于逻辑的入门教材有很多, "
      "如Hodges (1977), Mates (1972) 和Tarski (1941). "
      "有两本逻辑著作与本书一样附带了计算机程序, "
      "分别是Keisler (1996) 以及Barwise和Etchemendy (1991). "
      "此外还有若干著作仔细探讨了逻辑推理在数学中的作用, "
      "例如Garnier和Taylor (1996).")
   (P "Bochénski (1961), Dumitriu (1977) 以及Kneale和Kneale (1962) "
      "是关于逻辑史的详尽而严谨的学术著作. "
      "Kneebone (1963) 是一部数理逻辑综述, 其中也包含大量历史资料, "
      "而Marciszewski和Murawski (1995) 则与本书一样强调机械化这一主题. "
      "关于Jevons的逻辑钢琴以及其他早期" (Q "推理机器")
      "的生动介绍 (可以追溯至十三世纪西班牙神秘主义者"
      "Ramon Lull的工作), 参见Gardner (1958). "
      "MacKenzie (2001) 是关于自动定理证明发展及其应用的历史概述.")
   (P "有许多哲学逻辑导论著作更深入地讨论了诸如"
      "逻辑后承 (logical consequence) 的概念等议题, "
      "例如Engel (1991), Grayling (1990) 和Haack (1978). "
      "具有哲学倾向的读者或许会有兴趣审视Mill (1865) 和Mauthner (1901) "
      "关于逻辑后承不过是一种心理偶然现象的主张, "
      "以及Frege (1879) 和Husserl (1900) 针锋相对的论战式回应.")
   (P "关于OCaml和函数式编程的更多参考文献, 请参见附录2. "
      "我们所描述的基本句法分析技术几乎"
      "在每一本编译技术著作中都有详细阐述. "
      "由Aho, Sethi和Ullman (1986) 所著的" (Q "龙书")
      "长期以来被视为经典, "
      "不过对于主要兴趣不在句法分析方面的读者来说, "
      "其关于句法分析的论述可能过于详尽. "
      "对哪些句法分析任务是可判定的, "
      "哪些是不可判定的进行详细的理论分析, "
      "自然引向可计算性理论. Davis, Sigal和Weyuker (1994) "
      "不仅全面地涵盖了这方面的内容, 而且本身也是一本逻辑教材. "
      "关于美观打印的更多内容, 参见Oppen (1980b) 和Hughes (1995).")
   (P "与本书风格相同的, 面向实现的定理证明讨论, "
      "还见于Huet (1986), Newborn (2001) 和Paulson (1992), "
      "而Gordon (1988) 也以类似风格描述了定理证明器在程序验证环境中的应用. "
      "其他关于自动定理证明的综合性教材包括"
      "Chang和Lee (1973), Duffy (1991) 和Fitting (1990), "
      "此外还有一些更专门的著作将在后文中提及.")
   (H3. "练习")
   
   (H2. "命题逻辑")
   (P "我们将会仔细研究命题逻辑, 在OCaml之中定义其形式句法, "
      "连带着句法分析和打印支持. "
      "我们将会讨论一些关键性的命题算法, 并证明紧致性定理, "
      "还会指明命题定理证明的丰富应用.")
   (H3. "命题逻辑的句法")
   (P "命题逻辑是" (Ref "algebra-of-logic")
      "所呈现的Boole的命题代数的一种现代版本. "
      "{原注: 诚然如此, 命题逻辑有时被称为" (Q "Boole代数")
      ". 但是, 这容易令人感到困惑, "
      "因为数学家将一切满足特定公理的代数结构都称为Boole代数, "
      "大致上这些公理是通常的代数律连带着" (&= $x^2 $x)
      " (Halmos 1963).} {译注: 这说的是Boole环, 可以被定义为含幺元的幂等环.} "
      "其牵涉被称为" (Em "公式") "的表达式, 而公式的意图是表示命题, "
      "即可以被认为是真或者假的断言. "
      "{原注: 当查阅文献时, 读者或许会发现用的是术语" (Em "合式公式")
      " (缩写为wff) 而非仅仅" (Q "公式")
      ". 这是为了强调在具体句法之中, 我们仅仅关心具有句法合法形式的字符串, "
      "而非任意的符号的(字符)串.} "
      "这些公式可以由常量" (Q "true") "和" (Q "false")
      "以及一些基本的" (Em "原子命题") " (或者说" (Em "原子")
      ") 通过各种逻辑联结词 (" (Q "not") ", " (Q "and")
      ", " (Q "or") ", 等等) 构筑而成. "
      "原子命题类似于通常代数之中的变量, "
      "有时我们将其称为" (Em "命题变量") "或者"
      (Em "Boole变量") ". 正如词汇" (Q "原子")
      "所暗示的, 我们并不会分析其内在结构; "
      "当我们在下一章中处理一阶逻辑时则要进行考虑.")
   (H4. "OCaml中的表示")
   (P "我们使用一个OCaml数据类型来表示命题公式, "
      "这可以类比于" (Ref "symbolic-computation-and-ocaml")
      "里的表达式类型. 我们允许" (Q "常量")
      "命题" (Code "False") "和" (Code "True")
      "以及原子命题" (Code "Atom p")
      ", 并且可以由它们通过使用幺元运算符" (Code "Not")
      "以及二元联结词" (Code "And") ", " (Code "Or")
      ", " (Code "Imp") " (" (Q "implies")
      "), " (Code "Iff") " (" (Q "if and only if")
      ") 构筑公式. 我们将对于这些联结词的确切含义的讨论推后, "
      "先来处理立即有用的部分.")
   (P "原子命题的潜在集合很大程度上是任意的, "
      "尽管对于某些目的而言其应该是无限的, "
      "以避免限制我们所能考虑的公式的复杂度. "
      "在抽象处理之中原始命题往往就是用数字索引的. "
      "我们令原子命题的潜在类型" (Code "'a")
      "为公式类型的定义的一个参数, "
      "由此许多基本函数可以不管该类型为何而一样工作. "
      "当我们考虑扩展至一阶逻辑时, "
      "这种乍看上去空洞的泛化有助于避免重复工作. "
      "出于相同的理由, 我们包含了两个额外的公式类型构造子"
      (Code "Forall") "和" (Code "Exists")
      ". 这些在本章中大致上会被忽略, "
      "不过其作用将会在之后变得清晰."
      (CodeB "type ('a)formula = False
                 | True
                 | Atom of 'a
                 | Not of ('a)formula
                 | And of ('a)formula * ('a)formula
                 | Or of ('a)formula * ('a)formula
                 | Imp of ('a)formula * ('a)formula
                 | Iff of ('a)formula * ('a)formula
                 | Forall of string * ('a)formula
                 | Exists of string * ('a)formula;;"))
   (H4. "具体句法")
   (P "正如我们之前所见, Boole对于逻辑联结词使用了传统的代数符号, 例如"
      (Q $+) ". 这使得许多逻辑事实看起来令人迷惑地熟悉, 例如"
      (MB (&= (&i* $p (@+ $q $r))
              (&+ (&i* $p $q) (&i* $p $r)))))
   (P "但是有些逻辑事实看起来就相当奇怪了, "
      "例如若是将第一个公式中的" (Q "and") "和" (Q "or")
      "系统地交换, 则可以得到以下事实:"
      (MB (&= (&+ $p (&i* $q $r))
              (&i* (@+ $p $q) (@+ $p $r))))
      "{译注: 注意这里遵循惯例, 乘法先于加法进行计算.}")
   (P "以逻辑的伪装这是在说如果" $p "成立或者" $q "和" $r
      "都成立, 那么" $p "或" $q "成立, 且" $p "或" $r
      "成立, 反之亦然. 稍加思考则可令读者确信的确如此; "
      "回忆一下" (Q $p "或" $q) "是可兼的, 即包含同时成立的情况.")
   (P "为了避免困惑或者是由通常代数产生误导性的类比, "
      "我们将会对于联结词使用如今业已标准化了的特殊符号. "
      "下表的每一行我们给出了每种构造的英语读法, "
      "之后跟着的是我们在讨论中所采用的标准符号化, "
      "然后是我们在程序中所支持的ASCII近似化, "
      "相应的抽象句法构造, 以及其他一些可能会用到的符号化. "
      "(最后一列如果只是阅读本书则可以忽略, "
      "但是在参考其他文献时则会很有用.)"
      (let ((TrTd* (lambda x* (apply Tr (map Td x*)))))
        (Table
         #:attr* '((align "center")
                   (border "1")
                   (style "border-collapse: collapse;"))
         (TrTd* "英语" "符号" "ASCII" "OCaml" "其他符号")
         (TrTd* "false" $bottom (Code "false") (Code "False") (&cm $0 $F))
         (TrTd* "true" $top (Code "true") (Code "True") (&cm $1 $T))
         (TrTd* (Span "not " $p) (&neg $p) (Code "~p") (Code "Not p")
                (&cm (OverBar $p) (&- $p) (&~ $p)))
         (TrTd* (Span $p " and " $q) (&conj $p $q)
                (Code "p /\\ q") (Code "And(p,q)")
                (&cm (&i* $p $q) (&& $p $q) (&d* $p $q)))
         (TrTd* (Span $p " or " $q) (&disj $p $q) (Code "p \\/ q")
                (Code "Or(p,q)") (&cm (&+ $p $q) (&\| $p $q)))
         (TrTd* (Span $p " implies " $q) (&=> $p $q)
                (Code "p ==> q") (Code "Imp(p,q)")
                (&cm (&-> $p $q) (&sup $p $q)))
         (TrTd* (Span $p " iff " $q) (&<=> $p $q)
                (Code "p &lt;=> q") (Code "Iff(p,q)")
                (&cm (&<-> $p $q) (&equiv $p $q) (&~ $p $q))))))
   (P "符号" (Q $disj) "来源于拉丁词汇" (Q "vel")
      "的首字母, 其意为可兼或. " $top
      "的形状类似于" (Q "true") "的首字母, 而" $bottom
      "和" $conj "不过是" $top "和" $disj
      "的镜像, 体现了一种对偶原则, "
      "这将在第2.4节中加以解释. "
      "否定的符号与算术取负的符号足够相似, 因此容易记忆. "
      "有些读者可能在非形式化的数学中见过推出和"
      (Q "当且仅当") "的符号.")
   (P "和普通代数一样, 我们需要建立联结词的优先级规则, "
      "并且若有必要可以通过括号来覆写规则. "
      "我们所采用的(颇为标准的)优先级顺序已经在上表中指明, 其中"
      (Q $neg) "是最高的, " (Q $<=>) "是最低的. 例如, "
      (&=> $p (&disj (&conj $q (&neg $r)) $s)) "意思是"
      (&=> $p (@disj (@conj $q (@neg $r)) $s))
      ". 或许赋予" $conj "和" $disj
      "相等的优先级更为合适, 但是只有少数作者这么做 "
      "(Dijkstra和Scholten 1990), "
      "我们还是从众赋予" $conj "更高的优先级.")
   (P "我们所有的二元联结词都以向右结合的方式进行句法分析, 于是"
      (&conj $p $q $r) "的意思是" (&conj $p (@conj $q $r))
      ", 诸如此类. 在非形式化的实践里, 形式如"
      (&=> $p $q $r) "这样的迭代推出经常用作"
      (Q (&=> $p $q) "且" (&=> $q $r))
      "的缩写, 就像" (&<= $x $y $z) "是"
      (Q (&<= $x $y) "且" (&<= $y $z))
      "的缩写. 但是对于我们而言, "
      (&=> $p $q $r) "指的是"
      (&=> $p (@=> $q $r)) ", 不是一个意思.")
   (P "在非形式化的讨论里, 我们不会使得" (Code "Atom")
      "构造子显式化, 但是会使用诸如" (&cm $p $q $r)
      "这样的名字代表一般的公式, 而" (&cm $x $y $z)
      "代表一般的原子. 例如, 当我们讨论"
      (&<=> $x $p) "时, 我们往往指的是具有形式"
      (Code "Iff(Atom(x),p)") "的公式.")
   (P "{译注: 实际情况是, 这个记号约定基本上废的, "
      (&cm $p $q $r) "除了用于公式的元变量, "
      "也一般用作原子命题的名字, "
      "虽然一般不用作原子命题的元变量. "
      "问题在于, 这足够引起混淆了, 例如"
      (&=> $p $q) "到底指的是一个具体的公式, "
      "还是一个公式的形式/模式, "
      "只能通过上下文判断.}")
   (H4. "通用句法分析和打印")
   (P "我们为公式建立了自动化的句法分析和打印支持, "
      "正如我们在第1.7–1.8节中对普通代数表达式所做的那样. "
      "由于具体细节对当前目的而言并不重要, "
      "代码的详细描述推迟到附录3中给出. "
      "不过我们确实想要强调的是, "
      "既然公式的类型是以原子命题的类型为参数的, "
      "那么句法分析和打印函数也同样是参数化的. "
      "函数" (Code "parse_formula") "的类型为:"
      (CodeB "# parse_formula;;
- : (string list -> string list -> 'a formula * string list) *
    (string list -> string list -> 'a formula * string list) ->
    string list -> string list -> 'a formula * string list
= &lt;fun>"))
   
   (H4. "原始命题")
   (P "尽管许多函数将会是通用的 (generic), "
      "但是如果我们固定在一个确定的原始命题类型上, "
      "对于某些操作进行实验会更加简单. "
      "据此我们定义了以下的原始命题类型, 其由名字索引 (即字符串):"
      (CodeB "type prop = P of string;;")
      "我们定义以下函数来获取一个命题的名字:"
      (CodeB "let pname(P s) = s;;"))
   (P "现在我们只需提供一个原子命题的解析器, 这相当直截了当. "
      "出于附录3中解释的原因, 我们需要检查第一个输入字符是否不是左括号, "
      "除此之外, 我们只需将输入流中的第一个标记作为原始命题的名称即可:"
      (CodeB "let parse_propvar vs inp =
  match inp with
    p::oinp when p &lt;> &quot;(&quot; -> Atom(P(p)),oinp
  | _ -> failwith &quot;parse_propvar&quot;;;")
      "现在我们将其提供给通用的公式解析器, "
      "其中对于目前未使用的中缀原子解析器传入一个总是失败的函数, "
      "对于非命题变量的上下文则传入一个空列表:"
      
      )
   
   (H4. "句法操作")
   (P "如果我们能有对应于公式构造子的句法操作"
      "作为正常的OCaml函数可用是很方便的:"
      (CodeB "let mk_and p q = And(p,q) and mk_or p q = Or(p,q)
and mk_imp p q = Imp(p,q) and mk_iff p q = Iff(p,q)
and mk_forall x p = Forall(x,p) and mk_exists x p = Exists(x,p);;"))
   (P "对偶地, 往往能够解构公式而不需要显式的模式匹配也是方便的. "
      "以下这个函数解构了一个" (Em "等价")
      " (或者说" (Em "biimplication") ", 或者说" (Em "biconditional")
      "), 即将具有形式" (&<=> $p $q) "的公式转换为序对" (tu0 $p $q) ":"
      (CodeB "let dest_iff fm =
  match fm with Iff(p,q) -> (p,q) | _ -> failwith &quot;dest_iff&quot;;;"))
   (P "类似地, 以下函数将一个" (Em "合取") "公式" (&conj $p $q)
      "分解为两个" (Em "合取式(conjunct)") $p "和" $q ":"
      (CodeB "let dest_and fm =
  match fm with And(p,q) -> (p,q) | _ -> failwith &quot;dest_and&quot;;;")
      "而以下函数将一个合取递归地分解为一个合取式的列表:"
      (CodeB "let rec conjuncts fm =
  match fm with And(p,q) -> conjuncts p @ conjuncts q | _ -> [fm];;"))
   (P "下列类似的函数将一个" (Em "析取") "公式" (&disj $p $q)
      "分解为" (Em "析取式(disjunct)") $p "和" $q
      ", 一个是在顶层, 一个则是递归的:"
      (CodeB "let dest_or fm =
  match fm with Or(p,q) -> (p,q) | _ -> failwith &quot;dest_or&quot;;;

let rec disjuncts fm =
  match fm with Or(p,q) -> disjuncts p @ disjuncts q | _ -> [fm];;")
      "以下是推出式的一个顶层解构子:"
      (CodeB "let dest_imp fm =
  match fm with Imp(p,q) -> (p,q) | _ -> failwith &quot;dest_imp&quot;;;"))
   (P "一个推出式" (&=> $p $q) "里的公式" $p "和" $q
      "分别被称为其" (Em "前件") "和" (Em "后件")
      ", 而我们也应该定义相应的函数:"
      (CodeB "let antecedent fm = fst(dest_imp fm);;
let consequent fm = snd(dest_imp fm);;"))
   (P "我们经常需要通过对公式进行递归来定义函数, "
      "正如我们在第1.6节中对化简所做的那样. "
      "有两种递归模式似乎足够常见, 因此有必要定义通用函数. "
      "下面这个函数将一个函数应用于公式中的所有原子, 但保持其余结构不变. "
      "例如, 它可以用来将某个特定的原子命题系统地替换为另一个公式:"
      (CodeB "let rec onatoms f fm =
  match fm with
    Atom a -> f a
  | Not(p) -> Not(onatoms f p)
  | And(p,q) -> And(onatoms f p,onatoms f q)
  | Or(p,q) -> Or(onatoms f p,onatoms f q)
  | Imp(p,q) -> Imp(onatoms f p,onatoms f q)
  | Iff(p,q) -> Iff(onatoms f p,onatoms f q)
  | Forall(x,p) -> Forall(x,onatoms f p)
  | Exists(x,p) -> Exists(x,onatoms f p)
  | _ -> fm;;"))
   (P "下面这个函数是列表迭代器"
      (Code "itlist") "之于公式的类比, "
      "它将一个二元函数迭代地作用于公式中的所有原子:"
      (CodeB "let rec overatoms f fm b =
  match fm with
    Atom(a) -> f a b
  | Not(p) -> overatoms f p b
  | And(p,q) | Or(p,q) | Imp(p,q) | Iff(p,q) ->
        overatoms f p (overatoms f q b)
  | Forall(x,p) | Exists(x,p) -> overatoms f p b
  | _ -> b;;"))
   (P "一个特别常见的应用是收集与原子相关联的某种属性的集合; "
      "最简单的情形就是返回所有原子的集合. "
      "我们可以通过将一个函数" $f "连同一个" (Q "append")
      "操作迭代地作用于所有原子来实现这一点, "
      "最后将结果转换为集合以去除重复项. "
      "(我们也可以在过程中使用" (Code "union")
      "来逐步去除重复项, 但当涉及的集合较大时, "
      "当前的实现方式可能更为高效.)"
      (CodeB "let atom_union f fm = setify (overatoms (fun h t -> f(h)@t) fm []);;"))
   (P "我们很快将会看到对于如何使用这些非常一般的函数的刻画.")
   (H3. "命题逻辑的语义")
   (P "既然命题公式意在表示可能为真或者为假的断言, "
      "一个公式的最终含义只是两个" (Em "真值")
      (Q "true") "和" (Q "false") "中的一个. "
      "然而, 正如像" (&+ $x $y $1)
      "这样的一个代数表达式当我们知道变量" $x "和" $y
      "所代表的东西之后只有一个确切的含义, "
      "一个命题公式的含义依赖于被分配给其原子公式的真值. "
      "这种分配在一个" (Em "赋值(valuation)")
      "之中进行编码, 赋值是一个从原子的集合到真值的集合"
      (setE $false $true) "的函数. 给定一个公式" $p "和一个赋值" $v
      ", 然后我们可以根据下列递归定义的函数求得总体的真值:"
      (CodeB "let rec eval fm v =
  match fm with
    False -> false
  | True -> true
  | Atom(x) -> v(x)
  | Not(p) -> not(eval p v)
  | And(p,q) -> (eval p v) &amp; (eval q v)
  | Or(p,q) -> (eval p v) or (eval q v)
  | Imp(p,q) -> not(eval p v) or (eval q v)
  | Iff(p,q) -> (eval p v) = (eval q v);;"))
   (P "这是我们对于命题逻辑的数学" (Em "定义")
      ", 意在作为对于我们的直觉的自然形式化. "
      "{原注: 我们也可以选择将部分求值了的"
      (Code "eval p") ", 即一个从赋值到值的函数, "
      "视为公式" (Code "p") "的语义, 而非将赋值当作额外的参数. "
      "这主要只是一种术语问题.} "
      "(implication的语义并不显然, 之后我们将详细讨论.) "
      "每个逻辑联结词都由OCaml的内置类型" (Code "bool")
      "上的一个相应的运算子所解释. "
      "为了完全明确这些运算子的含义, "
      "我们可以枚举所有可能的输入组合并观察相应的输出, "
      "例如对于" (Code "&amp;") "运算子:"
      (CodeB "# false &amp; false;;
- : bool = false
# false &amp; true;;
- : bool = false
# true &amp; false;;
- : bool = false
# true &amp; true;;
- : bool = true"))
   (P "我们可以将这些信息排列在一张真值表中, "
      "展示如何由一个公式的立即子公式的真值来确定该公式被赋予的真值:"
      (MB (set-attr*
           (&Table
            ($p $q (&conj $p $q) (&disj $p $q) (&=> $p $q) (&<=> $p $q))
            ("false" "false" "false" "false" "true" "true")
            ("false" "true" "false" "true" "true" "false")
            ("true" "false" "false" "true" "false" "false")
            ("true" "true" "true" "true" "true" "true"))
           'frame "solid" 'rowlines "solid" 'columnlines "solid"))
      "当然了, 出于完整性的考量, 我们也应该包括幺元否定的真值表:"
      (MB (set-attr*
           (&Table
            ($p (&neg $p))
            ("false" "true")
            ("true" "false"))
           'frame "solid" 'rowlines "solid" 'columnlines "solid")))
   (P "让我们尝试在一个赋值下对公式" (&=> (&conj $p $q) (&conj $q $r))
      "求值, 其中" (&cm $p $q $r) "分别被设为" (Q "true")
      ", " (Q "false") "和" (Q "true")
      ". (我们不必费心去定义那些未出现在公式中的原子的值, "
      "OCaml会发出我们还没有完成的警告.)"
      (CodeB "# eval &lt;&lt;p /\\ q ==> q /\\ r>>
       (function P&quot;p&quot; -> true | P&quot;q&quot; -> false | P&quot;r&quot; -> true);;
...
- : bool = true"))
   (P "然而在另一个赋值下, 该公式可以求值为" (Q "false")
      "; 读者可能会发现手动验证这些结果是有益的练习:"
      (CodeB "eval &lt;&lt;p /\\ q ==> q /\\ r>>
     (function P&quot;p&quot; -> true | P&quot;q&quot; -> true | P&quot;r&quot; -> false);;"))
   (H4. "机械化了的真值表")
   (P "我们期望对于一个公式的求值独立于赋值如何给没有出现在公式之中的原子分配真值. "
      "让我们通过定义一个提取公式之中所出现的原子命题的集合的函数来使得我们的表述精确化. "
      "以抽象的数学术语来说, 我们将通过公式上的递归定义" $atoms "如下:"
      (eqn*
       ((&atoms $bottom)   $= $empty)
       ((&atoms $top)      $= $empty)
       ((&atoms $x)        $= (setE $x))
       ((&atoms (&neg $p)) $= (&atoms $p))
       ((&atoms (&conj $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))
       ((&atoms (&disj $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))
       ((&atoms (&=> $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))
       ((&atoms (&<=> $p $q))
        $=
        (&union (&atoms $p) (&atoms $q)))))
   (P "作为公式上的结构归纳证明的一个简单例子 "
      "(见附录1和2), 我们将会证明" (&atoms $p)
      "总是有限的, 因而我们可以基于ML的列表来解释它而并没有曲解其含义. "
      "(当然了, 我们需要记住一般情况下列表相等性和集合相等性并不相同.) "
      "{译注: 我的理解大概就是这里可以使用列表表示集合, 仅此而已.}")
   ((Theorem)
    "对于任意的命题公式" $p ", 集合" (&atoms $p) "是有限的.")
   ((proof)
    "对公式的结构进行归纳证明." (Br)
    "若" $p "是" $bottom "或" $top ", 则" (&atoms $p)
    "是空集; 若" $p "是一个原子命题, 则" (&atoms $p)
    "是一个单元素集. 在所有这些情况下, 它们都是有限的." (Br)
    "若" $p "的形式为" (&neg $q) ", 则由归纳假设, "
    (&atoms $q) "是有限的, 且根据定义, "
    (&= (&atoms (&neg $q)) (&atoms $q)) "." (Br)
    "若" $p "的形式为" (&conj $q $r) ", " (&disj $q $r)
    ", " (&=> $q $r) "或" (&<=> $q $r) ", 则"
    (&= (&atoms $p) (&union (&atoms $q) (&atoms $r)))
    ". 由归纳假设, " (&atoms $q) "和" (&atoms $r)
    "都是有限的, 而两个有限集的并集仍然是有限的.")
   (P "类似地, 我们可以形式化地澄清以上所提及的直觉上显然的事实.")
   ((Theorem)
    "对于任意的命题公式" $p ", 如果两个赋值" $v "和" $v^
    "在集合" (&atoms $p) "上相合, 即对于每个" (∈ $x (&atoms $p))
    "都有" (&= (app $v $x) (app $v^ $x)) ", 那么"
    (&= (&eval $p $v) (&eval $p $v^)) ".")
   ((proof)
    "对" $p "的结构进行归纳证明." (Br)
    "如果" $p "是" $bottom "或者" $top
    ", 那么其真值解释是独立于赋值的." (Br)
    "如果" $p "是一个原子" $x ", 那么"
    (&= (&atoms $x) (setE $x))
    ", 而根据题设我们有"
    (&= (app $v $x) (app $v^ $x)) ". 因此, "
    (&= (&eval $p $v) (app $v $x)
        (app $v^ $x) (&eval $p $v^))
    "." (Br)
    "如果" $p "具有形式" (&conj $q $r) ", " (&disj $q $r)
    ", " (&=> $q $r) "或" (&<=> $q $r) ", 那么"
    (&= (&atoms $p) (&union (&atoms $q) (&atoms $r)))
    ". 既然赋值在两个集合之并上是相合的, 那么其在"
    (&atoms $q) "和" (&atoms $r) "上更是相合的了. "
    "因此, 我们可以应用归纳假设以得出"
    (&= (&eval $q $v) (&eval $q $v^)) "和"
    (&= (&eval $r $v) (&eval $r $v^))
    ". 既然" $p "的赋值是这些子赋值的函数, 那么"
    (&= (&eval $p $v) (&eval $p $v^)) ".")
   (P "以上" $atoms "的定义可以被直接翻译为一个OCaml函数, "
      "例如对于" (Q $union) "使用" (Code "union") "而对于"
      (Q (setE $x)) "使用" (Code "[x]")
      ". 然而, 我们更倾向于基于既有的迭代子"
      (Code "atom_union") ":"
      (CodeB "let atoms fm = atom_union (fun a -> [a]) fm;;")
      "例如:"
      (CodeB "# atoms &lt;&lt;p /\\ q \\/ s ==> ~p \\/ (r &lt;=> s)>>;;
- : prop list = [P &quot;p&quot;; P &quot;q&quot;; P &quot;r&quot;; P &quot;s&quot;]"))
   (P "鉴于对于一个命题公式" $p
      "的解释只依赖于赋值在有限集合" (&atoms $p)
      " (设其有" $n "个元素) 上的动作, "
      "并且对于每个原子命题只有两种选择可作, "
      "于是最终的真值完全由对于这些原子的总共" $2^n
      "种选择所确定. 因此, 我们可以自然地将真值表形式的枚举"
      "从基本运算推广至任意的公式. "
      "为了在OCaml中实现这个, 我们从定义一个函数开始, "
      "其会测试一个函数" (Code "subfn")
      "是否会在原子" (Code "ats")
      "的所有可能赋值上返回" (Code "true")
      ", 对于其他所有原子则使用既有的赋值" (Code "v")
      ". 所有赋值的空间是通过相继修饰" (Code "v")
      "以设定每个原子" (Code "p") "为" (Q "true")
      "和" (Q "false") "与递归调用探索的:"
      (CodeB "let rec onallvaluations subfn v ats =
  match ats with
    [] -> subfn v
  | p::ps -> let v' t q = if q = p then t else v(q) in
             onallvaluations subfn (v' false) ps &amp;
             onallvaluations subfn (v' true) ps;;"))
   (P "我们可以将其应用于一个函数, "
      "这个函数绘制真值表的一行, 然后返回" (Q "true")
      ". (这个返回值是重要的, 因为" (Q (Code "&amp;"))
      "只有在其第一个参数是" (Code "true")
      "的情况下才会对于第二个参数进行求值.) "
      "这可以用来绘制一个公式的整个真值表:"
      (CodeB "let print_truthtable fm =
  let ats = atoms fm in
  let width = itlist (max ** String.length ** pname) ats 5 + 1 in
  let fixw s = s^String.make(width - String.length s) ' ' in
  let truthstring p = fixw (if p then &quot;true&quot; else &quot;false&quot;) in
  let mk_row v =
     let lis = map (fun x -> truthstring(v x)) ats
     and ans = truthstring(eval fm v) in
     print_string(itlist (^) lis (&quot;| &quot;^ans)); print_newline(); true in
  let separator = String.make (width * length ats + 9) '-' in
  print_string(itlist (fun s t -> fixw(pname s) ^ t) ats &quot;| formula&quot;);
  print_newline(); print_string separator; print_newline();
  let _ = onallvaluations mk_row (fun x -> false) ats in
  print_string separator; print_newline();;")
      "{译注: 老实说我不喜欢这种代码写法, "
      "其将求值和副作用混在了一起. "
      "我宁愿单独再写一个类似的函数专门处理副作用.}")
   (P "请注意, 我们以宽度为" (Code "width")
      "的列进行打印, 列宽足以容纳所有原子的名字以及"
      (Code "true") "和" (Code "false")
      ", 外加一个末尾空格. 这样, "
      "表格中的所有项就能整齐地对齐. 例如:"
      (CodeB "# print_truthtable &lt;&lt;p /\\ q ==> q /\\ r>>;;
p     q     r     | formula
---------------------------
false false false | true
false false true  | true
false true  false | true
false true  true  | true
true  false false | true
true  false true  | true
true  true  false | false
true  true  true  | true
---------------------------
- : unit = ()"))
   (H4. "形式语言和自然语言")
   (P "命题逻辑为我们提供了一种形式化的方式, "
      "来表达英语或其他自然语言中某些复杂的命题. "
      "练习将英语中的复合命题形式化 (即翻译为形式逻辑) 是很有益的. "
      "正如在两种自然语言之间进行翻译一样, "
      "我们不能总是期望逐词对应. "
      "但只要对非形式命题的结构有一定的了解, "
      "通常就可以进行相当直接的形式化.")
   (P "在命题逻辑中, 除了上面给出的优先级规则之外, "
      "我们还可以使用标准的数学括号技术将命题组合在一起, "
      "例如区分" (Q (&conj $p (@disj $q $r)))
      "和" (Q (&disj (@conj $p $q) $r))
      ". 括号在英语和大多数其他语言中的用法截然不同 "
      "(用来插入像这样的旁注). "
      "在英语中表示优先级是一件更加临时且笨拙的事情, "
      "通常通过插入额外的标点符号和" (Q "噪音词")
      "来给短语加括号, 从而消除歧义. "
      "例如, 我们可以将上述两个例子分别表述为"
      (Q $p ", and also either " $q " or " $r) "和"
      (Q "either both " $p " and " $q ", or else " $r)
      ". 对于复杂的命题, 这种方式会变得非常繁琐, "
      "而这实际上也是需要形式语言的部分原因.")
   (P "一般来说, 像" (Q "and") ", " (Q "or") "和" (Q "not")
      "这样的结构可以相当直接地从英语翻译为相应的逻辑联结词. "
      "联结词" (Q "not") "在英语中也可以隐含在前缀如"
      (Q "dis-") "和" (Q "un-") "中, 因此我们可以将"
      (Q "You are either honest and kind, or dishonest, or unkind")
      "翻译为" (Q (&disj (&conj $H $K) (&neg $H) (&neg $K)))
      ". 然而, 有时英语短语暗示着超越纯粹真值函数之外的细微含义. 例如, "
      (Q "and") "常常表示因果关系 (" (Q "he dropped the plate and it broke")
      ") 或时间顺序 (" (Q "she climbed into bed and turned out the light")
      "). " (Q "but") "一词可以说与" (Q "and") "有着相同的真值函数解释, "
      "但它表达的是各组成命题之间以一种出人意料或令人遗憾的方式相连. 同样, "
      (Q "unless") "可以合理地翻译为" (Q "or")
      ", 但由此导致的" (Q $p " unless " $q) "与"
      (Q $q " unless " $p) "之间的对称似乎令人意外.")
   (P "更成问题的是推出式或条件式" (&=> $p $q)
      "与其预期的英语表述" (Q $p " implies " $q)
      "或" (Q "if " $p " then " $q) "之间的关系. "
      "在这一点上表面上的不协调困扰着许多形式逻辑的初学者, "
      "并且至少使一个人永远放弃了这门学科 (Waugh 1991). "
      "事实上, 关于推出式的意义的争论可以追溯到两千多年前的"
      "墨伽拉-斯多噶学派逻辑学家 (Bochénski 1961). "
      "据Sextus Empiricus记载, "
      "公元前二世纪亚历山大图书馆的馆长Callimachus曾说"
      (Q "连屋顶上的乌鸦都在争论哪些条件句是真的") ".")
   (P "首先, 让我们明确一点: 如果我们对" (&=> $p $q)
      "采用" (Em "任何") "真值函数语义, 即根据"
      $p "和" $q "的真值来定义" (&=> $p $q)
      "的真值, 那么我们所选择的语义是唯一合理的. "
      "按照直觉理解, 推出最基本的原则是: 如果"
      $p "和" (&=> $p $q) "都为真, 那么" $q "也为真; "
      "因此, 如果" $p "为真而" $q "为假, 则" (&=> $p $q)
      "必须为假. 此外, " (&=> (&conj $p $q) $p)
      "总是为真这一点也是合理的, "
      "而只有我们所选择的语义才能在"
      $p "和" $q "取任意真值的情况下使之为真.")
   
   (H3. "有效性, 可满足性, 重言")
   (P "我们称一个赋值" $v (Em "满足")
      "一个公式" $p ", 如果" (&eval $p $v)
      "为真. 一个公式被称为是:"
      (Ul (Li (Em "重言") "或者" (Em "逻辑有效的")
              ", 如果其被" (Em "所有")
              "公式满足, 或者等价地说, "
              "如果其真值表的每一行的值都为真;")
          (Li (Em "可满足的")
              ", 如果其被某个赋值满足, "
              "即其真值表至少有一行的值为真;")
          (Li (Em "不可满足的") "或者说" (Em "矛盾")
              ", 如果没有赋值可以满足它, "
              "即其真值表的每一行的值都为假.")))
   (P "注意到一个重言也是可满足的, 另外正如名字所暗示的, "
      "一个公式是不可满足的恰当其不是可满足的. "
      "而且, 在任何赋值中, " (&eval (@neg $p) $v)
      "为假当且仅当" (&eval $p $v)
      "为真. 因此, " $p "是一个重言当且仅当"
      (&neg $p) "是不可满足的.")
   (P "最简单的重言是" (Q $top)
      "; 一个稍微有趣点的重言例子是"
      (&=> (&conj $p $q) (&disj $p $q)) " ("
      (Q "如果" $p "和" $q "都为真, 那么" $p "和" $q "至少有一个为真")
      "), 而一个许多人第一眼看上去会比较惊讶的例子是" (Q "Peirce律")
      (&=> (@=> (@=> $p $q) $p) $p) ":"
      (CodeB "# print_truthtable &lt;&lt;((p ==> q) ==> p) ==> p>>;;
p     q     | formula
---------------------
false false | true
false true  | true
true  false | true
true  true  | true
---------------------"))
   (P "对于我们首先在OCaml中生成其真值表的公式"
      (&=> (&conj $p $q) (&conj $q $r))
      ", 它是可满足的, 因为其真值表的最后一列有"
      (Q "true") ", 但它不是重言, 因为其也有"
      (Q "false") ". 最简单的矛盾是" (Q $bottom)
      ", 另一个简单的矛盾是" (Q (&conj $p (&neg $p)))
      " (" (Q $p "既为真又为假") "):"
      (CodeB "# print_truthtable &lt;&lt;p /\\ ~p>>;;
p     | formula
---------------
false | false
true  | false
---------------"))
   (P "从直觉上来说, 重言" (Q "总是为真")
      ", 可满足公式" (Q "有时(但可能并不总是)为真")
      ", 矛盾" (Q "总是为假")
      ". 的确如此, 重言意在形式化地捕获引论章节以非技术性方式"
      "所讨论的逻辑真性 (logical truth) 的概念, "
      "到目前为止的话我们是在命题逻辑中定义了重言. "
      "重言恰可以类比于诸如"
      (&= (&- $x^2 $y^2) (&i* (@+ $x $y) (@- $x $y)))
      "这样的代数等式, 其构成变量的值不论为何都是"
      "一般为真的 (universally true). "
      "可满足公式可以类比于至少有解的等式, "
      "但不必总是有效, 例如"
      (&= (&+ $x^2 $2) (&i* $3 $x))
      ". {译注: 英语里等式和方程都是equation就是了.} "
      "矛盾可以类比于无解的等式, 例如"
      (&= (&d* $0 $x) $1)
      ". {译注: 这里当然都是在实数域上讨论方程.}")
   (P "将(不)可满足性的想法从公式推广至公式的集合是有用的: "
      "公式的集合" Γ "被称为是可满足的, "
      "如果存在一个赋值" $v "能够" (Em "同时")
      "满足集合里的所有公式. 注意到" (Q "同时") ": "
      (setE (&conj $p (&neg $q)) (&conj (&neg $p) $q))
      "是不可满足的, 即便其每个公式都是可满足的. "
      "当所关心的集合有限时, 设"
      (&= Γ (setE $p_1 $..h $p_n))
      ", " Γ "的可满足性等价于单一公式"
      (&conj $p_1 $..c $p_n)
      "的可满足性, 读者可从定义看出来. "
      "然而, 在我们之后的工作里, "
      "考虑无限的公式集合的可满足性也是必要的, "
      "其就无法直接归约为单一公式的可满足性了. "
      "我们也会使用记号" (G!= $q) "来表达"
      (Q "对于所有使得每个" (∈ $p Γ) "都为真的赋值, "
         "该赋值也使得" $q "为真")
      ". 注意到在有限的" (&= Γ (setE $p_1 $..h $p_n))
      "这种情况下, " (G!= $q) "等价于断言"
      (&=> (&conj $p_1 $..c $p_n) $q)
      "是一个重言. 在" (&= Γ $empty)
      "的情况下, " (!= $empty $q) "一般记为"
      (!= $q) ", 意即" $q "是一个重言. "
      "{译注: " (G!= $q)
      "一般读作" Γ "语义蕴涵" $q ".}")
   (H4. "重言和可满足性检查")
   (P "虽然我们可以通过检查真值表来确定公式的状态, "
      "但让计算机完成所有工作会更简单. "
      "以下函数通过检查公式是否在所有赋值下均求值为"
      (Q (Code "true")) "来测试该公式是否为重言式."
      (CodeB "let tautology fm =
  onallvaluations (eval fm) (fun s -> false) (atoms fm);;"))
   
   (H4. "替换")
   (H4. "一些重要的重言")
   (H3. "De Morgan律, 充分性, 对偶性")
   (P "以下重要的重言被称为" (Em "De Morgan律")
      ", 其是以Augustus De Morgan的名字命名的, "
      "他和Boole几乎是同时代的人物, "
      "对于逻辑领域作出了重要贡献."
      (MB (&<=> (&neg (@disj $p $q))
                (&conj (&neg $p) (&neg $q))))
      (MB (&<=> (&neg (@conj $p $q))
                (&disj (&neg $p) (&neg $q)))))
   (P "第一个重言的一个日常例子是"
      (Q "I can not speak either Finnish or Swedish")
      "和"
      (Q "I can not speak Finnish and I can not speak Swedish")
      "意思相同. 第二个重言的一个例子是"
      (Q "I am not a wife and mother")
      "和"
      (Q "either I am not a wife or I am not a mother (or both)")
      "是相同的. De Morgan律的变体, 同样也很容易看出来是重言, 为:"
      (MB (&<=> (&disj $p $q)
                (&neg (@conj (&neg $p) (&neg $q)))))
      (MB (&<=> (&conj $p $q)
                (&neg (@disj (&neg $p) (&neg $q))))))
   (P "这些重言之所以是有趣的, 是因为它们展示了对于联结词"
      $conj "和" $disj ", 如何用其中一个表达另外一个. "
      
      )
   (H4. "对偶性")
   (H3. "化简和否定范式")
   (H3. "析取范式和合取范式")
   (H3. "命题逻辑的应用")
   (H3. "定义性CNF")
   (H3. "Davis-Putnam过程")
   (H3. "Stålmarck方法")
   (H3. "二元决策图")
   (H3. "紧致性")
   (H3. "深入阅读")
   (H3. "练习")
   (H2. "一阶逻辑")
   (P "我们现在从命题逻辑移至更为丰富的一阶逻辑, "
      "其中命题可以牵涉全称或者存在量化的非命题变元. "
      "我们将会展现一阶逻辑之中的证明是如何可以"
      "藉由Herbrand定理被朴素地机械化的. "
      "接着我们将会引入诸多改进, "
      "特别是合一 (unification), "
      "其可以使得自动化证明更加高效.")
   (H3. "一阶逻辑及其实现")
   (P "命题逻辑只允许我们从原始命题构建公式, "
      "原始命题本身或许是独立地为真或者为假. "
      
      )
   (H3. "句法分析和打印")
   (H3. "一阶逻辑的语义")
   (H3. "句法操作")
   
   (H2. "相等性")
   (H2. "可判定问题")
   (H2. "交互式定理证明")
   (H2. "限制")
   ))