#lang racket
(provide automated.html)
(require SMathML)
(define automated.html
  (TnTmPrelude
   #:title "实用逻辑和自动推理手册"
   #:css "styles.css"
   (H1. "实用逻辑和自动推理手册")
   (H2 "前言")
   (P "本书是关于可以执行" (Em "自动推理")
      "的计算机程序的. "
      )
   (H2. "引论")
   (P "本章我们引入了逻辑推理和机械化它的想法, "
      "简要触及了重要的历史性发展. "
      "我们通过讨论逻辑学中的一些最为基础的想法"
      "以及刻画符号方法是如何在计算机上实现的"
      "来为后续内容奠定基础.")
   (H3. "什么是逻辑推理?")
   (P "存在许多理由相信某个东西为真. "
      "它或许似乎是显而易见的, "
      "或许至少第一眼看上去是令人信服的, "
      "可能我们的父母之前告诉过我们, "
      "也可能是其与相关科学实现的结果达成了惊人的一致性. "
      "尽管往往是可靠的, 但是这些判断的方法也并非万无一失, "
      "其也曾被用于说服人们地球是平的, 圣诞老人是存在的, "
      "原子不可被进一步划分为更小的粒子.")
   (P (Em "逻辑") "推理相较于其他推理的不同之处在于"
      "其会避免任何未经澄清的假设, "
      "并将自身限制于不会出错且超越理性置辩的推理. "
      "为了避免作出任何无法保证的假设, "
      "逻辑推理不能依赖于要被推理的对象或者概念的任何特殊性质. "
      "这意味着逻辑推理必须从所有这样的特殊特征之中抽象出来, "
      "并在应用于其他领域时同等有效 (valid). "
      "论证之所以被接受为逻辑性的(论证), "
      "在于其与某种一般" (Em "形式")
      "的相合, 而非因为其所处理的特定" (Em "内容")
      ". 例如, 将以下的传统例子:"
      (Blockquote
       (Pre "所有人都是要死的
Socrates是一个人
因此Socrates是要死的"))
      "与下列从数学之中抽出的推理进行比较:"
      (Blockquote
       (Pre "所有正整数都是四个整数的平方之和
" 15 "是一个正整数
因此" 15 "是四个整数的平方之和"))
      "这两个论证都是正确的, 并且具有共同的模式:"
      (Blockquote
       (Pre "所有的" $X "都是" $Y "
" $a "是" $X "
因此" $a "是" $Y)))
   (P "这个推理模式是逻辑有效的, 因为其有效性并不依赖于内容: "
      (Q "正整数") "和" (Q "要死的") "的含义是无关紧要的. "
      "我们可以将" $X ", " $Y ", " $a
      "替换为任何我们喜欢的东西, 只要尊重语法范畴即可, "
      "而语句仍然保持有效. "
      "与之相对的是, 考虑以下推理:"
      (Blockquote
       (Pre "所有的雅典人都是希腊人
Socrates是一个雅典人
因此Socrates是要死的")))
   (P "尽管这个结论是全然正确的, 但是这个论证并非逻辑有效的, "
      "因为其依赖于所牵涉的项的内容. "
      
      )
   (H3. "Calculemus!")
   (H3. "符号化")
   (H3. "Boole的逻辑代数" #:id "algebra-of-logic")
   (H3. "句法和语义")
   (H3. "符号计算和OCaml" #:id "symbolic-computation-and-ocaml")
   (P "现代计算的早期人们普遍相信计算机基本上是用来进行数值计算的设备 (Ceruzzi 1983). "
      
      )
   (H3. "句法分析 (parsing)")
   (H3. "美观打印 (prettyprinting)")
   (H3. "深入阅读")
   (H3. "练习")
   (H2. "命题逻辑")
   (P "我们将会仔细研究命题逻辑, 在OCaml之中定义其形式句法, "
      "连带着句法分析和打印支持. "
      "我们将会讨论一些关键性的命题算法, 并证明紧致性定理, "
      "还会指明命题定理证明的丰富应用.")
   (H3. "命题逻辑的句法")
   (P "命题逻辑是" (Ref "algebra-of-logic")
      "所呈现的Boole的命题代数的一种现代版本. "
      "{原注: 诚然如此, 命题逻辑有时被称为" (Q "Boole代数")
      ". 但是, 这容易令人感到困惑, "
      "因为数学家将一切满足特定公理的代数结构都称为Boole代数, "
      "大致上这些公理是通常的代数律连带着" (&= $x^2 $x)
      " (Halmos 1963).} {译注: 这说的是Boole环, 可以被定义为含幺元的幂等环.} "
      "其牵涉被称为" (Em "公式") "的表达式, 而公式的意图是表示命题, "
      "即可以被认为是真或者假的断言. "
      "{原注: 当查阅文献时, 读者或许会发现用的是术语" (Em "合式公式")
      " (缩写为wff) 而非仅仅" (Q "公式")
      ". 这是为了强调在具体句法之中, 我们仅仅关心具有句法合法形式的字符串, "
      "而非任意的符号的(字符)串.} "
      "这些公式可以由常量" (Q "true") "和" (Q "false")
      "以及一些基本的" (Em "原子命题") " (或者说" (Em "原子")
      ") 通过各种逻辑联结词 (" (Q "not") ", " (Q "and")
      ", " (Q "or") ", 等等) 构筑而成. "
      "原子命题类似于通常代数之中的变量, "
      "有时我们将其称为" (Em "命题变量") "或者"
      (Em "Boole变量") ". 正如词汇" (Q "原子")
      "所暗示的, 我们并不会分析其内在结构; "
      "当我们在下一章中处理一阶逻辑时则要进行考虑.")
   (H4. "OCaml中的表示")
   (P "我们使用一个OCaml数据类型来表示命题公式, "
      "这可以类比于" (Ref "symbolic-computation-and-ocaml")
      "里的表达式类型. 我们允许" (Q "常量")
      "命题" (Code "False") "和" (Code "True")
      "以及原子命题" (Code "Atom p")
      ", 并且可以由它们通过使用幺元运算符" (Code "Not")
      "以及二元联结词" (Code "And") ", " (Code "Or")
      ", " (Code "Imp") " (" (Q "implies")
      "), " (Code "Iff") " (" (Q "if and only if")
      ") 构筑公式. 我们将对于这些联结词的确切含义的讨论推后, "
      "先来处理立即有用的部分.")
   (P "原子命题的潜在集合很大程度上是任意的, "
      "尽管对于某些目的而言其应该是无限的, "
      "以避免限制我们所能考虑的公式的复杂度. "
      
      )
   (H3. "命题逻辑的语义")
   (H3. "有效性, 可满足性, 重言")
   (H3. "De Morgan律, 充分性, 对偶性")
   (H3. "化简和否定范式")
   (H3. "析取范式和合取范式")
   (H3. "命题逻辑的应用")
   (H2. "一阶逻辑")
   (H2. "相等性")
   (H2. "可判定问题")
   (H2. "交互式定理证明")
   (H2. "限制")
   ))