#lang racket
(provide automated_ch5)
(require (except-in SMathML H3. H4. $!=)
         "automated_utils.rkt")
(define automated_ch5
  (Tm*
   (H2. "可判定问题")
   (P "我们已经考虑了各种用于验证一阶公式的逻辑有效性的算法 "
      "(例如tableau, 归结, 等等), 如果该公式的确是有效的. "
      "但是, 这些算法不能在一般情况下告诉我们何时一阶公式不是有效的. "
      "我们将会在第7章看到, 并不存在这样的系统性过程. "
      "然而, 存在过程对于特定种类的公式行之有效, "
      "或者对于特定种类的模型下的有效性行之有效, "
      "而我们会在本章讨论其中一些比较重要的情形. "
      "往往这些问题自然地推广了数学和泛代数中的常见判定问题, "
      "例如方程求解或" (Q "word问题") ".")
   (H3. "判定问题")
   (P "一阶逻辑存在三类自然且紧密关联的我们或许想要某种算法解决方案的问题. "
      "通过对于公式进行否定, 我们可以根据taste选择"
      "是基于有效性还是不可满足性来呈现这些问题. "
      (Ol (Li "确认一个逻辑有效 (或者不可满足) "
              "公式的确是有效的 (相应地, 不可满足的), "
              "但是决不对于非有效 (或者可满足) 公式进行确认.")
          (Li "确认一个逻辑非有效 (或者可满足) "
              "公式的确是非有效的 (相应地, 可满足的), "
              "但是决不对于有效 (或者不可满足) 公式进行确认.")
          (Li "测试一个公式是有效的还是非有效的 "
              "(或者可满足的还是不可满足的)."))
      "显然(3)包裹了(1)和(2). 反过来, "
      "(1)和(2)的解可以一并使用以解决(3): "
      "只需并行运行有效性和非有效性 "
      "(或者可满足性和不可满足性) 的验证过程. "
      "到目前为止, 我们已经显式呈现了(1)的解, "
      "例如tableau或归结. "
      "但是, 这些方法并不能解决(3). "
      "给定一个可满足公式, "
      "这些算法尽管并不会错误地声称可满足公式是不可满足的, "
      "但是也并不总是会终止. "
      "例如, 以下证明非有效公式的尝试不过只是保持着徒劳的搜索:"
      (CodeB "# tab &lt;&lt;forall x. p(x)>>;;
# meson &lt;&lt;forall x. p(x)>>;;"))
   (P "如果转而尝试" (Code "resolution")
      ", 我们的确会得到以失败作结的终止. "
      "但是, "
      )
   (H3. "AE片段")
   (P "我们已经机械化了的所有一阶逻辑证明过程"
      "最终都是由Herbrand定理所澄清的: "
      "公式的Skolem化无量词形式是不可满足的当且仅当"
      "存在某个ground实例 (复数) 的有限合取是命题不可满足的. "
      "一般而言, 可能的ground实例的集合是无限的, "
      "而使用合一来指导我们的搜索并不能改变这一基础事实. "
      "然而, 在Skolem化形式并不包含除了零元函数 "
      "(即常量) 之外的函数这种特殊情形下, "
      "ground实例的数目是有限的. "
      "例如, 回忆一下Łoś公式:"
      (CodeB "let los =
 &lt;&lt;(forall x y z. P(x,y) /\\ P(y,z) ==> P(x,z)) /\\
   (forall x y z. Q(x,y) /\\ Q(y,z) ==> Q(x,z)) /\\
   (forall x y. P(x,y) ==> P(y,x)) /\\
   (forall x y. P(x,y) \\/ Q(x,y))
   ==> (forall x y. P(x,y)) \\/ (forall x y. Q(x,y))>>;;"))
   (P "如果我们对于其否定进行Skolem化以作为反驳的前奏, "
      "那么结果包含四个常量符号和三个变量, "
      "但是不含有非零元函数:"
      (CodeB "# skolemize(Not los);;
- : fol formula =
&lt;&lt;(((~P(x,y) \\/ ~P(y,z)) \\/ P(x,z)) /\\
   ((~Q(x,y) \\/ ~Q(y,z)) \\/ Q(x,z)) /\\
   (~P(x,y) \\/ P(y,x)) /\\ (P(x,y) \\/ Q(x,y))) /\\
  ~P(c_x,c_y) /\\ ~Q(c_x',c_y')>>"))
   (P "这三个自由变量每个都只能由四个常量(项)之一替换, "
      "于是总共只有" (&= $4^3 64) "个ground实例. "
      "因此, Skolem化了的形式的不可满足性等价于这"
      64 "个ground实例之合取的命题不可满足性. "
      
      )
   (H3. "Miniscoping and the monadic fragment")
   (H3. "三段论")
   (H3. "有限模型性质")
   (H3. "量词消去")
   (H3. "Presburger算术")
   (H3. "复数")
   (H3. "实数")
   (H3. "环, 理想和word问题")
   (H3. "Gr&ouml;bner基")
   (H3. "几何定理证明")
   (H3. "将判定过程进行组合")
   (H3. "深入阅读")
   (P "许多逻辑学教材讨论了判定问题. "
      "关于判定问题在逻辑有效性方面可判定与不可判定的情形, "
      "可参见Börger, Grädel和Gurevich (2001), Ackermann (1954) "
      "以及Dreben和Goldfarb (1979), "
      "此外Hilbert和Ackermann (1950) 对此也有简要论述. "
      "需要注意的是, 判定问题通常从可满足性而非有效性的对偶角度加以处理, "
      "因此在将此类文献与本文的讨论相对照时, 需要在量词前缀中互换"
      $forall "与" $exists "的角色. Rabin (1991) 对可判定理论进行了综述, "
      "其中一些我们已在本章中加以讨论.")
   (P "三段论在诸多逻辑史著作中有详尽讨论, "
      "如Bocheński (1961), Dumitriu (1977), "
      "Kneale和Kneale (1962) 以及Kneebone (1963).")
   (P "文献中还有若干其他数学理论的量词消去结果. "
      "两个较为困难的例子是Abel群理论 (Szmielew 1955) "
      "与Boole代数理论 (Tarski 1949). "
      "Kreisel和Krivine (1971) 有一章专门讨论量词消去, "
      "内容涵盖可分Boole代数理论 (以及作为特例的原子Boole代数). "
      "其他标准模型论教材, 如Chang和Keisler (1992), "
      "Hodges (1993b) 以及Marcja和Toffalori (2003), "
      "也讨论了量词消去及模型完备性, " $o "-极小性等相关概念; "
      "模型完备性的一种表述 (A. Robinson 1963; MacIntyre 1991) 为: "
      "对于理论" $T ", 每个公式都" $T "-等价于一个纯全称公式 "
      "(或者等价地, 纯存在公式). "
      "Ershov, Lavrov, Taimanov和Taitslin (1965) "
      "在文末对量词消去方法成功应用的各类理论进行了综述. "
      "Soloray (私人通信) 也向本书作者介绍了一种适用于"
      "各类实与复向量空间的量词消去过程.")
   (P "Presburger算术及若干相关理论的处理可见于Enderton (1972), "
      "而Smoryński (1980) 则对Presburger与Skolem"
      "的不同量词消去程序作了详细阐述. "
      "该书包含大量相关主题的内容, "
      "其中包括对相应乘法理论的讨论. "
      "Smoryński (1981) 给出了Presburger算术量词消去的一个精彩应用. "
      "Yap (2000) 进一步深入探讨了相关可判定性问题, "
      "并包含许多其他相关材料. "
      "Presburger算术的其他处理方法还包括"
      "Omega测试 (Pugh 1992) 与Williams (1976) 的方法. "
      "Weispfenning (1999) 给出了一种适用于"
      "实数与整数混合线性算术的量词消去过程.")

   (H3. "练习")
   ))
