#lang racket
(provide blind.html french.css)
(require SMathML)
(define (Seq X)
  (@ (_ X $n)))
(define french.css
  '(("q"
     (quotes "'«' '»'"))))
(define-infix*
  (&=> $=>)
  (&disj $disj)
  (&conj $conj))
(define-@lized-op*
  (@disj &disj))
(define (denotation x)
  (&db0 x))
(define blind.html
  (TnTmPrelude
   #:title "盲点"
   #:css '("styles.css" "french.css")
   (H1. "盲点: 逻辑学讲义")
   (P "本书可谓是逻辑学家Jean-Yves Girard的思想之大成.")
   (H2. "存在 vs. 本质")
   (H3. "存在和本质的对立")
   (P "Kubrick著名的电影" (Q "2001") "的开场简直就是智慧的创生, "
      "其来自于从外太空坠落的巨石, 又被赐予了一群愚笨的猴子, "
      "那时它们还无法对付狮子, 野猪, 等等. 我们观察到:"
      (Ol #:attr* '((type "i"))
          (Li (Q "伟大的银河族 (great galactics)")
              "控制着这智慧, 其像病毒一样传播, "
              "但是这个族群在其幼生期必然也像某种猴子一样, "
              "因此...")
          (Li "(电影里的)智慧被视为一种绝对的属性, "
              "独立于经验, 独立于互动, "
              "就像是在某种预先存在的硬件之上实现的软件. "
              "若是这巨石落在Galápagos之上的话, "
              "爬虫或许就会统治世界: 开启乌龟时代..."))
      "实际上, 如果忘掉作者 (Arthur C. Clarke) "
      "那令人倍感折磨的科学主义, "
      "这个开篇可以读作Fátima式的奇迹.")
   (P "对于这样一种" (Q "解释")
      "的反应是明显且本能性的: "
      "人们认为这是启发性的还是愚蠢的, "
      "取决于他是" (Em "本质主义者") "还是"
      (Em "存在主义者") ".")
   
   (H3. "本质主义和存在主义计划")
   (H4. "集合论")
   
   (H4. "Hilbert的计划 (the hilbertian project)")
   (P (Q "Hilbert纲领") ", 基本上刻画于1920年左右, "
      "对应于数学的" (Em "形式主义")
      "视角. 这种方式经常被简化为"
      (Q "数学是纯粹的symbol pushing, "
         "其意义并不比象棋游戏更多, "
         "唯一重要的只是游戏规则的一致性")
      ". 不过, 这种挑衅不应该按照字面理解: "
      "Hilbert形式主义的背后是复杂的思考, "
      "即便这种思考是归约主义式的. "
      "尽管完全没有质疑集合论的旨趣, "
      "Hilbert对待集合论本质主义的方式却与集合论本身的精神背道而驰, "
      "特别是在无限的方面. "
      "以下是Hilbert想法的一个未经认证的版本. "
      "{译注: 大概就是作者并不能自信地声明这就是Hilbert的本意.}"
      (Ol #:attr* '((type "i"))
          (Li "我们关于无限的直觉是具有误导性的; "
              "人们讨论对象, 而人们并没有看见它们. "
              "与之相对的是, 推理 (表达以逻辑形式化) "
              "是真实可感的. 因此, 我们必须要明白"
              "什么是一个证明, 在其最数学的方面之下, 即形式化的; "
              "诚然, 也就是理解" (Em "它有什么用") ".")
          (Li "一个证明产生一个定理" $A
              ", 其可以在另一个证明之中(作为引理)重用, "
              "根据类似于" (Em "Modus Ponens") "的规则:"
              (MB (&rule $A (&=> $A $B) $B) ".")
              "接着" $B "可以作为引理用来产生" $C
              " (给定" (&=> $B $C) "的话), 如此可以继续下去; "
              "这没有带来什么新的东西, 诚然如此, "
              (Em "Modus Ponens") "的一个变种可以产生"
              (MB (&rule (&=> $A $B) (&=> $B $C)
                         (&=> $A $C)) ",")
              "换言之, 我们本可以在" $A "和" (&=> $A $C)
              "之间作出一个" (Em "Modus Ponens")
              "而直接得到" $C ".")
          (Li ""
              )
          )
      )
   (H4. "Brouwer的计划")
   (P "与Poincaré反对形式主义者的批评 "
      "(有时不那么公平, 但总是切中要害) 同出一源, "
      "Brouwer提出了一种对于无限的反逻辑主义的重新解读. "
      "如今人们可以辨认出Brouwer和Hilbert的共同之处, "
      "但是我们必须承认, 1920年代他们的关系相当紧张, "
      "类似于牧师Don Camillo (Brouwer) 和共产主义市长"
      "Peppone (Hilbert) 之间的对立, "
      "不过没有丝毫隐藏的同情, 障碍在于科学主义. "
      "顺便值得一提的是, Brouwer所建立的学派, 即"
      (Em "直觉主义") ", 主张直觉先于语言. "
      "Brouwer并没有拒绝无限 (与Hilbert的有限主义相对, "
      "Hilbert只将无限视为一种" (Em "说话方式(façon de parler)")
      "), 但是他拒绝了无限的最Thomist (" (Q "actual") ") 的方面; "
      "特别是集合论以及人们可以逐点逐值定义实变量函数的想法. "
      "一些原则在有限的论域之中是有效的, "
      "但是在无限的情形之下不再成立, 典型的例子是排中律"
      (&disj $A (&neg $A)) ". 对于"
      (Em "tertium non datur(意即没有第三种情况,即排中律)")
      "的通常澄清是一个公式" $A "具有一个真值 (为真或者为假). "
      "然而, 尽管人们可以在有限情形之下" (Em "计算")
      "一个真值, 没有算法可以处理无限多步的验证: "
      "这就是为什么Brouwer说无限的情形是可疑的. "
      "这种方式是相当现代的, 意即真性 (truth) 并不独立于方法, "
      "协议, 验证而存在; 我们应该将其与量子物理联系起来, "
      "并忘掉主观主义, 甚至是唯我论, 有时Brouwer陷入了这歧途.")
   (P "我们之后将有机会重访直觉主义, 通过线性逻辑, "
      "其主要作为直觉主义(逻辑)的" (Q "对称化")
      "版本出现. 让我们总结这次短暂的与Brouwer的相遇以两个"
      "(想象中的)对于Hilbert的驳论.")
   (P (B "Modus Ponens: ")
      
      )
   (P (B "Tertium non datur: ")
      "Hilbert接受了排中律; 并非是出于他相信" $A
      "具有一个预先存在的真值, 而是因为这简化了情况: "
      (Q "一种性质, 其什么也不意味, 但也没有代价")
      ". 从技术上说, 这种论证是可行的. "
      "的确, 我们知道 (自1932: ) "
      "经典逻辑可以被忠实地翻译为直觉主义逻辑: "
      (Q "每个地方 (everywhere)")
      "加上双重否定就足够了. 特别地, 排中律, "
      "一旦被翻译为" (&neg (&neg (@disj $A (&neg $A))))
      ", 其就变成直觉主义可证的了, "
      "因而添加这个就不再是" (Q "有风险")
      "的了. "
      )
   (H3. "G&ouml;del和自此之后")
   (H4. "失败和衰落")
   
   (H3 "第1.A节 本质主义 vs. Plato主义 (platonism)")
   
   (H2. "不完备性")
   (H3. "技术性陈述")
   (H4. "定理的困难")
   (H4. "对角线论证")
   (P "论证方式如下: 给定函数" (app $g $z) "和"
      (appl $f $x $y) ", 我们构造"
      (&:= (app $h $x) (app $g (appl $f $x $x)))
      "; 如果碰巧" $h "具有形式"
      (&= (app $h $x) (appl $f $x $a))
      ", 那么我们就得到了"
      (&= (app $h $a) (appl $f $a $a)
          (app $g (appl $f $a $a)))
      "; " (&:= $b (appl $f $a $a))
      "是" $g "的一个不动点, 这显然是意料之外的. "
      "依据上下文, 我们可以推出各种各样的结果, "
      "其中绝大多数都是悖论性的."
      (Ol (Li (B "Cantor的paradox: ")
              $NN "和其幂集之间不存在双射. 如果"
              (Seq $X) "枚举了" $NN "的子集, 并且定义"
              (MB (&:= (appl $f $m $n)
                       (Choice0
                        ($1 $cm (∈ $m $X_n))
                        ($0 $cm "otherwise"))))
              "又定义"
              (&cm (&:= (app $g $0) $1)
                   (&:= (app $g $1) $0))
              ", 那么" (&= (app $g $b) $b)
              ", 一个矛盾. {译注: 补充一下细节, 尽管可能人尽皆知. "
              "根据序列" (Seq $X) ", 我们可以定义一个" $NN "的子集"
              (MB (&:= $Y (setI (∈ $m $NN) (&!in $m $X_m))))
              "既然" (Seq $X) "枚举了" $NN "的子集, 所以存在"
              (∈ $a $NN) "满足" (&= $Y $X_a) ", 那么"
              (MB (&= (appl $f $x $a)
                      (Choice0
                       ($1 $cm (∈ $x $X_a))
                       ($0 $cm "otherwise"))
                      (Choice0
                       ($1 $cm (&!in $x $X_x))
                       ($0 $cm (&in $x $X_x)))))
              (MB (&= (app $h $x)
                      (app $g (appl $f $x $x))
                      (ap $g
                          (pare
                           (Choice0
                            ($1 $cm (&in $x $X_x))
                            ($0 $cm (&!in $x $X_x)))))
                      (Choice0
                       ($1 $cm (&!in $x $X_x))
                       ($0 $cm (&in $x $X_x)))))
              "也就是说, "
              (&= (appl $h $x) (appl $f $x $a)) ".}")
          (Li (B "Russell的antinomy: ")
              "相同的故事, " $NN "被代之以所有集合之集合. "
              "整数变成了任意的集合, 于是定义"
              (MB (&:= (appl $f $x $y)
                       (Choice0
                        ($1 $cm (∈ $x $y))
                        ($0 $cm "otherwise"))))
              "而" $g "和之前一样, 那么"
              (&:= $a (setI $x (&!in $x $x)))
              "而" (&:= $b (&in $a $a))
              ", 于是" (&<=> (∈ $a $a) (&!in $a $a))
              ". {译注: 这里的" $1 "相当于真, " $0
              "相当于假, " $g "相当于否定. 以此解释, "
              "1:相当于推出了"
              (&<=> (∈ $a $X_a) (&!in $a $X_a))
              ".}")
          (Li (B "程序的不动点: ")
              "如果" (Seq $f) "枚举了所有将" $NN
              "送往" $NN "的程序, 如果" $g "是" $f_n
              "中的一个, 那么前述构造可以产生" $g
              "的一个不动点. "
              "鉴于绝大多数函数并不具有不动点, "
              "我们可以断言不动点往往对应于发散的计算. "
              "典型地, 从" (&:= (app $g $n) (&+ $n $1))
              "开始, " (&= $a (&+ $a $1) (&+ $a $2) $..c)
              ", 这表明我们的确是在处理" (Em "部分")
              "函数. {译注: 本来写的内容删掉了, "
              "因为我感到存在细节问题. "
              "对于这样一本被作者Jean-Yves Girard故意写得玄之又玄的书籍, "
              "我只能对于缺失的细节妄加揣测. "
              "似乎是这样, 这里的" $f "是基于序列" (Seq $f)
              "的, 也就是"
              (&:= (appl $f $m $n) (app (denotation $f_n) $m))
              ". 然后, "
              (&:= (app $h $x)
                   (app (denotation $g)
                        (appl $f $x $x))
                   (app (denotation $g)
                        (app (denotation $f_x) $x)))
              ". 或许我们来到了" (B "可疑")
              "的一步, 作者大概认为存在"
              (∈ $a $NN) "使得" (&= $h (denotation $f_a))
              ", 于是"
              (&= (app $h $x)
                  (app (denotation $f_a) $x)
                  (appl $f $x $a))
              ". 那么, 可以推出"
              (&= (app (denotation $g) (appl $f $a $a))
                  (app $h $a)
                  (appl $f $a $a))
              ", 即" (app (denotation $f_a) $a)
              "是" (denotation $g) "的一个不动点?}")
          (Li (B $lambda "演算的不动点: ")
              "如果" $M "是一个" $lambda "项"
              )
          (Li (B "第一不完备性定理: ")
              
              )
          )
      )
   (H4. "编码")
   
   (H2. "经典相继式: LK")
   (H2. "直觉逻辑: LJ, NJ")
   (H2. "函数式解释")
   (H3. "证明作为函数")
   (H4. "证明的" (Q "语义"))
   
   (H4. "函数式解释")
   (P (B "原子: ")
      
      )
   (P (B "合取: ")
      $theta "是" (&conj $A $B) "的一个证明当且仅当"
      $theta "是一个序对" (tu0 $theta_1 $theta_2)
      ", 其中" $theta_1 "是" $A "的一个证明而"
      $theta_2 "是" $B "的一个证明.")
   (P (B "析取: ")
      
      )
   (P (B "Implication: ")
      $theta "是" (&=> $A $B) "的一个证明当且仅当"
      $theta "是一个应用, 其联系" $A "的每个证明"
      $theta^ "以" $B "的一个证明"
      (app $theta $theta^)
      ". {译注: 一般而言, 我们会将" $theta
      "称为一个函数.}")
   (H4. "盲点")
   (P "这定义留下了一些盲点. 例如, 既然"
      )
   (H3. "纯" $lambda "演算")
   (H3. "Curry-Howard同构")
   (H2. "系统F")
   (H3. "系统F")
   (H2. "范畴论式解释")
   (H2. "coherent空间")
   (H2. "线性逻辑")
   (H2. "perfection vs. imperfection")
   (H2. "证明网")
   (H2. "一个假设: 极化")
   (H2. "设计和行为")
   (H2. "Ludics: 重构")
   
   ))