#lang racket
(provide bps.html)
(require SMathML)
(define bps.html
  (TnTmPrelude
   #:title "构建问题解决器"
   #:css "styles.css"
   (H1. "构建问题解决器")
   (H2. "前言")
   (H2. "导引")
   (H2. "传统问题求解")
   (H3. "问题空间模型")
   (H3. "CPS设计")
   (P "从概念上来说, CPS由两部分构成: "
      "一个是用户提供问题空间的接口, "
      "另一个是搜索引擎. 我们从问题空间的接口开始. "
      "显然我们需要操作状态和行动的能力. "
      "那么哪些操作是我们需要的呢?")
   (P "以下是三种我们需要能够对于状态施行的操作."
      (Ol (Li "目标检测: 确定状态是否满足目标要求.")
          (Li "状态同一性判断: 判断两个对于状态的描述是否指的是同一个状态.")
          (Li "状态展示: 产生对于给定状态的人类可读描述.")))
   (H3. "CPS实现的事项")
   (H3. "CPS实现")
   (H3. "Boston地铁导航")
   (H3. "解决代数问题")
   (H3. "搜索之荣光已逝?")
   (H3. "反向指针")
   (P "这里的模式匹配器和化简器受到了Gerald Sussman"
      "出于研究目的所写的Scheme版本的启发.")
   (H3. "练习")
   (H3. "参考文献")
   (H2. "模式导向的推理系统")
   (H3. "模式导向的推理系统模型")
   (H3. "TRE的设计")
   (H3. "TRE的实现")
   (H3. "自然演绎")
   (H3. "结论")
   (H3. "反向指针")
   (H3. "练习")
   (H3. "参考文献")
   (H2. "扩展模式导向的推理系统")
   (H2. "事实维护系统导引")
   (H2. "基于辩护 (justification) 的事实维护系统")
   (H2. "使得JTMS运作")
   (H2. "基于逻辑的事实维护系统")
   (H2. "使得LTMS运作")
   (H2. "实现定性过程理论")
   (H2. "基于假设的事实维护系统")
   (H2. "改善事实维护系统的完备性")
   (H2. "使得ATMS运作")
   (H2. "前件约束语言")
   (H2. "基于假设的约束语言")
   (H2. "一个小型诊断引擎")
   (H2. "符号松弛系统")
   (H2. "一些前沿")
   ))