#lang racket
(provide catlog.html)
(require SMathML)
(define $. (Mo "."))
(define (∀ R P)
  (: $forall R $. P))
(define (∃ R P)
  (: $exists R $. P))
(define-infix*
  (&conj $conj))
(define-@lized-op*
  (@conj &conj))
(define catlog.html
  (TnTmPrelude
   #:title "范畴逻辑引论"
   #:css "styles.css"
   (H1. "范畴逻辑引论")
   (H2. "代数理论")
   (P "代数理论 (algebraic theory) 是对于结构的描述, "
      "其完全基于操作 (operation) 和等式 (equation). "
      "所有这样的代数概念都共有着一些相当深刻而广泛的性质, "
      "从自由代数的存在性到Lawvere的对偶理论. "
      "这些之中最基本的内容在本章呈现. "
      "这里的发展也充当着" (Em "函子语义(functorial semantics)")
      "的一般模式 (general scheme) 的第一个例子和模板, "
      "之后的章节里也要用于其他逻辑概念.")
   (H3. "句法和语义")
   (P "我们从诸如群, 环, 格之类的代数结构的一般方法开始. "
      "这些是由公理化 (axiomization) 所刻画的, "
      "其只牵涉单一种类 (sort) 的变量和常量, "
      "操作, 以及等式. 操作在每一处都有定义是重要的, "
      "这排除了两个重要的例子: 域, 鉴于" $0
      "的(乘)逆没有定义, 以及范畴, 鉴于复合只对特定的态射序对有定义.")
   (P "让我们从相当基础的代数理论开始: 群的理论. "
      "在一阶逻辑之中, 一个群可以被描述为一个集合" $G
      "带有一个二元操作" (func $d* (&c* $G $G) $G)
      ", 其满足两条一阶公理:"
      (MB (∀ (∈ $x $y $z $G)
             (associate &d* $x $y $z)))
      (MB (∃ (∈ $e $G)
             (∀ (∈ $x $G)
                (∃ (∈ $y $G)
                   (@conj
                    (&= (&d* $e $x)
                        (&d* $x $e)
                        $x)
                    (&= (&d* $x $y)
                        (&d* $y $x)
                        $e))))))
      "更仔细地观察这些公理的逻辑形式, "
      "我们会发现第二条公理 "
      "(其表达了单位元和逆元的存在性) "
      "有点不尽如人意, 因为它牵涉嵌套的量词. "
      "不仅这会使得解释复杂化, "
      "而且其也并非真正必要, "
      "鉴于一个群中的单位元和逆元是唯一确定的. "
      "因此, 我们可以将它们添加到结构之中"
      "并重新表述如下. "
      )
   (H2. "命题逻辑")
   (H2. "一阶逻辑")
   (H2. "类型论")
   (H2. "依赖类型论")
   ))