#lang racket
(provide catlog.html)
(require SMathML)
(define catlog.html
  (TnTmPrelude
   #:title "范畴逻辑引论"
   #:css "styles.css"
   (H1. "范畴逻辑引论")
   (H2. "代数理论")
   (P "代数理论 (algebraic theory) 是对于结构的描述, "
      "其完全基于操作 (operation) 和等式 (equation). "
      "所有这样的代数概念都共有着一些相当深刻而广泛的性质, "
      "从自由代数的存在性到Lawvere的对偶理论. "
      "这些之中最基本的内容在本章呈现. "
      "这里的发展也充当着" (Em "函子语义(functorial semantics)")
      "的一般模式 (general scheme) 的第一个例子和模板, "
      "之后的章节里也要用于其他逻辑概念.")
   (H3. "句法和语义")
   (P "我们从诸如群, 环, 格之类的代数结构的一般方法开始. "
      "这些是由公理化 (axiomization) 所刻画的, "
      "其只牵涉单一种类 (sort) 的变量和常量, "
      "操作, 以及等式. 操作在每一处都有定义是重要的, "
      "这排除了两个重要的例子: 域, 鉴于" $0
      "的(乘)逆没有定义, 以及范畴, 鉴于复合只对特定的态射序对有定义.")
   (P "让我们从相当基础的代数理论开始: 群的理论. "
      "在一阶逻辑之中, 一个群可以被描述为一个集合" $G
      "带有一个二元操作" (func $d* (&c* $G $G) $G)
      ", 其满足两条一阶公理:"
      
      )
   (H2. "命题逻辑")
   (H2. "一阶逻辑")
   (H2. "类型论")
   (H2. "依赖类型论")
   ))