#lang racket
(provide cmu15458.html)
(require SMathML)
(define (|[]| a b)
  (: $lb a $cm b $rb))
(define (|()| a b)
  (: $lp a $cm b $rp))
(define (|[)| a b)
  (: $lb a $cm b $rp))
(define (|(]| a b)
  (: $lp a $cm b $rb))
(define (lc . arg*)
  (apply &+ (map2 &i* arg*)))
(define $conv (Mi "conv"))
(define (&conv S)
  (app $conv S))
(define $\|
  (Mo "|" #:attr* '((stretchy "true"))))
(define (SetI a b)
  (: $lc a $\| b $rc))
(define ∀
  (case-lambda
    ((x) (: $forall x))
    ((x . arg*) (: $forall (apply ∈ x arg*)))))
(define (&∀ P . arg*)
  (: P (apply ∀ arg*)))
(define-syntax-rule (define-simple* (&id $id str) ...)
  (begin
    (define $id (Mi str))
    ...
    (define (&id x) (app $id x))
    ...))
(define-simple*
  (&Cl $Cl "Cl")
  (&St $St "St")
  (&Lk $Lk "Lk"))
(define $\\ (Mo "\\"))
(define-infix*
  (&\\ $\\))
(define cmu15458.html
  (TnTmPrelude
   #:title "CMU 15-458 离散微分几何笔记"
   #:css "styles.css"
   (H1. "CMU 15-458 离散微分几何笔记")
   (P "这个课对于我而言相当有趣, 或者有吸引力, 尽管我只看了概览的部分. "
      "老实说, 我已经很久没有学过什么数学了, 尽管我本科的专业其实是数学. "
      "基本上从小我就相当喜欢数学, 尤其是思考一个问题有没有更加直接, "
      "更加优雅, 更加简单的解决方法. 如果用Bourbaki的想法来说, "
      "大概就是寻找问题的" (Q "结构") ". 可是不知为何, "
      "大学的时候我变得相当厌恶数学. 这并不是因为技巧难以掌握, "
      "而是因为基础问题. 或许我以前也总是遇到各种基础问题, "
      "但是紧张的学习迫使我总是运用我的直觉. "
      "大学里我有比以前多得多的时间, 所以我开始检视数学的基础. "
      "我遇到了太多的问题, 耗费了太多昼夜进行无谓的思考, "
      "也没有认真学习集合论和证明论等数理逻辑分支. "
      "尽管我想其中大部分思考是有意义的, 然而我只是人类而已, "
      "没有太多时间可以供我思考这些东西, 而且我的家境不算富裕. "
      "我尤其不擅长分析, 因为我发现我找不到分析学的坚实基础. "
      "分析学里有很多ad hoc的定义, 但是并没有特定的理论可以解释为什么这么做. "
      "更多的情况下是这么做是可行的, 所以就这么做比较好. "
      "泛函分析还有测度论里的一些东西比较优雅, 但是总体上分析给我的感觉就是杂乱无章, "
      "甚至还会出现几百年前的天书般的证明, 我完全没法理解那些人是怎么"
      (Q "硬做") "出来的. 代数和拓扑等领域的问题相较于分析要少许多 (虽然不是没有), "
      "但是我因为应付课内的一大堆分析课程就已经精疲力竭, 导致我几乎也没有学习其他的东西. "
      "以前的我其实也喜欢硬做, 但是如果只是硬做, 无法令我满意. "
      "甚至是现在的我也保留了以前的习惯, 就是在思考良久之后, 试图找出最为自然的方法. "
      "然而, 我现在已经几乎不做题了, 这也导致我的数学能力不断下降. "
      "最近几年我基本上就是记忆定义加上验证证明, 几乎不再探究为什么, "
      "而以前的我总是习惯于见山开路遇水架桥 (基本上我的同学和老师都认为我在数学方面相当有天赋). "
      "我觉得这个课的教授者Keenan Crane相当有教学天分, 它让我回想起了我以前的一些想法和感觉. "
      "在某种意义上, 我现在的状态完全是闭门造车式的咎由自取, "
      "以至于我现在认识到采取各种各样的方法和多种多样的角度学习和理解的可贵之处. "
      "我本来似乎已经完全麻木了, 不过或许现在是重新开始思考的好时机.")
   (H2. "概览")
   (P "第一节课只是对于离散微分几何的概览, 着重考虑了曲率的离散定义, "
      "通过连续情形的类比. 说实在的, 我也没有能够把握所有的细节 (这真是令人惭愧), "
      "以至于到了最后只有no free lunch这一想法刻在了我的脑海里而已. "
      "有些东西我在其他的书籍中其实也遇到了, 不过我暂时已经不想回忆到底看了哪些书, "
      "因为那只会让我痛苦不堪.")
   (H2. "网格 (mesh)")
   ((definition #:n ". 凸集 (convex set)")
    "对于" $RR^n "的一个子集" $S ", 我们称其为凸的 (convex), "
    "如果对于任意的点" (∈ $p $q $S) ", 连接" $p "和" $q
    "的线段上的每一个点都位于" $S "之中. 换言之, 对于任意的"
    (∈ $t (|[]| $0 $1)) ", " (∈ (&+ $p (&i* $t (@- $q $p))) $S) ".")
   ((definition #:n ". 凸包 (convex hull)")
    "对于" (&sub $S $RR^n) ", " $S "的凸包" (&conv $S) "是以" $S
    "为子集的最小凸集. 换言之, 其是包含" $S
    "的所有凸集之交, 鉴于任意凸集族之交仍然是凸集.")
   ((definition #:n ". 线性无关")
    "向量" (&cm $v_1 $..h $v_n) "是线性无关的, 如果其线性组合"
    (&+ (&i* $k_1 $v_1) $..c (&i* $k_n $v_n))
    "为零(向量)可以推出每个组合系数" (&cm $k_1 $..h $k_n) "均为零.")
   ((definition #:n ". 仿射无关")
    "点" (&cm $p_0 $..h $p_k) "是仿射无关的, 如果向量"
    (&cm (&:= $v_i (&- $p_i $p_0)) (&= $i (&cm $1 $..h $k)))
    "是线性无关的.")
   ((definition #:n ". 单纯形 (simplex)")
    "一个" $k "-单纯形是" (&+ $k $1) "个仿射无关的点的凸包, "
    "这些点被我们称为顶点 (vertex).")
   ((example)
    "一个" $0 "-单纯形是一个点, 一个" $1 "-单纯形是一个线段, 一个"
    $2 "-单纯形是一个三角形, 一个" $3 "-单纯形是一个四面体, 在"
    (&>= $k $4) "的情况下一个" $k "-单纯形没有什么人类可以直接想象的几何直观.")
   ((definition #:n ". 重心坐标 (barycentric coordinate)")
    "我们可以使用重心坐标以更显式地描述一个单纯形. 如果一个" $k
    "-单纯形" $sigma "的" (&+ $k $1) "个顶点为" (&cm $p_0 $..h $p_k)
    ", 那么我们可以将" $sigma "的每个点表示为其顶点的凸组合 (convex combination). "
    "换言之, 我们要求权重都" (&>= $ $0) "且这些权重之和为" $1
    ". 而且, 单纯形" $sigma "其实就是由其顶点的所有凸组合构成的集合."
    (MB (&= $sigma
            (SetI (sum (&= $i $0) $k (&i* $t_i $p_i))
                  (&cm (&= (sum (&= $i $0) $k $t_i) $1)
                       (&∀ (&>= $t_i $0) $i)))))
    "这些权重" $t_i "就被称为重心坐标. 更一般地说, "
    "一些点的所有凸组合构成的集合形成了这些点的凸包, "
    "不论其是否是仿射无关的.")
   ((definition #:n ". 标准单纯形 (standard simplex)")
    "标准" $n "-单纯形是点集"
    (MB (&:= $sigma
             (SetI (∈ (tu0 $x_0 $..h $x_n)
                      (^ $RR (&+ $n $1)))
                   (&cm (&= (sum (&= $i $0) $n $x_i) $1)
                        (&∀ (&>= $x_i $0) $i)))) "."))
   ((definition #:n ". 面 (face)")
    "一个单纯形的一个面是任意的一个以该单纯形的顶点集"
    "的子集为顶点集的单纯形. 根据约定, "
    "以空集为顶点集的单纯形是空集, 其是" (@ $-1)
    "-单纯形.")
   ((definition #:n ". 单纯复形 (simplicial complex)")
    "一个(几何)单纯复形是一个单纯形的集合, 其满足"
    (Ul (Li "复形中的任意两个单纯形的交都是它们公共的面;")
        (Li "复形中的每个单纯形的每个面也都在复形之中.")))
   ((definition #:n ". 抽象单纯复形 (abstract simplicial complex)")
    "令" $S "是一个集合族. 如果对于每个" (∈ $sigma $S)
    ", 其所有的子集也都是" $S "的元素, 那么" $S
    "就是一个抽象单纯复形, 而一个大小为" (&+ $k $1)
    "的集合" (∈ $sigma $S) "是一个抽象" $k "-单纯形.")
   ((example)
    "一个(至少拥有一条边的)简单无向图"
    "可以视为一个(" $1 "维的)抽象单纯复形, "
    "其中的" $0 "-单纯形就是图的顶点 (vertex), 而" $1
    "-单纯形就是图的边 (edge). 简单无向图的意思是"
    "没有自环并且两个不同的顶点之间至多只有一条边的无向图.")
   ((definition #:n ". 闭包 (closure)")
    "对于一个单纯复形" $K:script ", 其子集" (&sube $S $K:script)
    "的闭包" (&Cl $S) "是包含" $S "的最小子复形.")
   ((definition #:n ". 星 (star)")
    "对于一个单纯复形" $K:script ", 其子集"
    (&sube $S $K:script) "的星"
    (MB (&:= (&St $S)
             (setI (∈ $sigma $K:script)
                   (: "存在" (∈ $tau $S) ",&nbsp;"
                      $tau "是" $sigma "的一个面"))) ".")
    "{注记: 幻灯片上对此的描述是"
    (Q "union of simplices containing a given subset of simplices")
    ", 这对于我这种并非以英文为母语的人而言真是难以理解.}")
   ((definition #:n ". 链接 (link)")
    "对于一个单纯复形" $K:script ", 其子集"
    (&sube $S $K:script) "的链接"
    (MB (&:= (&Lk $S)
             (&\\ (&Cl (&St $S))
                  (&St (&Cl $S)))) "."))
   
   (H2. "流形 (manifold)")
   
   (H2. "外代数 (exterior algebra)")
   
   (H2. $k "-形式")
   
   (H2. "微分形式")
   
   ))