#lang racket
(provide constructive_logic_notes.html)
(require SMathML)
(define (subst d x A)
  (: (bra0 (&/ d x)) A))
(define $<-> (Mo "&harr;"))
(define $impl $sup)
(define-infix*
  (&impl $impl)
  (&conj $conj)
  (&disj $disj)
  (&<-> $<->))
(define $. (Mo "."))
(define (∀ x A)
  (: $forall x $. A))
(define (∃ x A)
  (: $exists x $. A))
(define constructive_logic_notes.html
  (TnTmPrelude
   #:title "构造性逻辑讲义"
   #:css "styles.css"
   (H1. "构造性逻辑讲义")
   (P "这基本上是对于Frank Pfenning的构造性逻辑课程的讲义的翻译.")
   (H2. "何为(构造性)逻辑?")
   (H3. "引论")
   (P "根据维基百科, 逻辑学是研究有效推理和论证的学科. "
      "从这个定义的广度可以立即看出, "
      "逻辑学在哲学和数学领域构成了一个重要的研究方向. "
      "逻辑工具和方法在计算机硬件和软件的设计, "
      "描述和验证中也发挥着至关重要的作用. "
      "本课程将重点关注逻辑学在计算机科学中的这些应用. "
      "为了正确理解逻辑学及其与计算机科学的相关性, "
      "我们需要大量借鉴哲学和数学中更为古老的逻辑学传统. "
      "我们将在这些讲义中讨论逻辑学的一些相关历史, "
      "并提供进一步阅读的指引. "
      "在这次的介绍里, 我们只是给出了一个简要的引论. "
      "至于深入的一般性阅读材料, "
      "我们推荐Troelstra and van Dalen [1988]的引论部分, "
      "以及斯坦福哲学百科全书 (Stanford Encyclopedia of Philosophy) 中的"
      (A "直觉主义逻辑"
         #:attr* '((href "https://plato.stanford.edu/entries/logic-intuitionistic/")))
      "和"
      (A "数学哲学中的直觉主义"
         #:attr* '((href "https://plato.stanford.edu/entries/intuitionism/")))
      "词条.")
   (H3. "Russell悖论")
   (P "在19世纪末期和20世纪初期, "
      "数学处于一种可以称之为基础危机的状态, "
      "这场危机是由日益抽象的数学所引发的. "
      "逻辑悖论的发现加深了这场危机. "
      "Russell悖论 (发现于1901年) 尤其沉重打击了Frege试图"
      "发展一种可以用来进行所有数学推理的通用逻辑的努力 [Frege, 1879]. "
      "以现代语言, Russell悖论或许最容易通过集合来理解. "
      "Russell将" $R "定义为由所有不包含自身的集合构成的集合."
      (MB (&= $R (setI $x (&!in $x $x))))
      "那么, " $R "是" $R "的一个元素吗? "
      "如果是的话, 那么根据" $R "的定义必然有" (&!in $R $R)
      ". 如果不是的话, 那么又一次根据" $R "的定义必然有"
      (&in $R $R) ". 于是, 我们发现"
      (MB (&<-> (&in $R $R) (&!in $R $R)))
      "因而我们有了一个悖论性的命题, "
      "这个命题为真当且仅当其为假. "
      "Russell的解决方案是引入" (Em "类型")
      "以使得集合" $R "因为一个集合不能是其自身的元素"
      "而不能被构造出来. Whitehead和Russell的分歧类型论 "
      "(ramified type theory) Whitehead and Russell [1910–13]"
      ", 之后由Church [1940]演化成为他的" (Em "简单类型论")
      ", 解决了这个特定的问题. "
      "{译注: 从历史上来看, "
      "英年早逝的Frank Ramsey也对于简单类型论有重要的贡献.} "
      "其他的解决方案存在于集合论之中.")
   (H3. "直觉主义")
   (P "除了对于某个特定的系统中的某个问题进行提问, "
      "我们还可以进行更为一般的提问: "
      "当我们做数学的时候, 我们是在做什么呢? "
      "从柏拉图主义的角度来看, "
      "诸如整数, 有理数, 或者实数这样的数学对象具有客观的存在, "
      "而数学家只是试图理解这种真实性 (reality). "
      "Brouwer [1907], 作为直觉主义的创立者, "
      "转而将数学考虑为施行心智中的构造. "
      "由此数学更多与构造和知识有关, "
      "而非(一些难以捉摸的)绝对真性 (truth). "
      "从Brouwer的观念来看, 仅当我们知道"
      $A "为真或者" $B "为真的时候才能断言" (&disj $A $B)
      ". 特别地, 在一般情况下我们不能必然断言"
      (Em "排中律") (&disj $A (&neg $A))
      ", 因为我们可能既不知道" $A "的一个证明, "
      "也不知道" $A "的一个反驳. "
      "一个例子是哥德巴赫猜想 (让我们称其为" $G
      "), 即每个大于二的偶数都是两个素数之和. "
      "既然哥德巴赫猜想已经悬而未决将近三百年了, "
      "我们并不知道其一个证明, 也不知道其一个反例. "
      "因此, 我们无法言称" (&disj $G (&neg $G))
      "为真. 但是, 我们也不能排除之后或许我们就可以知道的可能性. "
      "{译注: 这句话让人想到Kripke语义.}")
   (P "我们将不会纠结于Brouwer关于直觉主义的特定形式的细节, "
      "但是我们可以从中提取出以下直觉主义的真性定义 "
      "(这个定义有些刻意地非形式化) "
      "[Troelstra and van Dalen, 1988]:"
      (Ul (Li "一个对于" (&conj $A $B)
              "的证明是通过呈现一个对于" $A
              "的证明和一个对于" $B
              "的证明而给出的.")
          (Li "一个对于" (&disj $A $B)
              "的证明是通过呈现一个对于" $A
              "的证明或一个对于" $B
              "的证明而给出的.")
          (Li "一个对于" (&impl $A $B)
              "的证明是一个构造, 其允许我们将一个对于"
              $A "的证明转换为一个对于" $B "的证明.")
          (Li "不存在对于" $bottom
              "的证明. 另外, 一个对于" (&neg $A)
              "的证明是一个构造, 其将一个(假想的)对于"
              $A "的证明转换为一个矛盾.")
          (Li "一个对于" (∃ $x $A)
              "的证明是通过提供一个量化的论域里的见证者"
              $d "和一个对于" (subst $d $x $A)
              "的证明给出的.")
          (Li "一个对于" (∀ $x $A)
              "的证明是一个构造, "
              "其取量化的论域里的任意一个元素"
              $d ", 然后给出对于" (subst $d $x $A)
              "的一个证明. {译注: 也就是说, "
              "对于论域的每个元素都需要给出证明. "
              "这其实和对于推出" (&-> $A $B) "的证明有些类似, "
              "在类型论中这将会更加明显.}"))
      "这个定义里提及" (Em "构造")
      "的地方, 我们可以将定义向计算机科学倾斜, 将其想成是"
      (Em "函数") ", 其必须是有效可计算的 "
      "(于是构造可以被实际施行). "
      "在这样一种解释下, 直觉主义证明对应于函数, "
      "而特定的直觉主义推理系统则会导致特定的编程语言.")
   (H3. "第一个例子")
   (P "我们称一个接受排中律的逻辑为" (Em "古典的(classical)")
      ". 作为古典证明和直觉主义证明的区别的例子, "
      "我们考虑下列定理和证明.")
   
   (H3. "另一个悖论")
   (H3. "关于证明和程序之间的联系")
   (H3. "隐藏计算性内容")
   (H2. "自然演绎")
   (H2. "和谐")
   (H2. "证明作为程序")
   (H2. "验证")
   (H2. "规则作为算法")
   (H2. "相继式演算")
   (H2. "切消")
   (H2. "证明和验证")
   (H2. "从证明系统到编程语言")
   (H2. "自然数")
   (H2. "延续")
   (H2. "谓词演算")
   (H2. "命题定理证明")
   (H2. "逆转")
   (H2. "certification")
   (H2. "聚焦")
   (H2. "逻辑编程")
   (H2. "一个元循环解释器")
   (H2. "目标栈")
   (H2. "合一 (unification)")
   (H2. "逆转方法")
   (H2. "运行时代码生成")
   (P "这次没有现成的讲义, 但是有推荐的阅读材料. "
      "第一个阅读材料是作者的论文"
      "Modal Types as Staging Specifications for Run-time Code Generation "
      "(模态类型作为运行时代码生成的阶段化描述). "
      "这篇论文探索和讨论了模态逻辑和多阶段编程之间的联系. "
      
      )
   (H2. "线性逻辑")
   (H2. "同步消息传递")
   
   ))