#lang racket
(provide control0.html)
(require SMathML "constants.rkt")
(define (Mpresup a b)
  (Mmultiscripts a (Mprescripts) $ b))
(define split2 (&split 2))
(define (&goto L) (split2 $goto L))
(define If
  (case-lambda
    ((q a e) (split2 $if q $then a $else e))
    ((q a) (split2 $if q $then a))))
(define (While q e)
  (split2 $while q $do e))
(define (For i k e)
  (split2 $for i $to k $do e))
(define (∃ x p)
  (: $exists x $. p))
(define (∀ x p)
  (: $forall x $. p))
(define (Trd . x*)
  (apply Tr (map Td x*)))
(define (domain h) (ap $D h))
(define pointsTo &\|->)
(define (heapEmpty h)
  (&= (domain h) $empty))
(define (embed P) (ang0 P))
(define (disjoint h1 h2)
  (&= (&cap (domain h1) (domain h2)) $empty))
(define (Lam x M)
  (: $lambda x $. M))
(define-infix*
  (&wand $wand))
(define-@lized-op*
  (@If If)
  (@\; &\;))
(define control0.html
  (TnTmPrelude
   #:title "编程语言中的控制结构"
   #:css "styles.css"
   (H1. "编程语言中的控制结构: 从goto到代数效应")
   (H2 "术语表")
   (Table
    #:attr* '((align "center"))
    (Trd "effect" "效应")
    (Trd "effect handler" "效应处理器")
    (Trd "algebraic effect" "代数效应")
    (Trd "effect system" "效应系统")
    (Trd "continuation" "延续")
    (Trd "monad" "单子")
    (Trd "implication" "后承 (翻译成蕴涵或推出都不太合理)")
    (Trd "alias" "别名共享"))
   (H2. "早期编程语言")
   (H2. "结构化编程")
   (H2. "非局部控制")
   (H2. "控制反转")
   (H2. "函数式语言")
   (H2. "延续和CPS变换")
   (H3. "延续的概念")
   (P (B "程序点的延续. ")
      "考虑程序执行中的一个点. 这个程序点在该程序中的" (Em "延续")
      "是抵达该点之后还需要执行以完成整个程序执行的计算序列.")
   (P "往往延续可以作为命令或者函数在编程语言中表示. "
      "(见以下例子.) 延续也可以是语义对象, 见以下的第6.3节.")
   (P (B "基于语句的语言之中的延续的例子. ")
      "考虑以下四个程序, 以具有结构化控制的Algol风格命令式语言写成:"
      (eqn*
       ($p_1 $= (&\; (^ $s_1 (@ $a)) $s_2))
       ($p_2 $= (&\; (If $be (Mpresup $s_1 (@ $b))
                         (Mpresup $s_2 (@ $c)))
                     $s_3))
       ($p_3 $= (While $be (Mmultiscripts
                            $s $ (@ $e)
                            (Mprescripts)
                            $ (@ $d))))
       ($p_4 $= (For (&:= $i $1) 10
                     (Mpresup $s (@ $f)))))
      "程序点记作" (@ $a) ", " (@ $b)
      ", 等等. 并且, 要么标记在语句" $s
      "执行的开始, 如" (Mpresup $s (@ $a))
      ", 要么标记在" $s "执行的结束, 如"
      (^ $s (@ $b)) ".")
   (P "在程序" $p_1 "中, " (@ $a) "的延续是语句" (@ $b)
      ": 一旦执行抵达" $s_1 "的结束, 序列" (&\; $s_1 $s_2)
      "继续以执行" $s_2 ", 直至抵达程序的结束.")
   (P "在" $p_2 "中, " (@ $b) "的延续是" (&\; $s_1 $s_3)
      ", 而" (@ $c) "的延续是" (&\; $s_2 $s_3)
      ". 当条件式的" $then "分支" $s_1 "已经执行完毕, "
      "我们仍然需要执行" $s_3 ". 这对于" $else
      "分支" $s_2 "也是一样的.")
   (P "在" $p_3 "中, " (@ $d) "的延续是"
      (&\; $s (While $be $s))
      ", 因为我们需要执行循环体" $s
      ", 然后重新执行" $while
      "循环直至" $be "为假. 出于相同的原因, "
      (@ $e) "的延续是循环" (While $be $s) ".")
   (P "在" $p_4 "中, " (@ $f) "的延续是"
      (&\; $s (While (&!= $i 10)
                     (@\; (&:= $i (&+ $i $1)) $s)))
      ". 我们需要执行计数循环的体" $s
      ", 然后重新对于递增的" $i
      "执行该体, 直至" $i "抵达上界" 10 ".")
   (P (B "子表达式的延续. ")
      "在函数式语言之中, 其程序是表达式, "
      "程序点通常标记在对于某个子表达式求值的结束. "
      "因此, 我们可以将程序" $p "的子表达式" $e
      "的延续想成是函数"
      (MB (&\|-> (: $e "之值") (: $p "之值")))
      "这个函数捕获了我们在有了" $e
      "之值之后为了完成" $p "的求值仍需进行的计算.")
   (P (B "基于表达式的语言中的延续的例子. ")
      "考虑一个算术表达式的语言, "
      "自左向右求值, 而程序为"
      (MB (&= $p (&c* (@+ $1 $2) (@+ $3 $4))))
      $p "中" $1 "的延续是函数"
      (Lam $v (&c* (@+ $v $2) (@+ $3 $4)))
      ". 从直觉上来说, 在对于" $1
      "求值得到了一个值" $v
      "之后, 我们仍需求值" (Q "加上" $2)
      "和" (Q "乘上" (&+ $3 $4)) ".")
   (P $p "中" (&+ $1 $2) "的延续是函数"
      (Lam $v (&c* $v (@+ $3 $4)))
      ". 一旦我们已经对于" (&+ $1 $2)
      "求值完毕, 我们仍不得不计算"
      (Q "乘上" (&+ $3 $4)) ".")
   (P $p "中" (&+ $3 $4) "的延续是函数"
      (Lam $v (&c* $3 $v)) ", 而非"
      (Lam $v (&c* (@+ $1 $2) $v))
      ". 因为求值自左向右进行处理, "
      "我们在开始对于" (&+ $3 $4)
      "求值之前就已经对于" (&+ $1 $2)
      "求值过了. 因此, 在我们将" (&+ $3 $4)
      "求值至" $v "完毕之时, " (&+ $1 $2)
      "已经求值为" $3 ", 于是所有剩余的工作是计算"
      (&c* $3 $v) ".")
   (P "注意到延续依赖于求值策略. "
      "如果我们自右向左求值, 那么"
      $p "中" (&+ $1 $2) "的延续就会是"
      (Lam $v (&c* $v $7)) ", 而"
      (&+ $3 $4) "的延续会是"
      (Lam $v (&c* (@+ $1 $2) $v)) ".")
   (P (B "延续和跳跃. ")
      "延续的概念可以帮助我们理解跳跃 ("
      $goto ", " $break ", " $return
      ", 抛出异常, 等等) 和其他命令 "
      "(赋值, 条件式, 等等) 的不同.")
   (P "考虑一个命令"
      (Mmultiscripts
       $s $ (@ $b)
       (Mprescripts)
       $ (@ $a))
      "与其两个程序点, " (@ $a)
      "在开始, " (@ $b)
      "在结束. 如果" $s
      "没有包含任何跳跃, 那么"
      (@ $a) "的延续总是" $s
      "后面跟着" (@ $b) "的延续. 若" $s
      "是一个跳跃, 那就不是一回事了:"
      (Table
       #:attr* '((align "center"))
       (Tr (Td "如果" $s "是...")
           (Td (@ $a) "的延续是..."))
       (Tr (Td (&goto $L))
           (Td "标签" $L "的延续"))
       (Tr (Td $break)
           (Td "围绕它的循环的延续"))
       (Tr (Td $return)
           (Td "对于当前函数的最后调用的延续"))
       (Tr (Td $throw)
           (Td "最近的" $try "的"
               $catch "子句的延续")))
      "例如, 以下程序"
      (MB (&\; (While $be (@If $be^ (&\; (Mpresup $break (@ $a))
                                         $s_1)))
               $s_2))
      "中的" (@ $a) "的延续仅是" $s_2 ", 而非"
      (&\; $s_1 (: $while $..h) $s_2) ".")
   (H3. "指称语义回顾")
   
   (H3. "基于延续的指称语义")
   (H3. "标签和跳跃的指称语义")
   (H3. "CPS变换")
   (H3. "CPS变换的语义性质")
   (H2. "延续编程")
   (H2. "控制算子")
   (H2. "异常")
   (H2. "用户定义效应的效应处理器")
   (H3. "从异常到效应")
   (H2. "单子")
   (H2. "代数效应")
   (H2. "类型和效应系统")
   (H2. "控制结构的Hoare逻辑")
   (H2. "控制算子的分离逻辑")
   (H3. "分离逻辑备忘")
   (P "分离逻辑由Reynolds (2002) 引入, "
      "作为Hoare逻辑的扩展, "
      "其对于使用指针和动态内存分配的程序有着更好的支持. "
      "这样的程序可能会碰到一些难于"
      "单独使用平直Hoare逻辑排除的问题 (issue). "
      "例如, 别名 (指向相同块的不同指针变量) "
      "可能会导致藉由某个指针变量的写影响藉由另外指针变量的读. "
      "人们可能会忘了释放一个不再需要的动态分配的块, "
      "这会导致内存泄露. 人们可能会在某个块释放之后访问, "
      "这会导致未定义行为. "
      "除了内存块之外, 诸多类似的" (Em "资源")
      "都会导致类似的问题, 例如系统资源 (文件描述符, 等等), "
      "security capabilities, 甚至是某些类型的延续, "
      "这我们会在本章之后看到.")
   (P "在Hoare逻辑之中, 断言具有真值并描述了程序的可变变量的当前状态. "
      "在分离逻辑之中, 断言既有真值, 也有一个" (Em "足迹")
      ", 这是一集资源, 既描述了这些资源的当前状态, "
      "也描述了其由该断言唯一拥有的事实. "
      "这就使得定义资源敏感 (resource-aware) 逻辑联结词成为可能, "
      "例如分离合取" (&* $A $B) ", 其成立若" $A "和" $B
      "断言均成立, 且它们的足迹互不相交. 因此, 如果由"
      $A "拥有的资源被修改了, " $B "仍然保持有效, 因为"
      $B "所拥有的资源仍然未被修改.")
   (P "在资源是动态分配内存块的情形下, "
      "分离逻辑的断言是内存堆上的谓词. "
      "以下是常常使用的断言, 以及它们作为堆"
      $h "上的谓词的形式化定义. 对于" $h
      "的domain, 我们记" (domain $h)
      ", 即" $h "中的有效位置的集合."
      (MB (set-attr*
           (&Table
            ((pointsTo $l $dummy) (: "位置" $l "是有效的"))
            ($ (&= (domain $h) (setE $l)))
            ((pointsTo $l $v) (: "位置" $l "含有" $v))
            ($ (&conj (&= (domain $h) (setE $l))
                      (&= (app $h $l) $v)))
            ($emp "堆为空")
            ($ (heapEmpty $h))
            ((embed $P) (: "逻辑命题" $P "成立且堆为空"))
            ($ (&conj (heapEmpty $h) $P))
            ((&* $A $B) "分离合取")
            ($ (∃ (&cm $h_1 $h_2)
                  (&conj (disjoint $h_1 $h_2)
                         (&= $h (&cup $h_1 $h_2))
                         (app $A $h_1)
                         (app $B $h_2))))
            ((&wand $A $B) "分离后承, 或称魔杖")
            ($ (∀ $h^ (&=> (&conj (disjoint $h $h^)
                                  (app $A $h^))
                           (app $B (&cup $h $h^))))))
           'columnalign "left"
           'columnlines "solid"
           'rowlines "solid"
           'frame "solid")))
   (P "例如, 考虑断言"
      (MB (∃ (&cm $n_1 $n_2)
             (&* (pointsTo $l_1 $n_1)
                 (pointsTo $l_2 $n_2)
                 (embed (&= (&+ $n_1 $n_2) 10)))))
      "其陈述了" $l_1 "和" $l_2 "是合法的位置, "
      "其分别含有整数" $n_1 "和" $n_2
      ", 而它们之和为" 10
      ". 因为该断言使用了分离合取, 所以这也保证了"
      (&!= $l_1 $l_2) ", 即指针" $l_1 "和" $l_2
      "之间没有别名共享.")
   (P "因此, 如果我们对于" $l_1 "的内容进行增量, "
      "我们可以安全地断言"
      (MB (∃ (&cm $n_1 $n_2)
             (&* (pointsTo $l_1 $n_1)
                 (pointsTo $l_2 $n_2)
                 (embed (&= (&+ $n_1 $n_2) 11)))))
      "如果没有" (&!= $l_1 $l_2) "这一保证, "
      "那么这个结论就是无效的了; "
      "若这两个指针别名共享 (alias), 对于"
      $l_1 "的内容进行增量也会对于" $l_2
      "的内容进行增量, 导致和为" 12 ".")
   (H3. "一个函数式命令式语言的一种分离逻辑")
   (P (B "FUNREF语言. ")
      "图15.1展示了FUNREF的抽象句法, 这是本章所采用的玩具语言. "
      "FUNREF是一个函数式语言, 其也通过可以就地修改的引用而支持命令式编程, "
      "这类似于OCaml以及其他ML族的语言. "
      "引用藉由四个操作呈现:"
      (Ul (Li (Code "alloc") "创建一个新鲜的未初始化的引用;")
          (Li (Code "x := v") "将值" $v "存储于引用" $x ";")
          (Li "")
          )
      )
   (H2 "参考文献")
   ))