#lang racket
(provide context.html)
(require SMathML)
(define $Ext (Mi "Ext"))
(define (Ext H G)
  (appl $Ext H G))
(define (Arrow f X Y)
  (&: f (&-> X Y)))
(define (Id X)
  (_ $1 X))
(define $~~> (Mo "&dzigrarr;"))
(define-infix*
  (&~~> $~~>))
(define context.html
  (TnTmPrelude
   #:title "上下文中的范畴论"
   #:css "styles.css"
   (H1. "上下文中的范畴论")
   (H2 "前言")
   (P "Atiyah将数学描述为" (Q "类比的科学")
      ". 沿此脉络, 那么范畴论的研究范围就是" (Em "数学类比")
      ". 范畴论为数学提供了跨学科的语言, "
      "其设计用以描绘一般的现象, "
      "这使得将想法从一个研究领域转移到另一个领域成为可能. "
      "范畴论视角可以充当简化抽象, 将出于形式原因成立的命题和"
      "那些证明需要特定于某个数学分支的技巧的命题分离开来.")
   (P "视角的微妙转变允许数学内容以相对于"
      "所考虑的对象的多样性的不变的语言进行描述. "
      "与其直接刻画对象, 范畴论方法强调相同一般类型的对象之间的变换. "
      "范畴论中的一个基本引理可以推出任何数学对象都可由其"
      (Em "泛性质") "进行刻画" --
      
      )
   (H2. "范畴, 函子, 自然变换")
   (P "一个abel群" $H "经由一个abel群" $G "的一个"
      (B "群扩张") "由一个群" $E
      "连带着作为正规子群的一个嵌入 (inclusion) "
      (&@-> $G $E) "和将" $H "展现为商群" (&/ $E $G)
      "的一个满同态" (&->> $E $H)
      "构成. 这个数据通常呈现于以下群同态的图表之中:"
      (MB (&-> $0 $G $E $H $0) ".")
      $G "和" $H "的一对群扩张" $E "和" $E^
      "被认为是等价的, 每当存在一个同构"
      (&cong $E $E^) ", 其与" $G
      "的嵌入和到" $H "的商映射" (Em "交换")
      ", 这里的含义将于第1.6节精确化. "
      $H "经由" $G "的abel群扩张的等价类集合定义了一个abel群"
      (Ext $H $G) ".")
   (H3. "抽象和具体范畴")
   ((Definition)
    "一个" (B "范畴") "由以下资料构成:"
    (Ul (Li "一个" (B "对象") (&cm $X $Y $Z $..h)
            "的合集")
        (Li "一个" (B "态射") (&cm $f $g $h $..h)
            "的合集"))
    "其满足:"
    (Ul (Li "每个态射都有指定的" (B "定义域") "和" (B "陪域")
            "对象; 记号" (Arrow $f $X $Y)
            "指称" $f "是一个以" $X "为定义域而" $Y
            "为陪域的态射.")
        (Li "每个对象都有一个指定的" (B "恒等态射")
            (Arrow (Id $X) $X $X) ".")
        (Li "对于任意的一对态射" $f "和" $g
            "满足" $f "的陪域等于" $g "的定义域, "
            "存在一个指定的" (B "复合态射")
            (&i* $g $f) ", 其定义域等于" $f
            "的定义域, 其陪域等于" $g
            "的陪域, 即"
            (MB (&~~> (&cm (Arrow $f $X $Y)
                           (Arrow $g $Y $Z))
                      (Arrow (&i* $g $f)
                             $X $Z)) ".")))
    "这些资料服从于如下两条公理:"
    (Ul (Li "对于任意的" (Arrow $f $X $Y)
            ", 复合" (&i* (Id $Y) $f) "和"
            (&i* $f (Id $X)) "均等于" $f ".")
        (Li "对于任意的可复合态射三元组"
            (&cm $f $g $h) ", 复合"
            (&i* $h (@i* $g $f)) "和"
            (&i* (@i* $h $g) $f)
            "是相等的, 因而以"
            (&i* $h $g $f) "指称:"
            (MB (&~~> (&cm (Arrow $f $X $Y)
                           (Arrow $g $Y $Z)
                           (Arrow $h $Z $W))
                      (Arrow (&i* $h $g $f)
                             $X $W)) ".")))
    "也就是说, 复合律 (composition law) "
    "是结合性的和幺元性的 (unital), "
    "恒等态射充当了两侧的恒元.")
   ((Remark)
    "一个范畴的对象与其恒等态射之间具有双射对应, "
    
    )
   (P "传统上我们以范畴的对象对于范畴进行命名; "
      "通常而言, 与之相伴的结构保持态射的更受偏爱的选择是清晰的. "
      "然而, 这种实践在某种意义上违背了范畴论的基本哲学: "
      
      )
   (H2. "泛性质, 可表性, 以及米田引理")
   (H2. "极限和余极限")
   (H2. "伴随")
   (H2. "单子和代数")
   (H2. "所有概念都是Kan扩张")
   (H2 "尾声: 范畴论中的定理")
   ))