#lang racket
(provide control.html)
(require SMathML)
(define (LP label #:attr* [attr* '()] . x*)
  `(p ,attr* ,(B label ". ") . ,x*))
(define (denotation e) (&db0 e))
(define $Store (Mi "Store"))
(define $Int (Mi "Int"))
(define $Variable (Mi "Variable"))
(define control.html
  (TnTmPrelude
   #:title "编程语言中的控制结构"
   #:css "styles.css"
   (H1. "编程语言中的控制结构")
   (H2 "引论")
   (H2. "早期编程语言")
   (H3. "处理器之中的控制流")
   (H3. "机器语言, 汇编语言")
   (H3. "FORTRAN")
   (H3. "ALGOL 60")
   (H3. "条件式和循环")
   (H3. "从循环和块之中及早退出")
   (H3. "深入阅读")
   (H2. "结构化编程")
   (H3. "一场运动和一场争议")
   (H3. "没有goto的编程")
   
   (H2. "非局部控制")
   (H2. "控制反转")
   (H2. "函数式语言")
   (H3. "声明式编程: 抛弃控制?")
   (P "到目前为止, 我们理所当然地认为源代码必须显式描述程序之中的计算顺序 (sequencing), "
      "并且编程语言必须提供表达这种顺序的控制结构. "
      "然而, 这种假设受到了" (Em "声明式语言")
      "的质疑, 其在源代码之中大体将计算顺序留作隐式, "
      "而依赖于编译器确定计算的正确顺序. "
      "换言之, 声明式语言强调" (Em "什么") " (什么是要被计算的?) 而非"
      (Em "如何") " (如何将计算分解为基本步骤? 以什么顺序施行这些步骤?).")
   (P "声明性方法的一个例子是诸如SQL这样的数据库查询语言: "
      "查询描述了要从数据库里拉取什么记录; "
      "如何搜索数据库则留给数据库管理系统确定. "
      "其他的声明性编程范式包括逻辑编程 (Prolog, Datalog), "
      "纯函数式编程 (Haskell, Agda), 以及数据流编程 (Simulink, Lustre). "
      "诸如Verilog和VHDL这样的硬件描述语言本质上也是声明性的.")
   (P "声明式编程于1970年代引入, 其目的在于简化编程和"
      (Q "将编程从von Neumann风格之中解放出来")
      ", 如Backus (1978) 所言. 1980年代的焦点转移到了并行计算之上: "
      "人们希望声明式语言比起标准的命令式语言并行执行起来更加容易, "
      "这恰恰是因为前者给予了编译器在调度计算方面更大的灵活性. "
      "自1990年代起, 声明式编程因其安全性和与形式验证的亲缘关系而受到认可.")
   (P "声明式编程能否摆脱控制结构? 其能否将程序员从表达程序之中的控制的重担中"
      (Q "解放") "出来呢? 本章试图在纯函数式编程的上下文之中回答这些问题, "
      "通过检视三种表达力依次递增的小语言: "
      "XL, 一个电子表格语言; APP, 带有与值不同的函数的一个应用性语言; "
      "FUN, 将函数作为值的一个函数式语言.")
   (H3. "XL: 表达式和电子表格")
   (LP "带有共享的表达式"
       "考虑以下算术表达式和等式的语言, 昵称" (Q "XL") ":"
       
       )
   (H3. "APP: 表达式和用户定义的函数")
   (H3. "FUN: 函数作为第一级值")
   (H3. "上下文下的归约")
   (H3. "深入阅读")
   (H2. "延续和CPS变换")
   (H3. "延续的概念")
   (LP "程序点的延续"
       "考虑程序执行过程中的一个点. 这个程序中该程序点的"
       (Em "延续") "是在执行抵达该点之后还要执行的计算序列, "
       "其是为了完成整个程序的执行过程.")
   (H3. "指称语义回顾")
   (P "指称语义由Christopher Strachey, Dana Scott, "
      "Christopher Wadsworth于1960年代后期引入, "
      "其是以数学的精确定义程序的含义之方法. "
      "指称语义以复合性的方式将数学对象与编程语言的每个句法元素 "
      "(表达式, 语句, 函数, ...) 联系起来.")
   (P "例如, 一个牵涉变量的整数算术表达式" $e
      "的含义可以被定义为从存储到整数的映射, "
      "其中存储将整数与变量联系起来:"
      
      )
   (H3. "基于延续的指称语义")
   (H3. "标签和跳转的指称语义")
   (H3. "CPS变换")
   (H3. "CPS变换的语义性质")
   (H3. "深入阅读")
   (H2. "延续编程")
   (H2. "控制运算子")
   (H2. "异常")
   (H2. "用户定义作用的作用处理器")
   (H2. "单子")
   (H2. "代数作用")
   (H2. "类型和作用系统")
   (H2. "控制结构的Hoare逻辑")
   (H2. "控制运算子的分离逻辑")
   ))