#lang racket
(provide fdg.html)
(require SMathML)
(define fdg.html
  (TnTmPrelude
   #:title "函数式微分几何"
   #:css "styles.css"
   (H1. "函数式微分几何")
   (H2 "前言")
   (P "学习物理是困难的. 一部分问题在于物理以数学语言自然地表达. "
      "当我们进行教学的时候, 我们使用数学语言的方式和我们使用自然语言的方式是相同的. "
      "我们依赖于大量的共享知识和文化, 并且我们仅仅是以数学习语勾勒出想法. "
      "我们没有做到足够精确以向不懂我们文化的人传达想法. "
      "我们的问题在于, 因为我们共享着一种文化, 所以我们很难发现我们所说的话是非常不精确的, "
      "以至于初来乍到的学生无法清晰地理解这些话语. "
      "学生必须同时学习数学语言以及以这样的语言表达的内容. "
      "这就像还在挣扎于法语的语法时就试图阅读" (Em "悲惨世界(Les Misérables)") ".")
   (P "本书是改善教授微分几何时遇到的问题的尝试, 微分几何是深刻理解广义相对论或者量子场论的必要基础. "
      "我们的方法在以下几个方面不同于传统的教学方式. "
      )
   (H2 "序幕")
   
   (H2. "引入")
   (P "微分几何是一种可以用来表达物理概念的数学语言. "
      "在这个引入部分里, 我们展示了这种语言的典型用法. "
      "Do not panic! 在这个阶段, "
      "我们并不期望你能理解我们所展示的东西的细节. "
      "一切都将在本书的后文中按照需要进行解释. "
      "本章的目的在于熟悉这个材料的风味.")
   (P "在北极于冰上刻出一条垂直于Greenwich子午线的直线. "
      "拿着一根平行于该线的棍子, 沿着Greenewich子午线往下走, "
      "走的时候保持这根棍子平行于自身. (用语"
      (Q "平行于自身") "是说, 当你走的时候, 保持棍子的朝向不变. "
      "棍子将会与东西方向吻合, 垂直于你旅行的方向.) "
      "当你走到赤道时, 棍子将会平行于赤道. "
      "向东转, 沿着赤道走, 保持棍子平行于赤道. "
      "继续走下去, 直至到达东经90度线. "
      "当你到达东经90度线时, 向北转, "
      "走回北极并保持棍子垂直于你旅行的方向. "
      "当你到达极点时, 注意到棍子将垂直于你在冰上所刻的线. "
      "但是, 出发时棍子平行于该线, 并且在旅途中你保持着棍子指向相同的方向"
      "&mdash;&mdash;棍子的朝向是怎么改变的呢?")
   (P "答案是, 你在曲面上走了一个封闭的圈. "
      )
   (H2. "流形")
   (P (Em "流形(manifold)") "是我们对于嵌入Euclid空间的光滑曲面的概念的泛化. "
      "对于一个" $n "维流形, 每个点的周围都存在着一个简单连通的开集, 即"
      (Em "坐标补丁(coordinate patch)") ", 以及一个单射的连续函数, 即"
      (Em "坐标函数(coordinate function)") "或者说" (Em "坐标卡(chart)")
      ", 其将这个开集的每个点都映射至一个由" $n "个实数构成的元组, 即"
      (Em "坐标(coordinate)") ". 一般而言, 可能需要数个坐标卡以标记一个流形上的所有点. "
      
      )
   (H3. "坐标函数")
   (H3. "流形函数")
   (H2. "向量场和" $1 "-形式场")
   (H3. "向量场")
   (H3. "坐标基向量场")
   (H3. "积分曲线")
   (H3. $1 "-形式场")
   (H3. "坐标基" $1 "-形式场")
   (H2. "基场")
   (H3. "基变换")
   (H3. "旋转基")
   (H3. "交换子")
   (H2. "积分")
   (H3. "高维")
   (H3. "外导数")
   (H3. "Stokes定理")
   (H3. "向量积分定理")
   (H2. "Over a Map")
   (H2. "方向导数")
   (H3. "Lie导数")
   (H3. "协变导数")
   (H3. "平行移动")
   (H3. "测地运动")
   (H2. "曲率")
   (H2. "度量")
   (H2. "Hodge星号和电动力学")
   (H3. "波动方程")
   (H3. "电动力学")
   (H2. "狭义相对论")
   ))