#lang racket
(provide fdvs.html)
(require SMathML)
(define fdvs.html
  (TmPrelude
   #:title "有限维向量空间"
   #:css "styles.css"
   (H1 "有限维向量空间")
   (H2 "第1章 空间")
   (H3 "第1节 域")
   (H3 "第2节 向量空间")
   (H3 "第3节 例子")
   (H3 "第4节 评注")
   (H3 "第5节 线性相关性")
   (H3 "第6节 线性组合")
   (H3 "第7节 基")
   (H3 "第8节 维数")
   (H3 "第9节 同构")
   (H3 "第10节 子空间")
   (H3 "第11节 子空间的演算")
   (H3 "第12节 子空间的维数")
   (H3 "第13节 对偶空间")
   (H3 "第14节 方括号")
   (H3 "第15节 对偶基")
   (H3 "第16节 反身性")
   (H3 "第17节 零化子")
   (H3 "第18节 直和")
   (H3 "第19节 直和的维数")
   (H3 "第20节 直和的对偶")
   (H3 "第21节 商空间")
   (H3 "第22节 商空间的维数")
   (H3 "第23节 双线性形式")
   (H3 "第24节 张量积")
   
   (H2 "第2章 变换")
   (H2 "第3章 正交")
   (H2 "第4章 分析")
   
   ))