#lang racket
(provide galgame.html)
(require SMathML)
(define galgame.html
  (TnTmPrelude
   #:title "galgame评论"
   #:css "styles.css"
   (H1. "galgame评论")
   (P "我无意进行严肃的galgame批评, 所以这里只是一些记录. "
      "目的可能是为了防止遗忘, 但是我已经忘了.")
   (H2. "意识流")
   (P "此作虽然总是列入国产galgame历史的重要作品, "
      "但实际上完成度很低, 原因在于作者搁笔之后英年早逝.")
   
   (H2. "近月少女的礼仪")
   
   (H2. "魔法使之夜")
   
   (H2. "Fate/Stay Night")
   (H2. "G弦上的魔王")
   (H2. "女仆咖啡厅帕露菲")
   (P "丸户史明在白色相簿2之前最有名的作品应该是此作了. "
      "本作的一个问题在于, 线路很多, "
      "但是对于次要人物的刻画太少, 以至于很难记住. "
      
      )
   (H2. "Baldr Sky Dive 1+2")
   
   (H2. "YU-NO")
   
   (H2. "白色相簿2")
   
   (H2. "兰斯10")
   (P "作为兰斯系列的收官之作, 整个故事展开了最后的高潮. "
      "虽然兰斯系列一直被称为反英雄的, "
      "但是我想反英雄即是英雄, "
      "兰斯故事里的诸多要素和设定与古代的英雄史诗相比具有惊人的相似度.")
   ))