#lang racket
(provide galois_connections.html)
(require SMathML)
(define galois_connections.html
  (TnTmPrelude
   #:title "Galois连接和不动点演算"
   #:css "styles.css"
   (H1. "Galois连接和不动点演算")
   (H2. "引论")
   (H3. "不动点方程")
   (P "表述和求解方程是一项基本数学活动, "
      "而整个数学领域都致力于求解特定种类的方程的技术. "
      "例如, 想一下微分演算的建立是为了求解微分方程. "
      "{译注: 不得不说, 其实前面这些话并不符合事实.} "
      "本章是关于一类叫做" (Em "不动点方程")
      "的方程的, 其在计算领域尤为重要.")
   (P "不动点方程具有非常简单的形式, 即"
      (MB (&= $x (app $f $x)))
      "其中" $f "是一个给定的函数, 而" $x
      "是未知元. 这个方程的一个解被称为是函数"
      $f "的一个" (Q "不动点")
      ", 因为应用" $f "于一个解保持值"
      (Q "不动") ", 即没有变化.")
   (H3. "语言")
   (P "在计算机科学文献中, 不动点方程常被称为"
      (Em "递归方程") ", 因为"
      )
   (H3. "函数")
   (H3. "数据类型")
   (H3. "Galois连接")
   (H3. "基本假设")
   (H3. "问题和应用")
   (H2. "Galois连接")
   (H2. "Galois连接的抽象性质")
   
   ))