#lang racket
(provide game_programming_notes.html)
(require SMathML)
(define game_programming_notes.html
  (TnTmPrelude
   #:title "泛游戏编程笔记"
   #:css "styles.css"
   (H1. "泛游戏编程笔记")
   (P "这里记录所读的收获和有意义的想法和问题, 然而只是期望.")
   (P "层次状态机, 栈状态机, 面向对象如何有机结合? "
      "这里的面向对象有几个方面, 数据局部化, "
      "消息传递交互, 以及世界的本体论观念.")
   (P "如何复合 (compose) 状态机? 并行和嵌套?")
   (P "行为树用于对自治代理在不同任务之间的切换进行结构化.")
   (P "如何结合使用状态机和行为树?")
   (P "ECS和传统面向对象impose了怎样的世界观?")
   (P "如何结合ECS和面向对象进行建模?")
   (P "如何应用线性逻辑(或者仿射逻辑)于叙事结构化?")
   (P "行为树相较于状态机在建模代理行为方面的优点在于模块化, "
      "这鼓励了代码重用和渐进设计与实现.")
   (P "一个行为通常是由一系列子行为复合而成的. "
      )
   (H1. "机器人学和人工智能中的行为树")
   (H2. "什么是行为树?")
   (H2. "行为树是如何泛化了之前的一些想法的, "
        "又是如何与之前的想法相关联的")
   (H3. "有限状态自动机")
   (H3. "层次性有限状态自动机")
   (H3. "包容架构")
   (H3. "Teleo-Reactive程序")
   (H3. "决策树")
   (H3. "行为树的优缺点")
   (H2. "设计原则")
   (H2. "行为树的扩展")
   (H2. "对于效率, 安全性, 健壮性的分析")
   
   ))