#lang racket
(provide gtm5.html)
(require SMathML "todo.rkt")
(define (Arrow f X Y)
  (&: f (&-> X Y)))
(define gtm5.html
  (TnTmPrelude
   #:title "数学工作者的范畴论"
   #:css "styles.css"
   (H1. "数学工作者的范畴论")
   (H2 "第二版前言")
   (H2 "第一版前言")
   (H2 "引论")
   (P "范畴论始于如下观察, "
      "即数学系统的许多性质可由箭头图表的呈现所统一和简化. "
      "每个箭头" (Arrow $f $X $Y)
      "都代表了一个函数; 也就是说, 一个集合" $X
      ", 一个集合" $Y ", 以及一个规则"
      (&\|-> $x (ap $f $x))
      ", 其赋每个元素" (∈ $x $X)
      "以一个元素" (∈ (ap $f $x) $Y)
      "; 若有可能, 我们总是记" (ap $f $x)
      "而非" (app $f $x) ", 省略不必要的括号. "
      "一个典型的集合和函数的图表为"
      todo.svg
      "当" $h "为" (&= $h (&compose $g $f))
      "时, 该图表是交换的, 其中" (&compose $g $f)
      "是通常的复合函数"
      (Arrow (&compose $g $f) $X $Z)
      ", 由" (&\|-> $x (app $g (ap $f $x)))
      "定义. 相同的图表可以应用于其他的数学上下文; "
      "因此, 在由所有拓扑空间构成的" (Q "范畴")
      "里, 字母" (&cm $X $Y $Z) "代表拓扑空间, 而"
      (&cm $f $g $h) "代表连续映射. 又一次, "
      "在由所有群构成的" (Q "范畴")
      "里, " (&cm $X $Y $Z) "代表群, "
      (&cm $f $g $h) "代表同态.")
   (P "数学构造的许多性质可以由图表的泛性质所表示. "
      "考虑两个集合的笛卡尔积" (&c* $X $Y)
      ", 和通常一样其由元素" (∈ $x $X)
      "和" (∈ $y $Y) "的所有序对"
      (tupa0 $x $y) "构成. 积于其" (Q "轴")
      $X "和" $Y "上的投影"
      (&\|-> (tupa0 $x $y) $x) "和"
      (&\|-> (tupa0 $x $y) $y)
      "是函数" (Arrow $p (&c* $X $Y) $X)
      ", " (Arrow $q (&c* $X $Y) $Y)
      ". 任何自第三个集合" $W "始的函数"
      (Arrow $h $W (&c* $X $Y))
      "都可由其组分" (&compose $p $h)
      "和" (&compose $q $h) "唯一确定. "
      "反过来, 给定如以下图表所示的"
      $W "和两个函数" $f "和" $g
      ", 存在唯一的函数" $h
      "使得图表交换; 即"
      (&= (ap $h $w)
          (tupa0 (ap $f $w)
                 (ap $g $w)))
      ", 对于每个" $W "中的" $w ":"
      todo.svg
      "因此, 给定" $X "和" $Y
      ", "
      )
   ))