#lang racket
(provide haskell_music.html)
(require SMathML)
(define haskell_music.html
  (TnTmPrelude
   #:title "音乐的Haskell学派"
   #:css "styles.css"
   (H1. "音乐的Haskell学派")
   (P "这本书根据" (Q "第一原理")
      "讨论了数字音乐的创作和实现, "
      "当然顺便教授了Haskell. "
      "不过, 与标题不符的是, "
      "这本书的内容肯定并不局限于Haskell.")
   (H2. "计算机音乐, Euterpea, 以及Haskell")
   (H2. "简单音乐")
   (H2. "多态函数和高阶函数")
   (H2. "音乐幕间")
   (H2. "句法魔法")
   (H2. "更多音乐")
   (H2. "Qualified Types和类型类")
   (H2. "从音乐到MIDI")
   (H2. "解释和演出")
   (H2. "自相似音乐")
   (H2. "归纳证明")
   (H2. "音乐代数")
   (H3. "音乐等价")
   (P "设我们有了两个值" (Code "m1 :: Music Pitch")
      "和" (Code "m2 :: Music Pitch")
      ", 并且我们想要知道他们是否是相等的. "
      "如果我们将其仅仅视为Haskell的值, "
      "那么我们可以轻易地编写一个函数, "
      "其递归地进行比较以看出它们是否在每个层次上都是相同的, "
      "一路向下直至休止和音符" (Em "原语")
      ". 这实际上正是Haskell函数" (Code "==")
      "所做的事情. 例如, 如果"
      
      )
   (H2. "L系统和生成文法")
   (P (Em "文法") "描述了" (Em "形式语言")
      ". 我们既可以设计该语言的" (Em "识别器")
      " (或者说" (Em "parser")
      "), 也可以设计一个" (Em "生成器")
      ", 其可以生成该语言的句子. "
      "既然我们对于使用文法生成音乐感兴趣, "
      "我们将只会关心生成文法.")
   (P "一个生成文法是一个四元组" (tu0 $N $T $n $P) ", 其中:"
      (Ul (Li $N "是" (Em "非终结符号") "的集合.")
          (Li $T "是" (Em "终结符号") "的集合.")
          (Li $n "是" (Em "初始符号") ".")
          (Li $P "是一集" (Em "生成规则")
              ", 其中每条生成规则都是一个序对" (tu0 $X $Y)
              ", 往往记作" (&-> $X $Y) ". " $X "和" $Y
              "是构于字母表" (&union $N $T)
              "之上的句子 (或者说" (Em "句型")
              "), 并且" $X "至少包含一个非终结符号.")))
   (P (Em "Lindenmayer系统") "或者说" (Em "L系统")
      "是生成文法的例子, 但是在两个方面有所不同:"
      (Ol (Li "句子的" (Em "序列") "和单个句子一样重要, 并且")
          (Li "新的句子是由之前的句子在每一步应用尽可能多的生成式生成的"
              "&mdash;&mdash;某种" (Em "并行生成") ".")))
   (P "Lindenmayer是一位生物学家和数学家, "
      "而他使用L系统来描述特定生物有机体的生长 "
      "(例如植物, 特别是藻类).")
   (P "我们将会限制我们的讨论于具有以下额外特征的L系统:"
      (Ol (Li "它们是" (Em "上下文无关")
              "的: 每个生成式的左侧 (即上述的" $X
              ") 是单独一个非终结符号.")
          (Li "终结符和非终结符之间不会进行区分 "
              "(但是无损于表达力&mdash;&mdash;为什么?).")))
   (P "我们将既会考虑" (Em "确定性") "文法, 又会考虑" (Em "非确定性")
      "文法. 确定性文法对于字母表中的每个非终结符恰有一个产生式与之对应, "
      "而非确定性文法可能有多于一个, "
      "因而我们需要某种方式来在它们之间进行选择.")
   (H3. "一个简单实现")
   
   (H2. "随机数, 概率分布, 以及Markov链")
   (H2. "基本输入/输出")
   (H2. "高阶类型和Monads")
   (H2. "音乐用户界面")
   (H2. "声音和信号")
   (P "本章我们研究了声音的本质以及其作为信号的数学表示. "
      "我们也讨论了信号的离散数字表示, "
      "其构成了现代声音合成与音频处理的基础.")
   (H3. "声音的本质")
   
   (H2. "Euterpea的信号函数")
   (H2. "谱分析")
   (H2. "加性和减性合成")
   
   ))