#lang racket
(provide hoare.html)
(require SMathML)
(define (Func . x*)
  (apply : (map-toggle
            #f (λ (f) (^^ $-> f)) x*)))
(define (Box #:attr* [attr* '()] . xml*)
  `(menclose ,(attr*-set attr* 'notation "box")
             . ,xml*))
(define (AssignmentAxiom P V E)
  (!- (Hoare (P E) (&:= V E) (P V))))
(define (subst P E V)
  (: P (bra0 (&/ E V))))
(define (!- . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (let ((b (car b*)))
      (: (apply &cm a*) $vdash b))))
(define $impl $=>)
(define split2 (&split 2))
(define (Hoare P C Q)
  (split2 (cur0 P) C (cur0 Q)))
(define (THoare P C Q)
  (split2 (bra0 P) C (bra0 Q)))
(define (Pid str)
  (Mi str #:attr* '((mathvariant "monospace"))))
(define :WHILE (Pid "WHILE"))
(define :DO (Pid "DO"))
(define (WHILE S C)
  (split2 :WHILE S :DO C))
(define (AWHILE S R C)
  (split2 :WHILE S :DO (cur0 R) C))
(define :FOR (Pid "FOR"))
(define :IF (Pid "IF"))
(define :THEN (Pid "THEN"))
(define :ELSE (Pid "ELSE"))
(define (IF S C1 C2)
  (split2 :IF S :THEN C1 :ELSE C2))
(define :x (Pid "x"))
(define :y (Pid "y"))
(define :n (Pid "n"))
(define :Q (Pid "Q"))
(define :R (Pid "R"))
(define :X (Pid "X"))
(define :Y (Pid "Y"))
(define :Z (Pid "Z"))
(define :T (Pid "T"))
(define :F (Pid "F"))
(define (pointsTo a b)
  (&\|-> a b))
(define-infix*
  (&impl $impl))
(define-@lized-op*
  (@/ &/)
  (@> &>))
(define ((law #:id [id #f]) . html*)
  (keyword-apply
   Div '(#:attr*) '(((class "frame"))) html*))
(define (Center . html*)
  `(div ((style "text-align: center;")) . ,html*))
(define hoare.html
  (TnTmPrelude
   #:title "Hoare逻辑"
   #:css "styles.css"
   (H1. "Hoare逻辑")
   (H2. "程序规约")
   (H3. "引论")
   (P "为了从数学上证明一个程序的正确性, "
      "我们必须首先刻画正确本身的含义. "
      "本章我们描述了一种用于刻画命令式程序的预期行为的记号. "
      "这种记号应该归功于C.A.R. Hoare.")
   (P "执行命令式程序有着改变" (Em "状态")
      "的作用, 直到第7章之前, 我们将状态取为程序变量的值. "
      "为了使用这样的程序, 我们需要建立初始状态, "
      "也就是将一些变量的值设置为有趣的值 (value of interest). "
      "然后我们执行程序. 这将初始状态变换为最终状态. "
      "然后我们检视最终状态里的变量的值来得到预期的结果. "
      "例如, 为了计算" :y "除以" :x
      ", 我们可能会将" :x "和" :y
      "分别载入程序变量" :X "和" :Y
      ". 然后我们可能会执行一个合适的程序 (见第1.4节的例子7) "
      "来将初始状态变换为最终状态以使得变量" :Q
      "和" :R "分别存放着商和余数.")
   (P "这些笔记里要使用的编程语言将于下一节进行描述.")
   (H3. "一种小语言")
   (P "程序由诸如赋值和条件式等命令构建而成. 术语"
      (Q "程序") "和" (Q "命令")
      "的确可以算是近义词; 前者只会用于表示完整算法的命令. "
      "这里的术语" (Q "陈述 (statement)")
      "用于程序变量上的条件, 其出现于正确性规约之中 (见第1.3节). "
      "这里存在混淆的风险, 因为一些作者将这个词用于命令 (如"
      (Q "for-statement") " [14]).")
   (P "现在我们描述我们的小语言里的"
      "各种命令的句法 (即形式) 和语义 (即意义). "
      "以下约定将会采用:"
      (Ol (Li "符号" (&cm $V $V_1 $..h $V_n)
              "代表任意的变量. 特定变量的例子有"
              (&cm :X :R :Q) "等等.")
          (Li "符号" (&cm $E $E_1 $..h $E_n)
              "代表任意的表达式 (或者说项). "
              "这些是像" (&cm (&+ :X $1) (Msqrt $2))
              "之类的东西, 其指称着值 (通常是数字).")
          (Li "符号" (&cm $S $S_1 $..h $S_n)
              "代表任意的陈述. 这些是像"
              (&cm (&< :X :Y) (&= (^ :X $2) $1))
              "之类的条件, 其要么为真要么为假.")
          (Li "符号" (&cm $C $C_1 $..h $C_n)
              "代表我们编程语言里的任意命令; "
              "这些会在本节的剩余部分进行描述."))
      "项和陈述在第1.5节进行了更为细致的描述.")
   (H4. "赋值")
   (P (B "句法: ") (&:= $V $E))
   (P (B "语义: ")
      "状态的改变由将项" $E "之值赋给变量" $V
      "完成. 所有的变量都假定具有全局作用域.")
   (P (B "例子: ") (Code "X:=X+1"))
   (P "这给变量" :X "之值加上一.")
   (H4. "序列")
   (P (B "句法: ") (&\; $C_1 $..c $C_n))
   (P (B "语义: ")
      "命令" (&cm $C_1 $..h $C_n)
      "按照顺序进行执行.")
   (P (B "例子: ") (Code "R:=X; X:=Y; Y:=R"))
   (P "变量" :X "和" :Y "之值经由临时变量" :R
      "进行了互换. 这个命令具有将变量" :R
      "之值变为变量" :X "之旧值的"
      (Em "副作用") ". {译注: 这个还是这些?}")
   (H4. "条件式")
   (P (B "句法: ") (IF $S $C_1 $C_2))
   (P (B "语义: ")
      "如果陈述" $S "在当前状态下为真, 那么"
      $C_1 "被执行. 如果" $S "为假, 那么"
      $C_2 "被执行.")
   (P (B "例子: ") (Code "IF X&lt;Y THEN MAX:=Y ELSE MAX:=X"))
   (H4. :WHILE "命令")
   (P (B "句法: ") (WHILE $S $C))
   (P (B "语义: ")
      "如果陈述" $S "在当前状态下为真, 那么"
      $C "被执行, 然后" :WHILE "命令重复. 如果"
      $S "为假, 那么什么也不做. 因此, " $C
      "反复执行, 直至" $S "的值变为假. 如果"
      $S "永远不变为假, 那么该命令的执行永远不终止.")
   (P (B "例子: ") (Code "WHILE ¬(X=0) DO X:=X-2"))
   (P "如果" :X "之值非零, 那么其值会减去" $2
      ", 然后进程重复. 这个" :WHILE
      "命令将会终止 (此时" :X "有着值" $0
      "), 如果" :X "的值是一个非负的偶数. "
      "其他状态下都不会终止.")
   (H4. "句法总结")
   
   (H4. "历史注记")
   (H3. "Hoare记号")
   (P "在一篇开创性论文 [13] 里C.A.R. Hoare引入了记号"
      (Hoare $P $C $Q) ", 其有时被称为" (Em "Hoare三元组")
      ", 用于刻画一个程序做了什么. 在这样一个Hoare三元组之中:"
      (Ul (Li $C "是一个程序.")
          (Li $P "和" $Q "是" $C "中用到的程序变量上的条件. "
              "程序变量上的条件以标准的数学记号连带着诸如"
              (&cm $conj $disj $neg $impl)
              "这样的逻辑联结词书写. 这些在第1.5节有进一步描述.")))
   (P "我们称" (Hoare $P $C $Q) "为真, 如果每当"
      $C "在某个满足" $P "的状态下执行且" $C
      "的执行终止, 那么" $C "执行终止的状态满足" $Q ".")
   (P (B "例子: ")
      (Hoare (&= :X $1)
             (Ms "X:=X+1")
             (&= :X $2))
      ". 这里的" $P "是"
      )
   (P "一个表达式" (Hoare $P $C $Q)
      "被称为一个" (Em "部分正确性规约")
      "; " $P "被称为其" (Em "前条件")
      "而" $Q "被称为其" (Em "后条件") ".")
   
   (H3. "一些例子")
   (H3. "项和陈述")
   
   (H2. "Hoare逻辑")
   (P "本章讨论了形式化证明的想法. "
      "然后, 我们引入了Hoare逻辑 "
      "(或称Floyd-Hoare逻辑) "
      "作为对于程序进行形式化推理的方法.")
   (P "上一章我们引入了三种可能为真或假的表达式:"
      (Ol #:attr* '((type "i"))
          (Li "部分正确性规约"
              (Hoare $P $C $Q) ".")
          (Li "完全正确性规约"
              (THoare $P $C $Q) ".")
          (Li "数学陈述, 例如"
              (&= (^ (@+ :X $1) $2)
                  (&+ (^ :X $2)
                      (&c* $2 :X)
                      $1)) "."))
      "我们假定读者已经知道如何证明简单的数学陈述, "
      "例如以上的iii中的那条. "
      "例如, 以下是该事实的一个证明."
      (MB (set-attr*
           (&Table
            ("1."
             (^ (@+ :X $1) $2)
             $=
             (&c* (@+ :X $1) (@+ :X $1))
             (: (^ (@) $2) "的定义."))
            ("2."
             (&c* (@+ :X $1) (@+ :X $1))
             $=
             (&+ (&c* (@+ :X $1) :X)
                 (&c* (@+ :X $1) $1))
             (: $c* "之于" $+ "的左分配律."))
            ("3."
             (^ (@+ :X $1) $2)
             $=
             (&+ (&c* (@+ :X $1) :X)
                 (&c* (@+ :X $1) $1))
             "将第2行代入第1行.")
            ("4."
             (&c* (@+ :X $1) $1)
             $=
             (&+ :X $1)
             (: $1 "的恒元律."))
            ("5."
             (&c* (@+ :X $1) :X)
             $=
             (&+ (&c* :X :X)
                 (&c* $1 :X))
             (: $c* "之于" $+ "的右分配律."))
            ("6."
             (^ (@+ :X $1) $2)
             $=
             (&+ (&c* :X :X)
                 (&c* $1 :X)
                 :X $1)
             "将第4行和第5行代入第3行.")
            ("7."
             (&c* $1 :X) $= :X
             (: $1 "的恒元律."))
            ("8."
             (^ (@+ :X $1) $2)
             $=
             (&+ (&c* :X :X)
                 :X :X $1)
             "将第7行代入第6行.")
            ("9."
             (&c* :X :X) $= (^ :X $2)
             (: (^ (@) $2) "的定义."))
            ("10."
             (&+ :X :X) $= (&c* $2 :X)
             (&cm (&= $2 (&+ $1 $1))
                  "分配律"))
            ("11."
             (^ (@+ :X $1) $2)
             $=
             (&+ (^ :X $2)
                 (&c* $2 :X)
                 $1)
             "将第9行和第10行代入第8行."))
           'columnalign "left")))
   (P "这个证明由一系列行构成, "
      "每行都是某个" (Em "公理")
      "的实例或者根据之前的行由"
      (Em "推理规则")
      "推出. 这个证明的最后一行是其所证明的陈述, 也就是"
      (&= (^ (@+ :X $1) $2)
          (&+ (^ :X $2)
              (&c* $2 :X)
              $1)) ".")
   (P "为了构造部分正确性规约的形式化证明, 需要公理和推理规则. "
      "这正是Hoare逻辑所提供的. "
      "该演绎系统的形式化表述归功于Hoare [13], "
      "但其中一些基本思想源自Floyd [9].")
   (P "Hoare逻辑中的证明是一系列行的序列, "
      "其中每一行要么是该逻辑的一条公理, "
      "要么是由前面的行通过该逻辑的一条推理规则推导而来.")
   (P "构造形式化证明的原因在于试图确保只使用可靠的演绎方法. "
      "有了可靠的公理和推理规则, 我们就可以确信所得出的结论是真的. "
      "另一方面, 如果任何公理或推理规则是不可靠的, "
      "那么就有可能推导出错误的结论; 例如:"
      
      )
   (P "形式化证明明确指出了为得出结论所使用的公理和推理规则. "
      "人们很容易提出一些看似合理但实际上不可靠的程序推理规则. "
      "计算机程序的正确性证明往往非常复杂, "
      "需要形式化方法来确保其有效性. "
      "因此, 将所使用的推理原则完全显式化是很重要的, "
      "这样才能对其可靠性进行分析.")
   (P "对于某些应用而言, 正确性尤为重要. "
      "例子包括生命攸关的系统, 如核反应堆控制器, 汽车制动系统, "
      "电传飞控飞机以及软件控制的医疗设备. "
      "曾有一起法律诉讼源于一台癌症治疗设备"
      "因软件缺陷导致辐射过量, 造成数人死亡 [15]. "
      "当穷举测试不可能实现时 (几乎总是如此), "
      "形式化正确性证明提供了一种确认程序中不存在缺陷的方法.")
   (P "本章将解释并举例说明用于程序推理的Hoare演绎系统. "
      "该系统的可靠性和完备性的数学分析将在第4章中讨论.")
   (H3. "Hoare逻辑的公理和规则")
   (P "正如本章开头所讨论的, "
      "一个命题的形式化证明是以该命题为最后一行的一个行序列, "
      "其中每一行要么是一条公理的实例, "
      "要么是由前面的行通过一条推理规则推导而来. 若" $S
      "是一个命题 (无论是普通数学的还是Hoare逻辑的), 我们记"
      (!- $S) "来表示" $S
      "有一个证明. 拥有证明的命题称为定理. "
      "如前所述, 在本讲义中只描述Hoare逻辑的公理和推理规则; "
      "因此, 若" $S "是一个数学定理, 我们将直接断言"
      (!- $S) "而不给出任何形式化的论证. "
      "当然, 为了达到完全的严格性, 这些断言必须被证明, "
      "但如何做到这一点的细节假定读者已经了解 "
      "(例如通过逻辑与证明课程).")
   (P "Hoare逻辑的公理在下面通过模式来指定, "
      "这些模式可以被实例化以得到特定的部分正确性规约. "
      "Hoare逻辑的推理规则将用如下形式的记号来描述:"
      (MB (&rule (!- $S_1) $..c (!- $S_n)
                 (!- $S)))
      "这是说结论" (!- $S) "可以从"
      (&cm (!- $S_1) $..h (!- $S_n))
      "推导而来, 后者是该规则的假设. "
      "这些假设可以全部是Hoare逻辑的定理 (如下面的顺序规则), "
      "也可以是Hoare逻辑定理与数学定理的混合 "
      "(如第2.1.2节中描述的前条件加强规则).")
   (H4. "赋值公理")
   (P "赋值公理表达了这样一个事实: 在执行赋值命令"
      (&:= $V $E) "之后, 变量" $V
      "的值等于执行前表达式" $E
      "的值. 为了将此形式化, 注意到如果一个命题"
      $P "在赋值之后为真, 那么在执行赋值之前, 将"
      $P "中的" $V "替换为" $E "所得到的命题必须为真. "
      "{译注: 这似乎和以下公理所表达的内容方向相反.}")
   (P "为了形式化地表达这一点, 定义"
      (subst $P $E $V)
      "以表示将" $P "中所有" $V
      "的出现替换为" $E "之结果. "
      (subst $P $E $V)
      "读作" (Q $P "with " $E " for " $V)
      ". 例如,"
      (MB (&= (subst (@> (&+ :X $1) :X)
                     (&+ :Y :Z) :X)
              (@> (&+ (@+ :Y :Z) $1)
                  (&+ :Y :Z))))
      "记住这个记号的方法是" (Q "消去律")
      (MB (&= (subst $V $E $V) $E))
      "这类比于分式的消去性质"
      (MB (&= (&c* $v (@/ $e $v)) $e)))
   ((law)
    (Center (B "Hoare赋值公理"))
    (MB (!- (Hoare (subst $P $E $V)
                   (&:= $V $E)
                   $P)))
    "其中" $V "是任意的变量, " $E
    "是任意的表达式, " $P
    "是任意的陈述, 而" (subst $P $E $V)
    "代表将陈述" $P "中变量" $V
    "的所有出现都替换为项" $E ".")
   (P "赋值公理的实例有:"
      (Ol (Li (AssignmentAxiom
               (λ (V) (&= :Y V))
               :X $2))
          (Li (AssignmentAxiom
               (λ (V) (&= V (&+ :n $1)))
               :X (&+ :X $1)))
          (Li (AssignmentAxiom
               (λ (V) (&= V $E))
               :X $E)
              ", 如果" :X "在" $E
              "中没有出现.")))
   (P "许多人会感到赋值公理和他们所期望的相反. "
      "两种常见的错误直觉如下:"
      (Ol #:attr* '((type "i"))
          (Li (!- (Hoare $P (&:= $V $E)
                         (subst $P $V $E)))
              )
          (Li (!- (Hoare $P (&:= $V $E)
                         (subst $P $E $V)))
              )
          )
      )
   (P "关于赋值公理容易产生错误直觉这一事实表明, "
      "拥有严格的手段来确立公理和规则的有效性是很重要的. "
      "我们将在后面的第4章中深入讨论这个主题, "
      "届时我们将给出我们这个小型编程语言的形式化语义, "
      "然后证明Hoare逻辑的公理和推理规则是可靠的. "
      "当然, 这一过程只有在我们相信形式化语义本身的正确性的前提下, "
      "才能增强我们对公理和规则的信心. "
      "上述简单的赋值公理对于" (Q "真实的")
      "编程语言是不成立的. 例如, G. Ligler [17] 的工作表明, "
      "它在(现已过时的)语言Algol 60中以六种不同的方式失效.")
   
   (H4. "前条件强化")
   ((law)
    (Center (B "前条件强化"))
    (MB (&rule (!- (&impl $P $P^))
               (!- (Hoare $P^ $C $Q))
               (!- (Hoare $P $C $Q)))))
   (H4. "后条件弱化")
   ((law)
    (Center (B "后条件弱化"))
    (MB (&rule (!- (Hoare $P $C $Q^))
               (!- (&impl $Q^ $Q))
               (!- (Hoare $P $C $Q)))))
   (H4. "规约合取与析取")
   ((law)
    (Center (B "规约合取"))
    (MB (&rule (!- (Hoare $P_1 $C $Q_1))
               (!- (Hoare $P_2 $C $Q_2))
               (!- (Hoare (&conj $P_1 $P_2)
                          $C
                          (&conj $Q_1 $Q_2)))))
    (Center (B "规约析取"))
    (MB (&rule (!- (Hoare $P_1 $C $Q_1))
               (!- (Hoare $P_2 $C $Q_2))
               (!- (Hoare (&disj $P_1 $P_2)
                          $C
                          (&disj $Q_1 $Q_2))))))
   (H4. "顺序规则")
   ((law)
    (Center (B "顺序规则"))
    (MB (&rule (!- (Hoare $P $C_1 $Q))
               (!- (Hoare $Q $C_2 $R))
               (!- (Hoare $P (&\; $C_1 $C_2) $R)))))
   (H4. "导出顺序规则")
   (H4. "条件规则")
   ((law)
    (Center (B "条件规则"))
    (MB (&rule (!- (Hoare (&conj $P $S) $C_1 $Q))
               (!- (Hoare (&conj $P (&neg $S)) $C_2 $Q))
               (!- (Hoare $P (IF $S $C_1 $C_2) $Q)))))
   (H4. :WHILE "规则")
   ((law)
    (Center (B :WHILE "规则"))
    (MB (&rule (!- (Hoare (&conj $P $S) $C $P))
               (!- (Hoare $P (WHILE $S $C)
                          (&conj $P (&neg $S)))))))
   (H4. :FOR "规则")
   
   (H4. "数组")
   
   (H2. "机械化程序验证")
   (P "本章描述了一个简单的程序验证器的架构. "
      "其操作相对于Hoare逻辑的规则而澄清.")
   (P "在摆弄了一些例子之后, "
      "以下两件事情一目了然:"
      (Ol #:attr* '((type "i"))
          (Li "证明一般冗长且乏味 "
              "(即便要验证的程序相当简单).")
          (Li "存在大量琐碎的细节需要弄对, "
              "其中许多极其平凡, 例如证明"
              (!- (&impl (@conj (&= :R :X)
                                (&= :Q $0))
                         (@= :X (&+ :R (&c* :Y :Q)))))
              ".")))
   (P "人们已经进行了许多尝试(并且仍在继续), "
      "试图通过设计系统来自动完成正确性证明, "
      "让这些系统处理在Hoare逻辑中生成形式化证明时那些枯燥而繁琐的部分. "
      "不幸的是, 逻辑学家已经证明, 从原理上讲, "
      "不可能设计出一种判定过程来自动判定任意数学命题的真假 [10]. "
      "然而, 这并不意味着我们无法拥有能够证明许多有用定理的过程. "
      "一般判定过程的不存在仅仅表明, 我们不能期望自动证明一切. "
      "在实践中, 构建一个能够将验证过程中"
      "许多枯燥和常规方面机械化的系统是完全可行的. "
      "本章描述了一种常用的实现方法.")
   (P "尽管不可能自动判定任意命题的真假, "
      "但检验一个任意的形式化证明是否有效却是可能的. "
      "这包括检查证明中每一行出现的结果是否确实是公理, "
      "或者是由前面的行推导出的结论. "
      "由于程序正确性的证明通常非常冗长且枯燥, "
      "手动生成时往往会包含错误. "
      "因此, 即使证明只能在人工辅助下生成, "
      "对其进行机械化检验仍然是有价值的.")
   (H3. "概览")
   (P "前一章展示了如何证明" (Hoare $P $C $Q)
      ", 方法是证明" $C "的各部分之性质, "
      "然后(以合适的证明规则)将它们拼在一起"
      "以获得关于" $C "本身的预期性质. "
      "例如, 为了证明"
      (!- (Hoare $P (&\; $C_1 $C_2) $Q))
      ", 我们首先证明"
      (!- (Hoare $P $C_1 $R)) "和"
      (!- (Hoare $R $C_2 $Q))
      " (对于某个合适的" $R
      "而言), 然后根据顺序规则可以推出"
      (!- (Hoare $P (&\; $C_1 $C_2) $Q)) ".")
   (P "这种过程被称为" (Em "前向证明")
      ", 因为人们由公理通过规则向前推进到结论. "
      "在实践中, 更为自然的是后向工作: "
      "从表明" (Hoare $P $C $Q)
      "的目标开始, 我们生成子目标, 子目标, "
      "如此反复直至问题解决. "
      "例如, 假定我们想要证明:"
      (MB (!- (Hoare (&conj (&= :X :x)
                            (&= :Y :y))
                     (&\; (&:= :R :X)
                          (&:= :X :Y)
                          (&:= :Y :R))
                     (&conj (&= :Y :x)
                            (&= :X :y)))))
      "那么根据赋值公理和顺序规则, "
      "证明以下子目标就足够了:"
      (MB (!- (Hoare (&conj (&= :X :x)
                            (&= :Y :y))
                     (&\; (&:= :R :X)
                          (&:= :X :Y))
                     (&conj (&= :R :x)
                            (&= :X :y)))))
      "鉴于"
      (AssignmentAxiom
       (λ (V) (&conj (&= V :x)
                     (&= :X :y)))
       :Y :R)
      ". 根据类似的论证, 这个子目标可以被归约为"
      (MB (!- (Hoare (&conj (&= :X :x)
                            (&= :Y :y))
                     (&:= :R :X)
                     (&conj (&= :R :x)
                            (&= :Y :y)))))
      "这显然可由赋值公理推出.")
   (P "这一章描述了如何形式化这样一种面向目标的证明方法.")
   (P "这里所描述的验证系统可以被视为一个证明检查器, "
      "同时它也为证明的生成提供了一定的帮助. "
      "下图给出了该系统的概览.")
   (MB (apply Func
              (map-toggle
               #t Box '("要证明的规约"
                        "人类专家"
                        "注解了的规约"
                        "vc生成器"
                        "逻辑陈述集合"
                        "定理证明器"
                        "简化的验证条件集合"
                        "人类专家"
                        "证明结束"))))
   (P "该系统的输入是一个部分正确性规约, "
      "其中标注了描述变量之间关系的数学陈述. "
      "系统从标注后的规约中生成一组纯数学陈述, "
      "称为验证条件 (即VC). "
      "在3.5节中将会证明, 如果这些验证条件是可证明的, "
      "那么原始规约就可以从Hoare逻辑的公理和规则中推导出来.")
   (P "验证条件被传递给一个定理证明器程序, "
      "该程序尝试自动地证明它们; "
      "如果证明失败, 则向用户寻求建议. "
      "我们将集中讨论与Hoare逻辑相关的方面, "
      "而对定理证明本身着墨甚少.")
   (P "当前大量研究的目标是构建能够将"
      "缓慢且昂贵的人类专家的参与降到最低的系统. "
      "这可以通过以下途径实现:"
      (Ul (Li "减少所需标注的数量和复杂度, 以及")
          (Li "增强定理证明器的能力.")))
   (P "下一节将解释验证条件的工作原理. 在3.5节中, "
      "将依据Hoare逻辑的公理和规则来论证其使用的合理性. "
      "除了作为机械化验证系统的基础之外, "
      "验证条件也是手工进行证明的一种有用方式.")
   (H3. "验证条件")
   (P "以下各节描述了如何将面向目标的证明风格形式化. "
      "为了证明一个目标" (Hoare $P $C $Q)
      ", 需要完成三件事. 这些将在后文中详细解释, "
      "但这里先给出一个简要概述:"
      (Ol #:attr* '((type "i"))
          (Li "通过在程序" $C "中插入陈述 (通常称为断言) 来对其进行标注, "
              "这些断言表达了在各个中间点上应当成立的条件. "
              "这一步骤是棘手的, 需要智慧以及对程序工作方式的深刻理解. "
              "将其自动化是一个人工智能问题.")
          (Li "然后从标注后的规约中生成一组称为验证条件 (简称VC) 的逻辑陈述. "
              "这一过程是纯机械的, 很容易由程序完成.")
          (Li "证明这些验证条件. 将其自动化同样是一个人工智能问题.")))
   (P "我们将证明, 如果能够证明由" (Hoare $P $C $Q)
      "生成的所有验证条件 (其中" $C "已被适当注解), 则"
      (!- (Hoare $P $C $Q)) ".")
   (P "由于验证条件只是数学陈述, "
      "可以将上述第2步视为将验证问题" (Q "编译")
      "或翻译为传统数学问题的过程.")
   (P "下面的例子将给出关于验证条件用法的初步感受.")
   (P "假设目标是证明 (参见第24页的例子)"
      (CodeB "{T}
   R:=X;
   Q:=0;
   WHILE Y≤R DO (R:=R-Y; Q:=Q+1)
{X=R+Y×Q ∧ R&lt;Y}")
      "第一步 (上述的i) 是插入注解. "
      "一个合适的注解过了的规约如下:"
      
      )
   (H3. "注解")
   (H3. "验证条件生成")
   (P "本节描述了一个过程, 其为注解过了的部分正确性规约"
      (Hoare $P $C $Q) "生成验证条件. "
      "这个过程是" $C "上的递归.")
   ((law)
    (Center (B "赋值命令"))
    "由"
    (MB (Hoare $P (&:= $V $E) $Q))
    "生成的单条验证条件为"
    (MB (&impl $P (subst $Q $E $V))))
   (P (B "例子: ")
      (MB (Hoare (&= :X $0)
                 (&:= :X (&+ :X $1))
                 (&= :X $1)))
      "的验证条件为"
      (MB (&impl (&= :X $0)
                 (&= (@+ :X $1) $1)))
      "这显然为真.")
   ((law)
    (Center (B "条件式"))
    "由"
    (MB (Hoare $P (IF $S $C_1 $C_2) $Q))
    "生成的验证条件为"
    (Ol #:attr* '((type "i"))
        (Li (MB (Hoare (&conj $P $S) $C_1 $Q))
            "所生成的验证条件")
        (Li (MB (Hoare (&conj $P (&neg $S))
                       $C_2 $Q))
            "所生成的验证条件")))
   ((law)
    (Center (B "序列"))
    (Ol (Li ""
            )
        )
    )
   ((law)
    (Center (B :WHILE "命令"))
    "由"
    (MB (Hoare $P (AWHILE $S $R $C) $Q))
    "所生成的验证条件为"
    (Ol #:attr* '((type "i"))
        (Li (&impl $P $R))
        (Li (&impl (&conj $R (&neg $S)) $Q))
        (Li "由" (Hoare (&conj $R $S) $C $R)
            "所生成的验证条件")))
   
   (H3. "验证条件的澄清")
   (P "本节将证明, 若一个带注解的规约"
      (Hoare $P $C $Q)
      "所生成的验证条件是可证的, "
      "则该规约在Hoare逻辑中也是可证的, 即"
      (!- (Hoare $P $C $Q))
      ". 这说明验证条件是充分的, "
      "但并不意味着它们是必要的. "
      "事实上, 验证条件是最弱的充分条件, "
      "但我们在此既不对此作更精确的表述, 也不深入讨论细节. "
      "关于前条件的深入研究可参见Dijkstra的著作 [8].")
   (P "容易证明验证条件不是必要的, 即"
      (Hoare $P $C $Q)
      "的验证条件不可证并不意味着"
      (!- (Hoare $P $C $Q))
      "不可推导. 例如, 带注解规约"
      (Hoare :T (AWHILE :F :F (&:= :X $0)) :T)
      "的验证条件是不可证的, "
      "但该Hoare三元组在Hoare逻辑中是可证的.")
   (P "验证条件充分性的论证将对" $C "的结构进行归纳. "
      "这类归纳论证包含两个部分. "
      "首先, 证明结论对赋值命令成立. 其次, 证明当"
      $C "不是赋值命令时, 若结论对" $C
      "的各组成命令成立 (这称为归纳假设), 则结论对"
      $C "也成立. 前者称为归纳基础, 后者称为归纳步骤. "
      "由归纳基础和归纳步骤即可得出结论对所有命令成立.")
   (H4. "赋值")
   (P (Hoare $P (&:= $V $E) $Q)
      "唯一的验证条件是"
      (&impl $P (subst $Q $E $V))
      ". 如果这是可证的, 那么鉴于"
      (!- (Hoare (subst $Q $E $V)
                 (&:= $V $E)
                 $Q))
      " (赋值公理), 根据前条件强化可以推出"
      (!- (Hoare $P (&:= $V $E) $Q)) ".")
   (H4. "条件式")
   (P "如果"
      (Hoare $P (IF $S $C_1 $C_2) $Q)
      "的验证条件是可证的, 那么"
      (Hoare (&conj $P $S) $C_1 $Q) "和"
      (Hoare (&conj $P (&neg $S)) $C_2 $Q)
      "的验证条件都是可证的. "
      "根据归纳假设, 我们可以假定"
      (!- (Hoare (&conj $P $S) $C_1 $Q)) "和"
      (!- (Hoare (&conj $P (&neg $S)) $C_2 $Q))
      ". 因此, 根据条件式规则可得"
      (!- (Hoare $P (IF $S $C_1 $C_2) $Q)) ".")
   (H4. "序列")
   (P "存在两种需要考虑的情形:"
      (Ol #:attr* '((type "i"))
          (Li ""
              )
          )
      )
   (H4. :WHILE "命令")
   (P "如果" (Hoare $P (AWHILE $S $R $C) $Q)
      "生成的验证条件是可证的, 那么"
      (!- (&impl $P $R)) ", "
      (!- (&impl (@conj $R (&neg $S)) $Q))
      "且由" (Hoare (&conj $R $S) $C $R)
      "所生成的验证条件是可证的. "
      "根据归纳可得"
      (!- (Hoare (&conj $R $S) $C $R))
      ", 因而根据" :WHILE "规则有"
      (!- (Hoare $R (WHILE $S $C) (&conj $R (&neg $S))))
      ". 然后, 根据consequence规则可得"
      (!- (Hoare $P (WHILE $S $C) $Q)) ".")
   (H2. "可靠性和完备性")
   (P "本章研究了Hoare逻辑的公理和规则"
      "是否正确 (可靠性) 以及是否充分 (完备性) 的问题. "
      "这要求明确地给出编程语言的意义 (语义), "
      "从而能够严格地定义Hoare三元组的语义.")
   (H3. "语义")
   (P "一条命令" $C "将一个初始状态转换为一个最终状态 (或者不终止). "
      "对于目前所描述的语言, 从一个给定的初始状态出发, "
      "至多只能到达一个终止状态" -- "即命令是确定性的" --
      "但后面当我们向语言中加入存储分配时, 情况就不再如此了. "
      "在数学上, 有几种本质上等价的方式来表示命令的意义. "
      "我们将使用关系, 但部分函数也是常用的方式. "
      "使用关系通常与操作语义相关联, "
      "而部分函数则与指称语义相关联, "
      "不过这并不是严格固定的: "
      "指称语义可以使用关系作为指称, "
      "操作语义也可以归纳地定义函数. "
      "事实上, 在下面的第4.1.2节中, "
      "我们给出了一种命令的指称语义, "
      "其中指称就是关系.")
   (P "各种风格的语义在很大程度上只是表示相同数学思想的不同方式. "
      "某些数学表示更适合某些目的, 而另一些表示则更适合其他目的. "
      "我在下面给出的语义可能与你在之前课程中见过的语义一致, 也可能不一致. "
      "如果它看起来不同, 那么一个很好的练习就是思考它们之间有何关联.")
   (P "我们将用状态集合上的一个二元关系来表示命令" $C
      "的意义: 在这个关系中, " $s_1 "与" $s_2
      "相关联, 当且仅当" $C "在状态" $s_1
      "下执行后终止于状态" $s_2 ".")
   
   (H4. "表达式和陈述的语义")
   (P "命令中可能包含表达式或陈述: 表达式出现在赋值的右侧, "
      "而陈述出现在条件语句和" :WHILE "命令的测试条件中. "
      "Hoare三元组的前条件和后条件也是陈述. "
      "Hoare逻辑的经典处理建立在一阶逻辑之上, "
      "表达式被视为逻辑中的项, 陈述被视为公式. "
      "你应该在之前的课程中已经熟悉了一阶逻辑的语义, "
      "我不想在这里重复那些内容. 此外, 在现代应用中, "
      "用于书写前条件和后条件的语言有时比一阶逻辑更弱或更强, "
      "例如无量词逻辑 (更弱) 或高阶逻辑 (更强).")
   
   (H3. "Hoare逻辑的可靠性")
   
   (H3. "可判定性和完备性")
   (H2. "完全 (total) 正确性")
   (H3. "非循环命令")
   (H3. "赋值的终止性")
   (H3. "用于完全正确性的" :WHILE "规则")
   (H3. "终止规约")
   (H3. "终止性的验证条件")
   (H3. "验证条件生成")
   (H2. "程序精化")
   (H3. "引论")
   
   (H2. "指针和局部推理")
   (H3. "指针操纵构造")
   (H3. "例子: 反转链表")
   (H3. "分离逻辑断言")
   (H4. "指向关系: " (pointsTo $E $F))
   (H3. "语义和分离逻辑")
   ))