#lang racket
(provide hoare.html)
(require SMathML)
(define $curried (Mi "curried"))
(define $Com (Mi "Com"))
(define $State (Mi "State"))
(define $Var (Mi "Var"))
(define $Val (Mi "Val"))
(define $Exp (Mi "Exp"))
(define $Sta (Mi "Sta"))
(define $Num (Mi "Num"))
(define $f_R^curried
  (_^ $f $R $curried))
(define (Anno R C)
  (: (cur0 R) C))
(define (∀ x P)
  (: $forall x $. P))
(define (∃ x P)
  (: $exists x $. P))
(define (Func . x*)
  (apply : (map-toggle
            #f (λ (f) (^^ $-> f)) x*)))
(define (Box #:attr* [attr* '()] . xml*)
  `(menclose ,(attr*-set attr* 'notation "box")
             . ,xml*))
(define (AssignmentAxiom P V E)
  (!- (Hoare (P E) (&:= V E) (P V))))
(define (subst P E V)
  (: P (bra0 (&/ E V))))
(define (!- . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (let ((b (car b*)))
      (: (apply &cm a*) $vdash b))))
(define $impl $=>)
(define split2 (&split 2))
(define App split2)
(define (If q a e)
  (split2 $if q $then a $else e))
(define (Lam x e)
  (: $lambda x $. e))
(define (Hoare P C Q)
  (split2 (cur0 P) C (cur0 Q)))
(define (THoare P C Q)
  (split2 (bra0 P) C (bra0 Q)))
(define $Bool (Mi "Bool"))
(define (Pid str)
  (Mi str #:attr* '((mathvariant "monospace"))))
(define :WHILE (Pid "WHILE"))
(define :DO (Pid "DO"))
(define (WHILE S C)
  (split2 :WHILE S :DO C))
(define (AWHILE S R C)
  (split2 :WHILE S :DO (cur0 R) C))
(define :FOR (Pid "FOR"))
(define :IF (Pid "IF"))
(define :THEN (Pid "THEN"))
(define :ELSE (Pid "ELSE"))
(define (IF S C1 C2)
  (split2 :IF S :THEN C1 :ELSE C2))
(define :BEGIN (Pid "BEGIN"))
(define :END (Pid "END"))
(define (BEGIN . C*)
  (split2 :BEGIN (apply &\; C*) :END))
(define :x (Pid "x"))
(define :y (Pid "y"))
(define :n (Pid "n"))
(define :Q (Pid "Q"))
(define :R (Pid "R"))
(define :X (Pid "X"))
(define :Y (Pid "Y"))
(define :Z (Pid "Z"))
(define :T (Pid "T"))
(define :F (Pid "F"))
(define :sin (Pid "sin"))
(define (&sin X)
  (app :sin X))
(define :rem (Pid "rem"))
(define (&rem X Y)
  (appl :rem X Y))
(define :max (Pid "max"))
(define (&max X Y)
  (appl :max X Y))
(define :fact (Pid "fact"))
(define (fact n)
  (app :fact n))
(define :ODD (Pid "ODD"))
(define (&ODD X)
  (app :ODD X))
(define :EVEN (Pid "EVEN"))
(define (&EVEN X)
  (app :EVEN X))
(define :PRIME (Pid "PRIME"))
(define (&PRIME X)
  (app :PRIME X))
(define :MAX (Pid "MAX"))
(define (Pred str)
  (Mi str #:attr* '((mathvariant "sans-serif"))))
(define :Iter (Pred "Iter"))
(define (Iter n p c s1 s2)
  (App :Iter n p c s1 s2))
(define :Esem (Pred "Esem"))
(define (Esem E s)
  (split2 :Esem E s))
(define :Ssem (Pred "Ssem"))
(define Ssem
  (case-lambda
    ((S s) (App :Ssem S s))
    ((S) (App :Ssem S))))
(define :Csem (Pred "Csem"))
(define Csem
  (case-lambda
    ((C s1 s2) (App :Csem C s1 s2))
    ((C) (App :Csem C))))
(define :Hsem (Pred "Hsem"))
(define (Hsem P C Q)
  (split2 :Hsem P C Q))
(define (HSEM P C Q)
  (∀ (&cm $s_1 $s_2)
     (&impl (&conj (Ssem P $s_1)
                   (Csem C $s_1 $s_2))
            (Ssem Q $s_2))))
(define (pointsTo a b)
  (&\|-> a b))
(define-infix*
  (&impl $impl))
(define-@lized-op*
  (@App App)
  (@∀ ∀)
  (@∃ ∃)
  (@Lam Lam)
  (@If If)
  (@<= &<=)
  (@impl &impl)
  (@:= &:=)
  (@IF IF)
  (@WHILE WHILE)
  (@\; &\;)
  (@Iter Iter)
  (@Esem Esem)
  (@Ssem Ssem)
  (@Csem Csem)
  (@subst subst)
  (@/ &/)
  (@< &<)
  (@> &>))
(define ((law #:id [id #f]) . html*)
  (keyword-apply
   Div '(#:attr*) '(((class "frame"))) html*))
(define (Center . html*)
  `(div ((style "text-align: center;")) . ,html*))
(define X=R+Y*Q
  (&= :X (&+ :R (@c* :Y :Q))))
(define hoare.html
  (TnTmPrelude
   #:title "Hoare逻辑"
   #:css "styles.css"
   (H1. "Hoare逻辑")
   (P (B "CST Part II 课程的学习指南. ")
      "本文档旨在提供背景阅读材料以支持讲座" --
      "可以将其视为一本免费的可下载教科书. "
      "第1到5章介绍了Floyd和Hoare提出的程序规约与证明的经典思想. "
      "尽管大部分材料已经很老" --
      "请看一些被引用参考文献上的日期" --
      "它仍然是当前研究的基础. "
      "第6章是对程序精化的一个非常简要的介绍; "
      "它提供了从Hoare风格的规约"
      (Q "计算") "出一个实现的规则. "
      "第7章是对分离逻辑思想的介绍, "
      "分离逻辑是Hoare逻辑的一个扩展, "
      "用于规约和验证操纵指针的程序. "
      "分离逻辑建立在Burstall的早期思想之上, "
      "但其现代形式归功于O'Hearn和Reynolds.")
   (P "请注意, 讲座中呈现的一些主题可能未在本文档中涵盖, "
      "本文档中的一些材料也可能与讲座中涵盖的主题无关. "
      "例如, 程序精化和分离逻辑的主题可能只会被非常粗略地描述, "
      "如果有涉及的话. 考试题目将基于讲座中呈现的材料.")
   (P "Part II课程Hoare Logic是从一门更早的Part II课程演变而来的, "
      "该课程的网页可以在我的主页上找到 (www.cl.cam.ac.uk/~mjcg). "
      "那门课程的一些考试题目可能是很好的练习 "
      "(但请注意其中一些是基于本课程未涵盖的材料). "
      "一份包含当前课程练习题的单独文档可从网页获取.")
   (P (B "警告. ")
      "这里的材料由过去课程讲义的重新组织的摘录以及新材料组成. "
      "很有可能存在符号不一致, 遗漏和错误. "
      "如果您发现此类缺陷, "
      "请将详细信息发送至Mike.Gordon@cl.cam.ac.uk.")
   (P (B "致谢. ")
      "感谢Martin Vechev和John Wickerson"
      "在这些笔记的先前草稿中发现了许多错误 (其中一些是严重的), "
      "同时也感谢他们对改进文本提出的建议.")
   (H2. "程序规约")
   (P "本章引入了一种包含赋值, 条件式, 块和"
      :WHILE "循环的简单编程语言. "
      "然后用它来描述Hoare用于规约程序部分正确性的记号. "
      "Hoare的记号使用形式逻辑记号来表达关于程序变量值的条件. "
      "该记号被非形式化地描述并通过示例加以刻画.")
   (H3. "引论")
   (P "为了从数学上证明一个程序的正确性, "
      "我们必须首先刻画正确本身的含义. "
      "本章我们描述了一种用于刻画命令式程序的预期行为的记号. "
      "这种记号应该归功于C.A.R. Hoare.")
   (P "执行命令式程序有着改变" (Em "状态")
      "的作用, 直到第7章之前, 我们将状态取为程序变量的值. "
      "为了使用这样的程序, 我们需要建立初始状态, "
      "也就是将一些变量的值设置为有趣的值 (value of interest). "
      "然后我们执行程序. 这将初始状态变换为最终状态. "
      "然后我们检视最终状态里的变量的值来得到预期的结果. "
      "例如, 为了计算" :y "除以" :x
      ", 我们可能会将" :x "和" :y
      "分别载入程序变量" :X "和" :Y
      ". 然后我们可能会执行一个合适的程序 (见第1.4节的例子7) "
      "来将初始状态变换为最终状态以使得变量" :Q
      "和" :R "分别存放着商和余数.")
   (P "这些笔记里要使用的编程语言将于下一节进行描述.")
   (H3. "一种小语言")
   (P "程序由诸如赋值和条件式等命令构建而成. 术语"
      (Q "程序") "和" (Q "命令")
      "的确可以算是近义词; 前者只会用于表示完整算法的命令. "
      "这里的术语" (Q "陈述 (statement)")
      "用于程序变量上的条件, 其出现于正确性规约之中 (见第1.3节). "
      "这里存在混淆的风险, 因为一些作者将这个词用于命令 (如"
      (Q "for-statement") " [14]).")
   (P "现在我们描述我们的小语言里的"
      "各种命令的句法 (即形式) 和语义 (即意义). "
      "以下约定将会采用:"
      (Ol (Li "符号" (&cm $V $V_1 $..h $V_n)
              "代表任意的变量. 特定变量的例子有"
              (&cm :X :R :Q) "等等.")
          (Li "符号" (&cm $E $E_1 $..h $E_n)
              "代表任意的表达式 (或者说项). "
              "这些是像" (&cm (&+ :X $1) (Msqrt $2))
              "之类的东西, 其指称着值 (通常是数字).")
          (Li "符号" (&cm $S $S_1 $..h $S_n)
              "代表任意的陈述. 这些是像"
              (&cm (&< :X :Y) (&= (^ :X $2) $1))
              "之类的条件, 其要么为真要么为假.")
          (Li "符号" (&cm $C $C_1 $..h $C_n)
              "代表我们编程语言里的任意命令; "
              "这些会在本节的剩余部分进行描述."))
      "项和陈述在第1.5节进行了更为细致的描述.")
   (H4. "赋值")
   (P (B "句法: ") (&:= $V $E))
   (P (B "语义: ")
      "状态的改变由将项" $E "之值赋给变量" $V
      "完成. 所有的变量都假定具有全局作用域.")
   (P (B "例子: ") (Code "X:=X+1"))
   (P "这给变量" :X "之值加上一.")
   (H4. "序列")
   (P (B "句法: ") (&\; $C_1 $..h $C_n))
   (P (B "语义: ")
      "命令" (&cm $C_1 $..h $C_n)
      "按照顺序进行执行.")
   (P (B "例子: ") (Code "R:=X; X:=Y; Y:=R"))
   (P "变量" :X "和" :Y "之值经由临时变量" :R
      "进行了互换. 这个命令具有将变量" :R
      "之值变为变量" :X "之旧值的"
      (Em "副作用") ". {译注: 这个还是这些?}")
   (H4. "条件式")
   (P (B "句法: ") (IF $S $C_1 $C_2))
   (P (B "语义: ")
      "如果陈述" $S "在当前状态下为真, 那么"
      $C_1 "被执行. 如果" $S "为假, 那么"
      $C_2 "被执行.")
   (P (B "例子: ") (Code "IF X&lt;Y THEN MAX:=Y ELSE MAX:=X"))
   (P "变量" :MAX "之值被设为" :X "和" :Y
      "之值的最大值.")
   (H4. :WHILE "命令")
   (P (B "句法: ") (WHILE $S $C))
   (P (B "语义: ")
      "如果陈述" $S "在当前状态下为真, 那么"
      $C "被执行, 然后" :WHILE "命令重复. 如果"
      $S "为假, 那么什么也不做. 因此, " $C
      "反复执行, 直至" $S "的值变为假. 如果"
      $S "永远不变为假, 那么该命令的执行永远不终止.")
   (P (B "例子: ") (Code "WHILE ¬(X=0) DO X:=X-2"))
   (P "如果" :X "之值非零, 那么其值会减去" $2
      ", 然后进程重复. 这个" :WHILE
      "命令将会终止 (此时" :X "有着值" $0
      "), 如果" :X "的值是一个非负的偶数. "
      "其他状态下都不会终止.")
   (H4. "句法总结")
   (P "我们的小语言的句法可以用BNF记号总结如下:"
      (CodeB "&lt;command> ::= &lt;variable> := &lt;term>
           |  &lt;command>; ...; &lt;command>
           |  IF &lt;statement> THEN &lt;command> ELSE &lt;command>
           |  WHILE &lt;statement> DO &lt;command>"))
   (P "请注意:"
      (Ul (Li "变量, 项, 陈述描述于第1.5节.")
          (Li "这个BNF句法是有歧义的: 例如, "
              (&\; (IF $S_1 $C_1 $C_2) $C_3)
              "可能指的是"
              (&\; (@IF $S_1 $C_1 $C_2) $C_3)
              ", 也可能指的是"
              (IF $S_1 $C_1 (@\; $C_2 $C_3))
              ". 每当有必要时, 我们会用括号进行澄清.")))
   (H4. "历史注记")
   (P "旧的Part II课程Specification and Verification I"
      "是基于一种与上述描述类似的语言的, 但具有额外的特性: "
      "块 (带有局部变量), " :FOR "命令和数组. 块和" :FOR
      "命令并未添加根本性的新思想, 因此它们将不会被涵盖; "
      "数组使用分离逻辑能够更好地处理 (见第7章). "
      "在旧课程中我使用" :BEGIN "和" :END
      "来组合命令, 而在这里我只使用括号. "
      "因此以前我会写" (BEGIN $C_1 $C_2)
      "而不是" (@\; $C_1 $C_2)
      ". 我提及此事是因为它可能有助于"
      "将旧的考试题目作为本课程的练习来重新使用.")
   (H3. "Hoare记号")
   (P "在一篇开创性论文 [13] 里C.A.R. Hoare引入了记号"
      (Hoare $P $C $Q) ", 其有时被称为" (Em "Hoare三元组")
      ", 用于刻画一个程序做了什么. 在这样一个Hoare三元组之中:"
      (Ul (Li $C "是一个程序.")
          (Li $P "和" $Q "是" $C "中用到的程序变量上的条件. "
              "程序变量上的条件以标准的数学记号连带着诸如"
              (&cm $conj $disj $neg $impl)
              "这样的逻辑联结词书写. 这些在第1.5节有进一步描述.")))
   (P "我们称" (Hoare $P $C $Q) "为真, 如果每当"
      $C "在某个满足" $P "的状态下执行且" $C
      "的执行终止, 那么" $C "执行终止的状态满足" $Q ".")
   (P (B "例子: ")
      (Hoare (&= :X $1)
             (&:= :X (&+ :X $1))
             (&= :X $2))
      ". 这里的" $P "是" :X "之值为" $1
      "这一条件, " $Q "是" :X "之值为" $2
      "这一条件, " $C "是赋值命令"
      (&:= :X (&+ :X $1)) ". "
      (Hoare (&= :X $1)
             (&:= :X (&+ :X $1))
             (&= :X $2))
      "为真. {译注: 这个为真是从语义角度而言的.}")
   (P "一个表达式" (Hoare $P $C $Q)
      "被称为一个" (Em "部分正确性规约")
      "; " $P "被称为其" (Em "前条件")
      "而" $Q "被称为其" (Em "后条件") ".")
   (P "这样的规约之所以是" (Q "部分的")
      ", 是因为即便" (Hoare $P $C $Q)
      "为真, " $C "的执行在满足" $P
      "的状态下开始也不必终止. "
      "其所要求的仅是如果" $C
      "终止, 那么" $Q "成立.")
   (P "一种更强的规约是" (Em "完全正确性规约")
      ". 这种规约没有标准的记号. 我们将使用"
      (THoare $P $C $Q) ".")
   (P "完全正确性规约" (THoare $P $C $Q)
      "为真当且仅当以下两个条件满足:"
      (Ol #:attr* '((type "i"))
          (Li "如果" $C "在满足" $P
              "状态下开始执行, 那么"
              $C "终止.")
          (Li "在终止之后, " $Q "成立."))
      "部分正确性和完全正确性之间的关系"
      "可以非正式地表述为以下等式:"
      (MB (&= "完全正确性"
              (&+ "终止性" "部分正确性"))))
   (P "完全正确性是我们最终感兴趣的, "
      "但通常更容易通过分别建立部分正确性和终止性来证明它.")
   (P "终止性通常是容易建立的, 但有一些著名的例子并非如此. "
      "例如, 未解决的Collatz猜想与下面的程序是否对"
      :X "的所有值都终止有关 (见下面的练习):"
      (CodeB "WHILE X>1 DO
  IF ODD(X) THEN X := (3×X)+1 ELSE X := X DIV 2")
      "(表达式" (Code "X DIV 2")
      "求值为" (&/ :X $2)
      "向下取整到一个整数的结果, "
      "不过由于这里条件语句的"
      :ELSE "分支仅在" :X
      "为偶数时才被执行, 实际上不需要取整.)")
   (P "著名数学家Paul Erdős关于Collatz猜想说道: "
      (Q "数学对于这样的问题尚未准备好.")
      " 他为其解答提供500美元奖励.")
   (H3. "一些例子")
   (P "以下的例子刻画了部分正确性的各种方面.")
   (P "在以下的例子5, 6, 7中, " :T
      "是永远为真的条件. 在例子3, 4, 7中, "
      $conj "是联结词合取, 即如果"
      $P_1 "和" $P_2 "是条件, 那么"
      (&conj $P_1 $P_2) "是这样的条件, "
      "其为真每当" $P_1 "和" $P_2 "均成立.")
   (Ol (Li (Hoare (&= :X $1)
                  (&:= :Y :X)
                  (&= :Y $1))
           (Br)
           "这是说如果命令" (&:= :Y :X)
           "在一个满足条件" (&= :X $1)
           "的状态下执行, 那么如果执行终止 "
           "(在此情况下的确如此), 那么条件"
           (&= :Y $1) "将会成立. "
           "这个规约显然为真.")
       (Li (Hoare (&= :X $1)
                  (&:= :Y :X)
                  (&= :Y $2))
           (Br)
           "这是说如果" (&:= :Y :X)
           "的执行始于满足" (&= :X $1)
           "的状态, 那么" (&= :Y $2)
           "将会成立. 这显然为假.")
       (Li (Hoare (&conj (&= :X :x)
                         (&= :Y :y))
                  (&\; (&:= :R :X)
                       (&:= :X :Y)
                       (&:= :Y :R))
                  (&conj (&= :X :y)
                         (&= :Y :x)))
           (Br)
           "这是在说如果"
           (&\; (&:= :R :X)
                (&:= :X :Y)
                (&:= :Y :R))
           "的执行终止 (的确如此), 那么"
           :X "和" :Y "之值就被交换了. "
           "变量" :x "和" :y
           "没有出现在命令里, "
           "其是用来对于程序变量" :X
           "和" :Y "的初值进行命名的, "
           "这种变量被称为逻辑变量, "
           "或者辅助变量, 或者幽灵变量.")
       (Li (Hoare (&conj (&= :X :x)
                         (&= :Y :y))
                  (&\; (&:= :X :Y)
                       (&:= :Y :X))
                  (&conj (&= :X :y)
                         (&= :Y :x)))
           (Br)
           "这是在说"
           (&\; (&:= :X :Y)
                (&:= :Y :X))
           "可以交换" :X "和" :Y
           "之值, 但是实际上这并不为真.")
       (Li (Hoare :T $C $Q) (Br)
           "这是在说每当" $C
           "终止时, " $Q "成立.")
       (Li (Hoare $P $C :T) (Br)
           "这种规约对于每个条件" $P
           "和每个命令" $C
           "为真, 这是因为" :T
           "总是为真.")
       (Li (CodeB "{T}
R:=X;
Q:=0;
WHILE Y≤R DO
  (R:=R-Y; Q:=Q+1)
{R &lt; Y ∧ X = R + (Y × Q)}")
           "这是"
           (Hoare :T $C
                  (&conj (&< :R :Y)
                         X=R+Y*Q))
           ", 其中" $C "是上述的命令. "
           "这个规约为真, 如果每当" $C
           "的执行终止时, 那么" :Q
           "是商而" :R "是" :X
           "除以" :Y "的余数. "
           "这个规约的确为真, 即便"
           :X "起始为负数!"))
   (P "这个例子里用到了程序变量" :Q
      ", 读者不应将其与5中所用到的" $Q
      "混淆. 程序变量" :Q
      " (注意字体) 遍历数字, 而后条件"
      $Q " (注意字体) 则遍历陈述. "
      "一般而言, 我们使用"
      (Mtext "typewriter font"
             #:attr* '((mathvariant "monospace")))
      "表示特定的程序变量, 而使用"
      (Mtext "italic font"
             #:attr* '((mathvariant "italic")))
      "表示遍历陈述的变量. "
      "尽管这种对于字体的微妙运用乍看上去可能令人迷惑, "
      "但是读者一旦理解之后, 两种" (Q "Q")
      "之间的区分就非常显然了. (即便不看字体, "
      "你也应该能够从上下文中区分它们.)")
   (H3. "项和陈述")
   (P "这里用于表达前条件和后条件的记号基于一阶逻辑. "
      "我们只会简要回顾, 因为读者默认已经非常熟悉它了.")
   (P "以下是" (Em "原子陈述") "的例子:"
      (MB (&cm :T :F (&= :X $1) (&< :R :Y)
               X=R+Y*Q))
      "陈述要么为真要么为假. 陈述" :T
      "永远为真, 而陈述" :F "永远为假. 陈述"
      (&= :X $1) "为真, 如果" :X "之值等于"
      $1 ". 陈述" (&< :R :Y) "为真, 如果"
      :R "之值小于" :Y "之值. 陈述" X=R+Y*Q
      "为真, 如果" :X "之值等于" :R
      "之值与" :Y "和" :Q "之积的和.")
   (P "陈述由" (Em "项") "构建而成, 例如:"
      (MB (&cm :X $1 :R :Y
               (&+ :R (@c* :Y :Q))
               (&c* :Y :Q)))
      "项指称着" (Em "值")
      ", 例如数字和字符串, "
      "不像陈述要么为真要么为假. "
      "一些项, 例如" $1 "和" (&+ $4 $5)
      ", 指称着固定的值, 而其他一些项则包含"
      (Em "变量") ", 例如" (&cm :X :Y :Z)
      "等等, 其值可能会变化. "
      "我们对于项将会使用常规数学记号, "
      "如以下例子所刻画的那样:"
      (MB (&cm :X :Y :Z))
      (MB (&cm $1 $2 325))
      (MB (&cm (&- :X) (&- (@+ :X $1))
               (&+ (@c* :X :Y) :Z)))
      (MB (&cm (Msqrt (@+ $1 (^ :X $2)))
               (&fact :X)
               (&sin :X)
               (&rem :X :Y))))
   (P :T "和" :F "是分别总是为真和为假的原子陈述. "
      "其他的原子陈述则由项使用" (Em "谓词")
      "构建而成. 以下是更多的一些例子:"
      (MB (&cm (&ODD :X)
               (&PRIME $3)
               (&= :X $1)
               (&>= (^ (@+ :X $1) $2)
                    (^ :X $2))))
      :ODD "和" :PRIME "是谓词的例子, 而"
      $= "和" $>= "则是中缀谓词的例子. 表达式"
      (&cm :X $1 $3 (&+ :X $1)
           (^ (@+ :X $1) $2)
           (^ :X $2))
      "是项的例子.")
   (P (Em "复合陈述")
      "由原子陈述使用以下逻辑联结词构建而成:"
      (MB (set-attr*
           (&Table
            ($neg "否定")
            ($conj "合取")
            ($disj "析取")
            ($impl "推出")
            ($<=> "当且仅当"))
           'columnalign "left"))
      "设" $P "和" $Q "是陈述, 那么:"
      (Ul (Li (&neg $P) "为真如果"
              $P "为假, 为假如果"
              $P "为真.")
          (Li (&conj $P $Q)
              "为真每当" $P "和"
              $Q "均为真.")
          (Li (&disj $P $Q)
              "为真如果" $P
              "或" $Q "为真, "
              "可以同时为真.")
          (Li (&impl $P $Q)
              "为真如果每当" $P
              "为真则" $Q
              "也为真. 根据约定, 如果"
              $P "为假, 那么"
              (&impl $P $Q)
              "为真. 实际上, 通常将"
              (&impl $P $Q)
              "视为等价于"
              (&disj (&neg $P) $Q)
              "; 然而, 一些称为直觉主义者的哲学家"
              "并不赞同这一对于推出的处理方式. "
              "{译注: 显然, 不仅是哲学家, "
              "绝大部分编程语言学家也并不赞同.}"))
      "使用联结词构建的陈述的例子有:"
      (MB (set-attr*
           (&Table
            ((&disj (&ODD :X) (&EVEN :X))
             (: :X "是奇数或者偶数."))
            ((&neg (@impl (&PRIME :X) (&ODD :X)))
             (: "如果" :X "为素数, 那么" :X "为奇数, 并不成立."))
            ((&impl (&<= :X :Y)
                    (&<= :X (^ :Y $2)))
             (: "如果" :X "小于等于" :Y ", 那么"
                :X "小于等于" (^ :Y $2) ".")))
           'columnalign "left"))
      "为了减少括号的需要, 通常假定" $neg
      "比" $conj "和" $disj "结合得更紧密, "
      "而这两个又比" $impl "和" $<=>
      "结合得更紧密, 例如:"
      (eqn*
       ((&conj (&neg $P) $Q)
        "等价于"
        (&conj (@neg $P) $Q))
       ((&impl (&conj $P $Q) $R)
        "等价于"
        (&impl (@conj $P $Q) $R))
       ((&<=> (&conj $P $Q)
              (&disj (&neg $R) $S))
        "等价于"
        (&<=> (@conj $P $Q)
              (@disj (@neg $R) $S)))))
   (H2. "Hoare逻辑")
   (P "本章讨论了形式化证明的想法. "
      "然后, 我们引入了Hoare逻辑 "
      "(或称Floyd-Hoare逻辑) "
      "作为对于程序进行形式化推理的方法.")
   (P "上一章我们引入了三种可能为真或假的表达式:"
      (Ol #:attr* '((type "i"))
          (Li "部分正确性规约"
              (Hoare $P $C $Q) ".")
          (Li "完全正确性规约"
              (THoare $P $C $Q) ".")
          (Li "数学陈述, 例如"
              (&= (^ (@+ :X $1) $2)
                  (&+ (^ :X $2)
                      (&c* $2 :X)
                      $1)) "."))
      "我们假定读者已经知道如何证明简单的数学陈述, "
      "例如以上的iii中的那条. "
      "例如, 以下是该事实的一个证明."
      (MB (set-attr*
           (&Table
            ("1."
             (^ (@+ :X $1) $2)
             $=
             (&c* (@+ :X $1) (@+ :X $1))
             (: (^ (@) $2) "的定义."))
            ("2."
             (&c* (@+ :X $1) (@+ :X $1))
             $=
             (&+ (&c* (@+ :X $1) :X)
                 (&c* (@+ :X $1) $1))
             (: $c* "之于" $+ "的左分配律."))
            ("3."
             (^ (@+ :X $1) $2)
             $=
             (&+ (&c* (@+ :X $1) :X)
                 (&c* (@+ :X $1) $1))
             "将第2行代入第1行.")
            ("4."
             (&c* (@+ :X $1) $1)
             $=
             (&+ :X $1)
             (: $1 "的恒元律."))
            ("5."
             (&c* (@+ :X $1) :X)
             $=
             (&+ (&c* :X :X)
                 (&c* $1 :X))
             (: $c* "之于" $+ "的右分配律."))
            ("6."
             (^ (@+ :X $1) $2)
             $=
             (&+ (&c* :X :X)
                 (&c* $1 :X)
                 :X $1)
             "将第4行和第5行代入第3行.")
            ("7."
             (&c* $1 :X) $= :X
             (: $1 "的恒元律."))
            ("8."
             (^ (@+ :X $1) $2)
             $=
             (&+ (&c* :X :X)
                 :X :X $1)
             "将第7行代入第6行.")
            ("9."
             (&c* :X :X) $= (^ :X $2)
             (: (^ (@) $2) "的定义."))
            ("10."
             (&+ :X :X) $= (&c* $2 :X)
             (&cm (&= $2 (&+ $1 $1))
                  "分配律"))
            ("11."
             (^ (@+ :X $1) $2)
             $=
             (&+ (^ :X $2)
                 (&c* $2 :X)
                 $1)
             "将第9行和第10行代入第8行."))
           'columnalign "left")))
   (P "这个证明由一系列行构成, "
      "每行都是某个" (Em "公理")
      "的实例或者根据之前的行由"
      (Em "推理规则")
      "推出. 这个证明的最后一行是其所证明的陈述, 也就是"
      (&= (^ (@+ :X $1) $2)
          (&+ (^ :X $2)
              (&c* $2 :X)
              $1)) ".")
   (P "为了构造部分正确性规约的形式化证明, 需要公理和推理规则. "
      "这正是Hoare逻辑所提供的. "
      "该演绎系统的形式化表述归功于Hoare [13], "
      "但其中一些基本思想源自Floyd [9].")
   (P "Hoare逻辑中的证明是一系列行的序列, "
      "其中每一行要么是该逻辑的一条公理, "
      "要么是由前面的行通过该逻辑的一条推理规则推导而来.")
   (P "构造形式化证明的原因在于试图确保只使用可靠的演绎方法. "
      "有了可靠的公理和推理规则, 我们就可以确信所得出的结论是真的. "
      "另一方面, 如果任何公理或推理规则是不可靠的, "
      "那么就有可能推导出错误的结论; 例如:"
      (MB (set-attr*
           (&Table
            ("1."
             (Msqrt (&c* $-1 $-1))
             $=
             (Msqrt (&c* $-1 $-1))
             (: $= "的自反性."))
            ("2."
             (Msqrt (&c* $-1 $-1))
             $=
             (&c* (@ (Msqrt $-1)) (@ (Msqrt $-1)))
             (: (Msqrt $) "之于" $c* "的分配律."))
            ("3."
             (Msqrt (&c* $-1 $-1))
             $=
             (^ (@ (Msqrt $-1)) $2)
             (: (^ (@) $2) "的定义."))
            ("4."
             (Msqrt (&c* $-1 $-1))
             $= $-1
             (: (Msqrt $) "的定义."))
            ("5."
             (Msqrt $1) $= $-1
             (: "鉴于" (&= (&c* $-1 $-1) $1) "."))
            ("6."
             $1 $= $-1
             (: "鉴于" (&= (Msqrt $1) $1) ".")))
           'columnalign "left")))
   (P "形式化证明明确指出了为得出结论所使用的公理和推理规则. "
      "人们很容易提出一些看似合理但实际上不可靠的程序推理规则. "
      "计算机程序的正确性证明往往非常复杂, "
      "需要形式化方法来确保其有效性. "
      "因此, 将所使用的推理原则完全显式化是很重要的, "
      "这样才能对其可靠性进行分析.")
   (P "对于某些应用而言, 正确性尤为重要. "
      "例子包括生命攸关的系统, 如核反应堆控制器, 汽车制动系统, "
      "电传飞控飞机以及软件控制的医疗设备. "
      "曾有一起法律诉讼源于一台癌症治疗设备"
      "因软件缺陷导致辐射过量, 造成数人死亡 [15]. "
      "当穷举测试不可能实现时 (几乎总是如此), "
      "形式化正确性证明提供了一种确认程序中不存在缺陷的方法.")
   (P "本章将解释并举例说明用于程序推理的Hoare演绎系统. "
      "该系统的可靠性和完备性的数学分析将在第4章中讨论.")
   (H3. "Hoare逻辑的公理和规则")
   (P "正如本章开头所讨论的, "
      "一个命题的形式化证明是以该命题为最后一行的一个行序列, "
      "其中每一行要么是一条公理的实例, "
      "要么是由前面的行通过一条推理规则推导而来. 若" $S
      "是一个命题 (无论是普通数学的还是Hoare逻辑的), 我们记"
      (!- $S) "来表示" $S
      "有一个证明. 拥有证明的命题称为定理. "
      "如前所述, 在本讲义中只描述Hoare逻辑的公理和推理规则; "
      "因此, 若" $S "是一个数学定理, 我们将直接断言"
      (!- $S) "而不给出任何形式化的论证. "
      "当然, 为了达到完全的严格性, 这些断言必须被证明, "
      "但如何做到这一点的细节假定读者已经了解 "
      "(例如通过逻辑与证明课程).")
   (P "Hoare逻辑的公理在下面通过模式来指定, "
      "这些模式可以被实例化以得到特定的部分正确性规约. "
      "Hoare逻辑的推理规则将用如下形式的记号来描述:"
      (MB (&rule (!- $S_1) $..c (!- $S_n)
                 (!- $S)))
      "这是说结论" (!- $S) "可以从"
      (&cm (!- $S_1) $..h (!- $S_n))
      "推导而来, 后者是该规则的假设. "
      "这些假设可以全部是Hoare逻辑的定理 (如下面的顺序规则), "
      "也可以是Hoare逻辑定理与数学定理的混合 "
      "(如第2.1.2小节中描述的前条件加强规则).")
   (H4. "赋值公理")
   (P "赋值公理表达了这样一个事实: 在执行赋值命令"
      (&:= $V $E) "之后, 变量" $V
      "的值等于执行前表达式" $E
      "的值. 为了将此形式化, 注意到如果一个命题"
      $P "在赋值之后为真, 那么在执行赋值之前, 将"
      $P "中的" $V "替换为" $E "所得到的命题必须为真. "
      "{译注: 这似乎和以下公理所表达的内容方向相反.}")
   (P "为了形式化地表达这一点, 定义"
      (subst $P $E $V)
      "以表示将" $P "中所有" $V
      "的出现替换为" $E "之结果. "
      (subst $P $E $V)
      "读作" (Q $P " with " $E " for " $V)
      ". 例如,"
      (MB (&= (subst (@> (&+ :X $1) :X)
                     (&+ :Y :Z) :X)
              (@> (&+ (@+ :Y :Z) $1)
                  (&+ :Y :Z))))
      "记住这个记号的方法是" (Q "消去律")
      (MB (&= (subst $V $E $V) $E))
      "这类比于分式的消去性质"
      (MB (&= (&c* $v (@/ $e $v)) $e)))
   ((law)
    (Center (B "Hoare赋值公理"))
    (MB (!- (Hoare (subst $P $E $V)
                   (&:= $V $E)
                   $P)))
    "其中" $V "是任意的变量, " $E
    "是任意的表达式, " $P
    "是任意的陈述, 而" (subst $P $E $V)
    "代表将陈述" $P "中变量" $V
    "的所有出现都替换为项" $E ".")
   (P "赋值公理的实例有:"
      (Ol (Li (AssignmentAxiom
               (λ (V) (&= :Y V))
               :X $2))
          (Li (AssignmentAxiom
               (λ (V) (&= V (&+ :n $1)))
               :X (&+ :X $1)))
          (Li (AssignmentAxiom
               (λ (V) (&= V $E))
               :X $E)
              ", 如果" :X "在" $E
              "中没有出现.")))
   (P "许多人会感到赋值公理和他们所期望的相反. "
      "两种常见的错误直觉如下:"
      (Ol #:attr* '((type "i"))
          (Li (!- (Hoare $P (&:= $V $E)
                         (subst $P $V $E)))
              (Br) "(未完待续)")
          (Li (!- (Hoare $P (&:= $V $E)
                         (subst $P $E $V)))
              (Br) "如果取" $P "为"
              (&= :X $0) ", " $V "为"
              :X ", " $E "为" $1
              ", 就会得到"
              (!- (Hoare (&= :X $0)
                         (&:= :X $1)
                         (&= $1 $0)))
              ", 这显然是错误的. "
              "{译注: 也就是unsound.}")))
   (P "关于赋值公理容易产生错误直觉这一事实表明, "
      "拥有严格的手段来确立公理和规则的有效性是很重要的. "
      "我们将在后面的第4章中深入讨论这个主题, "
      "届时我们将给出我们这个小型编程语言的形式化语义, "
      "然后证明Hoare逻辑的公理和推理规则是可靠的. "
      "当然, 这一过程只有在我们相信形式化语义本身的正确性的前提下, "
      "才能增强我们对公理和规则的信心. "
      "上述简单的赋值公理对于" (Q "真实的")
      "编程语言是不成立的. 例如, G. Ligler [17] 的工作表明, "
      "它在(现已过时的)语言Algol 60中以六种不同的方式失效.")
   (P "(以下是对于Floyd赋值公理的讨论, 翻译暂时省略.)")
   (H4. "前条件强化")
   (P "下一条Hoare逻辑规则允许第18页的i和ii的前条件得到简化. "
      "回忆一下,"
      (MB (&rule (!- $S_1) $..c (!- $S_n)
                 (!- $S)))
      "表示" (!- $S) "可由"
      (&cm (!- $S_1) $..h (!- $S_n))
      "推导出来. {译注: 这是句法概念.}")
   (P "使用该记号, 前条件强化规则为")
   ((law)
    (Center (B "前条件强化"))
    (MB (&rule (!- (&impl $P $P^))
               (!- (Hoare $P^ $C $Q))
               (!- (Hoare $P $C $Q)))))
   (P (B "例子")
      (Ol (Li "根据算术事实"
              (!- (&impl (&= :X :n)
                         (&= (&+ :X $1) (&+ :n $1))))
              ", 以及第18页的2, "
              "藉由前条件强化可以得到"
              (MB (!- (Hoare (&= :X :n)
                             (&:= :X (&+ :X $1))
                             (&= :X (&+ :n $1)))))
              "这里的变量" :n
              "是辅助变量或者说幽灵变量的例子. "
              "正如之前所描述的 (见第10页), "
              "辅助变量是出现于部分正确性规约"
              (Hoare $P $C $Q)
              "中但未出现在命令" $C
              "中的变量. 这样的变量用于将"
              $C "执行前后的状态中的值关联起来. "
              "例如, 以上的规约里说的是如果"
              :X "之值为" :n
              ", 那么在执行赋值"
              (&:= :X (&+ :X $1))
              "之后其值将会变成"
              (&+ :n $1) ".")
          (Li "根据逻辑事实"
              (!- (&impl :T (&= $E $E)))
              ", 以及第18页的3, "
              "我们可以推导出如果"
              :X "没有出现在" $E
              "之中, 那么:"
              (MB (!- (Hoare :T (&:= :X $E)
                             (&= :X $E)))))))
   (H4. "后条件弱化")
   (P "正如之前的规则允许部分正确性规约里的前条件被强化, "
      "以下的规则允许我们对于后条件进行弱化.")
   ((law)
    (Center (B "后条件弱化"))
    (MB (&rule (!- (Hoare $P $C $Q^))
               (!- (&impl $Q^ $Q))
               (!- (Hoare $P $C $Q)))))
   (P (B "例子: ") "以下是一个小小的形式证明."
      (MB (set-attr*
           (&Table
            ("1."
             (AssignmentAxiom
              (λ (Q) (&conj (&= :R :X) (&= Q $0)))
              :Q $0)
             "根据赋值公理.")
            ("2."
             (!- (&impl (&= :R :X)
                        (&conj (&= :R :X)
                               (&= $0 $0))))
             "根据纯粹逻辑.")
            ("3."
             (!- (Hoare (&= :R :X)
                        (&:= :Q $0)
                        (&conj (&= :R :X) (&= :Q $0))))
             "根据前条件强化.")
            ("4."
             (!- (&impl (&conj (&= :R :X) (&= :Q $0))
                        (&= :R (&+ :X (@c* :Y :Q)))))
             "根据算术律.")
            ("5."
             (!- (Hoare (&= :R :X)
                        (&:= :Q $0)
                        (&= :R (&+ :X (@c* :Y :Q)))))
             "根据后条件弱化."))
           'columnalign "left")))
   (P "前条件强化和后条件弱化规则有时被称为"
      (Em "rules of consequence") ".")
   (H4. "规约合取与析取")
   (P "以下两条规则提供了将关于相同命令的不同规约组合起来的方法.")
   ((law)
    (Center (B "规约合取"))
    (MB (&rule (!- (Hoare $P_1 $C $Q_1))
               (!- (Hoare $P_2 $C $Q_2))
               (!- (Hoare (&conj $P_1 $P_2)
                          $C
                          (&conj $Q_1 $Q_2)))))
    (Center (B "规约析取"))
    (MB (&rule (!- (Hoare $P_1 $C $Q_1))
               (!- (Hoare $P_2 $C $Q_2))
               (!- (Hoare (&disj $P_1 $P_2)
                          $C
                          (&disj $Q_1 $Q_2))))))
   (P "这些规则对于将证明拆成独立的任务而言是有用的. "
      "例如, 其允许通过单独证明"
      (!- (Hoare $P $C $Q_1)) "和"
      (!- (Hoare $P $C $Q_2))
      "而证明"
      (!- (Hoare $P $C (&conj $Q_1 $Q_2))) ".")
   (P "剩余的这些规则允许复合命令的性质由其分量的性质推导而来.")
   (H4. "顺序规则")
   (P "接下来的规则允许我们由" $C_1 "和" $C_2
      "的规约推导出序列" (&\; $C_1 $C_2)
      "的部分正确性规约.")
   ((law)
    (Center (B "顺序规则"))
    (MB (&rule (!- (Hoare $P $C_1 $Q))
               (!- (Hoare $Q $C_2 $R))
               (!- (Hoare $P (&\; $C_1 $C_2) $R)))))
   (P (B "例子: ") "根据赋值公理:"
      (Ol #:attr* '((type "i"))
          (Li (AssignmentAxiom
               (λ (R) (&conj (&= R :x)
                             (&= :Y :y)))
               :R :X))
          (Li (AssignmentAxiom
               (λ (X) (&conj (&= :R :x)
                             (&= X :y)))
               :X :Y))
          (Li (AssignmentAxiom
               (λ (Y) (&conj (&= Y :x)
                             (&= :X :y)))
               :Y :R)))
      "因此, 根据i, ii和顺序规则, 我们有"
      (Ol #:attr* '((type "i")
                    (start "4"))
          (Li (!- (Hoare (&conj (&= :X :x) (&= :Y :y))
                         (&\; (&:= :R :X) (&:= :X :Y))
                         (&conj (&= :R :x) (&= :X :y))))))
      "因此, 根据iv和iii以及顺序规则, 我们有"
      (Ol #:attr* '((type "i")
                    (start "5"))
          (Li (!- (Hoare (&conj (&= :X :x) (&= :Y :y))
                         (&\; (&:= :R :X)
                              (&:= :X :Y)
                              (&:= :Y :R))
                         (&conj (&= :Y :x) (&= :X :y)))))))
   (H4. "导出顺序规则")
   (P "以下的规则可由顺序规则和consequence规则导出.")
   ((law)
    (Center (B "导出顺序规则"))
    
    )
   (P "(未完待续)")
   (H4. "条件规则")
   ((law)
    (Center (B "条件规则"))
    (MB (&rule (!- (Hoare (&conj $P $S) $C_1 $Q))
               (!- (Hoare (&conj $P (&neg $S)) $C_2 $Q))
               (!- (Hoare $P (IF $S $C_1 $C_2) $Q)))))
   (P (B "例子: ")
      "假定我们有了"
      (Ol #:attr* '((type "i"))
          (Li (!- (&impl (&>= :X :Y)
                         (&= (&max :X :Y) :X))))
          (Li (!- (&impl (&>= :Y :X)
                         (&= (&max :X :Y) :Y)))))
      "那么, 根据条件式规则(和其他一些规则), 可以推出"
      (MB (!- (Hoare :T (IF (&>= :X :Y)
                            (&:= :MAX :X)
                            (&:= :MAX :Y))
                     (&= :MAX (&max :X :Y))))))
   (H4. :WHILE "规则")
   (P "如果" (!- (Hoare (&conj $P $S) $C $P))
      ", 那么我们称: 每当" $S "成立, "
      $P "是" $C "的一个" (Em "不变量")
      ". " :WHILE "规则是说, 如果" $P
      "每当测试条件成立时是" :WHILE
      "命令之体的一个不变量, 那么" $P
      "是整个" :WHILE "命令的一个不变量. "
      "换言之, 如果执行" $C
      "一次能够保持" $P "的为真, 那么执行"
      $C "任意多次也能够保持" $P "的为真.")
   (P :WHILE "命令也表达了这样的事实, "
      "在一个" :WHILE "命令终止之后, "
      "测试条件必然为假 "
      "(否则的话, 之前就不会终止).")
   ((law)
    (Center (B :WHILE "规则"))
    (MB (&rule (!- (Hoare (&conj $P $S) $C $P))
               (!- (Hoare $P (WHILE $S $C)
                          (&conj $P (&neg $S)))))))
   (P (B "例子: ") "根据之前的规则可得:"
      (MB (!- (Hoare X=R+Y*Q
                     (&\; (&:= :R (&- :R :Y))
                          (&:= :Q (&+ :Q $1)))
                     X=R+Y*Q)))
      "因此, 根据前条件强化, 可知"
      (MB (!- (Hoare (&conj X=R+Y*Q
                            (&<= :Y :R))
                     (&\; (&:= :R (&- :R :Y))
                          (&:= :Q (&+ :Q $1)))
                     X=R+Y*Q)))
      "于是, 根据" :WHILE "规则, 取" $P "为"
      (Q X=R+Y*Q)
      ", 可以得到"
      (MB (!- (Hoare X=R+Y*Q
                     (WHILE (&<= :Y :R)
                            (@\; (&:= :R (&- :R :Y))
                                 (&:= :Q (&+ :Q $1))))
                     (&conj X=R+Y*Q
                            (&neg (@<= :Y :R))))))
      "应用赋值公理两次 (以及顺序公理), 容易推导出"
      (MB (!- (Hoare :T (&\; (&:= :R :X)
                             (&:= :Q $0))
                     X=R+Y*Q)))
      "根据以上两个结果, 以及顺序规则和后条件弱化, 可以推得"
      (MB (!- (Hoare :T (&\; (&:= :R :X)
                             (&:= :Q $0)
                             (WHILE (&<= :Y :R)
                                    (@\; (&:= :R (&- :R :Y))
                                         (&:= :Q (&+ :Q $1)))))
                     (&conj (&< :R :Y)
                            X=R+Y*Q)))))
   (P "除了" :WHILE "规则这个例外, "
      "目前所有描述的公理和规则对于"
      "完全正确性和部分正确性都是可靠的. "
      "这是因为我们的小语言中唯一可能不终止的命令就是"
      :WHILE "命令. {译注: 并且, 根据精心(且脆弱)的安排, "
      "如果该语言里的运算和谓词都是完全的, "
      "那么该语言甚至不会抛出异常.} "
      "现在考虑如下证明:"
      (Ol (Li (AssignmentAxiom
               (λ (X) :T) :X $0)
              " (赋值公理)")
          (Li (!- (Hoare (&conj :T :T)
                         (&:= :X $0)
                         :T))
              " (前条件强化)")
          (Li (!- (Hoare :T (WHILE :T (&:= :X $0))
                         (&conj :T (&neg :T))))
              " (2和" :WHILE "规则)"))
      "若是" :WHILE "规则对于完全正确性也是适用的, "
      "那么上述证明就会表明:"
      (MB (!- (THoare :T (WHILE :T (&:= :X $0))
                      (&conj :T (&neg :T)))))
      "但这显然不对, 因为"
      (WHILE :T (&:= :X $0))
      "并不终止, 但即便它终止了, "
      (&conj :T (&neg :T))
      "也不可能在任何结果状态下成立.")
   (H4. :FOR "规则")
   (P "(未完待续)")
   (H4. "数组")
   (P "(未完待续)")
   (H2. "机械化程序验证")
   (P "本章描述了一个简单的程序验证器的架构. "
      "其操作相对于Hoare逻辑的规则而澄清.")
   (P "在摆弄了一些例子之后, "
      "以下两件事情一目了然:"
      (Ol #:attr* '((type "i"))
          (Li "证明一般冗长且乏味 "
              "(即便要验证的程序相当简单).")
          (Li "存在大量琐碎的细节需要弄对, "
              "其中许多极其平凡, 例如证明"
              (!- (&impl (@conj (&= :R :X)
                                (&= :Q $0))
                         (@= :X (&+ :R (&c* :Y :Q)))))
              ".")))
   (P "人们已经进行了许多尝试(并且仍在继续), "
      "试图通过设计系统来自动完成正确性证明, "
      "让这些系统处理在Hoare逻辑中生成形式化证明时那些枯燥而繁琐的部分. "
      "不幸的是, 逻辑学家已经证明, 从原理上讲, "
      "不可能设计出一种判定过程来自动判定任意数学命题的真假 [10]. "
      "然而, 这并不意味着我们无法拥有能够证明许多有用定理的过程. "
      "一般判定过程的不存在仅仅表明, 我们不能期望自动证明一切. "
      "在实践中, 构建一个能够将验证过程中"
      "许多枯燥和常规方面机械化的系统是完全可行的. "
      "本章描述了一种常用的实现方法.")
   (P "尽管不可能自动判定任意命题的真假, "
      "但检验一个任意的形式化证明是否有效却是可能的. "
      "这包括检查证明中每一行出现的结果是否确实是公理, "
      "或者是由前面的行推导出的结论. "
      "由于程序正确性的证明通常非常冗长且枯燥, "
      "手动生成时往往会包含错误. "
      "因此, 即使证明只能在人工辅助下生成, "
      "对其进行机械化检验仍然是有价值的.")
   (H3. "概览")
   (P "前一章展示了如何证明" (Hoare $P $C $Q)
      ", 方法是证明" $C "的各部分之性质, "
      "然后(以合适的证明规则)将它们拼在一起"
      "以获得关于" $C "本身的预期性质. "
      "例如, 为了证明"
      (!- (Hoare $P (&\; $C_1 $C_2) $Q))
      ", 我们首先证明"
      (!- (Hoare $P $C_1 $R)) "和"
      (!- (Hoare $R $C_2 $Q))
      " (对于某个合适的" $R
      "而言), 然后根据顺序规则可以推出"
      (!- (Hoare $P (&\; $C_1 $C_2) $Q)) ".")
   (P "这种过程被称为" (Em "前向证明")
      ", 因为人们由公理通过规则向前推进到结论. "
      "在实践中, 更为自然的是后向工作: "
      "从表明" (Hoare $P $C $Q)
      "的目标开始, 我们生成子目标, 子目标, "
      "如此反复直至问题解决. "
      "例如, 假定我们想要证明:"
      (MB (!- (Hoare (&conj (&= :X :x)
                            (&= :Y :y))
                     (&\; (&:= :R :X)
                          (&:= :X :Y)
                          (&:= :Y :R))
                     (&conj (&= :Y :x)
                            (&= :X :y)))))
      "那么根据赋值公理和顺序规则, "
      "证明以下子目标就足够了:"
      (MB (!- (Hoare (&conj (&= :X :x)
                            (&= :Y :y))
                     (&\; (&:= :R :X)
                          (&:= :X :Y))
                     (&conj (&= :R :x)
                            (&= :X :y)))))
      "鉴于"
      (AssignmentAxiom
       (λ (V) (&conj (&= V :x)
                     (&= :X :y)))
       :Y :R)
      ". 根据类似的论证, 这个子目标可以被归约为"
      (MB (!- (Hoare (&conj (&= :X :x)
                            (&= :Y :y))
                     (&:= :R :X)
                     (&conj (&= :R :x)
                            (&= :Y :y)))))
      "这显然可由赋值公理推出.")
   (P "这一章描述了如何形式化这样一种面向目标的证明方法.")
   (P "这里所描述的验证系统可以被视为一个证明检查器, "
      "同时它也为证明的生成提供了一定的帮助. "
      "下图给出了该系统的概览.")
   (MB (apply Func
              (map-toggle
               #t Box '("要证明的规约"
                        "人类专家"
                        "注解了的规约"
                        "vc生成器"
                        "逻辑陈述集合"
                        "定理证明器"
                        "简化的验证条件集合"
                        "人类专家"
                        "证明结束"))))
   (P "该系统的输入是一个部分正确性规约, "
      "其中标注了描述变量之间关系的数学陈述. "
      "系统从标注后的规约中生成一组纯数学陈述, "
      "称为验证条件 (即VC). "
      "在3.5节中将会证明, 如果这些验证条件是可证明的, "
      "那么原始规约就可以从Hoare逻辑的公理和规则中推导出来.")
   (P "验证条件被传递给一个定理证明器程序, "
      "该程序尝试自动地证明它们; "
      "如果证明失败, 则向用户寻求建议. "
      "我们将集中讨论与Hoare逻辑相关的方面, "
      "而对定理证明本身着墨甚少.")
   (P "当前大量研究的目标是构建能够将"
      "缓慢且昂贵的人类专家的参与降到最低的系统. "
      "这可以通过以下途径实现:"
      (Ul (Li "减少所需标注的数量和复杂度, 以及")
          (Li "增强定理证明器的能力.")))
   (P "下一节将解释验证条件的工作原理. 在3.5节中, "
      "将依据Hoare逻辑的公理和规则来论证其使用的合理性. "
      "除了作为机械化验证系统的基础之外, "
      "验证条件也是手工进行证明的一种有用方式.")
   (H3. "验证条件")
   (P "以下各节描述了如何将面向目标的证明风格形式化. "
      "为了证明一个目标" (Hoare $P $C $Q)
      ", 需要完成三件事. 这些将在后文中详细解释, "
      "但这里先给出一个简要概述:"
      (Ol #:attr* '((type "i"))
          (Li "通过在程序" $C "中插入陈述 (通常称为断言) 来对其进行标注, "
              "这些断言表达了在各个中间点上应当成立的条件. "
              "这一步骤是棘手的, 需要智慧以及对程序工作方式的深刻理解. "
              "将其自动化是一个人工智能问题.")
          (Li "然后从标注后的规约中生成一组称为验证条件 (简称VC) 的逻辑陈述. "
              "这一过程是纯机械的, 很容易由程序完成.")
          (Li "证明这些验证条件. 将其自动化同样是一个人工智能问题.")))
   (P "我们将证明, 如果能够证明由" (Hoare $P $C $Q)
      "生成的所有验证条件 (其中" $C "已被适当注解), 则"
      (!- (Hoare $P $C $Q)) ".")
   (P "由于验证条件只是数学陈述, "
      "可以将上述第2步视为将验证问题" (Q "编译")
      "或翻译为传统数学问题的过程.")
   (P "下面的例子将给出关于验证条件用法的初步感受.")
   (P "假设目标是证明 (参见第24页的例子)"
      (CodeB "{T}
   R:=X;
   Q:=0;
   WHILE Y≤R DO (R:=R-Y; Q:=Q+1)
{X = R+Y×Q ∧ R&lt;Y}")
      "第一步 (上述的i) 是插入注解. "
      "一个合适的注解过了的规约如下:"
      (CodeB "{T}
   R:=X;
   Q:=0; {R=X ∧ Q=0} ← P1
   WHILE Y≤R DO {X = R+Y×Q} ← P2
   (R:=R-Y; Q:=Q+1)
{X = R+Y×Q ∧ R&lt;Y}")
      "注解" $P_1 "和" $P_2
      "陈述了每当控制抵达它们时预期成立的条件. "
      
      )
   (H3. "注解")
   (P "带注解的命令是指在其中嵌入了陈述 (称为断言) 的命令. "
      "如果在以下位置插入了陈述, 则称该命令是正确注解的:"
      (Ol #:attr* '((type "i"))
          (Li "对于序列" (&\; $C_1 $C_2 $..h $C_n)
              "而言, 每个不是赋值命令的命令"
              $C_i "之前, 其中" (&> $i $1) ".")
          (Li "在" :WHILE "命令的" :DO "之后."))
      "从直觉上来说, 插入的断言应当表达的是: "
      "每当控制抵达断言出现的点时, "
      "我们预期成立的条件.")
   ((tcomment)
    "这个定义会遇到微妙的序列嵌套问题, "
    "但并非不可解决. 不过, 本讲义呈现时, "
    "似乎默认序列一定是摊平的.")
   (P "正确注解的规约是一个规约" (Hoare $P $C $Q)
      ", 其中" $C "是正确注解的命令.")
   (P (B "例子: ")
      
      )
   (H3. "验证条件生成")
   (P "本节描述了一个过程, 其为注解过了的部分正确性规约"
      (Hoare $P $C $Q) "生成验证条件. "
      "这个过程是" $C "上的递归.")
   ((law)
    (Center (B "赋值命令"))
    "由"
    (MB (Hoare $P (&:= $V $E) $Q))
    "生成的单条验证条件为"
    (MB (&impl $P (subst $Q $E $V))))
   (P (B "例子: ")
      (MB (Hoare (&= :X $0)
                 (&:= :X (&+ :X $1))
                 (&= :X $1)))
      "的验证条件为"
      (MB (&impl (&= :X $0)
                 (&= (@+ :X $1) $1)))
      "这显然为真.")
   ((law)
    (Center (B "条件式"))
    "由"
    (MB (Hoare $P (IF $S $C_1 $C_2) $Q))
    "生成的验证条件为"
    (Ol #:attr* '((type "i"))
        (Li (MB (Hoare (&conj $P $S) $C_1 $Q))
            "所生成的验证条件")
        (Li (MB (Hoare (&conj $P (&neg $S))
                       $C_2 $Q))
            "所生成的验证条件")))
   (P "如果" (&\; $C_1 $..h $C_n)
      "被正确注解了, 那么 (见第39页) "
      "其必然具有以下两种形式之一:"
      (Ol (Li (&\; $C_1 $..h (_ $C (&- $n $1))
                   (Anno $R $C_n)) ", 或是")
          (Li (&\; $C_1 $..h (_ $C (&- $n $1))
                   (&:= $V $E)) "."))
      "在这两种情形下, "
      (&\; $C_1 $..h (_ $C (&- $n $1)))
      "都是正确注解了的命令.")
   ((law)
    (Center (B "序列"))
    (Ol (Li (MB (Hoare $P
                       (&\; $C_1 $..h (_ $C (&- $n $1))
                            (Anno $R $C_n))
                       $Q))
            "(其中" $C_n "不是一个赋值) "
            "所生成的验证条件为:"
            (Ol #:attr* '((type "a"))
                (Li (MB (Hoare $P
                               (&\; $C_1 $..h (_ $C (&- $n $1)))
                               $R))
                    "所生成的验证条件")
                (Li (MB (Hoare $R $C_n $Q))
                    "所生成的验证条件")))
        (Li (MB (Hoare $P
                       (&\; $C_1 $..h (_ $C (&- $n $1))
                            (&:= $V $E))
                       $Q))
            "所生成的验证条件是由"
            (MB (Hoare $P
                       (&\; $C_1 $..h (_ $C (&- $n $1)))
                       (subst $Q $E $V)))
            "所生成的验证条件")))
   (P (B "例子: ")
      (MB (Hoare (&conj (&= :X :x) (&= :Y :y))
                 (&\; (&:= :R :X)
                      (&:= :X :Y)
                      (&:= :Y :R))
                 (&conj (&= :X :y) (&= :Y :x))))
      "所生成的验证条件是"
      (MB (Hoare (&conj (&= :X :x) (&= :Y :y))
                 (&\; (&:= :R :X)
                      (&:= :X :Y))
                 (subst (@conj (&= :X :y) (&= :Y :x))
                        :R :Y)))
      "所生成的验证条件, 这化简一下是"
      (MB (Hoare (&conj (&= :X :x) (&= :Y :y))
                 (&\; (&:= :R :X)
                      (&:= :X :Y))
                 (&conj (&= :X :y) (&= :R :x))))
      "由此生成的验证条件是"
      (MB (Hoare (&conj (&= :X :x) (&= :Y :y))
                 (&:= :R :X)
                 (subst (@conj (&= :X :y) (&= :R :x))
                        :Y :X)))
      "所生成的验证条件, 这又可以简化为"
      (MB (Hoare (&conj (&= :X :x) (&= :Y :y))
                 (&:= :R :X)
                 (&conj (&= :Y :y) (&= :R :x))))
      "这生成的唯一的验证条件是"
      (MB (&impl (&conj (&= :X :x) (&= :Y :y))
                 (subst (@conj (&= :Y :y) (&= :R :x))
                        :X :R)))
      "即可以化简为"
      (MB (&impl (&conj (&= :X :x) (&= :Y :y))
                 (&conj (&= :Y :y) (&= :X :x))))
      "这显然为真.")
   (P :WHILE "命令的正确注解规约具有形式"
      (MB (Hoare $P (AWHILE $S $R $C) $Q))
      "根据第24页的用法, 注解" $R
      "被称为一个不变量.")
   ((law)
    (Center (B :WHILE "命令"))
    "由"
    (MB (Hoare $P (AWHILE $S $R $C) $Q))
    "所生成的验证条件为"
    (Ol #:attr* '((type "i"))
        (Li (&impl $P $R))
        (Li (&impl (&conj $R (&neg $S)) $Q))
        (Li "由" (Hoare (&conj $R $S) $C $R)
            "所生成的验证条件")))
   ((tcomment)
    "乍看上去, 对于没有注解过的"
    :WHILE "命令的规约"
    (MB (Hoare $P (WHILE $S $C) $Q))
    "我们似乎也能够根据" :WHILE
    "命令的规则生成以下验证条件:"
    (Ol #:attr* '((type "i"))
        (Li (&impl (&conj $P (&neg $S)) $Q))
        (Li "由" (Hoare (&conj $P $S) $C $P)
            "所生成的验证条件"))
    "但问题在于, " $P "往往太强了. 从直觉上来说, "
    $P "描述的是" :WHILE "循环执行之前的状态, "
    "而命令的目的恰恰在于改变状态. 因此, "
    "这里的注解几乎完全是必要的, 而且难以自动化.")
   (P (B "例子: ")
      (CodeB "{R=X ∧ Q=0}
WHILE Y≤R DO {X = R+Y×Q}
  (R:=R-Y; Q=Q+1)
{X = R+(Y×Q) ∧ R&lt;Y}")
      "的验证条件为:"
      (Ol #:attr* '((type "i"))
          (Li (&impl (&conj (&= :R :X) (&= :Q $0))
                     X=R+Y*Q))
          (Li (&impl (&conj X=R+Y*Q
                            (&neg (@<= :Y :R)))
                     (&conj X=R+Y*Q
                            (&< :R :Y)))))
      "连带着"
      (MB (Hoare (&conj X=R+Y*Q
                        (&<= :Y :R))
                 (&\; (&:= :R (&- :R :Y))
                      (&:= :Q (&+ :Q $1)))
                 X=R+Y*Q))
      "的验证条件, 而这个条件仅有一条, 即"
      (Ol #:attr* '((type "i")
                    (start "3"))
          (Li (MB (&impl (&conj X=R+Y*Q
                                (&<= :Y :R))
                         (&= :X (&+ (@- :R :Y)
                                    (@c* :Y (@+ :Q $1))))))))
      "因此, 若i, ii, iii成立, 那么此" :WHILE
      "命令的规约为真, 即若"
      (MB (!- (&impl (&conj (&= :R :X) (&= :Q $0))
                     X=R+Y*Q)))
      "且"
      (MB (!- (&impl (&conj X=R+Y*Q
                            (&neg (@<= :Y :R)))
                     (&conj X=R+Y*Q
                            (&< :R :Y)))))
      "且"
      (MB (!- (&impl (&conj X=R+Y*Q
                            (&<= :Y :R))
                     (&= :X (&+ (@- :R :Y)
                                (@c* :Y (@+ :Q $1)))))))
      "那么"
      (MB (!- (Hoare (&conj (&= :R :X) (&= :Q $0))
                     (AWHILE (&<= :Y :R)
                             X=R+Y*Q
                             (&\; (&:= :R (&- :R :Y))
                                  (&:= :Q (&+ :Q $1))))
                     (&conj X=R+Y*Q
                            (&< :R :Y))))))
   (H3. "验证条件的澄清")
   (P "本节将证明, 若一个带注解的规约"
      (Hoare $P $C $Q)
      "所生成的验证条件是可证的, "
      "则该规约在Hoare逻辑中也是可证的, 即"
      (!- (Hoare $P $C $Q))
      ". 这说明验证条件是充分的, "
      "但并不意味着它们是必要的. "
      "事实上, 验证条件是最弱的充分条件, "
      "但我们在此既不对此作更精确的表述, 也不深入讨论细节. "
      "关于前条件的深入研究可参见Dijkstra的著作 [8].")
   (P "容易证明验证条件不是必要的, 即"
      (Hoare $P $C $Q)
      "的验证条件不可证并不意味着"
      (!- (Hoare $P $C $Q))
      "不可推导. 例如, 带注解规约"
      (Hoare :T (AWHILE :F :F (&:= :X $0)) :T)
      "的验证条件是不可证的, "
      "但该Hoare三元组在Hoare逻辑中是可证的. "
      "{译注: 当我们说其在Hoare逻辑中是可证时, "
      "是直接将命令中的注解完全抛弃了的.}")
   (P "验证条件充分性的论证将对" $C "的结构进行归纳. "
      "这类归纳论证包含两个部分. "
      "首先, 证明结论对赋值命令成立. 其次, 证明当"
      $C "不是赋值命令时, 若结论对" $C
      "的各组成命令成立 (这称为归纳假设), 则结论对"
      $C "也成立. 前者称为归纳基础, 后者称为归纳步骤. "
      "由归纳基础和归纳步骤即可得出结论对所有命令成立.")
   (H4. "赋值")
   (P (Hoare $P (&:= $V $E) $Q)
      "唯一的验证条件是"
      (&impl $P (subst $Q $E $V))
      ". 如果这是可证的, 那么鉴于"
      (!- (Hoare (subst $Q $E $V)
                 (&:= $V $E)
                 $Q))
      " (赋值公理), 根据前条件强化可以推出"
      (!- (Hoare $P (&:= $V $E) $Q)) ".")
   (H4. "条件式")
   (P "如果"
      (Hoare $P (IF $S $C_1 $C_2) $Q)
      "的验证条件是可证的, 那么"
      (Hoare (&conj $P $S) $C_1 $Q) "和"
      (Hoare (&conj $P (&neg $S)) $C_2 $Q)
      "的验证条件都是可证的. "
      "根据归纳假设, 我们可以假定"
      (!- (Hoare (&conj $P $S) $C_1 $Q)) "和"
      (!- (Hoare (&conj $P (&neg $S)) $C_2 $Q))
      ". 因此, 根据条件式规则可得"
      (!- (Hoare $P (IF $S $C_1 $C_2) $Q)) ".")
   (H4. "序列")
   (P "存在两种需要考虑的情形:"
      (Ol #:attr* '((type "i"))
          (Li "如果"
              (Hoare $P
                     (&\; $C_1 $..h (_ $C (&- $n $1))
                          (Anno $R $C_n))
                     $Q)
              "的验证条件是可证明的, 那么"
              (Hoare $P (&\; $C_1 $..h (_ $C (&- $n $1))) $R)
              "和" (Hoare $R $C_n $Q)
              "的验证条件都必须是可证明的, "
              "因而根据规则有"
              (!- (Hoare $P (&\; $C_1 $..h (_ $C (&- $n $1))) $R))
              "和" (!- (Hoare $R $C_n $Q))
              ". 于是, 根据顺序规则, 我们可得"
              (!- (Hoare $P
                         (&\; $C_1 $..h (_ $C (&- $n $1)) $C_n)
                         $Q)) ".")
          (Li "如果"
              (Hoare $P
                     (&\; $C_1 $..h (_ $C (&- $n $1))
                          (&:= $V $E))
                     $Q)
              "的验证条件是可证明的, 那必然是"
              (Hoare $P (&\; $C_1 $..h (_ $C (&- $n $1)))
                     (subst $Q $E $V))
              "的验证条件也是可证的这一情形, "
              "因而根据归纳, 我们有"
              (!- (Hoare $P (&\; $C_1 $..h (_ $C (&- $n $1)))
                         (subst $Q $E $V)))
              ". 然后, 根据赋值公理可以得到"
              (!- (Hoare (subst $Q $E $V)
                         (&:= $V $E)
                         $Q))
              ", 于是由顺序规则得到"
              (!- (Hoare $P
                         (&\; $C_1 $..h (_ $C (&- $n $1))
                              (&:= $V $E))
                         $Q)) ".")))
   (H4. :WHILE "命令")
   (P "如果" (Hoare $P (AWHILE $S $R $C) $Q)
      "生成的验证条件是可证的, 那么"
      (!- (&impl $P $R)) ", "
      (!- (&impl (@conj $R (&neg $S)) $Q))
      "且由" (Hoare (&conj $R $S) $C $R)
      "所生成的验证条件是可证的. "
      "根据归纳可得"
      (!- (Hoare (&conj $R $S) $C $R))
      ", 因而根据" :WHILE "规则有"
      (!- (Hoare $R (WHILE $S $C) (&conj $R (&neg $S))))
      ". 然后, 根据consequence规则可得"
      (!- (Hoare $P (WHILE $S $C) $Q)) ".")
   (H2. "可靠性和完备性")
   (P "本章研究了Hoare逻辑的公理和规则"
      "是否正确 (可靠性) 以及是否充分 (完备性) 的问题. "
      "这要求明确地给出编程语言的意义 (语义), "
      "从而能够严格地定义Hoare三元组的语义.")
   (H3. "语义")
   (P "一条命令" $C "将一个初始状态转换为一个最终状态 (或者不终止). "
      "对于目前所描述的语言, 从一个给定的初始状态出发, "
      "至多只能到达一个终止状态" -- "即命令是确定性的" --
      "但后面当我们向语言中加入存储分配时, 情况就不再如此了. "
      "在数学上, 有几种本质上等价的方式来表示命令的意义. "
      "我们将使用关系, 但部分函数也是常用的方式. "
      "使用关系通常与操作语义相关联, "
      "而部分函数则与指称语义相关联, "
      "不过这并不是严格固定的: "
      "指称语义可以使用关系作为指称, "
      "操作语义也可以归纳地定义函数. "
      "事实上, 在下面的第4.1.2节中, "
      "我们给出了一种命令的指称语义, "
      "其中指称就是关系.")
   (P "各种风格的语义在很大程度上只是表示相同数学思想的不同方式. "
      "某些数学表示更适合某些目的, 而另一些表示则更适合其他目的. "
      "我在下面给出的语义可能与你在之前课程中见过的语义一致, 也可能不一致. "
      "如果它看起来不同, 那么一个很好的练习就是思考它们之间有何关联.")
   (P "我们将用状态集合上的一个二元关系来表示命令" $C
      "的意义: 在这个关系中, " $s_1 "与" $s_2
      "相关联, 当且仅当" $C "在状态" $s_1
      "下执行后终止于状态" $s_2 ".")
   (P "数学上有多种方式来表示关系, 虽然选择哪种并不真正重要, "
      "但在深入具体细节之前, 先简要介绍一下这些不同的表示方式, "
      "可能有助于避免后续的混淆.")
   (P "集合论的入门书籍通常将关系表示为序对的集合, 即"
      $x "藉由关系" $R "与" $y "关联当且仅当"
      (∈ (tu0 $x $y) $R)
      ". 因此, 集合" $X "和" $Y
      "之间的一个二元关系是" (&c* $X $Y)
      "的一个子集, 即" (&sube $R (&c* $X $Y))
      "或者" (∈ $R (powset (&c* $X $Y)))
      ", 其中" $P:script "是幂集算子. 如果"
      $S "是任意的集合, 那么任何子集"
      (&sube $A $S) "都可以由一个函数"
      (func $f_A $S (setE $true $false))
      "刻画, 该函数的定义为"
      (MB (∀ (∈ $s $S)
             (&<=> (&= (app $f_A $s) $true)
                   (∈ $s $A))))
      $f_A "被称为" $A "的特征函数. "
      "因此, 一个关系" (&sube $R (&c* $X $Y))
      "可以由其特征函数" $f_R "刻画, 其被定义为"
      (MB (∀ (∈ $x $X)
             (∀ (∈ $y $Y)
                (&<=> (&= (appl $f_R $x $y) $true)
                      (∈ (tu0 $x $y) $R)))))
      "其中" (func $f_R (&c* $X $Y) (setE $true $false))
      ". 如果从集合" $S "到集合" $T
      "的所有函数之集合记作" (&-> $S $T)
      ", 而" $Bool "是集合" (setE $true $false)
      ", 那么" (∈ $f_R (&-> (&c* $X $Y) $Bool))
      ". 你或许可以从之前的课 (例如ML课) 上回忆一下, "
      "接受两个参数或者更多参数的函数可以被curry化, "
      "以使得这些函数每次接受一个参数. "
      "如果我们对于" $f_R "进行curry化, 那么就会得到函数"
      $f_R^curried ", 其定义如下:"
      (MB (&= (App $f_R^curried $x $y)
              (appl $f_R $x $y)))
      "那么"
      (func $f_R^curried $X (@-> $Y $Bool))
      ", 或是"
      (&: $f_R^curried (&-> $X $Y $Bool))
      ", 如果我们采取" $-> "向右结合的标准约定. "
      "注意到我们也有"
      (∈ $f_R^curried (&-> $X (powset $Y)))
      ". {译注: 原文写的是"
      (∈ $f_R^curried (powset (&-> $X $Y $Bool)))
      ", 这肯定不太对, "
      "但是我不确定我修正之后的版本是作者的原意.}")
   (P "总结一下, 一个关系" $R
      "可以表示为一个序对的集合, "
      "或者是一个将序对映射至布尔值的特征函数, "
      "或者是curry化了的特征函数. "
      "出于历史和风格方面的混合原因 (多少有些随意), "
      "我们将使用curry化特征函数的表示方式来表示命令的语义. "
      "具体而言, 我们将要定义" (Csem $C $s_1 $s_2)
      "来表达如果" $C "始于状态" $s_1
      ", 那么其会终止于状态" $s_2
      ". 这里的" :Csem "是用于表示" $C
      "的语义的关系, 其被表示为curry化的特征函数. "
      "我们语言中的命令集合将记作" $Com
      ", 而状态集合则记作" $State ". 因此, "
      (&: (Csem $C) (&-> $State $State $Bool))
      "或是"
      (&: :Csem (&-> $Com $State $State $Bool))
      ". 正如之前我们所提到的, 选择将" (Csem $C)
      "表示为curry化的特征函数而非序对集合, "
      "更多是风格上的考量, 与实质没有太多关系.")
   (P "令" $Var "是陈述, 表达式 (项), "
      "命令中所允许的变量之集合, 令"
      $Val "是变量可以取的值之集合. "
      "不必具体描述变量和值实际上是什么: 例如, "
      $Var "可以是 ASCII 字符的有限字符串的集合, "
      $Val "可以是整数的集合. "
      "一个状态确定每个变量的值, "
      "并且此外可能包含其他信息. "
      "对于我们的小型编程语言, "
      "将状态取为从" $Var "到" $Val
      "的函数就足够了. 使用" (&-> $A $B)
      "的记法来表示定义域为" $A
      ", 值域 (实则为陪域) 为"
      $B "的函数的集合, "
      "我们定义状态的集合" $State "为:"
      (MB (&= $State (&-> $Var $Val)))
      "注意以下写法都是等价的: "
      (∈ $s $State) ", "
      (∈ $s (@-> $Var $Val)) ", 以及"
      (func $s $Var $Val)
      ". 对于状态" $s "中与变量" $v
      "关联的值, 我们有时记成" (app $s $v)
      ", 有时记成" (App $s $v)
      ", 此即应用表示状态" $s
      "的函数于" $v
      ". 尽管目前将状态表示为从变量到值的函数已经足够了, "
      "第7章我们还要为状态加上另一组件, "
      "用于表示指针的内容. "
      "我们将在那一章中扩展" $State
      "的定义. 特定的状态可以使用"
      $lambda "记号来定义. 例如, 将"
      :X "映射为" $1 ", " :Y
      "映射为" $2 ", 而其他一切变量映射为"
      $0 "的状态可以定义为"
      (MB (Lam $v (If (&= $v :X) $1
                      (@If (&= $v :Y) $2 $0))))
      "如果"
      (&cm (∈ $s $State) (∈ $v $Var) (∈ $n $Val))
      ", 那么" (subst $s $n $v)
      "表示这样的状态, 其和"
      $s "一样, 除了变量"
      $v "的值为" $n ". 因此, "
      (subst $s $n $v)
      "由以下等式给出:"
      (MB (&= (subst $s $n $v)
              (Lam $v^
                   (If (&= $v^ $v) $n
                       (app $s $v^))))))
   (P (B "例子: ")
      (MB (subst
           (@Lam $v (If (&= $v :X) $1
                        (@If (&= $v :Y) $2 $0)))
           $3 :Z))
      (MB $=)
      (MB (Lam $v (If (&= $v :X) $1
                      (@If (&= $v :Y) $2
                           (@If (&= $v :Z) $3 $0)))))
      "{译注: 这是所谓的外延相等, 或者说指称相等.}")
   (H4. "表达式和陈述的语义")
   (P "命令中可能包含表达式或陈述: 表达式出现在赋值的右侧, "
      "而陈述出现在条件语句和" :WHILE "命令的测试条件中. "
      "Hoare三元组的前条件和后条件也是陈述. "
      "Hoare逻辑的经典处理建立在一阶逻辑之上, "
      "表达式被视为逻辑中的项, 陈述被视为公式. "
      "你应该在之前的课程中已经熟悉了一阶逻辑的语义, "
      "我不想在这里重复那些内容. 此外, 在现代应用中, "
      "用于书写前条件和后条件的语言有时比一阶逻辑更弱或更强, "
      "例如无量词逻辑 (更弱) 或高阶逻辑 (更强).")
   (P "为了避免涉及特定逻辑及其语义的细节, "
      "我们假设已给定表达式集合"
      $Exp "和语句集合" $Sta
      ", 以及定义它们语义的语义函数"
      :Esem "和" :Ssem ", 其中:"
      (eqn*
       (:Esem $: (&-> $Exp $State $Val))
       (:Ssem $: (&-> $Sta $State $Bool)))
      "现在我们给出一些非形式化的讨论和例子来刻画"
      :Esem "和" :Ssem "是如何对于特定逻辑定义的. "
      "我们希望从中可以清楚地看出, "
      "更形式化的处理将如何进行. "
      "按照通常的逻辑术语 "
      "(例如IB Tripos课程Logic and Proof中所使用的), "
      "我们是在用状态来表示解释函数, 把" $Val
      "作为论域或者说宇宙. "
      "变量的解释通过在状态中查找来实现:"
      (MB (&= (Esem $X $s) (app $s $X)))
      "{译注: 原文使用的是" :X
      ", 对于这个字体我不敢苟同, "
      "鉴于它应该是一个代表变量的元变量.}" (Br)
      "常量获得其通常的数学或逻辑含义:"
      (eqn*
       ((Esem $3 $s) $= $3)
       ((Ssem :T $s) $= $true))
      "{译注: 这里其实我有点问题, "
      "对于数字我的译文一以贯之没有使用其他字体, "
      "但是书中对于项/表达式中的数字是使用所谓的打字机字体的. "
      "不过, 你会发现原文的排版也有一些疏忽, "
      "例如角标的字体都没有顾及到这一点. "
      "总之, 我只是希望字体不要带来困惑.}" (Br)
      "复合表达式或陈述是自底而上进行解释的: "
      "(通过递归计算得到的)子表达式的值"
      "使用合适的数学或逻辑运算组合起来"
      "以得到整个表达式的解释. 例如:"
      (eqn*
       ((Esem (@- $E) $s) $= (&- (@Esem $E $s)))
       ((Esem (@+ $E_1 $E_2) $s)
        $= (&+ (@Esem $E_1 $s) (@Esem $E_2 $s))))
      (eqn*
       ((Ssem (@neg $S) $s) $= (&neg (@Ssem $S $s)))
       ((Ssem (@< $E_1 $E_2) $s)
        $= (&< (@Esem $E_1 $s) (@Esem $E_2 $s))))
      "{译注: 原文这里写的是"
      (MB (&= (Ssem (@< $S_1 $S_2) $s)
              (&< (@Ssem $S_1 $s) (@Ssem $S_2 $s))))
      "个人认为并不合理, 因为" $<
      "实际上是一个谓词而非逻辑联结词, "
      (&< $S_1 $S_2) "应该是一个原子陈述, 而"
      $S_1 "和" $S_2 "应该是项 (或者说表达式). "
      "换言之, 我们需要用" :Esem "来对于这些分量求值.}" (Br)
      "其中这些等式左边的符号"
      (apply enum (map* Q $- $+ $neg $<))
      "是陈述句法的一部分 (也就是对象语言的一部分), "
      "而右边的相应符号是非形式化的数学记号的一部分 "
      "(也就是我们的元语言的一部分). "
      "{译注: 更确切地说, 左边的那些符号本身就是句法, "
      "而右边的符号则指称着某种函数. 而且, "
      "最好我们也应该明确区分项和陈述, "
      "不然就会犯下原文这里的错误.} "
      "这是需要仔细琢磨的微妙之处! "
      "量词 (或许会出现在前条件和后条件里, "
      "但是不会出现在命令的测试里) "
      "以标准方式进行解释:"
      (eqn*
       ((Ssem (@∀ $v $S) $s)
        $= (∀ $n (Ssem $S (@subst $s $n $v))))
       ((Ssem (@∃ $v $S) $s)
        $= (∃ $n (Ssem $S (@subst $s $n $v)))))
      "{译注: 右边的" $n "取值于论域, 即" $Val ".}")
   (P (B "例子: ")
      (MB (&= (Ssem (@< :Y (&+ :Z $3))
                    (@Lam $v (If (&= $v :X) $1
                                 (@If (&= $v :Y) $2 $0))))
              (@< $2 (&+ $0 $3)))))
   (P "我们希望这足以解释之后要用到的" :Esem "和" :Ssem
      "了. 注意到对于任意的" (∈ $E $Exp) "和"
      (∈ $S $Sta) ", 我们有"
      (eqn*
       ((App :Esem $E) $: (&-> $State $Val))
       ((Ssem $S) $: (&-> $State $Bool))))
   (H4. "命令的语义")
   (P (Csem $C $s_1 $s_2) "将自底而上递归定义. "
      "唯一不含有子命令的命令是赋值. "
      "在一次赋值之后, 最终状态" $s_2
      "等于初始状态, 不过其中赋值左侧的变量" $V
      "被更新为右侧表达式" $E "在初始状态下的值."
      (MB (&= (Csem (@:= $V $E) $s_1 $s_2)
              (@= $s_2 (subst $s_1 (@Esem $E $s_1) $V)))))
   (P "从初始状态" $s_1 "出发执行顺序组合"
      (&\; $C_1 $C_2) "能够到达最终状态" $s_2
      ", 当且仅当存在一个中间状态" $s
      ", 使得从" $s_1 "执行" $C_1 "可到达" $s
      ", 并且从该中间状态" $s "执行"
      $C_2 "可到达" $s_2 "."
      (MB (&= (Csem (@\; $C_1 $C_2) $s_1 $s_2)
              (∃ $s (&conj (Csem $C_1 $s_1 $s)
                           (Csem $C_2 $s $s_2))))))
   (P "如果" $S "在状态" $s_1 "中为真, 则从" $s_1
      "出发执行条件语句" (IF $S $C_1 $C_2)
      "能够到达状态" $s_2 ", 当且仅当从" $s_1
      "出发执行" :THEN "分支" $C_1 "能够到达" $s_2
      ". 然而, 如果" $S "在状态" $s_1 "中为假, 则从"
      $s_1 "出发执行该条件语句能够到达状态" $s_2
      ", 当且仅当从" $s_1 "出发执行" :ELSE
      "分支" $C_2 "能够到达" $s_2 "."
      (MB (&= (Csem (@IF $S $C_1 $C_2) $s_1 $s_2)
              (If (@Ssem $S $s_1)
                  (@Csem $C_1 $s_1 $s_2)
                  (@Csem $C_2 $s_1 $s_2)))))
   (P "如果从初始状态" $s_1 "出发执行"
      (WHILE $S $C) "能够到达最终状态" $s_2
      ", 那么必然存在有限次的" $C
      "的迭代能够到达" $s_2 ", 并且" $S
      "在所有中间状态中为真, 而在" $s_2
      "中为假. 这通过定义一个迭代有限次的(谓词)函数"
      :Iter "来形式化, 进而我们定义:"
      (MB (&= (Csem (@WHILE $S $C) $s_1 $s_2)
              (∃ $n (Iter $n (@Ssem $S) (@Csem $C)
                          $s_1 $s_2))))
      "函数" :Iter "是" $n "上的递归, 定义如下:"
      (eqn*
       ((Iter $0 $p $c $s_1 $s_2)
        $= (&conj (&neg (@App $p $s_1))
                  (@= $s_1 $s_2)))
       ((Iter (@+ $n $1) $p $c $s_1 $s_2)
        $= (&conj (@App $p $s_1)
                  (@∃ $s (&conj (@App $c $s_1 $s)
                                (@Iter $n $p $c $s $s_2))))))
      :Iter "的第一个参数" $n "是迭代的次数. "
      "第二个参数" $p "是状态上的谓词, 例如" (Ssem $S)
      ". 第三个参数" $c "是一个curry化的特征函数, 例如" (Csem $C)
      ". 第四个和第五个参数分别是初状态和终状态. 如果"
      $Num "代表自然数集合" (setE $0 $1 $2 $..h)
      ", 那么我们有"
      (MB (&: :Iter (&-> $Num (@-> $State $Bool)
                         (@-> $State $State $Bool)
                         $State $State $Bool))))
   (H3. "Hoare逻辑的可靠性")
   (P "Hoare三元组" (Hoare $P $C $Q)
      "的意义被定义为" (Hsem $P $C $Q)
      ", 其中:"
      (MB (&= (Hsem $P $C $Q)
              (∀ (&cm $s_1 $s_2)
                 (&impl (&conj (Ssem $P $s_1)
                               (Csem $C $s_1 $s_2))
                        (Ssem $Q $s_2)))))
      "这个定义可以用来表述Hoare逻辑的可靠性. "
      "为了表明可靠性, 我们需要证明赋值公理的所有实例均为真, "
      "并且如果假设为真则由推理规则得到的所有结论为真. "
      "回忆一下赋值公理:")
   ((law)
    (Center (B "Hoare赋值公理"))
    (MB (!- (Hoare (subst $P $E $V)
                   (&:= $V $E)
                   $P)))
    "其中" $V "是任意的变量, " $E
    "是任意的表达式, " $P
    "是任意的陈述, 而" (subst $P $E $V)
    "代表将陈述" $P "中变量" $V
    "的所有出现都替换为项" $E ".")
   (P "为了证明这是可靠的, 我们必须表明对于每个"
      (&cm $V $E $P) ":"
      (MB (Hsem (@subst $P $E $V)
                (@:= $V $E)
                $P))
      "展开" :Hsem "的定义会将其转换为:"
      (MB (∀ (&cm $s_1 $s_2)
             (&impl (&conj (Ssem (@subst $P $E $V) $s_1)
                           (Csem (@:= $V $E) $s_1 $s_2))
                    (Ssem $P $s_2))))
      "展开" :Csem "的定义会将其转换为:"
      (MB (∀ (&cm $s_1 $s_2)
             (&impl (&conj (Ssem (@subst $P $E $V) $s_1)
                           (@= $s_2 (subst $s_1 (@Esem $E $s_1) $V)))
                    (Ssem $P $s_2))))
      "这可以化简为:"
      (MB (∀ (&cm $s_1 $s_2)
             (&impl (Ssem (@subst $P $E $V) $s_1)
                    (Ssem $P (@subst $s_1 (@Esem $E $s_1) $V)))))
      "这乍看上去可能有点令人困惑, 因为前件和后件里的记号"
      (bra0 (&/ $..c $..c)) "有着不同的含义. "
      
      )
   (P (B "关于替换的离题.")
      
      )
   (H3. "可判定性和完备性")
   (P (Hoare :T $C :F) "为真当且仅当" $C "并不终止, "
      "因而既然停机问题是不可判定的, "
      "于是Hoare逻辑也是不可判定的.")
   (P "可靠性是指, 凡是能用Hoare逻辑的公理和推理规则"
      "推导出的Hoare三元组都是真的. "
      "其逆命题, 即完备性, 则是说任何真的Hoare三元组"
      "都能用Hoare逻辑的公理和推理规则推导出来. "
      "遗憾的是, 这在一般情况下并不成立.")
   (P "考虑" (Hoare :T (&:= :X :X) $P)
      ". 根据之前的语义, 此为真当且仅当"
      (Hsem :T (@:= :X :X) $P) "为真, 即:"
      (MB (HSEM :T (@:= :X :X) $P))
      "既然"
      (&= (Csem (@:= :X :X) $s_1 $s_2)
          (@= $s_2 $s_1))
      "且" (&= (Ssem :T $s_1) $true)
      ", 这可以归约为"
      (MB (∀ (&cm $s_1 $s_2)
             (&impl (@= $s_2 $s_1)
                    (Ssem $P $s_2))))
      
      )
   (H4. "相对完备性")
   (H4. "句法和语义最弱前条件")
   (H4. "句法前条件和可表达性")
   
   (H2. "完全 (total) 正确性")
   (P "本章Hoare逻辑的公理和规则被扩展到了完全正确性, "
      "其给出了完全正确性规约的验证条件.")
   (P "在1.3节中, 我们引入了记号" (THoare $P $C $Q)
      "来表示完全正确性规约, 即每当"
      $C "在满足" $P "的状态下执行时, "
      "它将终止于一个满足" $Q
      "的状态. 在描述" :WHILE
      "规则的那一节 (第2.1.8节) 末尾, "
      "我们已经表明该规则对于完全正确性规约不是可靠的. "
      "这是因为" :WHILE "命令可能引入非终止性. "
      "其他命令都不会引入非终止性, "
      "因此Hoare逻辑的规则可以继续使用.")
   (H3. "非循环命令")
   (P "将花括号替换为方括号, 我们就得到了以下公理和规则.")
   (P (B "完全正确性的赋值公理")
      (MB (!- (THoare (subst $P $E $V)
                      (&:= $V $E)
                      $P))))
   (P (B "完全正确性的前条件加强")
      (MB (&rule (!- (&impl $P $P^))
                 (!- (THoare $P^ $C $Q))
                 (!- (THoare $P $C $Q)))))
   (P (B "完全正确性的后条件弱化")
      (MB (&rule (!- (THoare $P $C $Q^))
                 (!- (&impl $Q^ $Q))
                 (!- (THoare $P $C $Q)))))
   (P (B "完全正确性的规约合取")
      (MB (&rule (!- (THoare $P_1 $C $Q_1))
                 (!- (THoare $P_2 $C $Q_2))
                 (!- (THoare (&conj $P_1 $P_2)
                             $C
                             (&conj $Q_1 $Q_2))))))
   (P (B "完全正确性的规约析取")
      (MB (&rule (!- (THoare $P_1 $C $Q_1))
                 (!- (THoare $P_2 $C $Q_2))
                 (!- (THoare (&disj $P_1 $P_2)
                             $C
                             (&disj $Q_1 $Q_2))))))
   (P (B "完全正确性的顺序规则")
      (MB (&rule (!- (THoare $P $C_1 $Q))
                 (!- (THoare $Q $C_2 $R))
                 (!- (THoare $P (&\; $C_1 $C_2) $R)))))
   (P (B "完全正确性的导出顺序规则")
      
      )
   (P (B "完全正确性的条件规则")
      (MB (&rule (!- (THoare (&conj $P $S) $C_1 $Q))
                 (!- (THoare (&conj $P (&neg $S)) $C_2 $Q))
                 (!- (THoare $P (IF $S $C_1 $C_2) $Q)))))
   (P "这些规则从形式上来说和相应的Hoare逻辑规则等同, "
      "除了使用方括号而非花括号. 因此, "
      "显然以下是可靠 (valid) 的导出规则."
      (MB (&cm (&rule (!- (Hoare $P $C $Q))
                      (!- (THoare $P $C $Q)))
               (: "如果" $C "不含有" :WHILE "命令")))
      "{译注: 以我之见, 这与其说是导出规则, "
      "不如说是兼容规则 (admissible rule).}")
   (H3. "赋值的终止性")
   (P "注意到完全正确性的赋值公理陈述了赋值命令总是终止, "
      "这隐式地假定了表达式中的所有函数应用都会终止. "
      "如果函数可以递归定义, 那么或许并非如此. "
      "例如, 考虑赋值" (&:= :X (fact $-1))
      ", 其中" (fact :n) "被递归定义为"
      (MB (&= (fact :n)
              (IF (&= :n $0) $1
                  (&c* :n (fact (&- :n $1))))))
      "通常也假定诸如" (&/ $1 $0)
      "这样错误的表达式也不会造成任何问题. "
      "绝大多数编程语言遇到除以零时都会导致错误停下. "
      "然而, 在我们的逻辑里, 可以推出"
      (MB (!- (THoare :T (&:= :X (&/ $1 $0))
                      (&= :X (&/ $1 $0)))))
      "即赋值" (&:= :X (&/ $1 $0))
      "总是能终止于一个条件" (&= :X (&/ $1 $0))
      "成立的状态. 这假定" (&/ $1 $0)
      "指称着某个" :X "可以具有的值. "
      "存在两种可能性:"
      (Ol #:attr* '((type "i"))
          (Li (&/ $1 $0) "指称着某个数字;")
          (Li (&/ $1 $0) "指称着某种"
              (Q "错误值") "."))
      "乍看上去似乎采用ii是最为自然的选择. "
      "然而, 这会使得理解算术定律是否应该成立变得棘手. "
      "例如, " (&c* (@/ $1 $0) $0)
      "应该等于" $0 "还是某种" (Q "错误值")
      "? 如果是后者, 那么就会导致"
      (&= (&c* $n $0) $0)
      "不再是有效的算术定律了. "
      "{译注: 含义是不能用其进行项重写化简.} "
      "使用未定义或者 (and/or) 错误值"
      "或许也能让一切运转起来, "
      "只不过其带来的理论有点混乱. "
      "我们将会在这里假定算术表达式总是指称着数字, "
      "只不过在某些情形下这个数字确切是什么未加刻画. "
      "例如, 我们将会假定对于任意的" $m "和" $n
      ", " (&/ $m $n) "总会指称着某个数字, "
      "但是其唯一假定的性质为"
      (MB (&=> (&neg (@= $n $0))
               (&= (&c* (@/ $m $n) $n) $m)))
      "由此关于" (&/ $m $0) "并不能推出任何东西.")
   (P "另一种处理错误的方法在于扩展命令的语义, "
      "允许错误和状态一样作为结果. "
      "这种方法用在第7章以处理内存错误, "
      "但是类似的想法也能用来处理表达式求值错误 "
      "(尽管代价是语义更为复杂).")
   (H3. "用于完全正确性的" :WHILE "规则")
   
   (H3. "终止规约")
   (H3. "终止性的验证条件")
   (H3. "验证条件生成")
   (H2. "程序精化")
   (H3. "引论")
   (H3. "精化律")
   (H3. "一个例子")
   (H3. "一般评注")
   (H2. "指针和局部推理")
   (H3. "指针操纵构造")
   (H3. "例子: 反转链表")
   (H3. "分离逻辑断言")
   (H4. "指向关系: " (pointsTo $E $F))
   (H3. "语义和分离逻辑")
   ))