#lang racket
(provide div:hoffman_ch7)
(require SMathML "linear_algebra_utils.rkt")
(define div:hoffman_ch7
  (TmDiv
   (H2 "第7章 有理形式和Jordan形式")
   (H3 "第7.1节 循环子空间和零化子")
   (P "又一次, " $V "是域" $F "上的一个有限维向量空间, 而" $T "是" $V "上一个固定的 (但也是任意的) "
      "线性算子. 如果" $alpha "是" $V "的任意一个向量, 那么存在一个最小的包含" $alpha "且在" $T
      "下不变的" $V "的子空间. 这个子空间可以被定义为所有包含" $alpha "的" $T "不变子空间之交. "
      "然而, 现在对我们来说按照以下方式看待它是更有优势的. 如果" $W "是任意的包含" $alpha
      "且在" $T "下不变的" $V "的子空间, 那么" $W "也必然包含向量" (ap $T $alpha)
      ". 因此, " $W "还必然包含" (&= (app $T (ap $T $alpha)) (ap $T^2 $alpha)) ", "
      (&= (app $T (ap $T^2 $alpha)) (ap $T^3 $alpha)) ", 等等. 换言之, 对于每个域" $F
      "上的多项式" $g ", 必然有" (∈ (ap (app $g $T) $alpha) $W) ". 集合"
      (setI (ap (app $g $T) $alpha) (∈ $g polyF)) "显然在" $T "下不变, 因而是包含"
      $alpha "的最小" $T "不变子空间.")
   ((definition)
    "若" (∈ $alpha $V) ", " (B "由" $alpha "生成的" $T "循环子空间") "是"
    (&= (cyc $alpha $T) (setI (ap (app $g $T) $alpha) (∈ $g polyF)))
    ". 如果" (&= (cyc $alpha $T) $V) ", 那么" $alpha "被称为" $T
    "的一个" (B "循环向量") ".")
   (P "另一种描述子空间" (cyc $alpha $T) "的方式为" (cyc $alpha $T) "是由向量"
      (&cm (ap $T^k $alpha) (&>= $k $0)) "张成的子空间, 因而" $alpha "是"
      $T "的循环向量当且仅当这些向量可以张成" $V ". 我们提醒读者, 一般的线性算子"
      $T "可能没有循环向量.")
   ((example #:n "1")
    "对于任意的" $T ", 由零向量生成的" $T "循环子空间是零子空间. 空间"
    (cyc $alpha $T) "是一维的当且仅当" $alpha "是" $T "的特征向量. [译注: "
    "尽管在上一章定义特征向量时没有排除零向量, 但是从现在开始本书所称特征向量"
    "均不包括零向量, 这也与其他文本保持一致.] 对于恒等算子而言, 每个非零向量"
    "都生成了一维的循环子空间. 因此, 若" (&> (&dim $V) $1) ", 恒等算子没有循环向量. "
    "一个具有循环向量的线性算子的例子是" $F^2 "上在标准有序基下由矩阵"
    (MB (Mat (0 0) (1 0)))
    "表示的线性算子" $T ". 这里的一个循环向量是" $epsilon_1 ", 因为若"
    (&= $beta (tu0 $a $b)) ", 以" (&= $g (&+ $a (&i* $b $x))) "我们有"
    (&= $beta (ap (app $g $T) $epsilon_1)) ". 对于相同的算子" $T
    ", 由" $epsilon_2 "生成的循环子空间是一维的, 因为" $epsilon_2
    "是" $T "的特征向量.")
   (P "对于任意的" $T "和" $alpha ", 我们所感兴趣的是向量" (ap $T^j $alpha)
      "之间的线性关系"
      (MB (&= (LC0 $c_0 $alpha $c_1 (ap $T $alpha) $c_k (ap $T^k $alpha)) $0))
      "即我们所感兴趣的是具有性质" (&= (ap (app $g $T) $alpha) $0) "的多项式"
      (&= $g (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_k $x^k))) ". 集合"
      (setI (∈ $g polyF) (&= (ap (app $g $T) $alpha) $0)) "显然是" polyF
      "中的一个理想. 并且, 它也是一个非零理想, 因为它包含" $T "的极小多项式.")
   ((definition)
    "如果" (∈ $alpha $V) ", " $alpha "的" $T "零化子是" polyF "中的理想"
    (&= (ann $alpha $T) (setI (∈ $g polyF) (&= (ap (app $g $T) $alpha) $0)))
    ", 其唯一的首项系数为一的生成元" $p_alpha "也被称为" $alpha "的"
    $T "零化子. [译注: 这个定义在第6.4节{不变子空间}已经给出过了.]")
   (P "正如我们所指出的, " $T "零化子" $p_alpha "整除算子" $T
      "的极小多项式. 读者也应该注意到除非" $alpha "是零向量, "
      (&> (&deg $p_alpha) $0) ".")
   ((theorem #:n "1")
    "令" $alpha "是" $V "中的非零向量, " $p_alpha "是" $alpha "的" $T "零化子."
    (Ol #:attr* '((type "i"))
        (Li $p_alpha "的次数等于循环子空间" (cyc $alpha $T) "的维数.")
        (Li "如果" $p_alpha "的次数为" $k ", 那么向量"
            (&cm $alpha (ap $T $alpha) (ap $T^2 $alpha) $..h (ap (^ $T (&- $k $1)) $alpha))
            "构成了" (cyc $alpha $T) "的一个基.")
        (Li "如果" $U "是由" $T "于" (cyc $alpha $T) "上的限制导出的线性算子, 那么"
            $U "的极小多项式为" $p_alpha ".")))
   ((proof)
    "令" $g "是域" $F "上任意的多项式, 作带余除法"
    (MB (&= $g (&+ (&i* $p_alpha $q) $r)))
    "其中" (&= $r $0) "或" (&< (&deg $r) (&= (&deg $p_alpha) $k))
    ". 鉴于" (∈ (&i* $p_alpha $q) (ann $alpha $T)) ", 于是"
    (MB (&= (ap (app $g $T) $alpha) (ap (app $r $T) $alpha)) ".")
    "既然" (&= $r $0) "或" (&< (&deg $r) $k) ", 向量" (ap (app $r $T) $alpha)
    "是向量" (&cm $alpha (ap $T $alpha) $..h (ap (^ $T (&- $k $1)) $alpha))
    "的线性组合. 换言之, 这" $k "个向量可以张成" (cyc $alpha $T)
    ". 它们当然也是线性无关的, 因为若这些向量之间存在非平凡的线性关系, "
    "那么其可以导出一个非零的多项式" $g "满足"
    (&= (ap (app $g $T) $alpha) $0) "且" (&< (&deg $g) (&deg $p_alpha))
    ", 但这是不可能的. 现在我们已经证明了i和ii." (Br)
    "令" $U "是" $T "于" (cyc $alpha $T) "的限制. 如果" (∈ $g polyF) ", 那么"
    (eqnderiv (ap (app $p_alpha $U) (ap (app $g $T) $alpha))
              (ap (app $p_alpha $T) (ap (app $g $T) $alpha))
              (ap (app $g $T) (ap (app $p_alpha $T) $alpha))
              (ap (app $g $T) $0)
              $0)
    "因此, 算子" (app $p_alpha $U) "将每个" (cyc $alpha $T) "的向量都送至" $0
    ", 即" (cyc $alpha $T) "上的零算子. 并且, 如果" $h "是一个次数小于" $k
    "的多项式, 那么我们不可能有" (&= (app $h $U) $0) ", 不然的话"
    (&= (ap (app $h $U) $alpha) (ap (app $h $T) $alpha) $0)
    ", 但这与" $p_alpha "的定义矛盾. [译注: 此即若" $h "零化" $U ", 则" $p_alpha
    "整除" $h ". 换句话说, 就是" $p_alpha "的确生成了零化" $U "的理想.] 这表明"
    $p_alpha "是" $U "的极小多项式.")
   ((tcomment)
    "实际上, 定理1对于" (&= $alpha $0) "也成立, 此时" (&= $p_alpha $1) ", "
    (&= (&deg $p_alpha) $0) ", " (&= (cyc $alpha $T) (setE $0))
    ", " (&= (&dim (cyc $alpha $T)) $0) ", " $empty "是" (cyc $alpha $T)
    "的基, " (cyc $alpha $T) "上导出的算子即零向量空间上的平凡线性算子, "
    "其零化多项式构成的理想就是整个" polyF ", 所以极小多项式是" $1
    ", 也就是" $p_alpha ".")
   (P "该定理的一个特别推论如下: 如果" $alpha "碰巧是" $T "的一个循环向量, 那么"
      $T "的极小多项式的次数必然等于空间" $V "的维数. 因此, Cayley-Hamilton定理"
      "告诉我们" $T "的极小多项式就是" $T "的特征多项式. 之后我们将证明对于任意的"
      $T ", 存在向量" (∈ $alpha $V) "使得其" $T "零化子是" $T
      "的极小多项式. 然后, 这可以推出" $T "具有循环向量当且仅当" $T
      "的极小多项式和特征多项式是相同的. 但是, 还需要一些工作我们才能抵达这一步.")
   (P "我们的计划是利用具有循环向量的算子研究一般的" $T ". 因此, 让我们检视" $k
      "维空间" $W "上的一个具有循环向量" $alpha "的算子" $U ". 根据定理1, 向量"
      (&cm $alpha $..h (ap (^ $U (&- $k $1)) $alpha)) "构成了空间" $W
      "的一个基, 并且" $alpha "的零化子" $p_alpha "是" $U
      "的极小多项式 (因而也是" $U "的特征多项式). 如果我们令"
      (&cm (&= $alpha_i (ap (^ $U (&- $i $1)) $alpha)) (&= $i (&cm $1 $..h $k)))
      ", 那么" $U "于有序基" (&= $BBB (setE $alpha_1 $..h $alpha_k)) "上的作用为"
      (MB (set-attr*
           (&Table
            ((&cm (&= (ap $U $alpha_i) (_ $alpha (&+ $i $1)))
                  (&= $i (&cm $1 $..h (&- $k $1)))))
            ((&= (ap $U $alpha_k)
                 (&- (&- (&i* $c_0 $alpha_1)) (&i* $c_1 $alpha_2) $..c
                     (&i* (_ $c (&- $k $1)) $alpha_k)))))
           'columnalign "left"))
      "其中"
      (&= $p_alpha (&+ $c_0 (&i* $c_1 $x) $..c
                       (&i* (_ $c (&- $k $1)) (^ $x (&- $k $1)))
                       $x^k))
      ". " (ap $U $alpha_k) "的表达式是由" (&= (ap (app $p_alpha $U) $alpha) $0)
      "的事实推得的, 即"
      (MB (&= (&+ (ap $U^k $alpha)
                  (&i* (_ $c (&- $k $1)) (ap (^ $U (&- $k $1)) $alpha))
                  $..c (&i* $c_1 (ap $U $alpha)) (&i* $c_0 $alpha)) $0) ".")
      "这表明" $U "在有序基" $BBB "下的矩阵为"
      (MB (Mat (0 0 0 $..c 0 (&- $c_0))
               (1 0 0 $..c 0 (&- $c_1))
               (0 1 0 $..c 0 (&- $c_2))
               ($..v $..v $..v $ $..v $..v)
               (0 0 0 $..c 1 (&- (_ $c (&- $k $1))))) ".")
      "这个矩阵被称为首项系数为一的多项式" $p_alpha "的同伴矩阵 (companion matrix). "
      "[译注: 读者应该将同伴矩阵的概念视为多项式上的一个映射.]")
   ((theorem #:n "2")
    "如果" $U "是有限维向量空间" $W "上的一个线性算子, 那么" $U
    "拥有循环向量当且仅当存在" $W "的一个有序基使得" $U
    "在其下以" $U "的极小多项式的同伴矩阵表示.")
   ((proof)
    "我们刚才已经观察到若" $U "拥有循环向量, 那么的确存在这样一个基. "
    "反过来说, 如果我们有" $W "的一个有序基" (setE $alpha_1 $..h $alpha_k)
    "使得" $U "在其下由" $U "的极小多项式的同伴矩阵表示, 那么显然" $alpha_1
    "是" $U "的一个循环向量.")
   ((corollary)
    "如果" $A "是一个首项系数为一的多项式" $p "的同伴矩阵, 那么" $p
    "既是" $A "的极小多项式, 也是" $A "的特征多项式.")
   ((proof)
    "一种方法是令" $U "为" $F^k "上在标准有序基下由" $A "表示的线性算子, "
    "然后应用定理1和Cayley-Hamilton定理. 另一种方法是使用定理1看出" $p
    "是" $A "的极小多项式, 并通过直接的计算验证" $p "是" $A "的特征多项式.")
   ((tcomment)
    "证明的要点在于意识到" $epsilon_1 "的" $U "零化子" (_ $p $epsilon_1)
    " (根据定理1, 其等于" $A "的极小多项式) 何以等于" $p
    ". 答案是, 根据直接的计算, 可以知道" (&= (ap (app $p $U) $epsilon_1) $0)
    ", 因而" (_ $p $epsilon_1) "整除" $p ", 但是它们次数相等且首项系数都为一, "
    "所以" (&= $p (_ $p $epsilon_1)) ".")
   (P "以下是本节最后的注记. 如果" $T "是空间" $V "上任意的线性算子, "
      $alpha "是" $V "中任意的向量, 那么" $T "于循环子空间" (cyc $alpha $T)
      "上的限制算子" $U "具有一个循环向量, 即" $alpha ". 因此, " (cyc $alpha $T)
      "拥有一个有序基, " $U "在其下以" $p_alpha "的同伴矩阵表示, " $p_alpha
      "即" $alpha "的" $T "零化子. [译注: 当然, " $p_alpha
      "也是" $U "的极小多项式.]")
   ((exercise #:n "1")
    "令" $T "是" $F^2 "上的一个线性算子. 证明对于向量" $alpha ", 若" $alpha
    "非零且" $alpha "不是" $T "的特征向量, 那么" $alpha "是" $T
    "的一个循环向量. 据此, 证明要么" $T "拥有循环向量, 要么" $T
    "是恒等算子的标量倍数.")
   ((exercise #:n "2")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (2 0 0) (0 2 0) (0 0 -1)))
    "表示. 证明" $T "没有循环向量. 由向量" (tu0 1 -1 3) "生成的"
    $T "循环子空间是什么?")
   ((exercise #:n "3")
    "令" $T "是" $CC^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (1 $i 0) (-1 2 (&- $i)) (0 1 1)))
    "表示. 找出向量" (tu0 1 0 0) "的" $T "零化子. 找出"
    (tu0 1 0 $i) "的" $T "零化子.")
   ((exercise #:n "4")
    "证明如果" $T^2 "拥有循环向量, 那么" $T "拥有循环向量. 反过来正确吗?")
   ((exercise #:n "5")
    "令" $V "是域" $F "上的一个" $n "维向量空间, " $N "是" $V
    "上的一个幂零线性算子. 设" (&!= (^ $N $n-1) $0) ", 令"
    (∈ $alpha $V) "是满足" (&!= (ap (^ $N $n-1) $alpha) $0)
    "的一个向量. 证明" $alpha "是" $N "的一个循环向量. " $N "在有序基"
    (setE $alpha (ap $N $alpha) $..h (ap (^ $N $n-1) $alpha))
    "的矩阵是什么?")
   ((exercise #:n "6")
    "给出以下事实的一个直接证明. 如果" $A "是首项系数为一的多项式"
    $p "的同伴矩阵, 那么" $p "是" $A "的特征多项式.")
   ((exercise #:n "7")
    "令" $V "是一个" $n "维向量空间, " $T "是" $V "上的一个线性算子. 设"
    $T "是可对角化的."
    (Ol #:attr* '((type "a"))
        (Li "如果" $T "拥有循环向量, 证明" $T "拥有" $n "个不同的特征值.")
        (Li "如果" $T "拥有" $n "个不同的特征值, 并且" (setE $alpha_1 $..h $alpha_k)
            "是由" $T "的特征向量构成的一个基, 证明"
            (&= $alpha (&+ $alpha_1 $..c $alpha_k))
            "是" $T "的一个循环向量.")))
   ((exercise #:n "8")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 设" $T "拥有循环向量. 证明如果"
    $U "是任意与" $T "交换的线性算子, 那么" $U "是应用某个多项式于" $T "的结果.")
   (H3 "第7.2节 循环分解和有理形式")
   (P "本节的主要目的在于证明如果" $T "是有限维向量空间" $V "上任意的线性算子, "
      "那么存在向量" (∈ $alpha_1 $..h $alpha_r $V) "满足"
      (MB (&= $V (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))) ".")
      "换言之, 我们希望证明" $V "是一个" $T "循环子空间的直和. 这将表明" $T
      "是有限数目的线性算子的直和, 其中每个都拥有循环向量. 其效用在于将关于"
      "一般线性算子的诸多问题规约为关于拥有循环向量的算子的类似问题. 我们将证明的"
      "定理3是线性代数中最为深刻的结果之一, 并且拥有许多有趣的推论.")
   (P "循环分解定理与以下问题紧密关联. 对于什么样的" $T "不变子空间" $W
      "而言, 存在另一个" $T "不变子空间" $W^ "满足" (&= $V (&d+ $W $W^))
      ". 如果" $W "是有限维向量空间" $V "的任意一个子空间, 那么存在一个子空间"
      $W^ "满足" (&= $V (&d+ $W $W^)) ". 通常来说存在许多这样的子空间" $W^
      ", 其中每个都被称为与" $W^ (B "互补") ". 我们问的是何时一个" $T
      "不变子空间拥有一个与之互补的" $T "不变子空间.")
   (P "让我们设" (&= $V (&d+ $W $W^)) ", 其中" $W "和" $W^ "都在" $T
      "下不变, 然后看看我们可以发现什么关于子空间" $W "的性质. 每个向量"
      (∈ $beta $V) "都具有" (&= $beta (&+ $gamma $gamma^))
      "的形式, 其中" (∈ $gamma $W) "而" (∈ $gamma^ $W^) ". 如果" $f
      "是标量域上任意的多项式, 那么"
      (let ((fT (app $f $T)))
        (MB (&= (ap fT $beta) (&+ (ap fT $gamma) (ap fT $gamma^))) "."))
      "既然" $W "和" $W^ "都是" $T "不变的, 向量"
      (∈ (ap (app $f $T) $gamma) $W) "且" (∈ (ap (app $f $T) $gamma^) $W^)
      ". 因此, " (∈ (ap (app $f $T) $beta) $W) "当且仅当"
      (&= (ap (app $f $T) $gamma^) $0) ". 我们所感兴趣的正是这看似单纯的事实, 即如果"
      (∈ (ap (app $f $T) $beta) $W) ", 那么"
      (&= (ap (app $f $T) $beta) (ap (app $f $T) $gamma)) ".")
   ((definition)
    "令" $T "是向量空间" $V "上的线性算子, " $W "是" $V "的一个子空间. 我们称"
    $W "是" $T "可容许的 (" $T "-admissible), 如果"
    (Ol #:attr* '((type "i"))
        (Li $W "在" $T "下不变;")
        (Li "若" (∈ (ap (app $f $T) $beta) $W) ", 则存在向量" (∈ $gamma $W)
            "满足" (&= (ap (app $f $T) $beta) (ap (app $f $T) $gamma)) "."))
    "[译注: admissible暂无通行翻译, 译者将其定为&quot;可容许的&quot;.]")
   (P "刚才我们已经表明了, 如果" $W "是不变的且有一个互补的不变子空间, 那么"
      $W "是可容许的. 定理3的一个推论是其逆, 于是可容许性刻画了那些"
      "拥有互补不变子空间的不变子空间.")
   (P "让我们指出在获得分解"
      (MB (&= $V (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))))
      "的尝试里可容许性质的概念是如何牵涉其中的. 我们抵达这样一种分解的基本方法是归纳地挑选向量"
      (&cm $alpha_1 $..h $alpha_r) ". 设根据某种过程我们已经挑选了向量"
      (&cm $alpha_1 $..h $alpha_j) ", 并且子空间"
      (MB (&= $W_j (&+ (cyc $alpha_1 $T) $..c (cyc $alpha_j $T))))
      "是真子空间. 我们想要找到一个非零向量" (_ $alpha (&+ $j $1)) "满足"
      (MB (&= (&cap $W_j (cyc (_ $alpha (&+ $j $1)) $T)) (setE $0)))
      "因为这样的话子空间"
      (&= (_ $W (&+ $j $1)) (&d+ $W_j (cyc (_ $alpha (&+ $j $1)) $T)))
      "就离穷尽" $V "更进至少一维. 但是, 这样的" (_ $alpha (&+ $j $1))
      "何以存在呢? 如果" (&cm $alpha_1 $..h $alpha_j) "的挑选使得" $W_j
      "是一个" $T "可容许子空间, 那么很容易看出来我们可以找到一个合适的"
      (_ $alpha (&+ $j $1)) ". 这是使得我们对于定理3的证明成立之所在, "
      "即便这并非我们组织论证的方式.")
   (P "令" $W "是一个" $T "不变的真子空间. 让我们试着寻找一个非零的向量" $alpha "满足"
      (MB (&= (&cap $W (cyc $alpha $T)) (setE $0)) ".")
      "我们可以选择某个向量" (&!in $beta $W) ", 考虑" $T "导子" (conduct $beta $W)
      ", 其由所有满足" (∈ (ap (app $g $T) $beta) $W) "的多项式" $g
      "构成. 回忆一下, 生成理想" (conduct $beta $W) "的唯一的首项系数为一的多项式"
      (&= $f (pconduct $beta $W)) "也被称为从" $beta "到" $W
      "的" $T "导子. 向量" (ap (app $f $T) $beta) "在" $W "之中. 现在, 如果"
      $W "是" $T "可容许的, 那么存在" (∈ $gamma $W) "满足"
      (&= (ap (app $f $T) $beta) (ap (app $f $T) $gamma))
      ". 令" (&= $alpha (&- $beta $gamma)) ", " $g "是任意的多项式. 既然"
      (∈ (@- $beta $alpha) $W) ", " (∈ (ap (app $g $T) $beta) $W)
      "当且仅当" (∈ (ap (app $g $T) $alpha) $W) ". 换言之, "
      (&= (conduct $alpha $W) (conduct $beta $W)) ". 因此, 多项式" $f
      "也是从" $alpha "到" $W "的" $T "导子. 但是" (&= (ap (app $f $T) $alpha) $0)
      ", 这告诉我们" (∈ (ap (app $g $T) $alpha) $W) "当且仅当"
      (&= (ap (app $g $T) $alpha) $0) ", 即子空间" (cyc $alpha $T) "和"
      $W "是线性无关的, 并且" $f "是" $alpha "的" $T "零化子.")
   ((theorem #:n "3. 循环分解定理")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $W_0 "是一个" $T
    "可容许的" $V "的真子空间, 存在非零向量" (∈ $alpha_1 $..h $alpha_r $V) "满足"
    (Ol #:attr* '((type "i"))
        (Li (&= $V (&d+ $W_0 (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))) ";")
        (Li $p_k "整除" (_ $p (&- $k $1)) ", 其中" (&= $k (&cm $2 $..h $r))
            "而" $p_i "是" $alpha_i "的" $T "零化子."))
    "而且, 整数" $r "和零化子" (&cm $p_1 $..h $p_r) "由i, ii以及"
    (&!= $alpha_i $0) "的事实唯一确定.")
   ((proof)
    "证明相当冗长, 故我们将其分为四个步骤. 似乎初读证明时取" (&= $W_0 (setE $0))
    "会比较容易, 尽管这并不会带来任何实质性的简化. 贯穿整个证明, 我们都将"
    (ap (app $f $T) $beta) "缩略为" (ap $f $beta) "."
    (P (Em "第1步. ") "存在非零向量" (∈ $beta_1 $..h $beta_r $V) "满足"
       (Ol #:attr* '((type "a"))
           (Li (&= $V (&+ $W_0 (cyc $beta_1 $T) $..c (cyc $beta_r $T))) ";")
           (Li "如果" (&<= $1 $k $r) "并且"
               (MB (&= $W_k (&+ $W_0 (cyc $beta_1 $T) $..c (cyc $beta_k $T))))
               "那么导子" (&= $p_k (pconduct $beta_k (_ $W (&- $k $1))))
               "在所有到子空间" (_ $W (&- $k $1)) "的" $T
               "导子中拥有最大的次数, 即对于每个" $k "有"
               (MB (&= (&deg $p_k)
                       (maxi (∈ $alpha $V)
                             (&deg (pconduct $alpha (_ $W (&- $k $1)))))) ".")))
       "这一步只依赖于" $W_0 "是不变子空间的事实. 如果" $W "是一个" $T
       "不变的真子空间, 那么"
       (MB (&<= (&< $0 (maxi (∈ $alpha $V) (&deg (pconduct $alpha $W)))) (&dim $V)))
       "我们可以选择一个向量" $beta "使得" (&deg (pconduct $beta $W))
       "取得最大值, 然后子空间" (&+ $W (cyc $beta $T)) "是" $T "不变的且维数大于"
       (&dim $W) ". [译注: Cayley-Hamilton定理告诉我们特征多项式是一个零化多项式, "
       "于是" (pconduct $alpha $W) "整除特征多项式, 因而有"
       (&<= (&deg (pconduct $alpha $W)) (&dim $V)) ", 那么我们可以明白最大值是良定的"
       "且" (&<= (maxi (∈ $alpha $V) (&deg (pconduct $alpha $W))) (&dim $V))
       ". 考虑到" $W "是真子空间, 若" (&!in $alpha $W) ", 那么"
       (&> (&deg (pconduct $alpha $W)) $0) ", 由此可知"
       (&> (maxi (∈ $alpha $V) (&deg (pconduct $alpha $W))) $0)
       ". 文中" $beta "的选择必然满足" (&!in $beta $W) ", 因为否则的话" $T
       "导子的次数为零. 那么, 子空间" (&+ $W (cyc $beta $T)) "的维数的确严格大于"
       $W "的维数. 当然, 其在" $T "下不变是显然的.] 应用此过程于" (&= $W $W_0)
       "可以得到" $beta_1 ". 若" (&= $W_1 (&+ $W_0 (cyc $beta_1 $T)))
       "仍然是真子空间, 那么就再次应用该过程于" $W_1 "以得到" $beta_2
       ". 将过程继续施行下去, 鉴于" (&> (&dim $W_k) (&dim (_ $W (&- $k $1))))
       ", 我们必然可以在不超过" (&dim $V) "步的情况下抵达" (&= $W_r $V) ".")
    (P (Em "第2步. ") "令" (&cm $beta_1 $..h $beta_r) "是满足第1步的条件a和b"
       "的非零向量. 固定" $k ", 其中" (&<= $1 $k $r) ". 令" $beta "是" $V
       "中任意的向量, " (&= $f (pconduct $beta (_ $W (&- $k $1)))) ". 如果"
       (MB (&cm (&= (ap $f $beta)
                    (&+ $beta_0 (sum (&= $i $1) (&- $k $1)
                                     (ap $g_i $beta_i))))
                (∈ $beta_i $W_i)))
       "那么" $f "整除每个多项式" $g_i "并且存在" (∈ $gamma_0 $W_0) "满足"
       (&= $beta_0 (ap $f $gamma_0)) ". [译注: " (∈ $beta_i $W_i)
       "只是约束了" (∈ $beta_0 $W_0) ", 其余则是已知的.]" (Br)
       "如果" (&= $k $1) ", 此即陈述" $W_0 "是" $T "可容许的这个条件. 为了在"
       (&> $k $1) "的情形下证明断言, 应用带余除法:"
       (MB (&cm (&= $g_i (&+ (&i* $f $h_i) $r_i))
                (: (&= $r_i $0) "或者" (&< (&deg $r_i) (&deg $f)))) ".")
       "我们想要证明的是对于每个" $i "有" (&= $r_i $0) ". 令"
       (MB (&= $gamma (&- $beta (sum (&= $i $1) (&- $k $1) (ap $h_i $beta_i)))))
       "既然" (∈ (&- $gamma $beta) (_ $W (&- $k $1))) ", 我们有"
       (MB (&= (pconduct $gamma (_ $W (&- $k $1)))
               (pconduct $beta (_ $W (&- $k $1))) $f))
       "而且"
       (MB (&= (ap $f $gamma)
               (&+ $beta_0 (sum (&= $i $1) (&- $k $1)
                                (ap $r_i $beta_i)))) ".")
       "设某个" $r_i "异于" $0 ", 我们可以推导出矛盾来. 令"
       (&= $j (maxi (setI (∈ $i (setE $1 $..h (&- $k $1))) (&!= $r_i $0))))
       ", 那么"
       (MB (&cm (&= (ap $f $gamma)
                    (&+ $beta_0 (sum (&= $i $1) $j (ap $r_i $beta_i))))
                (: (&!= $r_j $0) "且"
                   (&< (&deg $r_j) (&deg $f)))) ".")
       "令" (&= $p (pconduct $gamma (_ $W (&- $j $1))))
       ", 既然" (&sube (_ $W (&- $j $1)) (_ $W (&- $k $1)))
       ", 导子" (&= $f (pconduct $gamma (_ $W (&- $k $1))))
       "必然整除" $p ":"
       (MB "存在多项式" $g ",&nbsp;" (&= $p (&i* $f $g)) ".")
       "应用" (app $g $T) "于前式两边, 可以得到:"
       (MB (&= (ap $p $gamma)
               (ap (&i* $g $f) $gamma)
               (&+ (ap (&i* $g $r_j) $beta_j)
                   (ap $g $beta_0)
                   (sum (&= $i $1) (&- $j $1)
                        (ap (&i* $g $r_i) $beta_i)))) ".")
       "根据" $p "的定义, " (∈ (ap $p $gamma) (_ $W (&- $j $1)))
       ", 而且上式最右边两项之和也在" (_ $W (&- $j $1))
       "之中, 所以" (∈ (ap (&i* $g $r_j) $beta_j) (_ $W (&- $j $1)))
       ". 现在我们使用第1步的条件b:"
       (MB (deriv0 (&deg (@i* $g $r_j)) $>=
                   (&deg (pconduct $beta_j (_ $W (&- $j $1)))) $=
                   (&deg $p_j) $>=
                   (&deg (pconduct $gamma (_ $W (&- $j $1)))) $=
                   (&deg $p) $=
                   (&deg (@i* $f $g))))
       "因此, " (&>= (&deg $r_j) (&deg $f))
       ", 但这与" $j "的选择相矛盾. 现在我们知道" $f "整除每个"
       $g_i ", 于是" (&= $beta_0 (ap $f $gamma)) ". 既然" $W
       "是" $T "可容许的, 存在" (∈ $gamma_0 $W_0) "使得"
       (&= $beta_0 (ap $f $gamma_0)) ". 顺带值得一提的是, 第2步是断言"
       (&cm $W_1 $W_2 $..h $W_r) "具有" $T "可容许性的一种增强形式.")
    (P (Em "第3步. ") "存在非零向量" (∈ $alpha_1 $..h $alpha_r $V)
       "满足定理3的条件i和ii." (Br)
       "我们自第1步的向量" (&cm $beta_1 $..h $beta_r) "始. 固定" $k
       ", 其中" (&<= $1 $k $r) ". 我们将第2步应用于" (&= $beta $beta_k)
       ", 那么" $T "导子" (&= $f $p_k) ", 于是可以得到"
       (MB (&= (ap $p_k $beta_k)
               (&+ (&i* $p_k $gamma_0)
                   (sum (&= $i $1) (&- $k $1)
                        (ap (&i* $p_k $h_i) $beta_i)))))
       "其中" (∈ $gamma_0 $W_0) "而" (&cm $h_1 $..h (_ $h (&- $k $1)))
       "是多项式. 令"
       (MB (&= $alpha_k (&- $beta_k $gamma_0
                            (sum (&= $i $1) (&- $k $1)
                                 (ap $h_i $beta_i)))))
       "鉴于" (∈ (&- $beta_k $alpha_k) (_ $W (&- $k $1))) ", 我们知道"
       (MB (&= (pconduct $alpha_k (_ $W (&- $k $1)))
               (pconduct $beta_k (_ $W (&- $k $1))) $p_k))
       "既然" (&= (ap $p_k $alpha_k) $0) ", 可以得到"
       (MB (&= (&cap (_ $W (&- $k $1)) (cyc $alpha_k $T)) (setE $0)) ".")
       "因为每个" $alpha_k "都满足以上两式, 所以"
       (MB (&= $W_k (&d+ $W_0 (cyc $alpha_1 $T) $..c (cyc $alpha_k $T))))
       "并且" $p_k "是" $alpha_k "的" $T "零化子. [译注: 读者需要注意到因为"
       (∈ (&- $beta_k $alpha_k) (_ $W (&- $k $1))) ", 所以"
       (&= (&+ (_ $W (&- $k $1)) (cyc $alpha_k $T))
           (&+ (_ $W (&- $k $1)) (cyc $beta_k $T)))
       ".] 换言之, 向量" (&cm $alpha_1 $..h $alpha_r)
       "和向量" (&cm $beta_1 $..h $beta_r) "定义了相同的子空间序列"
       (&cm $W_1 $W_2 $..h) "并且" $T "导子" (&= $p_k (pconduct $alpha_k (_ $W (&- $k $1))))
       "自然也满足最大性质, 即第1步的条件b. 其还具有额外的性质, 就是子空间"
       (&cm $W_0 (cyc $alpha_1 $T) (cyc $alpha_2 $T) $..h)
       "是线性无关的. 由此很容易验证定理3的条件ii. 既然对于每个" $i "都有"
       (&= (ap $p_i $alpha_i) $0) ", 我们有着平凡的关系"
       (MB (&= (ap $p_k $alpha_k)
               (&+ $0 (ap $p_1 $alpha_1) $..c
                   (ap (_ $p (&- $k $1)) (_ $alpha (&- $k $1))))))
       "现在应用第2步, 将" (&cm $beta_1 $..h $beta_k) "替换为" (&cm $alpha_1 $..h $alpha_k)
       "而" (&= $beta $alpha_k) ", 那么可以得到结论: " $p_k "整除每个" $p_i
       ", 其中" (&< $i $k) ".")
    (P (Em "第4步. ") "数字" $r "和多项式" (&cm $p_1 $..h $p_k) "在定理3的条件下是唯一的." (Br)
       "设除了向量" (&cm $alpha_1 $..h $alpha_r) "之外非零向量" (&cm $gamma_1 $..h $gamma_s)
       "也满足定理3的条件, 也就是说"
       (MB (&= $V (&d+ $W_0 (cyc $gamma_1 $T) $..c (cyc $gamma_s $T))))
       "并且" $g_k "整除" (_ $g (&- $k $1)) ", 其中" (&= $k (&cm $2 $..h $s)) "而"
       $g_i "是" $gamma_i "的" $T "零化子. 我们要证明的是" (&= $r $s) "以及对于每个" $i
       "有" (&= $p_i $g_i) "." (Br)
       "很容易看出来" (&= $p_1 $g_1) ". 多项式" $g_1 "实际上由前述条件可以被确定为从" $V
       "到" $W_0 "的" $T "导子. " (conduct $V $W_0) "被定义为集合"
       (setI (∈ $f polyF) (: "对于每个" (∈ $beta $V) ",&nbsp;" (∈ (ap $f $beta) $W_0)))
       ", 其中" $F "是标量域; 换言之, 多项式" (∈ $f (conduct $V $W_0)) "当且仅当"
       (app $f $T) "的像是" $W_0 "的子集. 那么, " (conduct $V $W_0)
       "是多项式代数中的一个非零理想, 而多项式" $g_1 "是该理想的首项系数为一的生成元. "
       "以下是我们的理由. 每个" (∈ $beta $V) "都具有形式"
       (MB (&= $beta (&+ $beta_0 (ap $f_1 $gamma_1) $..c (ap $f_s $gamma_s))))
       "于是"
       (MB (&= (ap $g_1 $beta)
               (&+ (ap $g_1 $beta_0)
                   (sum (&= $i $1) $s
                        (ap (&i* $g_1 $f_i) $gamma_i)))))
       "因为每个" $g_i "都整除" $g_1 ", 所以对于每个" $i "有" (&= (ap $g_1 $gamma_i) $0)
       ", 那么" (∈ (&= (ap $g_1 $beta) (ap $g_1 $beta_0)) $W_0) ", 于是"
       (∈ $g_1 (conduct $V $W_0)) ". 既然" $g_1 "是将" $gamma_1 "送至" $W_0
       "的次数最低的首项系数为一多项式, 那么" $g_1 "当然也是理想" (conduct $V $W_0)
       "中次数最低的首项系数为一多项式. 根据同样的论证, " $p_1
       "也应该是这个理想的首项系数为一的生成元, 所以" (&= $p_1 $g_1) "." (Br)
       "如果" $f "是一个多项式, " $W "是" $V "的一个子空间, 那么缩写" (ap $f $W)
       "将表示集合" (setI (ap $f $alpha) (∈ $alpha $W)) ". 我们将以下三个事实的验证留作练习."
       (Ol (Li (&= (ap $f (cyc $alpha $T)) (cyc (ap $f $alpha) $T)) ".")
           (Li "如果" (&= $V (&d+ $V_1 $..c $V_k)) ", 其中每个" $V_i "都在" $T
               "下不变, 那么" (&= (ap $f $V) (&d+ (ap $f $V_1) $..c (ap $f $V_k))) ".")
           (Li "如果" $alpha "和" $gamma "有着相同的" $T "零化子, 那么" (ap $f $alpha)
               "和" (ap $f $gamma) "也有着相同的" $T "零化子, 因而有"
               (MB (&= (&dim (cyc (ap $f $alpha) $T)) (&dim (cyc (ap $f $gamma) $T))) ".")))
       "现在我们通过归纳来论证" (&= $r $s) "以及对于" (&= $i (&cm $2 $..h $r)) "有"
       (&= $p_i $g_i) ". 论证的手法在于以恰当的方式数维数. 我们将给出" (&>= $r $2)
       "的情况下有" (&= $p_2 $g_2) "的证明, 由此怎样进行归纳则是清晰的. 设" (&>= $r $2) ", 那么"
       (MB (&< (&+ (&dim $W_0) (&dim (cyc $alpha_1 $T))) (&dim $V)))
       "既然我们已经知道了" (&= $p_1 $g_1) ", 那么" (cyc $alpha_1 $T) "和" (cyc $gamma_1 $T)
       "有着相同的维数. 因此, 也有"
       (MB (&< (&+ (&dim $W_0) (&dim (cyc $gamma_1 $T))) (&dim $V)))
       "这说明" (&>= $s $2) ". 现在问是否有" (&= $p_2 $g_2) "是有意义的了. 从两个对于" $V
       "的分解中, 我们可以得到两种对于" (ap $p_2 $V) "的分解方式:"
       (MB (set-attr*
            (&Table
             ((ap $p_2 $V)
              $=
              (&d+ (ap $p_2 $W_0) (cyc (ap $p_2 $alpha_1) $T)))
             ((ap $p_2 $V)
              $=
              (&d+ (ap $p_2 $W_0) (cyc (ap $p_2 $gamma_1) $T) $..c
                   (cyc (ap $p_2 $gamma_s) $T))))
            'columnalign "left"))
       "这里用到了事实1和2, 以及对于" (&>= $i $2) "有" (&= (ap $p_2 $alpha_i) $0)
       ". 既然我们已经知道了" (&= $p_1 $g_1) ", 事实3告诉我们" (cyc (ap $p_2 $alpha_1) $T)
       "和" (cyc (ap $p_2 $gamma_1) $T) "有着相同的维数. 显然, 我们可以得到"
       (MB (&cm (&= (&dim (cyc (ap $p_2 $gamma_i) $T)) $0)
                (&>= $i $2)) ".")
       "于是, " (&= (ap $p_2 $gamma_2) $0) ", 那么" $g_2 "整除" $p_2
       ". 同样的论证可以反过来以得到" $p_2 "整除" $g_2 ". 因此, " (&= $p_2 $g_2) "."))
   ((corollary)
    "如果" $T "是有限维向量空间上的一个线性算子, 那么每个" $T "可容许子空间都具有"
    $T "下不变的补子空间.")
   ((proof)
    "令" $W_0 "是" $V "的一个可容许子空间. 若" (&= $W_0 $V) ", 那么我们所寻求的补就是"
    (setE $0) ". 若" $W_0 "是真子空间, 那么就应用定理3, 令"
    (MB (&= (_^ $W $0 $prime) (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))))
    "于是" (_^ $W $0 $prime) "在" $T "下不变且" (&= $V (&d+ $W_0 (_^ $W $0 $prime))) ".")
   ((corollary)
    "令" $T "是有限维向量空间" $V "上的一个线性算子."
    (Ol #:attr* '((type "a"))
        (Li "存在向量" (∈ $alpha $V) "满足" $alpha "的" $T "零化子是" $T "的极小多项式.")
        (Li $T "有循环向量当且仅当" $T "的极小多项式和特征多项式相等.")))
   ((proof)
    "如果" (&= $V (setE $0)) ", 那么结果平凡地成立. 如果" (&!= $V (setE $0)) ", 令"
    (MB (&= $V (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))))
    "而" (&cm $alpha_1 $..h $alpha_r) "的" $T "零化子" (&cm $p_1 $..h $p_r)
    "满足" (_ $p (&+ $k $1)) "整除" $p_k ", 其中" (&= $k (&cm $1 $..h (&- $r $1)))
    ". 正如我们在定理3的证明中所注意到的那样, 很容易看出" $p_1 "是" $T
    "的极小多项式, 即从" $V "到" (setE $0) "的" $T "导子. 我们已然证明了a." (Br)
    "我们在第7.1节中看到, 如果" $T "拥有循环向量, 那么" $T "的极小多项式和特征多项式恰好是"
    "相等的. 为了证明b, 还需要证明的是其逆. 应用定理a, 选择一个满足要求的" $alpha
    ". 如果极小多项式的次数等于" (&dim $V) ", 那么" (cyc $alpha $T) "的维数为" (&dim $V)
    ", 即" (&= $V (cyc $alpha $T)) ".")
   ((theorem #:n "4. 一般Cayley-Hamilton定理")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $p "和" $f "分别为" $T
    "的极小多项式和特征多项式."
    (Ol #:attr* '((type "i"))
        (Li $p "整除" $f ";")
        (Li $p "和" $f "拥有相同的素因子, 在不计重数的情况下;")
        (Li "如果"
            (MB (&= $p (&i* (_^ $f $1 $r_1) $..c (_^ $f $k $r_k))))
            "是" $p "的素因子分解, 那么"
            (MB (&= $f (&i* (_^ $f $1 $d_1) $..c (_^ $f $k $d_k))))
            "其中" $d_i "是" (app (_^ $f $i $r_i) $T) "的零化度除以" $f_i
            "的次数.")))
   ((proof)
    "我们就不考虑平凡情形" (&= $V (setE $0)) "了. 为了证明i和ii, 考虑由定理3得到的" $V
    "的一个循环分解. 正如我们在定理3的第2个推论的证明中所注意到的, " (&= $p_1 $p)
    ". 令" $U_i "是" $T "于" (cyc $alpha_i $T) "的限制, 那么" $U_i "当然有循环向量, 于是"
    $p_i "既是" $U_i "的极小多项式, 也是其特征多项式. 因此, 特征多项式" $f "是乘积"
    (&= $f (&i* $p_1 $..c $p_r)) ". 这从" $T "在适当的基下呈现的分块形式矩阵看是显然的. 此时"
    $p_1 "整除" $f "是自明的, 这就证明了i. 显然任何" $p "的素因子也是" $f
    "的素因子. 反过来, " (&= $f (&i* $p_1 $..c $p_r)) "的素因子必须整除其中一个" $p_i
    ", 于是又整除" (&= $p $p_1) "." (Br)
    "令" (&= $p (&i* (_^ $f $1 $r_1) $..c (_^ $f $k $r_k))) "是" $p
    "的素因子分解. 准素分解定理 (第6章的定理12) 告诉我们, 如果" $V_i "是"
    (app (_^ $f $i $r_i) $T) "的零空间, 那么"
    (MB (&= $V (&d+ $V_1 $..c $V_k)))
    "并且" (_^ $f $i $r_i) "是算子" $T_i "的极小多项式, 其中" $T_i "是" $T
    "于(不变)子空间" $V_i "上的限制. 将当前定理的i和ii应用于" $T_i ", 既然其是素因子"
    $f_i "之幂, 那么" $T_i "的特征多项式必然具有" (_^ $f $i $d_i) "的形式, 其中"
    (&>= $d_i $r_i) ". 显然, 我们得到了"
    (MB (&= $d_i (~ (&dim $V_i) (&deg $f_i))))
    "而且根据定义有" (&= (&dim $V_i) (&nullity (app (_^ $f $i $r_i) $T))) ", 于是"
    (MB (&= $d_i (~ (&nullity (app (_^ $f $i $r_i) $T)) (&deg $f_i))) ".")
    "既然" $T "是算子" (&cm $T_1 $..h $T_k) "的直和, 那么特征多项式" $f "是乘积"
    (MB (&= $f (&i* (_^ $f $1 $d_1) $..c (_^ $f $k $d_k))) "."))
   ((tcomment)
    "这个即是第6章所说的对于Cayley-Hamilton定理的三个证明中的最后一个. 似乎此证明"
    "所依赖的循环分解定理 (定理3) 的证明中有个估计可能需要用到Cayley-Hamilton定理, "
    "然而这并不意味着该证明存在循环论证的嫌疑, 因为那个估计实际上并不需要那么准确, "
    "以极小多项式的存在性划定一个有限的上界就够了.")
   ((corollary)
    "如果" $T "是" $n "维向量空间上的一个幂零线性算子, 那么" $T
    "的特征多项式为" $x^n ".")
   (P "现在让我们检视循环分解定理的矩阵类比. 如果我们拥有线性算子" $T
      "和定理3的直和分解, 令" $BBB_i "是" (cyc $alpha_i $T)
      "的&quot;循环有序基&quot;"
      (MB (setE $alpha_i (ap $T $alpha_i) $..h
                (ap (^ $T (&- $k_i $1)) $alpha_i)) ".")
      "这里" $k_i "表示" (cyc $alpha_i $T) "的维数, 或者说零化子" $p_i
      "的次数. 在有序基" $BBB_i "下, 导出算子" $T_i "的矩阵是多项式"
      $p_i "的同伴矩阵. 因此, 若" $BBB "是将" (&cm $BBB_1 $..h (_ $BBB $r))
      "按照顺序合并得到的" $V "的有序基, 那么" $T "在" $BBB "下的矩阵为"
      (MB (&= $A (Mat ($A_1 $0 $..c $0)
                      ($0 $A_2 $..c $0)
                      ($..v $..v $ $..v)
                      ($0 $0 $..c $A_r))))
      "其中" $A_i "是" $p_i "的同伴矩阵, 大小为" (&c* $k_i $k_i)
      ". 一个" n*n "的矩阵" $A ", 如果其为非标量首项系数为一多项式"
      (&cm $p_1 $..h $p_r) "的同伴矩阵的直和且对于" (&= $i (&cm $1 $..h (&- $r $1)))
      "有" (_ $p (&+ $i $1)) "整除" $p_i ", 那么我们称" $A
      "具有" (B "有理形式") ". 循环分解定理告诉我们了以下结果.")
   ((tcomment)
    "读者需要注意一下, 本书的有理形式在顺序上与通行定义正好相反. 也就是说, 其他材料将形如"
    (MB (&= $A (Mat ($A_r $..c $0 $0)
                    ($..v $ $..v $..v)
                    ($0 $..c $A_2 $0)
                    ($0 $..c $0 $A_1))))
    "的矩阵称为有理形式.")
   ((theorem #:n "5")
    "令" $F "是一个域, " $B "是域" $F "上的一个" n*n "矩阵, 那么" $B
    "在域" $F "上相似于唯一的有理形式矩阵.")
   ((proof)
    "令" $T "是" $F^n "上在标准有序基下由" $B "表示的线性算子. 正如我们刚才"
    "所观察到的那样, 存在" $F^n "的某个有序基使得其下的" $T "由有理形式" $A
    "表示. 那么, " $B "相似于这个矩阵" $A ". 设" $B "在" $F "上相似于另一个有理形式"
    $C ". 这就意味着存在" $F^n "的某个基使得其下的" $T "由" $C
    "表示. 如果" $C "是非标量首项系数为一多项式" (&cm $g_1 $..h $g_s)
    "的同伴矩阵的直和, 其中对于" (&= $i (&cm $1 $..h (&- $s $1))) "有"
    (_ $g (&+ $i $1)) "整除" $g_i " [译注: 以上是在复述定义], 那么我们有非零向量"
    (∈ $beta_1 $..h $beta_s $V) "以" (&cm $g_1 $..h $g_s) "为" $T "零化子满足"
    (MB (&= $V (&d+ (cyc $beta_1 $T) $..c (cyc $beta_s $T))) ".")
    "但是, 根据循环分解定理的唯一性陈述, 多项式" $g_i "和定义了矩阵" $A "的多项式"
    $p_i "应该是完全等同的, 于是" (&= $C $A) ".")
   (P "多项式" (&cm $p_1 $..h $p_r) "被称为矩阵" $B "的"(B "不变因子")
      ". 在第7.4节, 我们将描述一个计算给定矩阵的不变因子的算法. 可根据施行于矩阵"
      "的元素上的有限次有理操作计算得出这些多项式的事实赋予了有理形式其名.")
   ((example #:n "2")
    "设" $V "是域" $F "上的一个二维向量空间, " $T "是" $V "上的一个线性算子. "
    $T "的循环子空间分解的可能性是相当受限的. 这是因为如果" $T "的极小多项式的次数为"
    $2 ", 那么它等于" $T "的特征多项式, 于是" $T "拥有循环向量. 因此, 存在" $V
    "的某个有序基使得" $T "由其特征多项式的同伴矩阵表示. 另一方面, 如果" $T
    "的极小多项式的次数为" $1 ", 那么" $T "是恒等算子的标量倍数. 若" (&= $T (&i* $c $I))
    ", 那么对于任意的两个线性无关的向量" $alpha_1 "和" $alpha_2 ", 我们有"
    (MB (&cm (&= $V (&d+ (cyc $alpha_1 $T) (cyc $alpha_2 $T)))
             (&= $p_1 $p_2 (&- $x $c))) ".")
    "对于矩阵而言, 这样的分析是说每个域" $F "上的" 2*2 "矩阵都在" $F
    "上恰相似于以下两种类型的矩阵中的一种:"
    (MB (&cm (Mat ($c $0) ($0 $c)) (Mat ($0 (&- $c_0)) ($1 (&- $c_1)))) "."))
   ((example #:n "3")
    "令" $T "是" $RR^3 "上由矩阵"
    (MB (&= $A (Mat (5 -6 -6) (-1 4 2) (3 -6 -4))))
    "表示的线性算子. 我们之前已经计算过了, " $T "的特征多项式为"
    (&= $f (&i* (@- $x $1) (^ (@- $x $2) $2))) ", 极小多项式为"
    (&= $p (&i* (@- $x $1) (@- $x $2))) ". 因此, 我们知道在" $T
    "的循环分解中, 第一个向量" $alpha_1 "的" $T "零化子为" $p
    ". 既然我们是在三维空间中讨论, 那么只能再有一个向量" $alpha_2
    ". 其必然生成的是一维的循环子空间, 即其必是" $T
    "的一个特征向量. 其" $T "零化子" $p_2 "必然是" (@- $x $2)
    ", 因为" (&= (&i* $p $p_2) $f) ". 注意到这立即告诉我们" $A "相似于矩阵"
    (MB (&= $B (Mat (0 -2 0) (1 3 0) (0 0 2))))
    "即" $T "在某个有序基下由" $B "表示. 我们该如何寻找合适的向量"
    $alpha_1 "和" $alpha_2 "呢? 嗯, 我们知道任意能够生成二维" $T
    "循环子空间的向量都是合适的" $alpha_1 ", 所以先让我们试试"
    $epsilon_1 ". 我们有"
    (MB (&= (ap $T $epsilon_1) (tu0 5 -1 3)))
    "其并非" $epsilon_1 "的标量倍数, 因此" (cyc $epsilon_1 $T)
    "的维数是" $2 ". 这个空间由所有具有形式"
    (MB (&= (LC $a $epsilon_1 $b (@ap $T $epsilon_1))
            (LC $a (tu0 1 0 0) $b (tu0 5 -1 3))
            (tu0 (&+ $a (&i* $5 $b)) (&- $b) (&i* $3 $b))))
    "的向量构成, 或者说由所有满足" (&= $x_3 (&i* -3 $x_2))
    "的向量" (tu0 $x_1 $x_2 $x_3) "构成. 现在我们想要寻找的是一个满足"
    (&= (ap $T $alpha_2) (&i* $2 $alpha_2)) "且"
    (&= (&cap (cyc $alpha_2 $T) (cyc $epsilon_1 $T)) (setE $0))
    "的向量" $alpha_2 ". 既然" $alpha_2 "是" $T "的特征向量, 那么空间"
    (cyc $alpha_2 $T) "必然是由" $alpha_2 "张成的一维子空间, 于是我们的要求其实是"
    (&!in $alpha_2 (cyc $epsilon_1 $T)) ". 如果" (&= $alpha (tu0 $x_1 $x_2 $x_3))
    ", 那么很容易通过计算得知" (&= (ap $T $alpha) (&i* $2 $alpha))
    "当且仅当" (&= $x_1 (LC $2 $x_2 $2 $x_3))
    ". 因此, " (&= $alpha_2 (tu0 $2 $1 $0)) "是满足我们要求的一个向量. "
    "读者应该直接验证有序基"
    (MB (setE (tu0 $1 $0 $0) (tu0 5 -1 3) (tu0 $2 $1 $0)))
    "下" $T "的矩阵即是上面的" $B ".")
   ((example #:n "4")
    "设" $T "是" $V "上的一个可对角化算子. 将" $T "的循环分解与对角化"
    $T "的基联系起来是有趣的. 令" (&cm $c_1 $..h $c_k) "是" $T
    "不同的特征值, " $V_i "是与特征值" $c_i "关联的特征空间, 那么"
    (MB (&= $V (&d+ $V_1 $..c $V_k)))
    "并且如果" (&= $d_i (&dim $V_i)) ", 那么"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k))) "是" $T "的特征多项式. 如果"
    (∈ $alpha $V) ", 那么很容易将循环子空间" (cyc $alpha $T) "和子空间"
    (&cm $V_1 $..h $V_k) "联系起来. 首先我们知道存在唯一的向量"
    (&cm $beta_1 $..h $beta_k) "使得"
    (MB (&= $alpha (&+ $beta_1 $..c $beta_k)))
    "其中" (∈ $beta_i $V_i) ". 既然" (&= (ap $T $beta_i) (&i* $c_i $beta_i))
    ", 那么对于每个多项式" $f ", 我们有"
    (MB (&= (ap (app $f $T) $alpha)
            (LC0 (app $f $c_1) $beta_1 (app $f $c_k) $beta_k)) ".")
    "给定任意的标量" (&cm $t_1 $..h $t_k) ", 存在多项式" $f "满足"
    (&cm (&= (app $f $c_i) $t_i) (&<= $1 $i $k))
    ". 因此, " (cyc $alpha $T) "就是由向量" (&cm $beta_1 $..h $beta_k)
    "张成的子空间. " $alpha "的零化子是什么呢? 根据前面的讨论, "
    (&= (ap (app $f $T) $alpha) $0) "当且仅当"
    (&cm (&= (&i* (app $f $c_i) $beta_i) $0) (&<= $1 $i $k))
    ". 换言之, 只需要对于那些使得" (&!= $beta_i $0)
    "的" $i "有" (&= (app $f $c_i) $0) "即可推出"
    (&= (ap (app $f $T) $alpha) $0) ". 据此, " $alpha "的零化子是积"
    (MB (prod (&!= $beta_i $0) $ (@- $x $c_i)) ".")
    "现在, 令" (&= $BBB_i (setE (_^ $beta $1 $i) $..h (_^ $beta $d_i $i)))
    "是" $V_i "的一个有序基, 令"
    (MB (&= $r (maxi (&<= $1 $i $k) $d_i)) ".")
    "我们通过"
    (MB (&cm (&= $alpha_j
                 (sum (&>= $d_i $j) $
                      (_^ $beta $j $i)))
             (&<= $1 $j $r)))
    "定义向量" (&cm $alpha_1 $..h $alpha_r) ". 循环子空间"
    (cyc $alpha_j $T) "是由向量" (_^ $beta $j $i)
    "张成的子空间, 其中" $i "遍历所有满足" (&>= $d_i $j)
    "的那些指标. " $alpha_j "的" $T "零化子是"
    (MB (&= $p_j (prod (&>= $d_i $j) $ (@- $x $c_i))) ".")
    "我们有"
    (MB (&= $V (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))))
    "因为每个" (_^ $beta $j $i) "属于且仅属于子空间"
    (&cm (cyc $alpha_1 $T) $..h (cyc $alpha_r $T))
    "其中的一个并且" (&= $BBB (tu0 $BBB_1 $..h $BBB_k))
    "是" $V "的一个基. [译注: 直和的论证稍显意味不明, 但是事实"
    "本身是容易看出的.] 根据" $p_j "的公式, 也很容易看出"
    (_ $p (&+ $i $1)) "整除" $p_i ", "
    (&= $i (&cm $1 $..h (&- $r $1)))
    ". [译注: 由此看出这的确是定理3中的循环分解.]")
   ((exercise #:n "1")
    "令" $T "是" $F^2 "上在标准有序基下由矩阵"
    (MB (Mat (0 0) (1 0)))
    "表示的线性算子. 令" (&= $alpha_1 (tu0 $0 $1))
    ". 证明" (&!= $F^2 (cyc $alpha_1 $T)) "且不存在非零向量"
    (∈ $alpha_2 $F^2) "满足"
    (&= (&cap (cyc $alpha_2 $T) (cyc $alpha_1 $T)) (setE $0)) ".")
   ((exercise #:n "2")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, "
    $R "是" $T "的像."
    (Ol #:attr* '((type "a"))
        (Li "证明" $R "拥有一个与之互补的" $T "不变子空间当且仅当"
            $R "与" $T "的零空间" $N "线性无关.")
        (Li "如果" $R "和" $N "线性无关, 证明" $N
            "是唯一的与" $R "互补的" $T "不变子空间.")))
   ((exercise #:n "3")
    "令" $T "是" $RR^3 "上在标准有序基下由矩阵"
    (MB (Mat (2 0 0) (1 2 0) (0 0 3)))
    "表示的线性算子. 令" $W "是" (&- $T (&i* $2 $I))
    "的零空间. 证明" $W "没有与之互补的" $T
    "不变子空间. (提示: 令" (&= $beta $epsilon_1)
    ", 观察到" (∈ (ap (@- $T (&i* $2 $I)) $beta) $W)
    ", 证明不存在" (∈ $alpha $W) "使得"
    (let ((T-2I (@- $T (&i* $2 $I))))
      (&= (ap T-2I $beta) (ap T-2I $alpha)))
    ".) [译注: " $W "存在" $T "不变的补子空间当且仅当" $W
    "是" $T "可容许的.]")
   ((exercise #:n "4")
    "令" $T "是" $F^4 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat ($c 0 0 0)
             (1 $c 0 0)
             (0 1 $c 0)
             (0 0 1 $c)))
    "表示. 令" $W "是" (&- $T (&i* $c $I)) "的零空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W "是由" $epsilon_4 "张成的子空间.")
        (Li "找出理想"
            (&cm (conduct $epsilon_4 $T)
                 (conduct $epsilon_3 $T)
                 (conduct $epsilon_2 $T)
                 (conduct $epsilon_1 $T))
            "的首项系数为一的生成元.")))
   ((exercise #:n "5")
    "令" $T "是域" $F "上的向量空间" $V "上的一个线性算子. 如果" $f
    "是域" $F "上的一个多项式而" (∈ $alpha $V) ", 令"
    (&= (ap $f $alpha) (ap (app $f $T) $alpha)) ". 如果"
    (&cm $V_1 $..h $V_k) "是" $T "不变子空间而"
    (&= $V (&d+ $V_1 $..c $V_k)) ", 证明"
    (MB (&= (ap $f $V) (&..d+ (ap $f $V_1) (ap $f $V_k))) ".")
    "[译注: 这个是定理3的证明中留给读者补充证明的引理.]")
   ((exercise #:n "6")
    "令" $T "是域" $F "上的向量空间" $V "上的一个线性算子. 如果向量"
    (∈ $alpha $beta $V) "有着相同的" $T "零化子, 证明对于任意的多项式"
    $f ", " (ap $f $alpha) "和" (ap $f $beta) "也有着相同的" $T
    "零化子. [译注: 这个亦是定理3的证明中留给读者补充证明的引理.]")
   ((exercise #:n "7")
    "找出以下每个实矩阵的极小多项式和有理形式."
    (MB (&cm (Mat (0 -1 -1)
                  (1 0 0)
                  (-1 0 0))
             (Mat ($c 0 -1)
                  (0 $c 1)
                  (-1 1 $c))
             (Mat ((&cos $theta) (&sin $theta))
                  ((&- (&sin $theta)) (&cos $theta))))))
   ((exercise #:n "8")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (3 -4 -4) (-1 3 2) (2 -4 -3)))
    "表示. 找出满足定理3条件的非零向量" (&cm $alpha_1 $..h $alpha_r) ".")
   ((exercise #:n "9")
    "令" $A "是实矩阵"
    (MB (&= $A (Mat (1 3 3) (3 1 3) (-3 -3 -5))) ".")
    "找出一个" (&c* $3 $3) "的可逆实矩阵" $P "使得"
    (sim $A) "是有理形式.")
   ((exercise #:n "10")
    "令" $F "是复数域的一个子域, " $T "是" $F^4
    "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (2 0 0 0) (1 2 0 0) (0 $a 2 0) (0 0 $b 2)))
    "表示. 找出" $T "的特征多项式. 考虑"
    (&= $a $b $1) "; " (&= $a $b $0) "; " (&cm (&= $a $0) (&= $b $1))
    "的情形. 在这三种情形下, 找出" $T "的极小多项式以及满足定理3条件的非零向量"
    (&cm $alpha_1 $..h $alpha_r) ".")
   ((exercise #:n "11")
    "证明如果" $A "和" $B "是域" $F "上的" (&c* $3 $3) "矩阵, 那么" $A "和" $B
    "在域" $F "上相似的充要条件是它们拥有相同的特征多项式和极小多项式. 给出一个"
    "例子表明对于" (&c* $4 $4) "的矩阵而言这是不对的.")
   ((exercise #:n "12")
    "令" $F "是复数域的一个子域, " $A "和" $B "是域" $F "上的" n*n "矩阵. 证明如果"
    $A "和" $B "在复数域上相似, 那么它们也在" $F "上相似. (提示: 证明" $A
    "的有理形式不论" $A "被视为" $F "还是" $CC "上的矩阵都是一样的, " $B "当然也是如此.)")
   ((exercise #:n "13")
    "令" $A "是一个" n*n "复矩阵, 证明如果" $A "的每个特征值都是实数, 那么" $A
    "相似于一个实矩阵.")
   ((exercise #:n "14")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 证明存在满足以下性质的向量"
    (∈ $alpha $V) ". 如果" $f "是一个多项式而" (&= (ap (app $f $T) $alpha) $0)
    ", 那么" (&= (app $f $T) $0) ". (这样的向量" $alpha "被称为" $T "的多项式代数的一个"
    (B "分离向量") ".) 当" $T "拥有循环向量时, 给出循环向量也是分离向量的直接证明.")
   ((exercise #:n "15")
    "令" $F "是复数域的一个子域, " $A "是" $F "上的一个" n*n "矩阵, " $p
    "是" $A "的极小多项式. 如果我们将" $A "视为" $CC "上的矩阵, 那么" $A
    "在" $CC "上也拥有一个极小多项式" $f ". 使用关于线性方程组的定理证明"
    (&= $p $f) ". 另外, 你能看出这也可由循环分解定理推得吗?")
   ((exercise #:n "16")
    "令" $A "是一个满足" (&= (&+ $A^2 $I) $0) "的" n*n "实矩阵, 证明"
    $n "是偶数, 并且如果" (&= $n (&i* $2 $k)) ", 那么" $A
    "在实数域上相似于以下分块形式的矩阵"
    (MB (Mat (0 (&- $I)) ($I 0)))
    "其中" $I "是" (&c* $k $k) "的恒等矩阵.")
   ((exercise #:n "17")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 设"
    (Ol #:attr* '((type "a"))
        (Li $T "的极小多项式是素多项式之幂;")
        (Li $T "的极小多项式等于特征多项式."))
    "证明不存在非平凡的" $T "不变子空间拥有" $T "不变的补子空间.")
   ((exercise #:n "18")
    "如果" $T "是可对角化线性算子, 那么每个" $T "不变子空间都有与之互补的"
    $T "不变子空间.")
   ((exercise #:n "19")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 证明" $T
    "拥有循环向量当且仅当每个与" $T "交换的线性算子" $U
    "都是应用某个多项式于" $T "的结果.")
   ((exercise #:n "20")
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子. 我们问何时" $V "中的每个非零向量都是"
    $T "的一个循环向量, 证明其成立的充要条件为" $T
    "的特征多项式在" $F "上不可约.")
   ((exercise #:n "21")
    "令" $A "是一个" n*n "实矩阵, " $T "是" $RR^n "上在标准有序基下由"
    $A "表示的线性算子, " $U "是" $CC^n "上在标准有序基下由" $A
    "表示的线性算子. 使用练习20的结果证明以下结论: 若" $T
    "仅有平凡的不变子空间, 那么" $U "是可对角化的.")
   (H3 "第7.3节 Jordan形式")
   (P "设" $N "是有限维向量空间" $V "上的一个幂零算子. 让我们检视由定理3获得的"
      $N "的循环分解. 我们有一个正整数" $r "和" $r "个非零向量"
      (∈ $alpha_1 $..h $alpha_r $V) "满足"
      (MB (&= $V (&..d+ (cyc $alpha_1 $N) (cyc $alpha_r $N))))
      "并且若" (&..cm $p_1 $p_r) "分别是" (&..cm $alpha_1 $alpha_r)
      "的" $N "零化子, 那么对于" (&= $i (&..cm $1 (&- $r $1))) "有"
      (_ $p (&+ $i $1)) "整除" $p_i ". 既然" $N "是幂零算子, 那么其极小多项式为"
      $x^k ", 其中" (&<= $k $n) ". [译注: 这里的" $n "是隐式的" $V
      "的维数.] 因此, 每个" $p_i "都具有" (^ $x $k_i)
      "的形式, 而整除的条件可以被表达为"
      (MB (&..>= $k_1 $k_2 $k_r) ".")
      "当然了, " (&= $k_1 $k) "并且" (&>= $k_r $1) ". " (^ $x $k_i)
      "的同伴矩阵是" (&c* $k_i $k_i) "的矩阵"
      (MB (&= $A_i (Mat (0 0 $..c 0 0)
                        (1 0 $..c 0 0)
                        (0 1 $..c 0 0)
                        ($..v $..v $ $..v $..v)
                        (0 0 $..c 1 0))) ".")
      "因此, 定理3为我们提供了" $V "的一个有序基使得其下的矩阵是"
      $A_i "这样的初等幂零矩阵之直和, 而且随着" $i "的增大, "
      $A_i "的大小是在减小的. 从中读者可以看出, 与一个" n*n
      "的幂零矩阵相关联着的, 是一个正整数" $r "和" $r "个正整数"
      (&..cm $k_1 $k_r) "满足" (&= (&..+ $k_1 $k_r) $n) "且"
      (&>= $k_i (_ $k (&+ $i $1))) ". 这些正整数确定了矩阵的有理形式, "
      "即在相似意义下确定了矩阵是什么. [译注: 相似矩阵有着相同的有理形式, "
      "这从循环分解的唯一性来看是显然的.]")
   (P "还有一点是我们想要对于上述的幂零算子" $N "指出的. 正整数" $r
      "恰是" $N "的零化度. 实际上, " $r "个向量"
      (MB (ap (^ $N (&- $k_i $1)) $alpha_i))
      "构成了" $N "的零空间的一个基. 这是因为, 令" $alpha "是" $N
      "的零空间中的一个向量, 我们可以将" $alpha "写成"
      (MB (&= $alpha (&..+ (ap $f_1 $alpha_1) (ap $f_r $alpha_r))))
      "的形式, 其中" $f_i "是多项式, 并且不妨设对于每个" $i "有"
      (&= $f_i $0) "或者" (&< (&deg $f_i) $k_i)
      ". 既然" (&= (ap $N $alpha) $0) ", 那么对于每个" $i "可知"
      (eqnderiv $0 (app $N (ap $f_i $alpha_i))
                (ap $N (ap (app $f_i $N) $alpha_i))
                (ap (@i* $x $f_i) $alpha_i))
      "因此, " (&i* $x $f_i) "被" (^ $x $k_i) "整除. 但是, 因为"
      (&= $f_i $0) "或者" (&< (&deg $f_i) $k_i) ", 这意味着"
      (MB (&= $f_i (&i* $c_i (^ $x (&- $k_i $1)))))
      "其中" $c_i "是某个标量, 那么我们就有"
      (MB (&= $alpha (LC0 $c_1 (@ap (^ $x (&- $k_1 $1)) $alpha_1)
                          $c_r (@ap (^ $x (&- $k_r $1)) $alpha_r))))
      "其表明这" $r "个向量的确是" $N "的零空间的一个基. "
      "[译注: 这些向量之所以线性无关, 是因为它们是使得幂零算子呈现"
      "有理形式的基的一部分.] 读者也应该注意到这个事实从矩阵"
      "的角度来看是相当清晰的.")
   (P "现在我们想要将我们关于幂零算子或者幂零矩阵的发现和第6章的准素分解定理"
      "结合起来. 情况如下: 设" $T "是" $V "的一个线性算子并且" $T
      "的特征多项式在标量域" $F "上可以被分解为"
      (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
      "其中" (&..cm $c_1 $c_k) "是" $F "的不同元素而" (&>= $d_i $1)
      ", 那么" $T "的极小多项式为"
      (MB (&= $p (decomp $c_1 $r_1 $c_k $r_k)))
      "其中" (&<= $1 $r_i $d_i) ". 若" $W_i "是"
      (^ (@- $T (&i* $c_i $I)) $r_i) "的零空间, 那么准素分解定理告诉我们"
      (MB (&= $V (&..d+ $W_1 $W_k)))
      "并且由" $T "于" $W_i "上的限制导出的算子" $T_i "的极小多项式为"
      (^ (@- $x $c_i) $r_i) ". 令" (&= $N_i (&- $T_i (&i* $c_i $I)))
      ", 那么" $N_i "是幂零的并且其极小多项式为" (^ $x $r_i)
      ". 在" $W_i "上, " $T "就表现为" $N_i "加上标量" $c_i
      "倍的恒等算子. 设我们挑选了" $W_i "的一个有序基使得" $N_i
      "呈现有理形式, 那么" $T_i "在此有序基下的矩阵应该是形式为"
      (MB (Mat ($c $0 $..c $0 $0)
               ($1 $c $..c $0 $0)
               ($..v $..v $ $..v $..v)
               ($ $ $ $c $)
               ($0 $0 $..c $1 $c)))
      "的矩阵的直和, 并且每个" (&= $c $c_i) ". 更进一步, 这些矩阵的大小"
      "自左向右递减. 我们将以上这种形式的矩阵称为与特征值" $c
      "相关联的基本Jordan矩阵. 现在如果我们将每个" $W_i "的基放在一起, 那么我们就得到了"
      $V "的一个有序基. 让我们来刻画" $T "在这个有序基下的矩阵" $A ".")
   (P "矩阵" $A "是矩阵" (&..cm $A_1 $A_k) "的直和"
      (MB (&= $A (Mat ($A_1 $0 $..c $0)
                      ($0 $A_2 $..c $0)
                      ($..v $..v $ $..v)
                      ($0 $0 $..c $A_k))))
      "每个" $A_i "都具有形式"
      (MB (&= $A_i (Mat ((&J $1) $0 $..c $0)
                        ($0 (&J $2) $..c $0)
                        ($..v $..v $ $..v)
                        ($0 $0 $..c (&J $n_i)))))
      "其中每个" (&J $j) "都是与特征值" $c_i "相关联的基本Jordan矩阵. 而且, 在每个"
      $A_i "内部, 矩阵" (&J $j) "的大小随着" $j "的增加而递减. 一个满足本段之前所述条件的"
      n*n "矩阵" $A " (对于不同的标量" (&..cm $c_1 $c_k)
      ") 被称为是具有" (B "Jordan形式") ".")
   (P "刚才我们已经指出, 若线性算子" $T "的特征多项式可在标量域上被完全分解, 那么存在"
      $V "的一个有序基使得" $T "由某个Jordan形式表示. 现在我们想要说明的是, 这个矩阵"
      "在某种意义下是唯一的, 实际上最多仅取决于将" $T "的特征值" $c_i
      "写下来的顺序. 换句话说, 如果两个Jordan形式是相似的, 那么它们仅可能是在标量"
      $c_i "的顺序上有所不同.")
   (P "我们可以从以下论证中看出唯一性. 设存在" $V "的某个有序基使得" $T
      "由前述的Jordan矩阵" $A "表示. 如果" $A_i "是一个" (&c* $d_i $d_i)
      "的矩阵, 那么" $d_i "显然是" $c_i "作为" $A " (或者说" $T
      ") 的特征多项式的根的重数. 换言之, " $T "的特征多项式为"
      (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)) ".")
      "这表明" (&cm $c_1 $..h $c_k) "和" (&cm $d_1 $..h $d_k)
      "除开顺序应该是唯一的. " $A "为矩阵" $A_i "之直和的事实为我们提供了一个"
      $T "不变的直和分解" (&= $V (&..d+ $W_1 $W_k)) ". 我们注意到" $W_i
      "必然是" (^ (@- $T (&i* $c_i $I)) $n) "的零空间, 其中"
      (&= $n (&dim $V)) ". 这是因为, " (&- $A_i (&i* $c_i $I))
      "显然是幂零的, 而对于" (&!= $j $i) ", " (&- $A_j (&i* $c_i $I))
      "又显然是非奇异的. 于是, 我们看到子空间" $W_i "是唯一的. 如果" $T_i
      "是由" $T "于" $W_i "上的限制导出的算子, 那么矩阵" $A_i
      "作为" (@- $T_i (&i* $c_i $I)) "的有理形式加上" $c_i
      "倍的" (&c* $d_i $d_i) "恒等矩阵是唯一的. "
      "[译注: 原文似乎忘掉还需要为幂零算子的有理形式加上"
      $c_i "倍的恒等矩阵才是" $A_i ". 另外, " $A_i "的唯一性依赖于"
      "有理形式的唯一性, 虽然实际上其间还有一点点差距, 但因为并不困难, "
      "就留给读者思考了.]")
   (P "现在我们希望更深入地观察算子" $T "及其在某个有序基下的Jordan矩阵"
      $A ", 以下所列出的是我们的发现:"
      (Ol (Li $A "的每个元素, 若是不在主对角线上或者紧挨着主对角线的下方, 必然是"
              $0 ". " $A "的对角线上的元素是" $T "的" $k "种不同的特征值"
              (&..cm $c_1 $c_k) ". 并且, " $c_i "重复" $d_i "次, 而" $d_i "是"
              $c_i "作为特征多项式的根的重数, 即" (&= $d_i (&dim $W_i)) ".")
          (Li "对于每个" $i ", 矩阵" $A_i "是" $n_i "个与特征值" $c_i
              "有关的基本Jordan矩阵" (&J $j) "的直和. 数字" $n_i
              "恰为与特征值" $c_i "相关联的特征空间的维数. 这是因为, " $n_i
              "是" (@- $T_i (&i* $c_i $I)) "的有理形式的基本幂零块的数目, 因而等于"
              (@- $T (&i* $c_i $I)) "的零空间的维数. [译注: " $W_i
              "是" (^ (@- $T (&i* $c_i $I)) $r_i) "的零空间, 其中" $r_i
              "是一个正整数, 于是其显然包含" (@- $T (&i* $c_i $I))
              "的零空间.] 特别地, 我们注意到" $T "是可对角化的当且仅当对于每个"
              $i ", " (&= $n_i $d_i) ". [译注: " $n_i "是所谓的几何重数, "
              $d_i "是所谓的代数重数.]")
          (Li "对于每个" $i ", 矩阵" $A_i "的第一个块" (&J $1) "是一个"
              (&c* $r_i $r_i) "的矩阵, 其中" $r_i "是" $c_i "作为" $T
              "的极小多项式的根的重数. 这可由幂零算子" (@- $T_i (&i* $c_i $I))
              "的极小多项式为" (^ $x $r_i) "的事实推得.")))
   (P "当然, 和之前一样, 我们也有直接的矩阵形式的结果. 如果" $B "是域" $F
      "上的一个" n*n "矩阵并且" $B "的特征多项式可在域" $F "上被分解完全, 那么"
      $B "在域" $F "相似于一个" n*n "的Jordan矩阵" $A ", 而" $A
      "在可以重排其特征值顺序的意义下是唯一的, 我们将" $A "称为" $B
      "的Jordan形式.")
   (P "若" $F "是代数闭域, 那么上述评注则可应用于所有" $F "上的有限维向量空间上的线性算子. "
      "因此, 例如, 每个复数域上的" n*n "矩阵都相似于一个基本上唯一的Jordan形式. "
      "[译注: &quot;基本上&quot;的意思即不计特征值的顺序.]")
   ((example #:n "5")
    "设" $T "是" $CC^2 "上的一个线性算子, 那么" $T "的特征多项式要么具有"
    (&i* (@- $x $c_1) (@- $x $c_2)) "的形式, 其中" $c_1 "和" $c_2
    "是不同的复数, 要么具有" (^ (@- $x $c) $2) "的形式. 在前一种情况下, " $T
    "必然是可对角化的且在某个有序基下由"
    (MB (Mat ($c_1 $0) ($0 $c_2)))
    "表示. 在后一种情况下, " $T "的极小多项式可能是" (@- $x $c) ", 那么"
    (&= $T (&i* $c $I)) ", 或者是" (^ (@- $x $c) $2) ", 那么在此情况下" $T
    "在某个有序基下可由矩阵"
    (MB (Mat ($c $0) ($1 $c)))
    "表示. 因此, 复数域上的每个" 2*2 "矩阵, 要么相似于一个对角矩阵, "
    "要么相似于以上这种形式的矩阵, 二者不可兼得.")
   ((example #:n "6")
    "令" $A "是" (&c* $3 $3) "的复矩阵"
    (MB (&= $A (Mat ($2 $0 $0) ($a $2 $0) ($b $c $-1))))
    $A "的特征多项式显然是" (&i* (^ (@- $x $2) $2) (@+ $x $1))
    ". 若这也是" $A "的极小多项式, 那么" $A "相似于"
    (MB (Mat ($2 $0 $0) ($1 $2 $0) ($0 $0 $-1)))
    "或者极小多项式为" (&i* (@- $x $2) (@+ $x $1)) ", 那么" $A "相似于"
    (MB (Mat ($2 $0 $0) ($0 $2 $0) ($0 $0 $-1)))
    "既然"
    (MB (&= (&i* (@- $A (&i* $2 $I)) (@+ $A $I))
            (Mat ($0 $0 $0) ((&i* $3 $a) $0 $0) ((&i* $a $c) $0 $0))))
    "因而" $A "相似于对角矩阵当且仅当" (&= $a $0) ".")
   ((example #:n "7")
    "令"
    (MB (&= $A (Mat (2 0 0 0) (1 2 0 0) (0 0 2 0) (0 0 $a 2))))
    $A "的特征多项式为" (^ (@- $x $2) $4) ". 既然" $A "是两个"
    2*2 "矩阵的直和, " $A "的极小多项式显然是" (^ (@- $x $2) $2)
    ". 现在如果" (&= $a $0) "或者" (&= $a $1) ", 那么矩阵" $A
    "是Jordan形式. 注意到对于" (&= $a $0) "和" (&= $a $1)
    ", 我们得到的两个矩阵有着相同的特征多项式和极小多项式, "
    "但是它们并不相似. 这是因为, " (&= $a $0) "时矩阵" (@- $A (&i* $2 $I))
    "的解空间的维数是" $3 ", 而" (&= $a $1) "时解空间的维数则是"
    $2 ". [译注: 相似矩阵的解空间可以被视为对于同一个线性算子的零空间"
    "的具体刻画, 不论怎样它们的维数至少应该是相同的.]")
   ((tcomment)
    "在例子8之前, 译者想要写一些注记, 尽管这只是第6章的例子14的译者注记的"
    "老调重弹而已. 微分运算" $D "实际上并非" $n "次连续可微函数空间" $C^n
    "上的线性算子, 因为它甚至不是算子. 实际上, " $n
    "次连续可微函数的导数并不一定仍然是" $n "次连续可微的. 换言之, " $C^n
    "压根就不对运算" $D "封闭. 原文看似完美无瑕的论证势必要打上一点补丁才行, "
    "而改动最小的方式就是将" $C^n "改成" (^ $C $inf)
    ", 即仅考虑无穷可微函数空间中满足微分方程的解. 这里的例子8甚至考虑的仅是"
    $n "次可微而不是" $n "次连续可微, 但是我们译注的基点没有发生变化.")
   ((example #:n "8")
    "常系数齐次线性微分方程 (第6章的例子14) 提供了对于Jordan形式的"
    "一种很好的刻画. 令" (&..cm $a_0 (_ $a $n-1)) "是复数而" $V
    "是定义在实轴的某个固定区间上满足微分方程"
    (let ((deriv (lambda (n)
                   (~ (ap (^ $diff n) $f) (ap $diff (^ $x n))))))
      (MB (&= (&+ (deriv $n) (&i* (_ $a $n-1) (deriv $n-1)) $..c
                  (&i* $a_1 (~ (ap $diff $f) (ap $diff $x))) (&i* $a_0 $f)) $0)))
    "的所有" $n "次可微函数" $f "构成的空间. 令" $D "是微分算子, 那么" $V
    "在" $D "下不变, 因为" $V "是" (app $p $D) "的零空间, 其中"
    (MB (&= $p (&+ $x^n $..c (&i* $a_1 $x) $a_0)) ".")
    "那么" $V "上的微分算子的Jordan形式是什么样的呢?" (Br)
    "令" (&cm $c_1 $..h $c_k) "是" $p "不同的复根, 那么"
    (MB (&= $p (decomp $c_1 $r_1 $c_k $r_k)))
    "令" $V_i "是" (^ (@- $D (&i* $c_i $I)) $r_i) "的零空间, 即微分方程"
    (MB (&= (ap (^ (@- $D (&i* $c_i $I)) $r_i) $f) $0))
    "的解集, 那么根据第6章例子14的观察, 准素分解定理告诉我们"
    (MB (&= $V (&..d+ $V_1 $V_k)) ".")
    "令" $N_i "是" (&- $D (&i* $c_i $I)) "于" $V_i "上的限制算子, 那么("
    $V "上的)算子" $D "的Jordan形式由分别位于空间" (&..cm $V_1 $V_k)
    "上的幂零算子" (&..cm $N_1 $N_k) "的有理形式决定." (Br)
    "所以说, 我们必须要知道的是(在各种各样的" $c "下)空间" $V_c "上的算子"
    (&= $N (&- $D (&i* $c $I))) "的有理形式, 其中" $V_c "是微分方程"
    (MB (&= (ap (^ (@- $D (&i* $c $I)) $r) $f) $0))
    "的解集. [译注: 这里的" $r "实际上是某个任意的正整数, 并且根据第6章的微分方程的例子, " $V_c
    "的维数就是" $r ". 当然, " $N "在" $V_c "上是幂零算子的事实是显然的.] "
    $N "在有理形式下有多少基本幂零块呢? 这个数字是" $N
    "的零化度, 即与特征值" $c "相关联的特征空间的维数. [译注: 这里说的特征值指的是"
    $V_c "上的微分算子" $D "的特征值, 而且其特征值就是唯一的, 即" $c
    ", 这可以从之前的观察中看出来.] 然而, 此维数必然是" $1 ", 因为任意满足微分方程"
    (MB (&= (ap $D $f) (&i* $c $f)))
    "的函数都是指数函数" (&= (app $h $x) (^ $e (&i* $c $x)))
    "的某个标量倍数. 因此, (空间" $V_c "上的)算子" $N
    "具有循环向量, 其一个比较好的选择是" (&= $g (&i* (^ $x (&- $r $1)) $h)) ":"
    (MB (&= (app $g $x) (&i* (^ $x (&- $r $1)) (^ $e (&i* $c $x)))) ".")
    "那么这就给出"
    (MB ((Ttable (lambda (d i j)
                   (cond ((= i 1) d)
                         ((= j 0) (set-right d))
                         ((= j 2) (set-left d))
                         (else d))))
         (&Table
          ((ap $N $g) $= (&i* (@- $r $1) (^ $x (&- $r $2)) $h))
          ($..v $ $..v)
          ((ap (^ $N (&- $r $1)) $g) $= (&i* (&fact (@- $r $1)) $h)))))
    "[译注: 这里的符号运用稍微值得解释一下. 在" (&i* (^ $x (&- $r $1)) $h)
    "中, " $x "代表将每个值映射至自身的函数, " (^ $x (&- $r $1))
    "表示这个函数的" (&- $r $1) "次幂, 但是这里的乘法是定义在函数上的, 即"
    (&= (app (@i* $f $g) $x) (&i* (app $f $x) (app $g $x))) ", 那当然"
    (&i* (^ $x (&- $r $1)) $h) "也应该这么解释. 对于其余类似的表达式, "
    "我们还应该注意到诸如" (@- $r $1) "这样的常数被解释为常值函数.] "
    "现在我们知道" $D "(在空间" $V ")上的Jordan形式是" $k "个基本Jordan矩阵"
    "的直和, 其中每个都对应于一个根" $c_i ", 且大小为" (&c* $r_i $r_i) ".")
   ((exercise #:n "1")
    "令" $N_1 "和" $N_2 "是域" $F "上的" (&c* $3 $3) "幂零矩阵, 证明" $N_1
    "和" $N_2 "相似当且仅当它们拥有相同的极小多项式.")
   ((exercise #:n "2")
    "使用练习1和Jordan形式的结果证明以下事实: 如果域" $F "上的" n*n
    "矩阵" $A "和" $B "有着相同的特征多项式"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "和相同的极小多项式, 并且没有" $d_i "大于" $3 ", 那么" $A "和"
    $B "是相似的.")
   ((exercise #:n "3")
    "如果" $A "是一个" (&c* $5 $5) "的复矩阵, 其特征多项式为"
    (MB (&= $f (&i* (^ (@- $x $2) $3) (^ (@+ $x $7) $2))))
    "而极小多项式为"
    (MB (&= $p (&i* (^ (@- $x $2) $2) (@+ $x $7))))
    "那么" $A "的Jordan形式是什么呢?")
   ((exercise #:n "4")
    (&c* $6 $6) "的复矩阵, 若其特征多项式为"
    (&i* (^ (@+ $x $2) $4) (^ (@- $x $1) $2))
    ", 那么其Jordan形式有多少种可能呢?")
   ((exercise #:n "5")
    "次数小于等于" $3 "的多项式构成的向量空间 [译注: 当然包括不能定义次数的零多项式] 上的微分算子, "
    "其在&quot;自然&quot;有序基下由矩阵"
    (MB (Mat (0 1 0 0) (0 0 2 0) (0 0 0 3) (0 0 0 0)))
    "表示. 这个矩阵的Jordan形式是什么? (" $F "是复数域的一个子域.)")
   ((exercise #:n "6")
    "令" $A "是复矩阵"
    (MB (Mat (2 0 0 0 0 0)
             (1 2 0 0 0 0)
             (-1 0 2 0 0 0)
             (0 1 0 2 0 0)
             (1 1 1 1 2 0)
             (0 0 0 0 1 -1)))
    "找出" $A "的Jordan形式.")
   ((exercise #:n "7")
    "如果域" $F "上的" n*n "矩阵" $A "以"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "为特征多项式, 请问" $A "的迹是多少?")
   ((exercise #:n "8")
    "按照相似对于满足" (&= $A^3 $I) "的" (&c* $3 $3) "复矩阵" $A "进行分类.")
   ((exercise #:n "9")
    "按照相似对于满足" (&= $A^n $I) "的" n*n "复矩阵" $A "进行分类.")
   ((exercise #:n "10")
    "令" $n "是大于" $1 "的整数, " $N "是域" $F "上一个满足" (&= $N^n $0)
    "但是" (&!= (^ $N $n-1) $0) "的" n*n "矩阵, 证明" $N
    "没有平方根, 即不存在" n*n "的矩阵" $A "使得" (&= $A^2 $N) ".")
   ((exercise #:n "11")
    "令" $N_1 "和" $N_2 "是域" $F "上的" (&c* $6 $6)
    "幂零矩阵, 设其拥有相同的极小多项式和相同的零化度, 证明" $N_1
    "和" $N_2 "是相似的. 说明为何这对于" (&c* $7 $7) "的情况并不成立.")
   ((exercise #:n "12")
    "使用练习11和Jordan形式的结果证明以下事实: 令" $A "和" $B
    "是域" $F "有着相同特征多项式"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "和相同极小多项式的" n*n "矩阵, 并且设对于每个" $i ", "
    (@- $A (&i* $c_i $I)) "和" (@- $B (&i* $c_i $I))
    "的解空间有着相同的维数, 如果没有" $d_i "大于" $6
    ", 那么" $A "和" $B "是相似的.")
   ((exercise #:n "13")
    "如果" $N "是一个" (&c* $k $k) "的基本幂零矩阵, 即" (&= $N^k $0)
    "但是" (&!= (^ $N (&- $k $1)) $0) ", 证明" $N^t "相似于" $N
    ". 现在使用Jordan形式来证明每个复矩阵都相似于其转置.")
   ((exercise #:n "14")
    "以下证明有何错误? 如果" $A "是一个" n*n "的复矩阵满足"
    (&= $A^t (&- $A)) ", 那么" (&= $A $0) ". (证明: 令" $J
    "是" $A "的Jordan形式, 因为" (&= $A^t (&- $A))
    ", 所以" (&= $J^t (&- $J)) ". 但是, 鉴于" $J
    "是下三角矩阵, " (&= $J^t (&- $J)) "可以推出" $J
    "的每个元素都是" $0 ". 既然" (&= $J $0) "而" $A "相似于"
    $J ", 那么" (&= $A $0) ".) (给出非零矩阵" $A "满足"
    (&= $A^t (&- $A)) "的例子.)")
   ((exercise #:n "15")
    "如果" $N "是" $CC "上的一个" (&c* $3 $3) "的幂零矩阵, 证明"
    (&= $A (&- (&+ $I (&i* 1/2 $N)) (&i* 1/8 $N^2))) "满足"
    (&= $A^2 (&+ $I $N)) ", 即" $A "是" (&+ $I $N)
    "的一个平方根. 使用" (^ (@+ $1 $t) (&/ $1 $2))
    "的二项级数展开以得到类似的" (&+ $I $N)
    "的平方根公式, 其中" $N "是" $CC "上任意的" n*n "的幂零矩阵.")
   ((exercise #:n "16")
    "使用练习15的结果证明如果" $c "是一个非零复数而" $N
    "是一个幂零的复矩阵, 那么" (@LC $c $I $N)
    "拥有平方根. 现在使用Jordan形式来证明每个非奇异的"
    n*n "复矩阵都拥有平方根.")
   (H3 "第7.4节 不变因子的计算")
   (P "设" $A "是域" $F "上的一个" n*n "矩阵, 我们希望找到一种能够计算确定了"
      $A "的有理形式的不变因子" (&..cm $p_1 $p_r) "的方法. 让我们从简单的情况着手, 即"
      $A "是首项系数为一多项式"
      (MB (&= $p (&+ $x^n (&i* (_ $c $n-1) (^ $x $n-1)) $..c (&i* $c_1 $x) $c_0)))
      "的同伴矩阵. 在第7.1节我们已经看到" $p "既是" $A "的极小多项式也是"
      $A "的特征多项式, 但是现在我们希望直接给出计算以表明" $p "是" $A
      "的特征多项式. 在此情况下, 特征矩阵为"
      (MB (&= (&- (&i* $x $I) $A)
              (Mat ($x 0 0 $..c 0 $c_0)
                   (-1 $x 0 $..c 0 $c_1)
                   (0 -1 $x $..c 0 $c_2)
                   ($..v $..v $..v $ $..v $..v)
                   (0 0 0 $..c $x (_ $c (&- $n $2)))
                   (0 0 0 $..c -1 (&+ $x (_ $c $n-1))))) ".")
      "将第" $n "行乘上" $x "加到第" (@- $n $1) "行上去, 这将移除第" (@- $n $1)
      "行" (@- $n $1) "列的" $x ", 但是不会改变其行列式的值. 接着, 将新的第"
      (@- $n $1) "行乘上" $x "加到第" (@- $n $2) "行上去. 如此反复直至所有主对角线上的"
      $x "都被移除. 这个过程的最终结果是矩阵"
      (MB (Mat (0 0 0 $..c 0 (&+ $x^n $..c (&i* $c_1 $x) $c_0))
               (-1 0 0 $..c 0 (&+ (^ $x $n-1) $..c (&i* $c_2 $x) $c_1))
               (0 -1 0 $..c 0 (&+ (^ $x (&- $n $2)) $..c (&i* $c_3 $x) $c_2))
               ($..v $..v $..v $ $..v $..v)
               (0 0 0 $..c 0 (&+ $x^2 (&i* (_ $c (&- $n $1)) $x) (_ $c (&- $n $2))))
               (0 0 0 $..c -1 (&+ $x (_ $c $n-1)))))
      "其与" (&- (&i* $x $I) $A) "有着相同的行列式, 而右上角是" $p
      ". 通过列变换我们可以清理一下最后一列:"
      (MB (Mat (0 0 0 $..c 0 $p)
               (-1 0 0 $..c 0 0)
               (0 -1 0 $..c 0 0)
               ($..v $..v $..v $ $..v $..v)
               (0 0 0 $..c 0 0)
               (0 0 0 $..c -1 0)))
      "将前" (@- $n $1) "列每个都乘上" $-1 ", 然后通过" (@- $n $1) "次相邻的对换将当前"
      "的最后一列移到第一列的位置. 因其(对于行列式而言)总的效果就是" (&- (&i* $2 $n) $2)
      "次的符号反转, 所以行列式仍然不变. 我们得到了矩阵"
      (MB (Mat ($p 0 0 $..c 0)
               (0 1 0 $..c 0)
               (0 0 1 $..c 0)
               ($..v $..v $..v $ $..v)
               (0 0 0 $..c 1)))
      "此时" (&= $p (&det (&- (&i* $x $I) $A))) "这个事实是显然的.")
   (P "现在我们将要表明, 对于任意的" n*n "矩阵" $A ", 存在一系列行和列变换将"
      (&- (&i* $x $I) $A) "转换为上面这种形式的矩阵, 即" $A
      "的不变因子沿着主对角线依次出现. 先让我们完全明了我们将要(对于行和列)施行的操作.")
   (P "我们关心的是" (^ polyF m*n) ", 即由所有以域" $F "上的多项式为元素的" m*n
      "矩阵构成的集合. 如果" $M "是这样的一个矩阵, 那么" $M "上的一个"
      (B "初等行变换") "是以下三种操作中的一种:"
      (Ol (Li "给" $M "的一行乘上" $F "中的一个非零标量;")
          (Li "将" $M "的第" $r "行替换为第" $r "行加上" $f "倍的第" $s
              "行, 其中" $f "是域" $F "上任意的多项式并且" (&!= $r $s) ";")
          (Li "交换" $M "的两行."))
      "一个初等行变换的逆仍然是相同类型的初等行变换. [译注: 其实所谓类型不是良定的, "
      "但是不要紧, 因为压根不会利用这个事实.] 注意到在1中, 我们要求的是非零标量而不是"
      "非零多项式, 因为非标量的多项式并非可逆, 若是如此则会导致不能作出初等行变换可逆的断言. 一个"
      m*m "的" (B "初等矩阵") ", 即一个" (^ polyF m*m) "中的初等矩阵, 是可由"
      m*m "的恒等矩阵通过单独一个初等行变换得到的矩阵. 显然对于" $M
      "施行一个初等行变换可以等效为给" $M "左乘一个相应的" m*m "的初等矩阵; 实际上, 如果"
      $e "是这样的一个初等行变换, 那么"
      (MB (&= (app $e $M) (&i* (app $e $I) $M)) "."))
   (P "令" (∈ $M $N (^ polyF m*n)) ", 我们称" $M "行等价于" $N ", 如果" $N
      "可由" $M "经过有限的一系列初等行变换得到:"
      (MB (&= $M (&-> $M_0 $M_1 $..c $M_k) $N) ".")
      "显然" $N "行等价于" $M "当且仅当" $M "行等价于" $N ", 所以我们可以使用术语&quot;"
      $M "和" $N "是行等价的&quot;. 如果" $N "行等价于" $M ", 那么"
      (MB (&= $N (&i* $P $M)))
      "其中" m*m "的矩阵" $P "是初等矩阵之积:"
      (MB (&= $P (&i* $E_1 $..c $E_k)) ".")
      "特别地, " $P "是一个可逆矩阵, 其逆为"
      (MB (&= (inv $P) (&i* (_^ $E $k $-1) $..c (_^ $E $1 $-1))) ".")
      "当然, " $E_j "的逆来源于初等行变换的逆. [译注: 多项式上的矩阵乘法也满足"
      "结合律, 所以逆矩阵自然是唯一的.]")
   (P "刚才的这些内容就和域上的矩阵是一样的, 其平行于第1章的那些基本结果. 因此, 其所暗示的"
      "接下来的问题应该是如何引入多项式矩阵的行简化阶梯形式. 这里我们遇到了新的障碍. "
      "之前我们是怎么对于矩阵进行行规约的呢? 第一步是选出第" $1 "行的首非零元, 然后将第"
      $1 "行的每个元素都除以那个元素. 对于元素为多项式的矩阵, 我们必然不能在一般情况下"
      "完成这个操作. 在接下来的定理中我们可以看到, 特定情形下我们可以绕开这个困难. 然而, 对于"
      (^ polyF m*n) "而言, 并不存在适用于所有情况的行简化形式. 若是我们也引入列变换, "
      "并研究兼用行列变换得到的等价关系, 那么对于每个矩阵我们可以得到一种相当有用的标准形式. "
      "以下是我们的基本工具.")
   ((lemma)
    "令" (∈ $M (^ polyF m*n)) ", 设其第一列不全为零, 并令" $p "是" $M
    "的第一列各元素的最大公因子, 那么" $M "行等价于一个矩阵" $N ", 其中" $N "的第一列为"
    (MB (Mat ($p) ($0) ($..v) ($0)) "."))
   ((proof)
    "我们将要证明的东西比我们刚才所陈述的要强一点. 实际上, 我们表明了存在一个找到"
    $N "的算法, 即一个可供机器执行以在有限步骤内计算" $N "的描述. 首先, 我们需要一些记号." (Br)
    "令" (∈ $M (^ polyF m*n)) "具有非零的首列"
    (MB (&= $M_1 (Mat ($f_1) ($..v) ($f_m))))
    "定义"
    (MB (set-left
         (&Table
          ((app $l $M_1) $= (mini (&!= $f_i $0) (&deg $f_i)))
          ((app $p $M_1) $= (&gcd $f_1 $..h $f_m)))))
    "令" $j "是某个满足" (&= (&deg $f_j) (app $l $M_1)) "的下标. 为了明确起见, 令"
    $j "是满足要求的下标中最小的那个, 即"
    (&= $j (mini (setI (∈ $i (setE $1 $..h $m)) (&= (&deg $f_i) (app $l $M_1)))))
    ". 我们尝试用" $f_j "去除每个" $f_i ":"
    (MB (&cm (&= $f_i (&+ (&i* $f_j $g_i) $r_i))
             (: (&= $r_i $0) "或者" (&< (&deg $r_i) (&deg $f_j)))) ".")
    "对于每个异于" $j "的" $i ", 将" $M "的第" $i "行替换为第" $i "行减去"
    $g_i "乘上第" $j "行. 将第" $j "行乘上首项系数的倒数以将" $f_j "化为首项系数为一的多项式, "
    "然后交换第" $j "行和第" $1 "行. 通过所有这些操作, 我们得到了一个矩阵" $M^ ", 其第一列为"
    (MB (&= (_^ $M $1 $prime)
            (Mat ((_ (OverBar $f) $j)) ($r_2) ($..v) ((_ $r (&- $j $1)))
                 ($r_1) ((_ $r (&+ $j $1))) ($..v) ($r_m))) ".")
    "我们已经给出了一个良定义的过程以将每个" $M "转化为一个具有以下这些性质的" $M^ ":"
    (Ol #:attr* '((type "a"))
        (Li $M^ "行等价于" $M ";")
        (Li (&= (app $p (_^ $M $1 $prime)) (app $p $M_1)) ";")
        (Li "要么" (&< (app $l (_^ $M $1 $prime)) (app $l $M_1)) ", 要么"
            (MB (&= (_^ $M $1 $prime)
                    (Mat ((app $p $M_1)) ($0) ($..v) ($0))) ".")))
    "性质b和c是容易验证的. [译注: 为了验证性质b, 读者最好回顾一下第4章, 那里将"
    (&cm $f_1 $..h $f_m) "的" $gcd "定义为由这些多项式生成的理想的首项系数为一"
    "的生成元. 并且, 第4章给出了" $gcd "的一个等价定义, 其更符合我们的直觉, "
    "即若首项系数为一的多项式" $d "满足其整除" (&cm $f_1 $..h $f_m) "且每个整除"
    (&cm $f_1 $..h $f_m) "的多项式都整除" $d ", 那么" $d "是"
    (&cm $f_1 $..h $f_m) "的" $gcd ". 或许, 利用等价定义说明性质b是更简单的, "
    "但其实两种定义都差不多.] 实际上, 性质c只是在重述, 要么存在某个" $i
    "使得" (&!= $r_i $0) "而" (&< (&deg $r_i) (&deg $f_j)) ", 要么对于每个"
    $i "都有" (&= $r_i $0) ", 于是" (_ (OverBar $f) $j) "成为"
    (&cm $f_1 $..h $f_m) "的最大公因子." (Br)
    "现在要证明引理就相当简单了. 我们从矩阵" $M "开始, 应用上述过程以得到"
    $M^ ". 性质c告诉我们要么矩阵" $M^ "就是引理所需要的" $N ", 要么"
    (&< (app $l (_^ $M $1 $prime)) (app $l $M_1))
    ". 对于后一种情况, 我们再次应用该过程于" $M^ "以得到矩阵"
    (&= (^ $M (@ $2)) (&prime (@ $M^))) ". 要是" (^ $M (@ $2))
    "也不合适, 我们就构造" (&= (^ $M (@ $3)) (&prime (@ (^ $M (@ $2)))))
    ", 如此进行下去. 证明的要义在于严格的不等式"
    (MB (&> (app $l $M_1) (app $l (_^ $M $1 $prime))
            (app $l (_^ $M $1 (@ $2))) $..c))
    "不可能无限延伸下去. 至多只需要" (app $l $M_1)
    "次过程迭代, 我们必定能够抵达具有我们所寻求性质的矩阵" (^ $M (@ $k))
    ". [译注: 这里其实存在一个无关紧要的细节问题, 就是迭代次数的上界严格说来是"
    (&+ (app $l $M_1) $1) ", 原因如下. 首先, 除非一开始矩阵的第一列就是"
    "符合条件的, 否则都需要进行至少一次迭代. 其次, 迭代终止的条件为" $l
    "应用于矩阵第一列的值不变. 也就是说, 尽管前面的迭代步骤都会导致"
    $l "应用于矩阵第一列的值严格减小, 但是最后一步时总是不变的.]")
   ((tcomment)
    "将引理的背景去掉, 其实这就是求多个多项式的最大公因子的辗转相除法.")
   ((theorem #:n "6")
    "令" (∈ $P (^ polyF m*m)) ", 以下条件是等价的:"
    (Ol #:attr* '((type "i"))
        (Li $P "是可逆的;")
        (Li $P "的行列式是非零的标量多项式;")
        (Li $P "行等价于" m*m "的恒等矩阵;")
        (Li $P "是初等矩阵之积.")))
   ((proof)
    "由i推出ii是显然的, 这是因为行列式函数是乘性的, 而" polyF
    "中的可逆元素仅是非零的标量多项式. 实际上, 第5章我们已经通过"
    "古典伴随说明了i和ii是等价的. 这里我们的论证提供了由ii推出i"
    "的一个不同证明. 我们将坐一圈旋转木马 (merry-go-round)"
    (MB (&Table
         ("i" $-> "ii")
         ($uarr $ $darr)
         ("iv" $<- "iii")))
    "其实并不显然的命题只有从ii推出iii而已." (Br)
    "假定ii成立, 我们考虑" $P "的第一列. 其包含特定的多项式"
    (&cm $p_1 $..h $p_m) "而我们知道必然有"
    (MB (&= (&gcd $p_1 $..h $p_m) $1))
    "因为每个" (&cm $p_1 $..h $p_m) "的公因子都必然整除"
    (&det $P) ", 其为非零的标量多项式. 应用前述引理于" $P
    ", 我们可以得到一个矩阵"
    (MB (&= $Q (Mat ($1 $a_2 $..c $a_m)
                    ($0 $ $ $)
                    ($..v $ $B $)
                    ($0 $ $ $))))
    "其行等价于" $P ". 鉴于一次初等行变换至多只会改变矩阵的"
    "行列式以一个非零的标量因子, " (&det $Q)
    "也是一个非零的标量多项式. 显然, " (&c* (@- $m $1) (@- $m $1))
    "的矩阵" $B "和" $Q "有着相同的行列式. 因此, 我们可以继续将前述引理应用于"
    $B ". 若是重复此步骤" $m "次, 就可以得到一个上三角矩阵"
    (MB (&= $R (Mat ($1 $a_2 $..c $a_m)
                    ($0 $1 $..c $b_m)
                    ($..v $..v $ $..v)
                    ($0 $0 $..c $1))))
    "其行等价于" $P ". 并且, " $R "又显然等价于" m*m "的恒等矩阵.")
   ((corollary)
    "令" (∈ $M $N (^ polyF m*n)) ", 那么" $N "行等价于" $M
    "当且仅当"
    (MB (&= $N (&i* $P $M)))
    "其中" (∈ $P (^ polyF m*m)) "是一个可逆矩阵.")
   (P "现在我们以类比于初等行变换和行等价的方式来定义"
      (B "初等列变换") "和" (B "列等价") ". 我们并不需要新的初等矩阵的概念, "
      "因为施行一次初等列变换于恒等矩阵得到的矩阵类和施行一次初等行变换得到的是一样的.")
   ((definition)
    "矩阵" $N (B "等价") "于矩阵" $M ", 如果我们可以通过一系列变换从" $M "得到" $N ":"
    (MB (&= $M (&-> $M_0 $M_1 $..c $M_k) $N))
    "其中每一步都是一次初等行变换或者初等列变换.")
   ((theorem #:n "7")
    "令" (∈ $M $N (^ polyF m*n)) ", " $N "等价于" $M "当且仅当"
    (MB (&= $N (&i* $P $M $Q)))
    "其中" (∈ $P (^ polyF m*m)) "和" (∈ $Q (^ polyF n*n)) "都是可逆矩阵.")
   ((theorem #:n "8")
    "令" (∈ $A (^ $F n*n)) ", " (&cm $p_1 $..h $p_r) "是" $A
    "的不变因子, 那么矩阵" (&- (&i* $x $I) $A) "等价于一个" n*n
    "的对角矩阵, 其对角线上的元素依次为" (&cm $p_1 $..h $p_r $1 $1 $..h $1) ".")
   ((proof)
    "存在可逆矩阵" (∈ $P (^ $F n*n)) "使得" (sim $A) "成为有理形式, 即具有分块形式"
    (MB (&= (sim $A) (Mat ($A_1 $0 $..c $0)
                          ($0 $A_2 $..c $0)
                          ($..v $..v $..d $..v)
                          ($0 $0 $..c $A_r))))
    "其中" $A_i "是多项式" $p_i "的同伴矩阵. 根据定理7, 矩阵"
    (MB (&= (sim (@- (&i* $x $I) $A))
            (&- (&i* $x $I) (sim $A))))
    "等价于" (&- (&i* $x $I) $A) ". 现在我们有"
    (MB (&= (&- (&i* $x $I) (sim $A))
            (Mat ((&- (&i* $x $I) $A_1) $0 $..c $0)
                 ($0 (&- (&i* $x $I) $A_2) $..c $0)
                 ($..v $..v $ $..v)
                 ($0 $0 $..c (&- (&i* $x $I) $A_r)))))
    "其中的各个" $I "是具有适当大小的恒等矩阵. 根据本节开头的讨论, 我们表明了"
    (&- (&i* $x $I) $A_i) "等价于矩阵"
    (MB (Mat ($p_i $0 $..c $0)
             ($0 $1 $..c $0)
             ($..v $..v $ $..v)
             ($0 $0 $..c $1)) ".")
    "将以上得到的结果组合一下, 显然" (&- (&i* $x $I) $A)
    "等价于这样的对角矩阵, 其主对角线上具有多项式" $p_i "和" (@- $n $r)
    "个" $1 ". 通过交换行和列, 可以将对角线元素按照我们想要的顺序排列, 即: "
    (&cm $p_1 $..h $p_r $1 $..h $1) ".")
   (P "定理8的证明并未给出计算不变因子" (&cm $p_1 $..h $p_r)
      "的有效方法, 因为其依赖于循环分解定理. 现在我们将给出一个规约行列式矩阵"
      "为对角形式的显式算法. 定理8的证明暗示了我们也可以将主对角线上的"
      "相继元素安排成前一个整除后一个的样子. [译注: 也就是说, 反转整个主对角线"
      "上的元素的顺序.]")
   ((definition)
    "令" (∈ $N (^ polyF m*n)) ", 我们称" $N "具有(Smith)" (B "规范形式") ", 如果"
    (Ol #:attr* '((type "a"))
        (Li $N "的每个偏离主对角线的元素都是" $0 ";")
        (Li $N "的主对角线上的元素依次是" (&cm $f_1 $..h $f_l)
            ", 其满足" $f_k "整除" (_ $f (&+ $k $1))
            ", " (&<= $1 $k (&- $l $1)) "."))
    "在以上定义中, 数字" (&= $l (&min $m $n)) ", 而主对角线元素是"
    (&cm (&= $f_k (mref $N $k $k)) (&= $k (&cm $1 $..h $l))) ".")
   ((tcomment)
    "作者在定义里遗漏了一个细节, 其后果是规范形式并非唯一. 实际上, "
    "这里还需要添加额外的限制条件, 即主对角线上的非零元素的首项系数均为一.")
   ((theorem #:n "9")
    "令" (∈ $M (^ polyF m*n)) ", 那么" $M "等价于一个具有规范形式的矩阵" $N ".")
   ((proof)
    "鉴于原文的证明存在一些基本问题, 又很难通过直接打上补丁修复完善, 因此"
    "译者自行编制了一个证明, 其已经尽量在精神上与原文保持一致." (Br)
    "如果" (&= $M $0) ", 那么" $M "本身就具有规范形式, 无需证明. 如果"
    (&!= $M $0) ", 我们想要(通过初等行变换和初等列变换)将其化为与之等价的形式"
    (MB (&= $M^ (Mat ($f_1 $0 $..c $0)
                     ($0 $ $ $)
                     ($..v $ $R $)
                     ($0 $ $ $))))
    "其中首项系数为一的多项式" $f_1 "整除矩阵" $R "的每个元素. 若我们的确能够施行此项操作, "
    "实际上证明就结束了. 这是因为我们可以再次将该过程应用于" $R
    "以得到多项式" $f_2 ", 并且我们知道" $f_1 "整除" $f_2
    ". 不断迭代下去, 我们最终将抵达所需的规范形式." (Br)
    "令" (&= (app $l $M) (mini (&!= (mref $M $i $j) $0) (&deg (mref $M $i $j))))
    ". 为了简单起见, 我们将以归纳法叙述证明. 如果" (&= (app $l $M) $0)
    ", 这是显然的, 因为此时" $M "具有某个标量元素, 只需将其化为" $1
    "然后移动到左上角, 最后消去第一列和第一行的其他元素即可. 对于" (&> (app $l $M) $0)
    ", 我们令" (&= $k (app $l $M)) ", 并作归纳假设: 对于任意的矩阵" (∈ $N (^ polyF m*n))
    ", 如果" (&< (app $l $N) $k) ", 那么我们可以运用初等行变换和初等列变换将其化为"
    "我们想要的形式. 现在我们找出矩阵" $M "中一个具有最低次数的元素, 然后将其移动到左上角来. "
    "我们可以通过初等行变换将第一列除第一行以外的元素化为其除以第一行元素的余式. "
    "若余式不均为零, 那么整个矩阵的元素的最低次数就减小了, 运用归纳假设即可. 否则的话, "
    "我们将注意力放到第一行上来. 如法炮制, 我们可以通过初等列变换将第一行除了第一列以外的"
    "元素化为其除以第一列元素的余式. 若存在不为零的余式, 则又可使用归纳假设. 如果"
    "上面两个手段失效了, 此时第一行和第一列除左上角元素外均已化为零. 那么, 左上角的元素"
    "是否整除右下角的" (&c* (@- $m $1) (@- $n $1)) "分块矩阵的每个元素呢? 如果是, "
    "那么就结束了. 否则的话, 即存在某个元素不能被左上角整除, 我们将包含该元素的列加到第一列"
    "上去. 明显地, 我们再次将第一列除了第一行之外的元素化为其除以第一行元素的余式. "
    "此时可以肯定某个余式不为零, 即我们创造了利用归纳假设的条件. 至此证明全然结束了." (Br)
    "最后我们还想顺便说一句, 尽管这个以归纳法进行的证明似乎是声明性的, 但是实际上"
    "其已足够指导我们施行一个" (Ruby "过程" (Rt "算法")) "来将矩阵化为我们所需要的形式, "
    "或者说其可以导出一个这样的过程. 或许, 这是因为归纳和递归天然就是类似的.")
   (P "我们想要表明与一个矩阵" $M "相关联的规范形式是唯一的. 我们已经见过的两件事实"
      "提供了定理9中的多项式" (&cm $f_1 $..h $f_l) "何以被" $M "唯一确定的线索. "
      "首先, 初等行变换和初等列变换至多改变一个方阵的行列式以非零的标量因子. 其次, "
      "初等行变换和初等列变换不会改变矩阵的元素的最大公因子. "
      "[译注: 实际上, 这两个事实之间的关系是递进的, 而后者才是真正的线索. "
      "以下我们将证明, 确定了矩阵的Smith规范形式的不变因子"
      " (即规范形式的主对角线上的元素) 可由所谓的行列式因子决定.]")
   ((definition)
    "令" (∈ $M (^ polyF m*n)) ", 如果" (&<= $1 $k (&min $m $n))
    ", 我们将" (&delta_k $M) "定义为" $M "的所有" (&c* $k $k)
    "子矩阵的行列式的最大公因子. "
    "[译注: 在许多中文教材中, " (&c* $k $k) "的子矩阵的行列式常被称为" $k
    "阶子式, 而" (&delta_k $M) "常被称为" $M "的" $k "阶行列式因子. "
    "值得注意的是, 某一阶的子式可能全部为零, 此时的行列式因子要么设为未定义的, "
    "要么就定义为零.]")
   (P "回忆一下, " $M "的一个" (&c* $k $k) "子矩阵是将" $M "的某" (&- $m $k)
      "行和某" (&- $n $k) "列删去得到的东西. 换言之, 我们挑选了两个特定的" $k "元组"
      (MB (set-left
           (&Table
            ($I $= (tu0 $i_1 $..h $i_k)
                (: $cm (&< (&<= $1 $i_1) $..c (&<= $i_k $m))))
            ($J $= (tu0 $j_1 $..h $j_k)
                (: $cm (&< (&<= $1 $j_1) $..c (&<= $j_k $n)))))))
      "然后由" $M "的这些行和列构造了矩阵. 我们感兴趣的是行列式"
      (MB (&= (subdet $I $J $M)
              (ap $det
                  (Mat ((mref $M $i_1 $j_1) $..c (mref $M $i_1 $j_k))
                       ($..v $ $..v)
                       ((mref $M $i_k $j_1) $..c (mref $M $i_k $j_k))))) ".")
      "多项式" (&delta_k $M) "是诸多项式" (subdet $I $J $M)
      "的最大公因子, 其中" $I "和" $J "遍历所有可能的前述" $k "元组.")
   ((theorem #:n "10")
    "如果" (∈ $M $N (^ polyF m*n)) "是等价的矩阵, 那么"
    (MB (&cm (&= (&delta_k $M) (&delta_k $N))
             (&<= $1 $k (&min $m $n))) "."))
   ((proof)
    "实际上证明单次初等行变换" $e "不会改变" $delta_k
    "就够了, 而又因为" $e "是可逆的, 所以我们只需要证明: 对于每个" $k
    "而言, 如果多项式" $f "整除所有" (subdet $I $J $M) ", 那么" $f "整除所有"
    (subdet $I $J (app $e $M)) ", 其中" (&cm $I $J)
    "是一切可能的前述" $k "元组." (Br)
    "既然我们在考虑行变换, 令" (&cm $alpha_1 $..h $alpha_m) "是" $M
    "的行, 并且我们采用记号"
    (MB (&= (subdetC $J (_ $alpha $i_1) $..h (_ $alpha $i_k))
            (subdet $I $J $M)) ".")
    "[译注: 严格说来, 这个定义方式稍有问题, 但是记号的含义还算是明确, "
    "即以这些行构造矩阵, 取" $J "指定的列来构造子矩阵, 最后计算其行列式.] "
    "给定" $I "和" $J ", " (subdet $I $J $M) "和" (subdet $I $J (app $e $M))
    "之间有什么关系呢? 考虑变换" $e "的三种类型:"
    (Ol #:attr* '((type "a"))
        (Li "给第" $r "行乘上一个非零标量" $c ";")
        (Li "将第" $r "行替换为第" $r "行加上" $g "倍的第" $s
            "行, 其中" (&!= $r $s) ";")
        (Li "交换第" $r "行和第" $s "行, 其中" (&!= $r $s) "."))
    "暂时忘掉类型c的操作, 让我们专注于类型a和b, 其仅改变第" $r
    "行. 如果" $r "不在下标" (&cm $i_1 $..h $i_k) "之中, 那么显然"
    (MB (&= (subdet $I $J (app $e $M)) (subdet $I $J $M)) ".")
    "如果" $r "在下标" (&cm $i_1 $..h $i_k)
    "之中, 那么对于这两种类型的操作我们有"
    (Ol #:attr* '((type "a"))
        (Li (eqnderiv (subdet $I $J (app $e $M))
                      (subdetC $J (_ $alpha $i_1) $..h
                               (&i* $c $alpha_r)
                               $..h (_ $alpha $i_k))
                      (&i* $c (subdetC $J (_ $alpha $i_1) $..h
                                       $alpha_r
                                       $..h (_ $alpha $i_k)))
                      (&i* $c (subdet $I $J $M))))
        (Li (eqnderiv (subdet $I $J (app $e $M))
                      (subdetC $J (_ $alpha $i_1) $..h
                               (&+ $alpha_r (&i* $g $alpha_s))
                               $..h (_ $alpha $i_k))
                      (&+ (subdet $I $J $M)
                          (&i* $g (subdetC $J (_ $alpha $i_1) $..h
                                           $alpha_s
                                           $..h (_ $alpha $i_k)))))))
    "对于类型a的操作, 显然任意整除" (subdet $I $J $M) "的多项式" $f
    "也整除" (subdet $I $J (app $e $M)) ". 对于类型c的操作的情况, 注意到"
    (Ol (Li "如果存在" $j "使得" (&= $s $i_j) ", 那么"
            (&= (subdetC $J (_ $alpha $i_1) $..h
                         $alpha_s $..h (_ $alpha $i_k)) $0) ";")
        (Li "否则的话, 即对于所有" $j "都是" (&!= $s $i_j) ", 那么"
            (&= (subdetC $J (_ $alpha $i_1) $..h
                         $alpha_s $..h (_ $alpha $i_k))
                (&+- (subdet $I^ $J $M))) "."))
    "这个" $I^ "是将" $k "元组" (tu0 $i_1 $..h $s $..h $i_k)
    "按照升序重新排列得到的. 应该很明了的是, 如果" $f
    "整除每个" (subdet $I $J $M) ", 那么" $f "整除每个"
    (subdet $I $J (app $e $M)) ". [译注: 这里的" (&cm $I $J)
    "就不是给定的两个" $k "元组了, 而是所有可能的情况.]" (Br)
    "对于类型c操作的情况, 大致上也可遵循相同的论证手段, 或者说实际上"
    "其可以被实现为类型a和b操作的组合.")
   ((corollary)
    "每个矩阵" (∈ $M (^ polyF m*n)) "都恰等价于一个具有规范形式的"
    $N ". 出现在" $N "的主对角线上的多项式" (&cm $f_1 $..h $f_l) "为"
    (MB (&cm (&= $f_k (~ (&delta_k $M)
                         (app (_ $delta (&- $k $1)) $M)))
             (&<= $1 $k (&min $m $n))))
    "其中为了方便起见, 我们定义" (&= (app $delta_0 $M) $1) ".")
   ((proof)
    "如果规范形式" $N "以" (&cm $f_1 $..h $f_l)
    "为对角线元素, 那么很容易看出来"
    (MB (&= (&delta_k $N) (&i* $f_1 $f_2 $..c $f_k)) "."))
   ((tcomment)
    "这个推论及其证明大体上是正确的, 就是有点粗糙. "
    "问题在于, 可能存在某个" $k "使得所有" $k
    "阶子式都为零. (当然, 对于每个" (&>= $k^ $k)
    ", " $k^ "阶子式也都为零.) 至于如何细致地解决这个问题, "
    "也就是说将推论及其证明陈述得圆满, 那就留给读者了.")
   (P "当然了, 我们将推论中的矩阵" $N "称为" $M
      "的" (B "规范形式") ". 多项式" (&cm $f_1 $..h $f_l)
      "常被称为" $M "的" (B "不变因子") ".")
   (P "设" (∈ $A (^ $F n*n)) "而令" (&cm $p_1 $..h $p_r)
      "是" $A "的不变因子. 现在我们可以看出矩阵" (&- (&i* $x $I) $A)
      "的规范形式的对角线元素依次是" (&cm $1 $1 $..h $1 $p_r $..h $p_1)
      ". 前面的推论告诉我们如何基于" (&- (&i* $x $I) $A)
      "的子矩阵 [译注: 其实就是各阶行列式因子] 来表达"
      (&cm $p_1 $..h $p_r) ". 数字" (&- $n $r) "是"
      (maxi (setI (∈ $k (setE $1 $..h $n))
                  (&= (&delta_k (&- (&i* $x $I) $A)) $1)))
      ". " $A "的极小多项式" $p_1 "是" $A "的特征多项式除以"
      (&- (&i* $x $I) $A) "的所有" (&c* (@- $n $1) (@- $n $1))
      "的子矩阵的最大公因子 [译注: 也就是" (@- $n $1)
      "阶行列式因子], 诸如此类.")
   ((exercise #:n "1")
    "对还是错? 每个" (^ polyF m*n) "中的矩阵都行等价于一个上三角矩阵.")
   ((exercise #:n "2")
    "令" $T "是有限维向量空间上的一个线性算子, " $A "是" $T
    "在某个有序基下的矩阵, 那么" $T "拥有循环向量当且仅当" (@- (&i* $x $I) $A)
    "的各" (&c* (@- $n $1) (@- $n $1)) "子矩阵的行列式互素.")
   ((exercise #:n "3")
    "令" (∈ $A (^ $F n*n)) ", 设" (&cm $f_1 $..h $f_n)
    "是" (&- (&i* $x $I) $A) "的规范形式的对角线元素. 对于什么样的矩阵"
    $A "有" (&!= $f_1 $1) "呢?")
   ((exercise #:n "4")
    "构造一个以" (&i* $x^2 (^ (@- $x $1) $2)) "为极小多项式且以"
    (&i* $x^3 (^ (@- $x $1) $4)) "为特征多项式的线性算子" $T
    ". 描述" $T "下对于向量空间的准素分解, 并找出投影至这些不变子空间的算子. "
    "找到一个基使得" $T "的表示矩阵呈现Jordan形式. 最后, 显式给出定理3"
    "中的循环分解 (其将向量空间分解为" $T "循环子空间的直和), 并求出不变因子.")
   ((exercise #:n "5")
    "令" $T "是" $RR^8 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (&= $A (MatR (1 1 1 1 1 1 1 1)
                     (0 0 0 0 0 0 0 1)
                     (0 0 0 0 0 0 0 -1)
                     (0 1 1 0 0 0 0 1)
                     (0 0 0 1 1 0 0 0)
                     (0 1 1 1 1 1 0 1)
                     (0 -1 -1 -1 -1 0 1 -1)
                     (0 0 0 0 0 0 0 0))))
    "表示."
    (Ol #:attr* '((type "a"))
        (Li "找出特征多项式和不变因子.")
        (Li "找出" $RR^8 "在" $T "下的准素分解以及相应的那些投影. "
            "对于准素分解的每个直和分量, 找出如定理3那样的循环分解.")
        (Li "找出" $A "的Jordan形式.")
        (Li "如定理3那样, 将" $RR^8 "分解为" $T
            "循环子空间的直和. (提示: 一种做法是使用b的结果并对于例子4"
            "中所讨论的想法进行适当泛化.)")))
   (H3 "第7.5节 总结; 半单算子")
   (P "在前一章和本章中, 我们一直在处理有限维向量空间" $V
      "上的单独一个线性算子" $T ". 既定的流程在于将" $T
      "分解为比较简单的线性算子的直和, 这是为了获得" $T
      "是如何在空间" $V "上进行&quot;操作&quot;的详细信息. "
      "让我们简要回顾一下现在我们所立之地.")
   (P "最初我们使用特征值和特征向量来研究" $T
      ". 我们引入了可对角化算子的概念, 其可以基于特征值和特征向量"
      "被完全刻画. 接着, 我们观察到" $T "可能连一个特征向量都没有. "
      "即便是标量域为代数闭域的情形, 此时每个线性算子都至少拥有一个"
      "特征向量, 我们注意到这些" $T "的特征向量也未必能够张成整个空间.")
   (P "于是, 我们证明了循环分解定理, 将任意的线性算子表达为拥有循环向量"
      "的算子的直和, 这无需对于标量域进行任何假定. 如果" $U
      "是拥有循环向量的一个线性算子, 那么存在一个基"
      (setE $alpha_1 $..h $alpha_n) "满足"
      (MB (set-left
           (&Table
            ((&cm (&= (ap $U $alpha_j) (_ $alpha (&+ $j $1)))
                  (&= $j (&..cm $1 $n-1))))
            ((&= (ap $U $alpha_n)
                 (&- (&- (&i* $c_0 $alpha_1))
                     (&i* $c_1 $alpha_2) $..c
                     (&i* (_ $c $n-1) $alpha_n)))))))
      $U "在这个基上的作用为将每个" $alpha_j "偏移为下一个向量"
      (_ $alpha (&+ $j $1)) ", 除了" (ap $U $alpha_n)
      "是基中这些向量的某个线性组合. 既然一般的线性算子" $T
      "都是有限数目的这样的线性算子" $U "的直和, 我们可以得到对于"
      $T "的作用的一种显式而又相当简单的描述.")
   (P "接下来我们将循环分解定理应用于幂零算子. 在标量域为代数闭域的情形下, "
      "我们将其与准素分解定理相结合, 可以得到所谓的Jordan形式. Jordan形式给出了空间"
      $V "的一个基" (setE $alpha_1 $..h $alpha_n) ", 其使得对于每个" $j
      ", 要么" (ap $T $alpha_j) "是" $alpha_j "的标量倍数, 要么"
      (&= (ap $T $alpha_j) (&+ (&i* $c $alpha_j) (_ $alpha (&+ $j $1))))
      ". 这样的一个基当然以一种显式而又简单的方式刻画了" $T "的作用.")
   (P "有理形式 (或者Jordan形式) 的重要性在于其存在性, 而非其在特定情形下"
      "可以被计算出来. 当然了, 如果给定一个线性算子并可计算其循环形式 "
      "[译注: 也就是有理形式] 或者Jordan形式, 那就是应该要做的事情. "
      "这是因为, 若是我们拥有如此形式, 则可一口气报出大量关于" $T
      "的信息. 标准形式的计算之中会出现两种不同类型的困难. 一种困难当然是"
      "计算可能会过于冗长. 另一种困难在于即便拥有必要的时间和耐心, "
      "可能也没有任何方法能够施行意图的计算. 比如说, 第二种类型的困难"
      "出现于尝试计算一个复矩阵的Jordan形式时. 鉴于分解特征多项式并无"
      "良定的方法, 因而读者可能在问题的外围就卡住了. 不过, 我们的确在"
      "第7.4节表明了存在一个找出给定" n*n "矩阵的有理形式的算法. 然而, "
      "这样的计算通常都是极其繁琐的. [译注: 当然, 就译者所处的时代而言, "
      "读者完全可以使用计算机来施行这种计算.]")
   (P "在以上我们对于本章和前一章的总结中, 我们尚未提及一个我们已经"
      "证明了的定理. 这个定理是说, 如果" $T "是某个代数闭域上的向量空间上"
      "的线性算子, 那么其可以被唯一地分解为相互交换的一个可对角化算子"
      "和一个幂零算子之和. 这个结果是由准素分解定理和关于可对角化算子"
      "的特定信息推得的. 它不像循环分解定理或者Jordan形式的存在性那样深刻, "
      "但是它的确在特定的数学部分里有着重要的用途. 为了给本章作结, "
      "我们将证明了一个类似的定理, 但不假定标量域为代数闭域. "
      "我们先来定义一种算子, 其将扮演着与可对角化算子类似的角色.")
   ((definition)
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是"
    $V "上的一个线性算子. 我们称" $T "是" (B "半单 (semi-simple) ")
    "的, 如果每个" $T "不变的子空间都拥有一个与之互补的" $T
    "不变的子空间.")
   (P "我们要证明的是, 只需要对于域" $F "作出一些限制, 那么每个线性算子"
      $T "都可以被唯一地表示为" (&= $T (&+ $S $N))
      "的形式, 其中" $S "是半单的, " $N "是幂零的, 而且"
      (commute* $S $N) ". 首先, 我们将要通过极小多项式来"
      "刻画半单算子, 而这种刻画将表明, 当" $F "是代数闭域时, "
      "一个线性算子是半单的当且仅当其是可对角化的.")
   ((lemma)
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 令"
    (&= $V (&d+ $W_1 $..c $W_k)) "是" $T
    "的准素分解. 换言之, 如果" $p "是" $T "的极小多项式而"
    (&= $p (&i* (_^ $p $1 $r_1) $..c (_^ $p $k $r_k)))
    "是" $p "的素因子分解, 那么" $W_j "是"
    (app (_^ $p $j $r_j) $T) "的零空间. 令" $W "是" $V
    "的任意在" $T "下不变的子空间, 那么"
    (MB (&= $W (&d+ (@cap $W $W_1) $..c
                    (@cap $W $W_k))) "."))
   ((proof)
    "为了证明这个引理, 我们需要回忆一下第6.8节中我们对于"
    "准素分解定理的证明的一个推论. 如果" (&..cm $E_1 $E_k)
    "是与分解" (&= $V (&d+ $W_1 $..c $W_k))
    "对应的投影, 那么每个" $E_j "都是应用某个多项式于" $T
    "的结果. 也就是说, 存在多项式" (&..cm $h_1 $h_k)
    "使得" (&= $E_j (app $h_j $T)) "." (Br)
    "现在令" $W "是在" $T "下不变的一个子空间. 如果"
    (∈ $alpha $W) ", 那么" (&= $alpha (&..+ $alpha_1 $alpha_k))
    ", 其中" (∈ $alpha_j $W_j) ". 既然"
    (&= $alpha_j (app $E_j $alpha) (ap (app $h_j $T) $alpha))
    "并且" $W "在" $T "下不变, 每个" $alpha_j "也在" $W
    "之中. 因此, 每个" (∈ $alpha $W) "都具有"
    (&= $alpha (&..+ $alpha_1 $alpha_k)) "的形式, 其中"
    (∈ $alpha_j (&cap $W $W_j)) ". 这个表达方式当然是唯一的, 鉴于"
    (&= $V (&..d+ $W_1 $W_k)) ". 也就是说, 我们得到了"
    (MB (&= $W (&d+ (@cap $W $W_1) $..c
                    (@cap $W $W_k))) "."))
   ((lemma)
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 设" $T
    "的极小多项式在标量域" $F "上不可约, 那么" $T "是半单的.")
   ((proof)
    "令" $W "是" $V "的一个在" $T "下不变的子空间, 我们必须要证明"
    $W "拥有一个与之互补的" $T "不变子空间. 根据定理3的一个推论, "
    "实际上证明{如果多项式" $f "和向量" (∈ $beta $V) "满足"
    (∈ (ap (app $f $T) $beta) $W) ", 那么存在" (∈ $alpha $W)
    "使得" (&= (ap (app $f $T) $beta) (ap (app $f $T) $alpha))
    "}就足够了. 于是, 设" (∈ $beta $V) "和多项式" $f "满足"
    (∈ (ap (app $f $T) $beta) $W) ". 若" (&= (ap (app $f $T) $beta) $0)
    ", 令" (&= $alpha $0) ", 那么" (∈ $alpha $W) "并且"
    (&= (ap (app $f $T) $beta) (ap (app $f $T) $alpha))
    ". 若" (&!= (ap (app $f $T) $beta) $0) ", 那么" $f
    "不被" $T "的极小多项式" $p "整除. 既然" $p "是素多项式, 那么"
    $f "和" $p "是互素的. 也就是说, 存在多项式" $g "和" $h
    "使得" (&= (&+ (&i* $f $g) (&i* $p $h)) $1) ". 因为"
    (&= (app $p $T) $0) ", 我们就有" (&= (&i* (app $f $T) (app $g $T)) $I)
    ", 而这又能推出" $beta "必然在子空间" $W "之中, 鉴于"
    (eqnderiv $beta (ap (&i* (app $g $T) (app $f $T)) $beta)
              (app (app $g $T) (ap (app $f $T) $beta)))
    "其中" (∈ (ap (app $f $T) $beta) $W) "而" $W "在" $T
    "下不变. 取" (&= $alpha $beta) "即可.")
   ((theorem #:n "11")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 那么" $T
    "为半单算子的充要条件是" $T "的极小多项式" $p "具有"
    (&= $p (&..i* $p_1 $p_k)) "的形式, 其中" (&..cm $p_1 $p_k)
    "是互异的标量域" $F "上的不可约多项式. [译注: 虽然没有显式说明, 但是"
    (&..cm $p_1 $p_k) "当然默认是非标量且首项系数为一的了.]")
   ((proof)
    "设" $T "是半单算子, 我们将证明在对于极小多项式" $p
    "的素因子分解中, 没有不可约多项式会重复出现. 假设其否定成立, "
    "那么存在某个非标量的首项系数为一多项式" $g "满足" $g^2 "整除"
    $p ". 令" $W "是算子" (app $g $T) "的零空间, 那么" $W "在"
    $T "下不变. 现在对于某个多项式" $h "有" (&= $p (&i* $g^2 $h))
    ", 既然" $g "并非标量多项式, 那么算子" (&i* (app $g $T) (app $h $T))
    "并非零算子. 于是, 存在" (∈ $beta $V) "使得"
    (&!= (ap (&i* (app $g $T) (app $h $T)) $beta) $0)
    ", 即" (&!= (ap (@i* $g $h) $beta) $0) ". 虽然"
    (∈ (ap (@i* $g $h) $beta) $W) ", 鉴于"
    (&= (app $g (ap (&i* $g $h) $beta))
        (ap (&i* $g^2 $h) $beta)
        (ap $p $beta) $0)
    ", 但是并无" (∈ $alpha $W) "能够使得"
    (&= (ap (&i* $g $h) $beta) (ap (&i* $g $h) $alpha))
    ". 这是因为, 如果" (∈ $alpha $W) ", 那么"
    (MB (&= (ap (@i* $g $h) $alpha)
            (ap (@i* $h $g) $alpha)
            (app $h (ap $g $alpha))
            (app $h $0) $0) ".")
    "也就是说, " $W "没有与之互补的" $T "不变子空间, 这与"
    $T "是半单算子的假设矛盾." (Br)
    "现在设" $p "的素因子分解为" (&= $p (&..i* $p_1 $p_k))
    ", 其中" (&..cm $p_1 $p_k) "是互异的不可约(非标量)"
    "首项系数为一的多项式. [译注: 作者似乎终于回想起来第"
    "4章里不可约多项式和素多项式是两个不同的概念.] 令"
    $W "是" $V "的一个在" $T "下不变的子空间, 我们将证明"
    $W "拥有一个与之互补的" $T "不变的子空间. 令"
    (&= $V (&..d+ $W_1 $W_k)) "是" $T "的准素分解, 即令"
    $W_j "是" (app $p_j $T) "的零空间. 令" $T_j "是"
    $T "于" $W_j "上由限制导出的算子, 于是" $T_j
    "的极小多项式为素多项式" $p_j ". 现在" (&cap $W $W_j)
    "是" $W_j "的一个在" $T_j "下 (或者说在" $T
    "下) 不变的子空间. 根据前面的第二条引理, 存在" $W_j
    "的一个在" $T_j "下不变的子空间" $V_j "使得"
    (&= $W_j (&d+ (@cap $W $W_j) $V_j))
    ". 当然, 既然" $V_j "在" $T_j "下不变, 其肯定也在"
    $T "下不变. 那么, 我们有"
    (eqnderiv $V (&..d+ $W_1 $W_k)
              (&d+ (@cap $W $W_1) $V_1 $..c
                   (@cap $W $W_k) $V_k)
              (&..d+ (bra0 (&..d+ (@cap $W $W_1)
                                  (@cap $W $W_k)))
                     $V_1 $V_k))
    "根据之前的第一条引理, 我们知道"
    (&= $W (&..d+ (@cap $W $W_1) (@cap $W $W_k)))
    ". 于是, 若令" (&= $W^ (&..d+ $V_1 $V_k))
    ", 那么" (&= $V (&d+ $W $W^)) "且"
    $W^ "在" $T "下不变.")
   ((corollary)
    "如果" $T "是某个代数闭域上的有限维向量空间上的线性算子, 那么"
    $T "是半单的当且仅当" $T "是可对角化的.")
   ((proof)
    "如果标量域" $F "是代数闭域, 那么" $F "上的首项系数为一的素多项式都具有"
    (&- $x $c) "的形式. 在这种情况下, " $T "是半单算子当且仅当" $T
    "的极小多项式为" (&= $p (&..i* (@- $x $c_1) (@- $x $c_k)))
    ", 其中" (&..cm $c_1 $c_k) "是" $F "的不同元素, 而这恰恰就是我们在第6章建立的刻画"
    $T "为可对角化算子的准则.")
   (P "我们应该指出, " $T "是半单算子当且仅当存在某个多项式" $f
      ", 其是不同的素多项式之积, 使得" (&= (app $f $T) $0)
      ". 这仅是与极小多项式为不同的素多项式之积的条件在表面上有所区别. "
      "[译注: 这里说的不同, 更准确地说, 实际上是互素, 因为我们不计标量缩放的差异.]")
   (P "现在我们将注意力转移到将线性算子表示为交换的半单算子与幂零算子之和的问题上来. "
      "在这里, 我们要限制标量域为复数域的一个子域. 机敏的读者可能会看出来"
      "要义在于域" $F "应该是一个特征为零的域. 也就是说, 对于每个正整数" $n
      ", " $F "中的和" (&..+ $1 $1) " (" $n "个" $1 "相加) 不应该为" $0 ". 对于域"
      $F "上的多项式" $f ", 我们用" (^ $f (@ $k)) "代表" $f "的" $k
      "阶形式导数. 换一种记号的话, 就是" (&= (^ $f (@ $k)) (ap $D^k $f))
      ", 其中" $D "是多项式空间上的形式微分算子. 如果" $g "是另一个域"
      $F "的多项式, 那么我们用" (app $f $g) "代表应用" $f "于" $g
      "的结果, 即由应用多项式" $f "于线性代数" polyF "中的元素" $g
      "得到的多项式. [译注: 应用域" $F "上的多项式于域" $F
      "上的含幺元的线性代数的元素的操作在第4章中被定义, 当然这里的域"
      "不需要什么额外的限制.]")
   ((lemma #:n ". Taylor公式")
    "令" $F "是一个特征为零的域, " $g "和" $h "是域" $F "上的多项式. 如果"
    $f "也是域" $F "上的多项式并且" (&<= (&deg $f) $n) ", 那么"
    (MB (&= (app $f $g)
            (sum (&= $k $0) $n
                 (&i* (~ $1 (&fact $k))
                      (app (^ $f (@ $k)) $h)
                      (^ (@- $g $h) $k)))) ".")
    "[译注: 这个实际上是第4章最后一节的某个练习.]")
   ((proof)
    "我们要证明的是一般化了的Taylor公式. 若令"
    (&= $h $c) "而" (&= $g $x) ", 我们则可得到原本的公式, 即"
    (MB (&= $f (app $f $x)
            (&+ (app $f $c)
                (&i* (app (^ $f (@ $1)) $c) (@- $x $c))
                (&i* (~ (app (^ $f (@ $2)) $c) (&fact $2))
                     (^ (@- $x $c) $2))
                $..c
                (&i* (~ (app (^ $f (@ $n)) $c) (&fact $n))
                     (^ (@- $x $c) $n)))) ".")
    "对于这一般公式的证明实际上只是二项式定理"
    (MB (&= (^ (@+ $a $b) $k)
            (&+ $a^k (&i* $k (^ $a (&- $k $1)) $b)
                (&i* (~ (&i* $k (@- $k $1)) (&fact $2))
                     (^ $a (&- $k $2)) $b^2)
                $..c $b^k)))
    "的一个应用. 读者应该看出来, 既然替换和微分是线性过程, 那么只需要对于"
    (&= $f $x^k) "的情况证明公式成立就足够了, 因为"
    (&= $f (sum (&= $k $0) $n (&i* $c_k $x^k)))
    "的一般情形可再由线性组合推得. 若" (&= $f $x^k)
    ", 其中" (&<= $k $n) ", 那么Taylor公式是在说"
    (MB (&= $g^k (&+ $h^k (&i* $k (^ $h (&- $k $1)) (@- $g $h))
                     (&i* (~ (&i* $k (@- $k $1)) (&fact $2))
                          (^ $h (&- $k $2))
                          (^ (@- $g $h) $2))
                     $..c (^ (@- $g $h) $k))))
    "这不过就是"
    (MB (&= $g^k (^ (bra0 (&+ $h (@- $g $h))) $k)))
    "的二项式展开而已. [译注: 对于" (&> $j $k) ", "
    (&= (^ $f (@ $j)) $0) ".]")
   ((tcomment)
    "&quot;替换和微分是线性过程&quot;是说对于任意的标量"
    $a "和" $b ", 对于任意的多项式" $f "和" $g
    ", 对于任意的非负整数" $k ", 我们有"
    (MB (&= (app (@LC $a $f $b $g) $h)
            (LC $a (bra0 (app $f $h))
                $b (bra0 (app $g $h)))))
    "以及"
    (MB (&= (^ (@LC $a $f $b $g) (@ $k))
            (LC $a (^ $f (@ $k))
                $b (^ $g (@ $k)))))
    "于是最终得到"
    (eqnderiv
     (LC $a (bra0 (app (^ $f (@ $k)) $h))
         $b (bra0 (app (^ $g (@ $k)) $h)))
     (app (bra0 (LC $a (^ $f (@ $k))
                    $b (^ $g (@ $k)))) $h)
     (app (^ (@LC $a $f $b $g) (@ $k)) $h)))
   ((lemma)
    "令" $F "是复数域的一个子域, " $f "是域" $F
    "上的一个首项系数为一的多项式, " $f^ "是" $f
    "的形式导数, 那么以下陈述是等价的:"
    (Ol #:attr* '((type "a"))
        (Li $f "的素因子分解中各项互异;")
        (Li $f "和" $f^ "互素;")
        (Li "若将" $f "视为域" $CC "上的多项式, "
            $f "没有重复的根.")))
   ((proof)
    "陈述a和b的等价性实际上就是第4章的定理11 (而且那里的域可以是任意的), "
    "所以不再赘述. 为了看出陈述c与a和b的等价性, 我们只需观察到以下事实. "
    "对于域" $F "上的多项式" $f "和" $g ", 它们作为域" $F
    "上的多项式而互素等价于其作为域" $CC "上的多项式而互素. "
    "我们将这个的证明留作练习. 取" (&= $g $f^) ", 注意到在" $f
    "被视为" $CC "上的多项式时, c就是a, 因而b和c是等价的.")
   ((tcomment)
    "这个观察到的事实可以通过带余除法的唯一性和辗转相除法说明.")
   (P "现在我们可以证明一个定理, 其使得半单算子和可对角化算子"
      "之间的关系更加明晰.")
   ((theorem #:n "12")
    "令" $F "是复数域的一个子域, " $V "是域" $F
    "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子, " $A "是" $T
    "在某个有序基下的表示矩阵, 那么" $T
    "是半单算子当且仅当" $A "在复数域上相似于一个对角矩阵.")
   ((proof)
    "令" $p "是" $T "的极小多项式. 根据定理11, " $T
    "为半单算子当且仅当" $p "在域" $F "上的素因子分解"
    (&= $p (&..i* $p_1 $p_k)) "中" (&..cm $p_1 $p_k)
    "互异. 根据前述引理, " $T "是半单算子当且仅当" $p
    "在复数域上没有重复的根." (Br)
    "当然, " $p "也是矩阵" $A "的极小多项式. [译注: 读者或许"
    "可以回忆一下, 极小多项式并不会因为域的扩张而改变.] "
    "我们知道" $A "在复数域上相似于一个对角矩阵当且仅当"
    "极小多项式没有重复的复根. 这就证明了定理12.")
   ((theorem #:n "13")
    "令" $F "是复数域的一个子域, " $V "是域" $F
    "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子, 那么存在" $V "上的半单算子" $S
    "和幂零算子" $N "使得"
    (Ol #:attr* '((type "i"))
        (Li (&= $T (&+ $S $N)) ";")
        (Li (commute* $S $N) "."))
    "而且, 半单算子" $S "和幂零算子" $N
    "可由i和ii唯一确定, 它们都是应用某个多项式于"
    $T "得到的结果.")
   ((proof)
    "令" (&..i* (_^ $p $1 $r_1) (_^ $p $k $r_k))
    "是" $T "的极小多项式的素因子分解, "
    (&= $f (&..i* $p_1 $p_k)) ", "
    (&= $r (&max $r_1 $..h $r_k)) ", 那么"
    $f "是互异的首项系数为一的素多项式之积, 且"
    $f^r "被" $T "的极小多项式整除, 于是"
    (MB (&= (app $f^r $T) $0) ".")
    "我们将要构造一个多项式序列"
    (&cm $g_0 $g_1 $g_2 $..h)
    "使得对于每个自然数" (&= $n (&cm $0 $1 $2 $..h)) ", 有"
    (MB (ap $f
            (pare
             (&- $x
                 (sum (&= $j $0) $n
                      (&i* $g_j $f^j))))))
    "被" (^ $f (&+ $n $1)) "整除. 我们取" (&= $g_0 $0) ", 那么"
    (&= (app $f (&- $x (&i* $g_0 $f^0))) (app $f $x) $f)
    "被" $f "整除. 设我们已经选定了"
    (&..cm $g_0 (_ $g (&- $n $1))) ", 令"
    (MB (&= $h (&- $x (sum (&= $j $0) (&- $n $1)
                           (&i* $g_j $f^j)))))
    "根据假设, " (app $f $h) "被" $f^n
    "整除. 我们想要找出一个" $g_n "使得"
    (MB (app $f (&- $h (&i* $g_n $f^n))))
    "被" (^ $f (&+ $n $1))
    "整除. 我们应用一般Taylor公式, 然后可以得到"
    (eqnderiv (app $f (&- $h (&i* $g_n $f^n)))
              (sum (&= $k $0) (&deg $f)
                   (&i* (~ $1 (&fact $k))
                        (app (^ $f (@ $k)) $h)
                        (^ (@- (&i* $g_n $f^n)) $k)))
              (&+ (&- (app $f $h)
                      (&i* $g_n $f^n (app $f^ $h)))
                  (&i* (^ $f (&+ $n $1)) $b)))
    "其中" $b "是某个多项式. [译注: 如果注意一下细节的话, 这里"
    (&>= (&deg $f) $1) "且" (&>= $n $1) ".] 根据假设, 存在多项式"
    $q "满足" (&= (app $f $h) (&i* $q $f^n))
    ". 因此, 为了使得" (app $f (&- $h (&i* $g_n $f^n)))
    "被" (^ $f (&+ $n $1)) "整除, 只需要选择令"
    (bra0 (&- $q (&i* $g_n (app $f^ $h)))) "被" $f
    "整除的" $g_n "就可以了, 这的确是可以做到的. 鉴于"
    (&..cm $p_1 $p_k) "互异, 所以" $f "和" $f^
    "互素. 也就是说, 存在多项式" $a "和" $e "满足"
    (&= (&+ (&i* $a $f) (&i* $e $f^)) $1)
    ". 将其应用于" $h ", 我们就得到"
    (MB (&= (&+ (&i* (app $a $h) (app $f $h))
                (&i* (app $e $h) (app $f^ $h)))
            $1) ".")
    "令" (&= $g_n (&i* $q (bra0 (app $e $h)))) ", 那么"
    (eqnderiv (&- $q (&i* $g_n (app $f^ $h)))
              (&- $q (&i* $q (bra0 (app $e $h))
                          (app $f^ $h)))
              (&i* $q (bra0 (app $a $h))
                   (app $f $h))
              (&i* $q^2 (bra0 (app $a $h)) $f^n))
    "即" (bra0 (&- $q (&i* $g_n (app $f^ $h))))
    "被" $f "整除. [译注: 这里的方括号仅是为了明示运算的顺序, "
    "而非应用多项式之意.]" (Br)
    "现在我们已经有了一个序列" (&cm $g_0 $g_1 $..h)
    "使得" (^ $f (&+ $n $1)) "整除"
    (ap $f
        (pare
         (&- $x
             (sum (&= $j $0) $n
                  (&i* $g_j $f^j)))))
    "并且" (&= $g_0 $0) ". 让我们取" (&= $n (&- $r $1))
    ", 既然" (&= (app $f^r $T) $0) ", 我们有"
    (MB (&= (ap $f (pare
                    (&- $T (sum (&= $j $0) (&- $r $1)
                                (&i* (app $g_j $T)
                                     (app $f^j $T))))))
            $0) ".")
    "[译注: 这里用到了"
    (&= (app (bra0 (app $f $g)) $T) (app $f (app $g $T)))
    "的事实.] 令"
    (MB (&= $N (sum (&= $j $1) (&- $r $1)
                    (&i* (app $g_j $T)
                         (app $f^j $T)))
            (sum (&= $j $0) (&- $r $1)
                 (&i* (app $g_j $T)
                      (app $f^j $T)))))
    "既然" (sum (&= $j $1) $n (&i* $g_j $f^j))
    "被" $f "整除, 我们看出来" (&= $N^r $0)
    ", 即" $N "是一个幂零算子. 令" (&= $S (&- $T $N))
    ", 那么" (&= (app $f $S) (app $f (&- $T $N)) $0)
    ". 鉴于" $f "是不同的首项系数为一的素多项式之积, 那么"
    $S "的极小多项式的素因子分解中也不可能出现重复的因子, 所以"
    $S "是半单的." (Br)
    "现在我们有" (&= $T (&+ $S $N)) ", 其中" $S
    "是一个半单算子, " $N "是一个幂零算子, 并且它们都是应用某个多项式于"
    $T "的结果, 因而是交换的. 为了证明唯一性的陈述, 让我们从标量域"
    $F "转移到复数域" $CC "上来考虑问题. 令" $BBB
    "是空间" $V "的某个有序基, 那么我们有"
    (MB (&= (coordm $T) (&+ (coordm $S) (coordm $N))))
    "其中" (coordm $S) "在复数域上是可对角化的, 而"
    (coordm $N) "是一个幂零矩阵, 并且它们还是交换的. "
    "根据第6章中我们已经证明了的结果, 这样的两个矩阵是唯一确定的.")
   ((tcomment)
    "实际上第6章只表述了线性算子的版本, 若将其写成矩阵的形式, "
    "则是以下定理.")
   ((theorem)
    "对于域" $F "上的" n*n "矩阵" $A ", 若" $A "的极小多项式可以在域"
    $F "上被分解为一次因子之积, 那么存在可对角化矩阵" (∈ $D (^ $F n*n))
    "和幂零矩阵" (∈ $N (^ $F n*n)) "满足"
    (Ol #:attr* '((type "i"))
        (Li (&= $A (&+ $D $N)) ";")
        (Li (commute* $D $N) "."))
    "其中可对角化矩阵" $D "和幂零矩阵" $N "由条件i和ii唯一确定, "
    "并且它们都是应用某个多项式于" $A "得到的结果.")
   ((exercise #:n "1")
    "对于标量域为复数域的一个子域的有限维向量空间" $V
    ", 如果" $N "是" $V "上的一个幂零线性算子, 那么对于任意的多项式"
    $f ", " (app $f $N) "的半单部分是恒等算子的一个标量倍数.")
   ((exercise #:n "2")
    "令" $F "是复数域的一个子域, " $V "是" $F "上的一个有限维向量空间, "
    $T "是" $V "上的一个半单线性算子. 如果" $f "是域" $F
    "上任意的一个多项式, 那么" (app $f $T) "也是半单的.")
   ((exercise #:n "3")
    "设标量域为复数域的一个子域, 对于向量空间上的一个线性算子"
    $T ", 证明" $T "是半单算子当且仅当对于任意的多项式" $f
    ", " (app $f $T) "是幂零算子可以推出" (&= (app $f $T) $0) ".")
   ))