#lang racket
(provide div:hoffman_ch6)
(require SMathML "linear_algebra_utils.rkt")
(define div:hoffman_ch6
  (TmDiv
   (H2 "第6章 初等标准形式")
   (H3 "第6.1节 引论")
   (P "之前我们已经提过我们的主要目的在于研究有限维向量空间上的线性变换. "
      "到目前为止, 我们已经见过了许多线性变换的特殊例子, 并且证明了一些"
      "关于一般线性变换的定理. 在有限维的情形我们利用有序基通过矩阵来表示"
      "这样的变换, 这种表示增添了我们对于其行为的直觉. 我们探索了向量空间"
      (&L $V $W) ", 其由从一个向量空间到另一个的线性变换构成. 我们也探索了"
      (&L $V $V) ", 其由从一个向量空间到自身的线性变换构成.")
   (P "在接下来的两章中, 我们将主要关心线性算子. 我们的流程是选取一个有限维向量空间" $V
      "上的单独的一个线性算子" $T ", 将它拆下来, 看看什么使其运转. 在这早期阶段, "
      "将我们的目标以矩阵的语言表述是最为简单的: 给定线性算子" $T ", 找出" $V "的一个有序基使得"
      $T "的矩阵呈现特别简单的形式.")
   (P "现在对于我们心中所想作一个基本的刻画. 或许最简单的矩阵, 除了恒等矩阵之外, 就是对角矩阵了:"
      (MB (&= $D (Mat ($c_1 $0 $0 $..c $0)
                      ($0 $c_2 $0 $..c $0)
                      ($0 $0 $c_3 $..c $0)
                      ($..v $..v $..v $ $..v)
                      ($0 $0 $0 $..c $c_n))))
      "令" $T "是一个" $n "维向量空间" $V "上的线性算子. 如果我们能够找到" $V
      "的一个有序基" basis:def "使得" $T
      "由上面的对角矩阵" $D "表示, 那么我们能够获得和" $T "有关的相当信息. 例如, 和"
      $T "有关的简单数字, 比如说" $T "和秩或者" $T "的行列式, 看一眼矩阵" $D
      "就能出来. 我们可以显式描述" $T "的像和零空间. 既然" (&= (coordm $T) $D)
      "当且仅当"
      (MB (&cm (&= (ap $T $alpha_k) (&i* $c_k $alpha_k)) (&= $k (&cm $1 $..h $n))))
      "那么像就是由那些" (&!= $c_k $0) "的" $alpha_k "张成的子空间, 零空间就是由剩下来的"
      $alpha_k "张成的. 似乎可以这样说, 如果我们知道了一个基" $BBB "和一个对角矩阵"
      $D "满足" (&= (coordm $T) $D) ", 那么我们就能轻易回答一切与" $T "有关的问题.")
   (P "是否每个线性算子都可以在某个有序基下表示为对角矩阵呢? 如果不是的话, 那么什么样的算子"
      $T "下这样的基存在呢? 如果存在这样的基的话, 那么我们又该怎么找到它呢? 如果这样的基"
      "不存在的话, 那么可以表示" $T "的最简单的矩阵类型是什么样的呢? 这些是我们将在本章 "
      "(和下一章) 解决的问题. 随着我们理解到其中的困难, 一些问题的形式也会变得更加复杂.")
   (H3 "第6.2节 特征值")
   (P "前一节的评注为我们提供了尝试分析一般线性算子" $T "的起点. 之前的线索暗示着我们应该研究"
      "这样的向量, 其由" $T "送至自身的标量倍数.")
   ((definition)
    "令" $V "是域" $F "上的向量空间而" $T "是" $V "上的线性算子. " $T "的一个特征值是一个"
    $F "中的标量" $c ", 存在" $V "中非零的向量" $alpha "使得" (&= (ap $T $alpha) (&i* $c $alpha))
    ". 如果" $c "是" $T "的特征值, 那么"
    (Ol #:attr* '((type "a"))
        (Li "任何满足" (&= (ap $T $alpha) (&i* $c $alpha)) "的向量" $alpha
            "都被称为" $T "在特征值" $c "下的特征向量.")
        (Li "所有满足" (&= (ap $T $alpha) (&i* $c $alpha)) "的向量" $alpha
            "构成的集合被称为" $T "在特征值" $c "下的特征空间.")))
   (P "特征值 (characteristic value) 也被称为特征根 (characteristic root), 隐式根 (latent root), "
      "特征值 (eigenvalue), 特征值 (proper value) 或者谱值 (spectral value). 本书我们将只使用"
      "&quot;特征值 (characteristic value)&quot;这个名字.")
   (P "如果" $T "是任意的线性算子而" $c "是任意的标量, 所有满足" (&= (ap $T $alpha) (&i* $c $alpha))
      "的向量" $alpha "的集合是" $V "的子空间, 实际上它就是线性变换" (@- $T (&i* $c $I))
      "的零空间. 我们称" $c "是" $T "的特征值, 如果该子空间异于零子空间, 即" (@- $T (&i* $c $I))
      "不是单射的. 在" $V "是有限维的情况下, " (@- $T (&i* $c $I)) "不是单射恰当其行列式等于零.")
   ((theorem #:n "1")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $c "是一个标量, 那么以下是等价的."
    (Ol #:attr* '((type "i"))
        (Li $c "是" $T "的特征值.")
        (Li "算子" (@- $T (&i* $c $I)) "是奇异的 (不可逆的).")
        (Li (&= (&det (&- $T (&i* $c $I))) $0) ".")))
   (P "行列式判则iii是非常重要的, 因为它告诉我们从哪里寻找" $T "的特征值. 既然"
      (&det (&- $T (&i* $c $I))) "是对于变量" $c "的" $n "次多项式, 那么我们所求的特征值就是"
      "该多项式的根. 让我们仔细解释这个想法.")
   (P "如果" $BBB "是" $V "的基并且" (&= $A (coordm $T)) ", 那么" (@- $T (&i* $c $I))
      "可逆当且仅当矩阵" (@- $A (&i* $c $I)) "可逆. 据此, 我们有如下定义.")
   ((definition)
    "如果" $A "是域" $F "上的一个" n*n "矩阵, 那么" $A "的一个在" $F "中的特征值是一个" $F
    "中标量" $c "满足矩阵" (@- $A (&i* $c $I)) "是奇异的 (不可逆的).")
   (P "既然" $c "是" $A "的特征值当且仅当" (&= (&det (&- $A (&i* $c $I))) $0) "或者等价地当且仅当"
      (&= (&det (&- (&i* $c $I) $A)) $0) ", 我们构造以多项式为元素的矩阵" (@- (&i* $x $I) $A)
      "并考虑多项式" (&= $f (&det (&- (&i* $x $I) $A))) ". 显然" $A "在" $F "中的特征值不过就是"
      $F "中满足" (&= (app $f $c) $0) "的标量" $c ". 出于这样的原因" $f "被称为" $A "的特征多项式. "
      "注意到" $f "是一个次数恰为" $n "的首项系数为一的多项式是重要的. 这很容易从基于元素的矩阵的行列式"
      "公式中看出来.")
   ((lemma)
    "相似矩阵拥有相同的特征多项式.")
   ((proof)
    "如果" (&= $B (&i* (inv $P) $A $P)) ", 那么"
    (let* ((cm (lambda (A) (&- (&i* $x $I) A)))
           (cp (lambda (A) (&det (cm A)))))
      (MB (deriv (cp $B)
                 (cp (&i* (inv $P) $A $P))
                 (&det (&i* (inv $P) (@ (cm $A)) $P))
                 (&d* (ap $det (inv $P)) (cp $A) (ap $det $P))
                 (cp $A)))))
   (P "这条引理允许我们将算子" $T "的特征多项式定义为任意在某个" $V "的有序基下表示" $T
      "的" n*n "矩阵的特征多项式. 正如矩阵一样, " $T "特征值就是" $T "的特征多项式的根. "
      "特别地, 这表明" $T "不可能拥有多于" $n "个不同的特征值. 我们也应该指出" $T
      "可能没有任何特征值.")
   ((example #:n "1")
    "令" $T "是" $RR^2 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (&= $A (Mat ($0 $-1) ($1 $0))))
    "表示. " $T " (或者" $A ") 的特征多项式为"
    (MB (&= (&det (&- (&i* $x $I) $A))
            (Det ($x $1) ($-1 $x))
            (&+ $x^2 $1)) ".")
    "既然这个多项式没有实根, 那么" $T "就没有特征值. 如果" $U "是" $CC^2
    "上的线性算子, 其在标准有序基下由" $A "表示, 那么" $U "就有两个特征值, "
    $i "和" (&- $i) ". 这里我们看到了微妙的一点. 在讨论一个矩阵" $A
    "的特征值时, 我们必须小心地规定所涉及的域. 上面的矩阵" $A "在" $RR
    "中没有特征值, 但在" $CC "中有两个特征值" $i "和" (&- $i) ".")
   ((example #:n "2")
    "令" $A "是" (&c* $3 $3) "的(实)矩阵"
    (MB (Mat ($3 $1 $-1) ($2 $2 $-1) ($2 $2 $0)) ".")
    "那么" $A "的特征多项式为"
    (MB (&= (Det ((&- $x $3) $-1 $1)
                 ($-2 (&- $x $2) $1)
                 ($-2 $-2 $x))
            (: $x^3 $- (&i* $5 $x^2) $+ (&i* $3 $x) $- $4)
            (&i* (@- $x $1) (^ (@- $x $2) $2))) ".")
    "因此" $A "的特征值是" $1 "和" $2 "." (Br)
    "设" $T "是" $RR^3 "上的线性算子, 其在标准基下由" $A "表示. 让我们找出" $T
    "在特征值" $1 "和" $2 "下的特征向量. 现在"
    (MB (&= (&- $A $I) (Mat ($2 $1 $-1) ($2 $1 $-1) ($2 $2 $-1))))
    "显然一眼就可以看出" (&- $A $I) "的秩等于" $2 " (因此" (&- $T $I)
    "的零化度为" $1 "). 于是特征值" $1 "下的特征向量的空间是一维的. 向量"
    (&= $alpha_1 (tu0 $1 $0 $2)) "可以张成" (&- $T $I) "的零空间. 因此"
    (&= (ap $T $alpha) $alpha) "当且仅当" $alpha "是" $alpha_1
    "的标量倍数. 现在考虑"
    (MB (&= (&- $A (&i* $2 $I))
            (Mat ($1 $1 $-1) ($2 $0 $-1) ($2 $2 $-2))))
    "显然" (&- $A (&i* $2 $I)) "的秩也是" $2 ", 于是在特征值" $2
    "下的特征向量的空间维数是" $1 ". 显然" (&= (ap $T $alpha) (&i* $2 $alpha))
    "当且仅当" $alpha "是" (&= $alpha_2 (tu0 $1 $1 $2)) "的标量倍数.")
   ((definition)
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 我们称" $T "是可对角化的, 如果存在" $V
    "的一个基满足其中每个向量都是" $T "的特征向量.")
   (P "为什么要叫这个名字应该是很显然的, 因为如果存在" $V "的一个有序基"
      basis:def "满足每个" $alpha_i "都是" $T
      "的特征向量, 那么" $T "在有序基" $BBB "下的矩阵是对角的. 如果"
      (&= (ap $T $alpha_i) (&i* $c_i $alpha_i)) ", 那么"
      (MB (&= (coordm $T)
              (Mat ($c_1 $0 $..c $0)
                   ($0 $c_2 $..c $0)
                   ($..v $..v $ $..v)
                   ($0 $0 $..c $c_n))))
      "我们当然并不需要标量" (&cm $c_1 $..h $c_n) "互异. 实际上, 它们可以是相同的标量 "
      "(当" $T "是恒等算子的标量倍数时).")
   (P "我们也可以将" $T "可对角化定义为存在" $T "的一集特征向量可以张成" $V ". 这与之前的"
      "定义只是表面上不同而已, 因为我们可以从任意能够张成" $V "的一集向量中挑选出一个基.")
   (P "对于例子1和2我们故意挑选了在" $RR^n "上不可对角化的线性算子" $T ". 在例子1中, " $RR^2
      "上的这个线性算子之所以是不可逆的, 是因为它没有特征值. 在例子2中, 线性算子" $T
      "的确有特征值. 实际上, " $T "的特征多项式可以在实数域上被分解完全: "
      (&= $f (&i* (@- $x $1) (^ (@- $x $2) $2))) ". 然而, " $T "并非可对角化的. 在" $T
      "的两个特征值下每个特征空间都只是一维的, 因此我们并不能构造出一个全由" $T
      "的特征向量构成的" $RR^3 "的基.")
   (P "设" $T "是一个可对角化的线性算子. 令" (&cm $c_1 $..h $c_k) "是" $T "互异的特征值. "
      "那么存在一个有序基" $BBB "满足其下" $T "由一个以标量" $c_i "为对角元素的对角矩阵表示, "
      "每个标量均重复特定的次数. 如果" $c_i "重复了" $d_i "次, 那么(我们可以重新排列有序基的"
      "向量顺序使得)该矩阵具有如下分块形式"
      (MB (&= (coordm $T)
              (Mat ((&i* $c_1 $I_1) $0 $..c $0)
                   ($0 (&i* $c_2 $I_2) $..c $0)
                   ($..v $..v $ $..v)
                   ($0 $0 $..c (&i* $c_k $I_k)))))
      "其中" $I_j "是" (&c* $d_j $d_j) "的恒等矩阵. 从中我们看出两件事. 首先, " $T
      "的特征多项式是(可能重复的)线性因子之积:"
      (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)) ".")
      "如果标量域" $F "是代数闭域, 例如复数域, 那么每个" $F "上的多项式都可以被这么"
      "分解 (见第4.5节). 然而, 如果" $F "不是代数闭域, 当我们说" $T "的特征多项式有这样一种分解时, "
      "我们是在声明" $T "的一个特别性质. 第二件能看出来的事情是" $d_i " (" $c_i "作为" $f
      "的重根次数) 等于与特征值" $c_i "相关的特征空间的维数. 这是因为对角矩阵的零化度等于其主对角线上"
      "零的数目, 而矩阵" (coordm (&- $T (&i* $c_i $I)) $BBB) "在其主对角线上拥有" $d_i
      "个零. 这个特征空间的维数与特征值作为" $f "的根的重数之间的关系最初看上去并不令人兴奋. 然而, "
      "它为我们提供了一种更简单的判断给定算子是否可对角化的方法.")
   ((lemma)
    "设" (&= (ap $T $alpha) (&i* $c $alpha)) ". 如果" $f "是任意的多项式, 那么"
    (&= (ap (app $f $T) $alpha) (&i* (app $f $c) $alpha)) ".")
   ((proof)
    "作为练习.")
   ((lemma)
    "令" $T "是有限维向量空间" $V "上的线性算子. 令" (&cm $c_1 $..h $c_k) "是" $T
    "不同的特征值, 而" $W_i "是特征值" $c_i "下的特征空间. 如果" (&= $W (&+ $W_1 $..c $W_k))
    ", 那么"
    (MB (&= (&dim $W) (&+ (&dim $W_1) $..c (&dim $W_k))) ".")
    "实际上, 如果" $BBB_i "是" $W_i "的一个有序基, 那么"
    (&= $BBB (tu0 $BBB_1 $..h $BBB_k)) "是" $W "的一个有序基.")
   ((proof)
    "空间" (&= $W (&+ $W_1 $..c $W_k)) "是由" $T "的所有特征向量张成的子空间. 当一个人构造子空间"
    $W_i "之和" $W "时, 通常会预料" (&< (&dim $W) (&+ (&dim $W_1) $..c (&dim $W_k)))
    ", 因为不同空间的向量之间也可能存在线性关系. 这条引理告诉我们不同特征值下的特征空间是独立的." (Br)
    "设(对于每个" $i ")我们有一个" $W_i "中的向量" $beta_i ", 并且假定" (&= (&+ $beta_1 $..c $beta_k) $0)
    ". 我们将证明对于每个" $i "有" (&= $beta_i $0) ". 令" $f "是任意的多项式. 既然"
    (&= (ap $T $beta_i) (&i* $c_i $beta_i)) ", 那么之前的引理告诉我们"
    (MB (deriv $0
               (ap (app $f $T) $0)
               (&+ (ap (app $f $T) $beta_1) $..c (ap (app $f $T) $beta_k))
               (&+ (&i* (app $f $c_1) $beta_1) $..c (&i* (app $f $c_k) $beta_k))))
    "选择多项式" (&cm $f_1 $..h $f_k) "使得"
    (MB (&= (app $f_i $c_j) δij
            (Choice ($1 (: $cm (&= $i $j)))
                    ($0 (: $cm (&!= $i $j))))))
    "那么"
    (MB (deriv $0
               (ap (app $f_i $T) $0)
               (sum (&= $j $1) $k (&i* δij $beta_j))
               $beta_i))
    "现在令" $BBB_i "是" $W_i "的一个有序基, 令" $BBB "是序列"
    (&= $BBB (tu0 $BBB_1 $..h $BBB_k)) ", 那么" $BBB "能够张成子空间"
    (&= $W (&+ $W_1 $..c $W_k)) ". 并且, " $BBB "也是线性无关的向量序列, 原因如下. 任何"
    $BBB "中向量之间的线性关系都具有" (&= (&+ $beta_1 $..c $beta_k) $0) "的形式, 其中"
    $beta_i "是" $BBB_i "中的向量的线性组合. 根据我们刚才得到的结果, 我们知道对于每个"
    $i "有" (&= $beta_i $0) ". 既然每个" $BBB_i "都是线性无关的, 那么显然" $BBB
    "中的向量之间只存在平凡的线性关系.")
   ((theorem #:n "2")
    "令" $T "是有限维向量空间" $V "上的线性算子, 令" (&cm $c_1 $..h $c_k) "是" $T
    "不同的特征值, 令" $W_i "是" (@- $T (&i* $c_i $I)) "的零空间, 以下条件是等价的."
    (Ol #:attr* '((type "i"))
        (Li $T "是可对角化的.")
        (Li $T "的特征多项式为"
            (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
            "并且" (&cm (&= (&dim $W_i) $d_i) (&= $i (&cm $1 $..h $k))) ".")
        (Li (&= (&+ (&dim $W_1) $..c (&dim $W_k)) (&dim $V)) ".")))
   ((proof)
    "我们已经观察到i可以推出ii. 如果特征多项式" $f "是如ii所示的线性因子之积, 那么"
    (&= (&+ $d_1 $..c $d_k) (&dim $V)) ", 因为" $d_i "之和就是特征多项式的次数, 而这个次数就是"
    (&dim $V) ". 于是, ii能够推出iii. 设iii成立. 根据引理, 我们必须有" (&= $V (&+ $W_1 $..c $W_k))
    ", 即" $T "的特征向量能够张成" $V ".")
   (P "定理2的矩阵类比可以按照如下方式陈述. 令" $A "是一个元素来源于域" $F "的" n*n "矩阵, 令"
      (&cm $c_1 $..h $c_k) "是" $A "在" $F "中不同的特征值. 对于每个" $i ", 令" $W_i
      "是满足"
      (MB (LE (@- $A (&i* $c_i $I)) $X $0))
      "的列矩阵" $X "的空间, 当然" $X "的元素应该来源于" $F ", 令" $BBB_i "是" $W_i
      "的一个有序基. 我们将基" (tu0 $BBB_1 $..h $BBB_k) "连在一起以构成了一个矩阵" $P
      "的列的序列:"
      (MB (&= $P (li0 $P_1 $P_2 $..h) (tu0 $BBB_1 $..h $BBB_k)) ".")
      "矩阵" $A "在域" $F "上能够相似于一个对角矩阵当且仅当" $P "是一个方阵. 当" $P
      "是方阵的时候, " $P "可逆并且" (&i* (inv $P) $A $P) "是对角矩阵.")
   ((example #:n "3")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准基下由矩阵"
    (MB (&= $A (Mat ($5 $-6 $-6) ($-1 $4 $2) ($3 $-6 $-4))))
    "表示. 让我们指出读者计算特征多项式的一种可能方式, 使用行变换和列变换:"
    (MB (deriv (Det ((&- $x $5) $6 $6)
                    ($1 (&- $x $4) $-2)
                    ($-3 $6 (&+ $x $4)))
               (Det ((&- $x $5) $0 $6)
                    ($1 (&- $x $2) $-2)
                    ($-3 (&- $2 $x) (&+ $x $4)))
               (&i* (@- $x $2)
                    (Det ((&- $x $5) $0 $6)
                         ($1 $1 $-2)
                         ($-3 $-1 (&+ $x $4))))
               (&i* (@- $x $2)
                    (Det ((&- $x $5) $0 $6)
                         ($1 $1 $-2)
                         ($-2 $0 (&+ $x $2))))
               (&i* (@- $x $2)
                    (Det ((&- $x $5) $6)
                         ($-2 (&+ $x $2))))
               (&i* (@- $x $2) (@ $x^2 $- (&i* $3 $x) $+ $2))
               (&i* (^ (@- $x $2) $2) (@- $x $1))))
    "在这两个特征值下的特征空间的维数是多少呢? 我们有"
    (MB (&cm (&= (&- $A $I) (Mat ($4 $-6 $-6) ($-1 $3 $2) ($3 $-6 $-5)))
             (&= (&- $A (&i* $2 $I)) (Mat ($3 $-6 $-6) ($-1 $2 $2) ($3 $-6 $-6)))))
    "我们知道" (&- $A $I) "是奇异的, 并且显然有" (&>= (&rank (&- $A $I)) $2)
    ". 因此, " (&= (&rank (&- $A $I)) $2) ". 另外, 显然有"
    (&= (&rank (&- $A (&i* $2 $I))) $1) "." (Br)
    "令" $W_1 "和" $W_2 "分别是特征值" $1 "和" $2 "下的特征空间, 我们知道"
    (&= (&dim $W_1) $1) "和" (&= (&dim $W_2) $2) ". 根据定理2, " $T "是可对角化的. 很容易找出"
    $RR^3 "的一个基满足其下" $T "由一个对角矩阵表示. " (@- $T $I) "的零空间由向量"
    (&= $alpha_1 (tu0 $3 $-1 $3)) "张成, 于是" (setE $alpha_1) "是" $W_1
    "的一个基. " (&- $T (&i* $2 $I)) "的零空间 (即空间" $W_2 ") 由满足"
    (&= $x_1 (&+ (&i* $2 $x_2) (&i* $2 $x_3))) "的向量" (tu0 $x_1 $x_2 $x_3)
    "构成. 因此, " $W_2 "的基的一个例子是"
    (MB (&cm (&= $alpha_2 (tu0 $2 $1 $0)) (&= $alpha_3 (tu0 $2 $0 $1))) ".")
    "如果" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) ", 那么" (coordm $T) "是对角矩阵"
    (MB (&= $D (Mat ($1 $0 $0) ($0 $2 $0) ($0 $0 $2))) ".")
    $T "可对角化的事实意味着原本的矩阵" $A "(在" $RR "上)相似于对角矩阵" $D ". 使得我们能够将基"
    $BBB "下的坐标转换为标准基下的坐标的矩阵" $P "(当然)以" (&cm $alpha_1 $alpha_2 $alpha_3)
    "的转置为列向量:"
    (MB (&= $P (Mat ($3 $2 $2) ($-1 $1 $0) ($3 $0 $1))) ".")
    "而且, " (&= (&i* $A $P) (&i* $P $D)) ", 于是"
    (MB (&= (&i* (inv $P) $A $P) $D) "."))
   ((exercise #:n "1")
    "以下的每种情形, 令" $T "是" $RR^2 "上的线性算子, 其在" $RR^2 "的标准有序基下由矩阵"
    $A "表示. 并且, 令" $U "是" $CC^2 "上的线性算子, 其在" $CC^2 "的标准有序基下也由矩阵"
    $A "表示. 找出" $T "和" $U "的特征多项式, 找出" $T "和" $U "的特征值, 以及找出每个特征值"
    "所对应的特征空间的一个基."
    (MB (&cm (&= $A (Mat ($1 $0) ($0 $0)))
             (&= $A (Mat ($2 $3) ($-1 $1)))
             (&= $A (Mat ($1 $1) ($1 $1)))) "."))
   ((exercise #:n "2")
    "令" $V "是域" $F "上的一个" $n "维向量空间. " $V "上的恒等算子的特征多项式是什么? " $V
    "上的零算子的特征多项式是什么?")
   ((exercise #:n "3")
    "令" $A "是域" $F "上的一个" n*n "的三角矩阵. 证明" $A "的特征值就是其对角线的元素, 即标量"
    (mref $A $i $i) ".")
   ((exercise #:n "4")
    "令" $T "是" $RR^3 "上在标准有序基下由矩阵"
    (MB (Mat (-9 4 4) (-8 3 4) (-16 8 7)))
    "表示的线性算子. 证明" $T "是可对角化的, 通过给出" $RR^3 "的一个基, 其每个向量都是" $T
    "的特征向量.")
   ((exercise #:n "5")
    "令"
    (MB (&= $A (Mat (6 -3 -2) (4 -1 -2) (10 -5 -3))) ".")
    "域" $RR "上" $A "是否相似于一个对角矩阵? 域" $CC "上" $A "是否相似于一个对角矩阵?")
   ((exercise #:n "6")
    "令" $T "是" $RR^4 "上在标准有序基下由矩阵"
    (MB (Mat (0 0 0 0) ($a 0 0 0) (0 $b 0 0) (0 0 $c 0)))
    "表示的线性算子. " (&cm $a $b $c) "在何种条件下使得" $T "是可对角化的?")
   ((exercise #:n "7")
    "令" $T "是" $n "维向量空间" $V "上的一个线性算子. 如果" $T "具有" $n
    "个不同的特征值, 证明" $T "是可对角化的.")
   ((exercise #:n "8")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵, 证明如果" (@- $I AB) "是可逆的, 那么"
    (@- $I (&i* $B $A)) "也是可逆的, 并且"
    (MB (&= (inv (@- $I (&i* $B $A)))
            (&+ $I (&i* $B (inv (@- $I AB)) $A))) "."))
   ((exercise #:n "9")
    "使用练习8的结果证明, 如果" $A "和" $B "是域" $F "上的" n*n "矩阵, 那么" AB
    "和" (&i* $B $A) "在域" $F "中恰好拥有相同的特征值.")
   ((exercise #:n "10")
    "设" $A "是一个" 2*2 "的实对称矩阵, 证明" $A "在" $RR "上相似于一个对角矩阵.")
   ((exercise #:n "11")
    "令" $N "是一个" 2*2 "的复矩阵满足" (&= $N^2 $0) ", 证明要么" (&= $N $0)
    ", 要么" $N "在" $CC "上相似于"
    (MB (Mat (0 0) (1 0)) "."))
   ((exercise #:n "12")
    "使用练习11的结果证明, 如果" $A "是一个" 2*2 "的复矩阵, 那么" $A "在" $CC
    "上相似于以下两种类型的矩阵中的一种:"
    (MB (&cm (Mat ($a 0) (0 $b)) (Mat ($a 0) (1 $a))) "."))
   ((exercise #:n "13")
    "令" $V "是所有从" $RR "到" $RR "的连续函数构成的向量空间, 令" $T "是" $V "上由"
    (MB (&= (app (@ap $T $f) $x) (integral $0 $x (app $f $t) $t)))
    "定义的线性算子, 证明" $T "没有特征值.")
   ((exercise #:n "14")
    "令" $A "是" n*n "的对角矩阵, 它的特征多项式为"
    (MB (decomp $c_1 $d_1 $c_k $d_k))
    "其中" (&cm $c_1 $..h $c_k) "是不同的标量. 令" $V "是所有与" $A "交换的" n*n
    "矩阵构成的向量空间, 证明" $V "的维数是" (&+ (_^ $d $1 $2) $..c (_^ $d $k $2)) ".")
   ((exercise #:n "15")
    "令" $V "是" (^ $F n*n) ", 矩阵" (∈ $A $V) ", " $T "是" $V "上&quot;左乘" $A
    "&quot;的线性算子, " $A "和" $T "具有相同的特征值吗?")
   (H3 "第6.3节 零化多项式")
   (P "在尝试分析一个线性算子" $T "的时候, 知道能够零化" $T "的多项式类是很有用的. 更确切地说, "
      "设" $T "是域" $F "上的向量空间" $V "上的线性算子. 如果" $p "是域" $F "上的多项式, 那么"
      (app $p $T) "也是" $V "上的线性算子. 如果" $q "是另一个域" $F "上的多项式, 那么"
      (MB (&cm (&= (app (@+ $p $q) $T) (&+ (app $p $T) (app $q $T)))
               (&= (app (@i* $p $q) $T) (&i* (app $p $T) (app $q $T)))) ".")
      "因此, 零化" $T "的多项式" $p " (意即" (&= (app $p $T) $0) ") 的集合是多项式代数"
      polyF "的理想. 它可能是零理想, 也就是说" $T "可能不由任何非零多项式零化. 但是, 如果"
      $V "是有限维的, 这种情况是不可能发生的.")
   (P "设" $T "是一个" $n "维空间" $V "上的线性算子. 看看" $T "的前" (@+ $n^2 $1) "次幂:"
      (MB (&cm $I $T $T^2 $..h (^ $T $n^2)) ".")
      "这是" (&L $V $V) "中" (&+ $n^2 $1) "个算子的序列, " (&L $V $V) "即" $V "上的线性算子的空间. 空间"
      (&L $V $V) "是" $n^2 "维的, 因此这" (&+ $n^2 $1) "个算子的序列必然是线性相关的, "
      "也就是说存在不是全零的标量" $c_i "满足"
      (MB (&= (&+ (&i* $c_0 $I) (&i* $c_1 $T) $..c (&i* (_ $c $n^2) (^ $T $n^2))) $0) ".")
      "于是, 零化" $T "的多项式理想中有一个非零的多项式, 其次数小于等于" $n^2 ".")
   (P "根据第4章的定理7, 每个非零的多项式理想都可由某个首项系数为一的多项式生成. 因此, 存在一个与" $T
      "相关的首项系数为一的多项式" $p "满足以下性质: 如果" $f "是一个域" $F "上的多项式, 那么"
      (&= (app $f $T) $0) "当且仅当" (&= $f (&i* $p $g)) ", 其中" $g "是某个" $F "上的多项式.")
   ((definition)
    "令" $T "是一个域" $F "上的有限维向量空间" $V "上的线性算子. " $T "的极小多项式是零化" $T
    "的域" $F "上的多项式理想的(唯一的)首项系数为一的生成元.")
   (P "&quot;极小多项式&quot;这个名字来源于这个多项式理想的生成元可由理想中次数最小的"
      "首项系数为一多项式刻画. 这意味着线性算子" $T "的极小多项式" $p "由以下三条性质唯一确定:"
      (Ol (Li $p "是标量域" $F "上的首项系数为一的多项式.")
          (Li (&= (app $p $T) $0) ".")
          (Li "没有能够零化" $T "的域" $F "上的多项式次数比" $p "低.")))
   (P "如果" $A "是域" $F "上的一个" n*n "矩阵, 我们可以按照类似的方式定义" $A
      "的极小多项式, 即域" $F "上零化" $A "的多项式理想的那个唯一的首项系数为一的生成元. 如果" $T
      "在某个有序基下由矩阵" $A "表示, 那么" $T "和" $A "有着相同的极小多项式. 这是因为在这个基下"
      (app $f $T) "由矩阵" (app $f $A) "表示, 于是" (&= (app $f $T) $0) "当且仅当"
      (&= (app $f $A) $0) ".")
   (P "上面关于算子和矩阵的评注也可说明相似矩阵拥有相同的极小多项式. "
      "从定义看这个事实也是显然的, 因为对于每个多项式" $f "有"
      (MB (&= (app $f (sim $A)) (sim (app $f $A))) "."))
   (P "关于矩阵的极小多项式的另一个基本评注也是应该说的. 设" $A "是一个" n*n "矩阵, 其元素来源于域"
      $F ". 设" $F_1 "是以" $F "为子域的一个域. (例如, " $A "的元素可能是有理数, 而" $F_1
      "是实数域. 或者, " $A "的元素是实数, 而" $F_1 "是复数域.) 我们既可以将" $A
      "当成" $F "上的矩阵, 也可以将其当作" $F_1 "上的矩阵. 从表面上来看, 似乎我们会得到" $A
      "的两个不同的极小多项式. 幸运的是, 这并不会发生, 我们必须明白为什么. 当" $A "被视为域" $F
      "上的" n*n "矩阵时, 其极小多项式的定义是什么? 我们考虑能够零化" $A "的系数来源于" $F
      "的首项系数为一的多项式, 并挑选其中次数最小的那个. 如果" $f "是域" $F "上的"
      "一个首项系数为一的多项式:"
      (MB (&= $f (&+ $x^k (sum (&= $j $0) (&- $k $1) (&i* $a_j $x^j)))))
      "那么" (&= (app $f $A) $0) "仅仅是说我们有了一个" $A "的幂之间的线性关系:"
      (MB (&= (&+ $A^k (&i* (_ $a (&- $k $1)) (^ $A (&- $k $1)))
                  $..c (&i* $a_1 $A) (&i* $a_0 $I)) $0) ".")
      "极小多项式的次数是满足存在以上形式的" (&cm $I $A $..h $A^k) "之间的线性关系的最小的正整数"
      $k ". 而且, 根据极小多项式的唯一性, 对于" $k "而言有且仅有一种这样形式的关系, 即一旦最小的"
      $k "确定下来了, 存在唯一的" $F "中标量" (&seq $a #:from $0 #:to (&- $k $1)) "能够使得以上"
      "形式的关系成立. 它们是极小多项式的系数.")
   (P "现在(对于每个" $k ")我们有一个&quot;未知元&quot;" (&cm $a_0 $..h (_ $a (&- $k $1)))
      "的具" $n^2 "个方程的线性方程组. [译注: 也就是考虑" $A "的" $n^2 "个元素得到的线性方程组.] "
      "既然" $A "的元素都在" $F "中, 那么该线性方程组的系数也都在" $F "中. 因此, 如果该方程组有"
      $F_1 "中的" (&cm $a_0 $..h (_ $a (&- $k $1))) "的解, 那么它就有" $F "中的"
      (&cm $a_0 $..h (_ $a (&- $k $1))) "的解. (见第1.4节末.) 现在读者显然可以看出两个极小多项式"
      "应该是相同的. [译注: 而且, 这是因为此时解是唯一的.]")
   (P "到目前为止, 关于" $n "维空间上的线性算子的极小多项式, 我们知道什么呢? 我们只知道它的次数不超过"
      $n^2 ". 这实际上是一个相当糟糕的估计, 因为它的次数不可能超过" $n ". 我们将简短地证明该算子由其"
      "特征多项式零化. 首先, 让我们观察到一个基本事实.")
   ((theorem #:n "3")
    "令" $T "是" $n "维向量空间" $V "上的一个线性算子 (或者, 令" $A "是一个" n*n "矩阵), 那么"
    $T " (或者" $A ") 的特征多项式和极小多项式具有相同的根, 不计重数.")
   ((proof)
    "令" $p "是" $T "的极小多项式. 令" $c "是一个标量. 我们想要证明的是" (&= (app $p $c) $0)
    "当且仅当" $c "是" $T "的一个特征值." (Br)
    "首先, 设" (&= (app $p $c) $0) ", 那么"
    (MB (&= $p (&i* (@- $x $c) $q)))
    "其中" $q "是一个多项式. 既然" (&< (&deg $q) (&deg $p)) ", 那么极小多项式" $p
    "的定义告诉我们" (&!= (app $q $T) $0) ". 选择一个向量" $beta "使得" (&!= (ap (app $q $T) $beta) $0)
    ". 令" (&= $alpha (ap (app $q $T) $beta)) ", 那么"
    (eqnderiv $0 (ap (app $p $T) $beta)
              (ap (&i* (@- $T (&i* $c $I)) (app $q $T)) $beta)
              (ap (@- $T (&i* $c $I)) $alpha))
    "即" $c "是" $T "的一个特征值." (Br)
    "现在设" $c "是" $T "的一个特征值, 即存在" (&!= $alpha $0) "使得" (&= (ap $T $alpha) (&i* $c $alpha))
    ". 正如我们在之前的引理中所注意到的,"
    (MB (&= (ap (app $p $T) $alpha) (&i* (app $p $c) $alpha)) ".")
    "既然" (&= (app $p $T) $0) "而" (&!= $alpha $0) ", 我们有" (&= (app $p $c) $0) ".")
   (P "令" $T "是一个可对角化线性算子而" (&cm $c_1 $..h $c_k) "是其不同的特征值, 那么很容易看出来"
      $T "的极小多项式为"
      (MB (&= $p (&i* (@- $x $c_1) $..c (@- $x $c_k))) ".")
      "如果" $alpha "是一个特征向量, 那么算子" (&cm (&- $T (&i* $c_1 $I)) $..h (&- $T (&i* $c_k $I)))
      "之一将" $alpha "送至" $0 ", 因此对于每个特征向量" $alpha "有"
      (MB (&= (ap (&i* (@- $T (&i* $c_1 $I)) $..c (@- $T (&i* $c_k $I))) $alpha) $0) ".")
      "对于" $T "所变换的空间, 存在一个全由" $T "的特征向量构成的基, 于是"
      (MB (&= (app $p $T) (&i* (@- $T (&i* $c_1 $I)) $..c (@- $T (&i* $c_k $I))) $0) ".")
      "总结一下. 如果" $T "是一个可对角化的线性算子, 那么" $T "的极小多项式是不同的线性因子之积. "
      "我们很快将看到, 这个性质刻画了可对角化算子.")
   ((example #:n "4")
    "让我们试着寻找一下例子1, 2, 3里的线性算子的极小多项式. 我们将以相反的顺序讨论它们. 例子3"
    "中的线性算子被我们发现是可对角化的, 并且其特征多项式为"
    (MB (&= $f (&i* (@- $x $1) (^ (@- $x $2) $2))) ".")
    "根据前一段的论述, 我们知道" $T "的极小多项式为"
    (MB (&= $p (&i* (@- $x $1) (@- $x $2))) ".")
    "读者可能会发现直接验证一下"
    (MB (&= (&i* (@- $A $I) (@- $A (&i* $2 $I))) $0))
    "要更令人放心一点. 在例子2中, 算子" $T "的特征多项式也是" (&i* (@- $x $1) (^ (@- $x $2) $2))
    ". 但是, 这个" $T "不是可对角化的, 所以我们并不能知道其极小多项式就是" (&i* (@- $x $1) (@- $x $2))
    ". 在这种情况下, 关于极小多项式我们又知道什么呢? 从定理3中我们得知其根是" $1 "和" $2
    ", 但是重数未知. 因此, 我们在具有形式"
    (&cm (&i* (^ (@- $x $1) $k) (^ (@- $x $2) $l)) (&>= $k $1) (&>= $l $1))
    "的多项式中寻找" $p ". 先试试" (&i* (@- $x $1) (@- $x $2)) ":"
    (eqnderiv (&i* (@- $A $I) (@- $A (&i* $2 $I)))
              (&i* (Mat (2 1 -1) (2 1 -1) (2 2 -1))
                   (Mat (1 1 -1) (2 0 -1) (2 2 -2)))
              (Mat (2 0 -1) (2 0 -1) (4 0 -2)))
    "于是, 极小多项式的次数至少为" $3 ". 于是, 接下来我们应该尝试" (&i* (^ (@- $x $1) $2) (@- $x $2))
    "或者" (&i* (@- $x $1) (^ (@- $x $2) $2)) ". 后者是特征多项式, 似乎是不那么随机的选择. "
    "读者通过计算可以发现" (&= (&i* (@- $A $I) (^ (@- $A (&i* $2 $I)) $2)) $0) ", 因此" $T
    "的极小多项式就是其特征多项式. [译注: 虽然例子2中的" $T "是实向量空间上的线性算子, 以至于看起来极小多项式和"
    "特征多项式拥有相同的根的事实并不能保证极小多项式就是由那两个线性因子的幂构成. 但是, 我们也可以将其"
    "当作复数域上的线性算子, 根据前面的论证, 其极小多项式也是一样的, 而复数域是代数闭域.] 在例子1中"
    "我们讨论了" $RR^2 "上的线性算子" $T ", 其在标准基下由矩阵"
    (MB (&= $A (Mat ($0 $-1) ($1 $0))))
    "表示. 它的特征多项式为" (&+ $x^2 $1) ", 其没有实根. 为了确定极小多项式, 让我们忘了" $T "而专注于"
    $A ". 如果将其视为复矩阵, 那么" $A "具有特征值" $i "和" (&- $i) ". 这两个根都必须出现在极小多项式的根里, "
    "因而极小多项式被" (&+ $x^2 $1) "整除. 验证" (&= (&+ $A^2 $I) $0) "是平凡的, 于是极小多项式就是"
    (&+ $x^2 $1) ".")
   ((theorem #:n "4. (Cayley-Hamilton)")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 如果" $f "是" $T "的特征多项式, 那么" (&= (app $f $T) $0)
    ". 换言之, 极小多项式整除特征多项式.")
   ((proof)
    "之后我们将会给出另外两个独立于此证明的证明. 当前这个证明, 尽管比较短, 可能难以理解. 除了简洁性, "
    "它还有一个优点, 就是提供了第5章建立的行列式理论的一个富于启发性且远非平凡的应用." (Br)
    "令" $K "是一个含幺交换环, 其由所有以" $T "为变元的多项式构成. 当然, " $K
    "实际上是一个标量域上的含幺元的交换代数. 选择" $V "的一个有序基" (setE $alpha_1 $..h $alpha_n)
    ", 令" $A "是在此给定基下表示" $T "的矩阵, 那么"
    (MB (&cm (&= (ap $T $alpha_i) (sum (&= $j $1) $n (&i* (mref $A $j $i) $alpha_j)))
             (&<= $1 $i $n)) ".")
    "这些式子也可以被写成以下等价的形式"
    (MB (&cm (&= (sum (&= $j $1) $n
                      (ap (@- (&i* (&delta $i $j) $T) (&i* (mref $A $j $i) $I))
                          $alpha_j)) $0)
             (&<= $1 $i $n)) ".")
    "令" (∈ $B (^ $K n*n)) "的元素为"
    (MB (&= (mref $B $i $j)
            (&- (&i* (&delta $i $j) $T) (&i* (mref $A $j $i) $I))) ".")
    "当" (&= $n $2) "时, 有"
    (MB (&= $B (Mat ((&- $T (&i* (mref $A $1 $1) $I)) (&i* (&- (mref $A $2 $1)) $I))
                    ((&i* (&- (mref $A $1 $2)) $I) (&- $T (&i* (mref $A $2 $2) $I))))))
    "并且 [译注: 在某种意义上, 这里存在一个&quot;类型错误&quot;, 因为" (&det $B)
    "是多项式而" (app $f $T) "是一个线性算子, 更正确的陈述是" (&= (&det $B) $f)
    ", 至于多项式变元是何种符号则无关紧要. 下面仍然有许多类型错误, 还请读者自行甄别.]"
    (eqnderiv (&det $B)
              (&- (&i* (@- $T (&i* (mref $A $1 $1) $I))
                       (@- $T (&i* (mref $A $2 $2) $I)))
                  (&i* (mref $A $1 $2) (mref $A $2 $1) $I))
              (&+ (&- $T^2 (&i* (@+ (mref $A $1 $1) (mref $A $2 $2)) $T))
                  (&i* (@- (&i* (mref $A $1 $1) (mref $A $2 $2))
                           (&i* (mref $A $1 $2) (mref $A $2 $1))) $I))
              (app $f $T))
    "其中" $f "是特征多项式:"
    (MB (&= $f (&+ (&- $x^2 (&i* (@ap $trace $A) $x)) (&det $A))) ".")
    "对于" (&> $n $2) "的情形, 显然也有"
    (MB (&= (&det $B) (app $f $T)))
    "这是因为" $f "是矩阵" (&- (&i* $x $I) $A) "的行列式, 该矩阵的元素为多项式"
    " [译注: 这里作者不小心将" (mref $A $i $j) "写成了" (mref $A $j $i)
    ", 但是不影响论证的合法性, 因为转置并不影响矩阵的行列式的值]"
    (MB (&= (mref (@- (&i* $x $I) $A) $i $j)
            (&- (&i* (&delta $i $j) $x) (mref $A $i $j))) ".")
    "我们想要证明" (&= (app $f $T) $0) ". 为了证明" (app $f $T) "是零算子, "
    "只需要证明其充要条件就够了, 即对于" (&= $k (&cm $1 $..h $n)) "有"
    (&= (ap (&det0 $B) $alpha_k) $0) ". 根据" $B "的定义, 向量"
    (&cm $alpha_1 $..h $alpha_n) "满足等式"
    (MB (&cm (&= (sum (&= $j $1) $n (ap (mref $B $i $j) $alpha_j)) $0)
             (&<= $1 $i $n)) ".")
    "当" (&= $n $2) "时, 它或许暗示我们将其写成以下形式 [译注: 这完全是形式上的, 至于其内在的涵义, "
    "则需要读者仔细考察, 下面的推理亦是如此]"
    (MB (&= (&i* (Mat ((&- $T (&i* (mref $A $1 $1) $I)) (&i* (&- (mref $A $2 $1)) $I))
                      ((&i* (&- (mref $A $1 $2)) $I) (&- $T (&i* (mref $A $2 $2) $I))))
                 (Mat ($alpha_1) ($alpha_2)))
            (Mat ($0) ($0))) ".")
    "在此情形之下, 古典伴随" (&adj $B) "是矩阵"
    (MB (&= (&~~ $B)
            (Mat ((&- $T (&i* (mref $A $2 $2) $I)) (&i* (mref $A $2 $1) $I))
                 ((&i* (mref $A $1 $2) $I) (&- $T (&i* (mref $A $1 $1) $I))))))
    "并且"
    (MB (&= (&i* (&~~ $B) $B) (Mat ((&det $B) $0) ($0 (&det $B)))) ".")
    "因此, 我们有"
    (eqnderiv (&i* (&det0 $B) (Mat ($alpha_1) ($alpha_2)))
              (&i* (@i* (&~~ $B) $B) (Mat ($alpha_1) ($alpha_2)))
              (&i* (&~~ $B) (pare (&i* $B (Mat ($alpha_1) ($alpha_2)))))
              (Mat ($0) ($0)))
    "一般情况下, 令" (&= (&~~ $B) (&adj $B)) ", 那么对于每对" $k "和" $i
    ", 根据" $B "的定义可得 [译注: 这里的" (mref (&~~ $B) $k $i)
    "只是附带的系数, 不被求和所绑定]"
    (MB (&= (sum (&= $j $1) $n
                 (&i* (mref (&~~ $B) $k $i) (mref $B $i $j) $alpha_j))
            $0))
    "在" $i "上求和, 我们有"
    (eqnderiv
     $0 (sum (&= $i $1) $n
             (sum (&= $j $1) $n
                  (&i* (mref (&~~ $B) $k $i) (mref $B $i $j) $alpha_j)))
     (sum (&= $j $1) $n
          (ap (@sum (&= $i $1) $n
                    (&i* (mref (&~~ $B) $k $i) (mref $B $i $j)))
              $alpha_j)))
    "既然" (&= (&i* (&~~ $B) $B) (&i* (&det0 $B) $I)) ", 于是"
    (MB (&= (sum (&= $i $1) $n
                 (&i* (mref (&~~ $B) $k $i) (mref $B $i $j)))
            (&i* (&delta $k $j) (&det0 $B))))
    "因此对于" (&= $k (&cm $1 $..h $n)) ", 我们得到"
    (eqnderiv
     $0 (sum (&= $j $1) $n
             (ap (&i* (&delta $k $j) (&det0 $B)) $alpha_j))
     (ap (&det0 $B) $alpha_k)))
   ((proof)
    "以上证明的叙述有些混乱, 译者在此试图将其整理成更加清晰易读的形式. 设"
    (setE $alpha_1 $..h $alpha_n) "是" $V "的一个有序基, 而" $A
    "是" $T "在此有序基下的矩阵表示. 令" (&= $B (&- (&i* $x $I) $A))
    ", 这是多项式环上的矩阵. 另外, 设" $f "是" $T "的特征多项式, 那么我们知道"
    (&= (&det $B) $f) ", 以及" (&= (&i* $B (&adj $B)) (&i* $f $I))
    ". 根据" $A "的定义, 我们知道"
    (MB (&cm (&= (sum (&= $i $1) $n
                      (ap (app (mref $B $i $j) $T) $alpha_i))
                 $0)
             (&<= $1 $j $n)) ".")
    "这里的" (mref $B $i $j) "是一个多项式, 而应用一个多项式于线性算子是"
    "第4章所定义的操作, 其结果仍然是一个线性算子. 接着, 我们可以推出对于"
    (&= $k (&cm $1 $..h $n)) "有"
    (eqnderiv
     $0 (ap (app (mref (&adj $B) $j $k) $T)
            (@sum (&= $i $1) $n
                  (ap (app (mref $B $i $j) $T) $alpha_i)))
     (sum (&= $i $1) $n
          (ap (app (mref (&adj $B) $j $k) $T)
              (ap (app (mref $B $i $j) $T) $alpha_i)))
     (sum (&= $i $1) $n
          (ap (app (bra0 (&i* (mref (&adj $B) $j $k)
                              (mref $B $i $j))) $T)
              $alpha_i))
     (sum (&= $i $1) $n
          (ap (app (bra0 (&i* (mref $B $i $j)
                              (mref (&adj $B) $j $k))) $T)
              $alpha_i)))
    "在" $j "上求和, 我们得到"
    (eqnderiv
     $0 (sum (&= $j $1) $n
             (sum (&= $i $1) $n
                  (ap (app (bra0 (&i* (mref $B $i $j)
                                      (mref (&adj $B) $j $k))) $T)
                      $alpha_i)))
     (sum (&= $i $1) $n
          (sum (&= $j $1) $n
               (ap (app (bra0 (&i* (mref $B $i $j)
                                   (mref (&adj $B) $j $k))) $T)
                   $alpha_i)))
     (sum (&= $i $1) $n
          (ap (@sum (&= $j $1) $n
                    (app (bra0 (&i* (mref $B $i $j)
                                    (mref (&adj $B) $j $k))) $T))
              $alpha_i))
     (sum (&= $i $1) $n
          (ap (app (@sum (&= $j $1) $n
                         (&i* (mref $B $i $j)
                              (mref (&adj $B) $j $k))) $T)
              $alpha_i))
     (sum (&= $i $1) $n
          (ap (app (&i* (&delta $i $k) (&det0 $B)) $T)
              $alpha_i))
     (sum (&= $i $1) $n
          (&i* (&delta $i $k)
               (ap (app $f $T) $alpha_i))))
    "分别令" (&= $k (&cm $1 $..h $n)) ", 可得"
    (MB (&cm (&= (ap (app $f $T) $alpha_k) $0)
             (&<= $1 $k $n)))
    "既然" (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基, 而" (app $f $T)
    "在基的每个向量上都为零, 那么" (app $f $T) "本身肯定是一个零变换.")
   (P (B "译者注记.") " 以上我们补充的证明中的" $B "和原来的证明中的" $B
      "恰好是互为转置的关系. 读者可以看到, 这并不影响证明, 只是原本与矩阵乘法"
      "在形式上暗合的推理变成了转置了的顺序反转的版本而已. 作者的潜在想法实际上是这样的, "
      "虽然原文只是在" 2*2 "的情况下提了一下. 对于多项式上的矩阵, 我们可以定义"
      "一个应用矩阵于线性算子的entrywise操作, 其结果是一个以线性算子为元素的矩阵, 即将"
      "多项式上的矩阵的逐个元素应用于线性算子得到的矩阵. "
      "这个操作可以保持矩阵乘法, 即如果" $A "和" $B "是多项式上的矩阵, 而"
      $T "是一个线性算子, 那么" (&= (app (@i* $A $B) $T) (&i* (app $A $T) (app $B $T)))
      ". 这里的" (&i* (app $A $T) (app $B $T)) "纯粹是形式上的矩阵乘法, 其每个元素"
      "都是线性算子相乘再相加得到的. 虽然线性算子在一般情况下并不交换, 但在这里"
      "相乘的顺序的确没有那么重要, 因为我们知道对于多项式" $p "和" $q "有"
      (&= (&i* (app $p $T) (app $q $T)) (&i* (app $q $T) (app $p $T)))
      ". 除了应用多项式矩阵于线性算子和线性算子矩阵的乘法之外, 我们还需要定义应用"
      "线性算子的矩阵于向量的列矩阵的形式操作, 这点在形式上当然和矩阵乘法也是一样的, "
      "只是乘法变成了函数应用而已. 关键的一点在于, 如果" $C "是这样一个"
      "向量的列矩阵, 那么"
      (MB (&= (&i* (app $A $T) (bra0 (&i* (app $B $T) $C)))
              (&i* (bra0 (&i* (app $A $T) (app $B $T))) $C)))
      "这个形式上的&quot;乘法结合律&quot;的确也是成立的. 在定义了这些形式操作并"
      "知道这几条性质之后, 那么Cayley-Hamilton的证明的确没有什么魔法可言.")
   (P "此时此刻Cayley-Hamilton定理对于我们有用主要是因为它缩小了我们"
      "寻找线性算子的极小多项式的搜索范围. 如果我们知道了在某个有序基下表示"
      $T "的矩阵" $A ", 那么我们可以计算特征多项式" $f ". 我们知道极小多项式"
      $p "整除" $f ", 并且它们拥有相同的根. 不过, 除非次数很小, 没有方法可以"
      "精确计算多项式的根. 然而, 如果" $f "可以被分解为"
      (MB (&cm (&= $f (decomp $c_1 $d_1 $c_k $d_k))
               (: (&cm $c_1 $..h $c_k) "各不相同")
               (&>= $d_i $1)))
      "那么"
      (MB (&cm (&= $p (decomp $c_1 $r_1 $c_k $r_k))
               (&<= $1 $r_j $d_j)) ".")
      "这就是在一般情况下我们能够断言的全部事情了. 如果" $f "的确是这样的多项式"
      "并且其次数为" $n ", 那么对于每个具有这种形式的多项式" $p
      ", 我们可以找到一个" n*n "的矩阵满足以" $f "为特征多项式而" $p
      "为极小多项式. 暂时我们还不会证明这个. 但是, 我们想强调的是, 具有这种形式的"
      "特征多项式告诉我们了极小多项式所具有的形式. 至于其他内容, 则无可奉告.")
   ((example #:n "5")
    "令" $A "是" (&c* $4 $4) "的(有理数)矩阵"
    (MB (&= $A (Mat (0 1 0 1) (1 0 1 0) (0 1 0 1) (1 0 1 0))) ".")
    $A "的幂是容易计算的:"
    (MB (&cm (&= $A^2 (Mat (2 0 2 0) (0 2 0 2) (2 0 2 0) (0 2 0 2)))
             (&= $A^3 (Mat (0 4 0 4) (4 0 4 0) (0 4 0 4) (4 0 4 0)))) ".")
    "因此, " (&= $A^3 (&i* $4 $A)) ", 即如果"
    (&= $p (&- $x^3 (&i* $4 $x)) (&i* $x (@+ $x $2) (@- $x $2)))
    ", 那么" (&= (app $p $A) $0) ". " $A "的极小多项式必然整除" $p
    ". 这个极小多项式的次数显然不是" $1 ", 因为次数为" $1 "意味着" $A
    "是恒等矩阵的标量倍数. 因此, 极小多项式的候选者为: "
    (&cm $p (&i* $x (@+ $x $2)) (&i* $x (@- $x $2)) (&- $x^2 $4))
    ". 这三个二次的多项式也很容易排除, 因为一眼就能看出"
    (&!= $A^2 (&i* -2 $A)) ", " (&!= $A^2 (&i* 2 $A)) ", "
    (&!= $A^2 (&i* 4 $I)) ". 于是, " $p "即" $A "的极小多项式. 并且, "
    (&cm 0 2 -2) "是" $A "的特征值. 特征多项式里" (&cm $x (&- $x $2) (&+ $x $2))
    "这三个因子之一必然要重复两次. 显然, " (&= (&rank $A) $2)
    ". 因此, 与特征值" $0 "相关联的特征空间是" $2 "维的. 根据定理2, 特征多项式显然是"
    (&i* $x^2 (@- $x^2 $4)) ", 并且" $A "在有理数域上相似于矩阵"
    (MB (Mat (0 0 0 0) (0 0 0 0) (0 0 2 0) (0 0 0 -2)) "."))
   ((exercise #:n "1")
    "令" $V "是有限维向量空间. " $V "上的恒等算子的极小多项式是什么? " $V
    "上的零算子的极小多项式是什么?")
   ((exercise #:n "2")
    "令" (&cm $a $b $c) "是一个域" $F "的元素, " $A "是以下" $F "上的" (&c* 3 3) "矩阵:"
    (MB (&= $A (Mat (0 0 $c) (1 0 $b) (0 1 $a))) ".")
    "证明" $A "的特征多项式为" (&- $x^3 (&i* $a $x^2) (&i* $b $x) $c)
    ", 并且这也是" $A "的极小多项式.")
   ((exercise #:n "3")
    "令" $A "是" (&c* 4 4) "的实矩阵"
    (MB (&= $A (Mat (1 1 0 0) (-1 -1 0 0) (-2 -2 2 1) (1 1 -1 0))) ".")
    "证明" $A "的特征多项式为" (&i* $x^2 (^ (@- $x $1) $2)) ", 而这也是其极小多项式.")
   ((exercise #:n "4")
    "练习3的矩阵" $A "在复数域上是可对角化矩阵吗?")
   ((exercise #:n "5")
    "令" $V "是一个" $n "维向量空间而" $T "是" $V "上的一个线性算子. 设存在某个正整数" $k
    "使得" (&= $T^k $0) ", 证明" (&= $T^n $0) ".")
   ((exercise #:n "6")
    "找出一个" (&c* 3 3) "的矩阵, 其极小多项式是" $x^2 ".")
   ((exercise #:n "7")
    "令" $n "是一个正整数, " $V "是次数不超过" $n "的实多项式的向量空间, " $D
    "是" $V "上的微分算子. " $D "的极小多项式是什么?")
   ((exercise #:n "8")
    "令" $P "是" $RR^2 "上将每个向量平行于" $y "轴投影于" $x "轴的算子: "
    (&= (appl $P $x $y) (tu0 $x $0)) ". 表明" $P "是线性的. " $P
    "的极小多项式是什么?")
   ((exercise #:n "9")
    "令" $A "是一个" n*n "的矩阵, 其特征多项式为"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)) ".")
    "证明"
    (MB (&= (LC0 $c_1 $d_1 $c_k $d_k) (&trace $A)) "."))
   ((exercise #:n "10")
    "令" $V "是域" $F "上的" n*n "矩阵的向量空间. 令" $A "是一个固定的" n*n
    "矩阵. 令" $T "是" $V "上由"
    (MB (&= (app $T $B) (&i* $A $B)))
    "定义的线性算子. 证明" $T "的极小多项式是" $A "的极小多项式.")
   ((exercise #:n "11")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵. 根据6.2节的练习9, 矩阵"
    AB "和" (&i* $B $A) "拥有相同的特征值. 它们有着相同的特征多项式吗? "
    "它们有着相同的极小多项式吗?")
   (H3 "第6.4节 不变子空间")
   (P "本节我们将引入一些在试图分析一个线性算子时有用的概念. "
      "我们将运用这些想法来获得基于极小多项式的对于可对角化"
      " (和可三角化) 算子的刻画.")
   ((definition)
    "令" $V "是一个向量空间而" $T "是" $V "上的一个线性算子. 如果"
    $W "是" $V "的一个子空间, 那么我们称" $W "在" $T "下不变, 如果对于每个向量"
    (∈ $alpha $W) "有向量" (∈ (ap $T $alpha) $W) ", 即"
    (&sube (app $T $W) $W) ".")
   ((example #:n "6")
    "如果" $T "是" $V "上任意的线性算子, 那么" $V "和零子空间在" $T "下不变. "
    $T "的像和零空间也在" $T "下不变.")
   ((example #:n "7")
    "令" $F "是一个域而" $D "是多项式空间" polyF "上的微分算子. 令" $n
    "是正整数而" $W "是次数小于等于" $n "的多项式的子空间, 那么" $W "在"
    $D "下不变. 这只是另一种陈述" $D "是&quot;次数降低&quot;的算子的方式.")
   ((example #:n "8")
    "这里给出例子6的一种非常有用的泛化. 令" $T "是" $V "上的一个线性算子, "
    $U "是任意的与" $T "交换的线性算子, 即" (commute* $T $U)
    ". 令" $W "是" $U "的像, 而" $N "是" $U "的零空间, 那么" $W "和" $N
    "都在" $T "下不变. 如果" $alpha "在" $U "的像中, 比如说"
    (&= $alpha (ap $U $beta)) ", 那么"
    (&= (ap $T $alpha) (ap $T (@ap $U $beta)) (ap $U (@ap $T $beta)))
    ", 于是" (ap $T $alpha) "也在" $U "的像中. 如果" (∈ $alpha $N)
    ", 那么" (&= (ap $U (@ap $T $alpha)) (ap $T (@ap $U $alpha)) (app $T $0) $0)
    ", 因而" (∈ (ap $T $alpha) $N) "." (Br)
    (&= $U (app $g $T)) "是一类与" $T "交换的算子, 其中" $g "是一个多项式. "
    "例如, 我们可以有" (&= $U (&- $T (&i* $c $I))) ", 其中" $c "是" $T
    "的一个特征值. 这个" $U "的零空间对于我们而言是熟悉的. 我们看到这个例子包含了"
    "显见的事实, 即与某个特征值" $c "相关联的" $T "的特征空间在" $T "下是不变的.")
   ((example #:n "9")
    "令" $T "是" $RR^2 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (&= $A (Mat (0 -1) (1 0))))
    "表示, 那么在" $T "下不变的仅有" $RR^2 "平凡的子空间. 若有其他的不变子空间, "
    "那它必然是" $1 "维的. 但是, 若" $W "是由某个非零向量" $alpha "张成的子空间, 那么"
    $W "在" $T "下不变的事实意味着" $alpha "是一个特征向量, 但是" $A
    "没有实特征值.")
   (P "当子空间" $W "在算子" $T "下不变时, " $T "导出了空间" $W "上的一个线性算子"
      $T_W ", 其由" (&cm (&= (app $T_W $alpha) (app $T $alpha)) (∈ $alpha $W))
      "定义. 不过, " $T_W "和" $T "是相当不同的对象, 因为其定义域是" $W "而不是" $V ".")
   (P "若" $V "是有限维的, 那么" $W "在" $T "下的不变性有一个简单的矩阵解释, "
      "或许我们现在就应该提到它. 设我们选取了" $V "的一个有序基" basis:def "使得"
      (&= $BBB^ (setE $alpha_1 $..h $alpha_r)) "是" $W "的一个有序基 (" (&= $r (&dim $W))
      "). 令" (&= $A (coordm $T)) ", 于是"
      (MB (&= (ap $T $alpha_j) (sum (&= $i $1) $n (&i* (mref $A $i $j) $alpha_i))) ".")
      "既然" $W "在" $T "下不变, 那么对于" (&<= $j $r) "有" (∈ (ap $T $alpha_j) $W)
      ", 这意味着"
      (MB (&cm (&= (ap $T $alpha_j)
                   (sum (&= $i $1) $r (&i* (mref $A $i $j) $alpha_i)))
               (&<= $j $r)) ".")
      "换言之, 对于" (&<= $j $r) "且" (&> $i $r) ", " (&= (mref $A $i $j) $0) ".")
   (P "若试图将" $A "写下来, 其具有分块形式"
      (MB (&= $A (Mat ($B $C) ($0 $D))))
      "其中" $B "是一个" (&c* $r $r) "矩阵, " $C "是一个" (&c* $r (@- $n $r))
      "矩阵, " $D "是一个" (&c* (@- $n $r) (@- $n $r)) "矩阵. 读者应该注意到, "
      "根据定义, 矩阵" $B "恰是导出算子" $T_W "在有序基" $BBB^ "下的矩阵.")
   (P "往往我们并不利用矩阵" $A "的分块形式展开关于" $T "和" $T_W "的论证, 但是"
      "我们应该注意到这样的分块形式呈现了" $T "和" $T_W "之间怎样的显然关系.")
   ((lemma)
    "令" $W "是" $T "下不变的子空间. 限制算子" $T_W "的特征多项式整除" $T
    "的特征多项式. " $T_W "的极小多项式整除" $T "的极小多项式.")
   ((proof)
    "我们有"
    (MB (&= $A (Mat ($B $C) ($0 $D))))
    "其中" (&= $A (coordm $T)) "而" (&= $B (coordm $T_W $BBB^))
    ". 对于这样的分块形式, 我们知道"
    (MB (&= (&det (&- (&i* $x $I) $A))
            (&i* (&det (&- (&i* $x $I) $B))
                 (&det (&- (&i* $x $I) $D)))) ".")
    "此即证明了关于特征多项式的陈述. 注意到这里的三个" $I "的大小是不同的." (Br)
    "矩阵" $A "的" $k "次幂具有分块形式"
    (MB (&= $A^k (Mat ($B^k $C_k) ($0 $D^k))))
    "其中" $C_k "是某个" (&c* $r (@- $n $r)) "的矩阵. 因此, 任何零化" $A
    "的多项式也零化" $B " (还有" $D "). 于是, " $B "的极小多项式整除" $A
    "的极小多项式.")
   (P (B "译者注记.") " 对于多项式" $f ", " (app $f $A) "具有形式"
      (MB (&= (app $f $A) (Mat ((app $f $B) $C_f) ($0 (app $f $D)))))
      "其中" $C_f "是某个" (&c* $r (@- $n $r)) "的矩阵. 另外, 关于分块矩阵"
      "的运算性质, 原书几乎没有任何讨论, 或许读者应该参考其他线性代数教材.")
   ((example #:n "10")
    "令" $T "是有限维向量空间" $V "上任意的线性算子. 令" $W "是" $T
    "的所有特征向量张成的子空间. 令" (&cm $c_1 $..h $c_k) "是" $T
    "不同的特征值. 对于每个" $i ", 令" $W_i "是与特征值" $c_i
    "相关的特征空间, 并令" $BBB_i "是" $W_i "的一个有序基. 定理2前的引理告诉我们"
    (&= $BBB^ (tu0 $BBB_1 $..h $BBB_k)) "是" $W "的一个有序基, 因而"
    (MB (&= (&dim $W) (&+ (&dim $W_1) $..c (&dim $W_k))) ".")
    "令" (&= $BBB^ (setE $alpha_1 $..h $alpha_r)) ", 其中最前面的一些向量构成了基"
    $BBB_1 ", 接下来的一些构成了基" (_ $BBB $2) ", 诸如此类. 那么, 我们得到"
    (MB (&cm (&= (ap $T $alpha_i) (&i* $t_i $alpha_i))
             (&= $i (&cm $1 $..h $r))))
    "其中" (&= (tu0 $t_1 $..h $t_r) (tu0 $c_1 $c_1 $..h $c_1 $..h $c_k $c_k $..h $c_k))
    "而" $c_i "重复" (&dim $W_i) "次." (Br)
    "现在" $W "在" $T "下不变, 因为对于每个" (&in $alpha $W) ", 我们有"
    (MB (&cm (&= $alpha (LC0 $x_1 $alpha_1 $x_r $alpha_r))
             (&= (ap $T $alpha)
                 (LC0 (&i* $t_1 $x_1) $alpha_1 (&i* $t_r $x_r) $alpha_r))) ".")
    "选取任意其他的向量" (∈ (_ $alpha (&+ $r $1)) $..h $alpha_n $V) "使得"
    basis:def "是" $V "的一个基, 那么" $T "在" $BBB "下的矩阵具有之前所呈现的那种"
    "分块形式, 并且限制算子" $T_W "相对于基" $BBB^ "的矩阵为"
    (MB (&= $B (Mat ($t_1 0 $..c 0)
                    (0 $t_2 $..c 0)
                    ($..v $..v $ $..v)
                    (0 0 $..c $t_r))) ".")
    $B " (即" $T_W ") 的特征多项式为"
    (MB (&= $g (decomp $c_1 $e_1 $c_k $e_k)))
    "其中" (&= $e_i (&dim $W_i)) ". 而且, " $g "整除" $f ", " $f "是" $T
    "的特征多项式. 因此, " $c_i "作为" $f "的根的重数至少为" (&dim $W_i) "." (Br)
    "以上这些讨论应该能够使得定理2透明起来. 它仅仅是说" $T "是可对角化的当且仅当"
    (&= $r $n) ", 当且仅当" (&= (&+ $e_1 $..c $e_k) $n) ". 在不可对角化的情形下, "
    "它不是很有用, 因为我们不知道分块形式中的矩阵" $C "和" $D "是什么.")
   ((definition)
    "令" $W "是" $T "下不变的子空间, 而" $alpha "是" $V "中向量. 从" $alpha "到"
    $W "的" $T "导子 (" $T "-conductor) 是集合" (conduct $T $alpha $W) ", 其由所有(标量域上)满足"
    (∈ (ap (app $g $T) $alpha) $W) "的多项式" $g "构成.")
   (P "既然算子" $T "在大多数讨论中都是固定的, 我们也常扔掉下标" $T "而就记作"
      (conduct $alpha $W) ". 许多作者通常将这个多项式的集合称为&quot;stuffer&quot; "
      "(das einstopfende Ideal). &quot;conductor&quot;是更标准的术语, 想象一下, "
      "一个不那么激进的算子" (app $g $T) ", 温和地将向量" $alpha "送往" $W
      ". 在" (&= $W (setE $0)) "的特别情况下, 这个导子也被称为" $alpha
      "的" $T "零化子 (" $T "-annihilator).")
   ((lemma)
    "如果" $W "是" $T "下不变的子空间, 那么对于每个多项式" $f ", " $W "在"
    (app $f $T) "下不变. 因此, 对于每个" (∈ $alpha $V) ", 导子"
    (conduct $alpha $W) "是多项式代数" polyF "中的一个理想.")
   ((proof)
    "如果" (&in $beta $W) ", 那么" (&in (ap $T $beta) $W) ". 因此, "
    (&in (&= (app $T (ap $T $beta)) (ap $T^2 $beta)) $W) ". 根据归纳, 对于每个自然数"
    $k "有" (&in (ap $T^k $beta) $W) ". 取线性组合则能看出对于每个多项式" $f
    ", " (&in (ap (app $f $T) $beta) $W) "." (Br)
    "即便" $W "是" $V "的任意子集, " (conduct $alpha $W) "的定义还是可以成立的. 如果"
    $W "是" $V "是子空间, 那么" (conduct $alpha $W) "是" polyF "的子空间, 因为"
    (MB (&= (app (@LC $c $f $g) $T) (LC $c (app $f $T) (app $g $T))) ".")
    "如果" $W "还在" $T "下不变, 令多项式" (∈ $g (conduct $alpha $W)) ", 即"
    (∈ (ap (app $g $T) $alpha) $W) ". 如果" $f "是任意的多项式, 那么"
    (∈ (ap (app $f $T) (bra0 (ap (app $g $T) $alpha))) $W) ". 既然"
    (MB (&= (app (@i* $f $g) $T) (&i* (app $f $T) (app $g $T))) ",")
    "那么" (∈ (&i* $f $g) (conduct $alpha $W)) ". 因此, 导子吸收了乘法.")
   (P "理想" (conduct $alpha $W) "唯一的首项系数为一的生成元也被称为从" $alpha
      "到" $W "的" $T "导子 (在" (&= $W (setE $0)) "的情况下也被称为"
      $T "零化子). 从" $alpha "到" $W "的" $T "导子是满足"
      (∈ (ap (app $g $T) $alpha) $W) "的次数最低的首项系数为一的多项式" $g
      ". 多项式" (∈ $f (conduct $alpha $W)) "当且仅当" $g "整除" $f
      ". 注意到导子" (conduct $alpha $W) "总是包含" $T
      "的极小多项式. 因此, 每个" $T "导子都整除" $T "的极小多项式.")
   (P "作为如何使用导子" (conduct $alpha $W) "的第一个例子, 我们将刻画"
      "可三角化算子. 线性算子" $T "被称为是可三角化的, 如果其在某个有序基下由"
      "三角矩阵表示.")
   ((lemma)
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $T "是" $V
    "上的线性算子, 其极小多项式为线性因子之积"
    (MB (&cm (&= $p (decomp $c_1 $r_1 $c_k $r_k)) (∈ $c_i $F)) ".")
    "令" $W "是" $T "下不变的一个真子空间 (" (&!= $W $V) "). 存在向量"
    (∈ $alpha $V) "满足"
    (Ol #:attr* '((type "a"))
        (Li (&!in $alpha $W) ";")
        (Li (&in (ap (@- $T (&i* $c $I)) $alpha) $W) ", 其中" $c
            "是线性算子" $T "的某个特征值.")))
   ((proof)
    "a和b是在说从" $alpha "到" $W "的" $T "导子是一个线性的多项式. 令"
    (∈ $beta $V) "是任意的不在" $W "之中的向量. 令" $g "是从" $beta "到"
    $W "的" $T "导子, 那么" $g "整除" $p ", 其中" $p "是" $T
    "的极小多项式. 既然" (&!in $beta $W) ", 多项式" $g "不可能是常量多项式. 因此,"
    (MB (&= $g (decomp $c_1 $e_1 $c_k $e_k)))
    "其中至少有一个" $e_i "是正的. 选择使得" (&> $e_j $0) "的" $j ", 那么"
    (@- $x $c_j) "整除" $g ":"
    (MB (&= $g (&i* (@- $x $c_j) $h)) ".")
    "根据" $g "的定义, 向量" (&!in (&= $alpha (ap (app $h $T) $beta)) $W)
    ", 但是"
    (MB (deriv0 (ap (@- $T (&i* $c_j $I)) $alpha)
                $= (ap (@- $T (&i* $c_j $I)) (ap (app $h $T) $beta))
                $= (ap (app $g $T) $beta)
                $in $W)))
   ((theorem #:n "5")
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是" $V "上的一个线性算子, 那么"
    $T "是可三角化的当且仅当" $T "的极小多项式是域" $F "上的线性多项式之积.")
   ((proof)
    "设极小多项式被分解为"
    (MB (&= $p (decomp $c_1 $r_1 $c_k $r_k)) ".")
    "重复应用上述引理, 我们将会抵达一个有序基" basis:def ", 而其下表示" $T
    "的矩阵是上三角的:"
    (MB (&= (coordm $T)
            (Mat ((mref $a $1 $1) (mref $a $1 $2) (mref $a $1 $3) $..c (mref $a $1 $n))
                 ($0 (mref $a $2 $2) (mref $a $2 $3) $..c (mref $a $2 $n))
                 ($0 $0 (mref $a $3 $3) $..c (mref $a $3 $n))
                 ($..v $..v $..v $ $..v)
                 ($0 $0 $0 $..c (mref $a $n $n)))) ".")
    "这个式子仅仅是说"
    (MB (&cm (&= (ap $T $alpha_j) (LC0 (mref $a $1 $j) $alpha_1 (mref $a $j $j) $alpha_j))
             (&<= $1 $j $n)))
    "即" (ap $T $alpha_j) "在由" (&cm $alpha_1 $..h $alpha_j) "张成的子空间之中. 为了找出"
    (&cm $alpha_1 $..h $alpha_n) ", 我们从应用引理于" (&= $W (setE $0)) "的情形开始, 这就得到了向量"
    $alpha_1 ". 接着, 应用引理于" $W_1 ", 此即" $alpha_1 "张成的空间, 我们就得到了" $alpha_2
    ". 然后, 应用引理于" $W_2 ", 即由" $alpha_1 "和" $alpha_2 "张成的空间, 续行此法. "
    "值得说明的是, 在" (&cm $alpha_1 $..h $alpha_i) "找到后, 上面这样的三角类型的关系对于"
    (&= $j (&cm $1 $..h $i)) "成立, 这保证了由" (&cm $alpha_1 $..h $alpha_i)
    "张成的子空间在" $T "下是不变的." (Br)
    "如果" $T "是可三角化的, 那么显然" $T "的特征多项式具有形式"
    (MB (&cm (&= $f (decomp $c_1 $d_1 $c_k $d_k)) (&in $c_i $F)) ".")
    "看看上面的三角矩阵, 我们知道对角线元素" (&cm (mref $a $1 $1) $..h (mref $a $n $n))
    "是其特征值, 其中" $c_i "重复" $d_i "次. 但是, 如果特征多项式" $f "可以被这么分解, 那么极小多项式"
    $p "当然也可以, 因为" $p "整除" $f ".")
   ((corollary)
    "令" $F "是代数闭域, 例如复数域, 那么每个域" $F "上的" n*n "矩阵都在" $F "上相似于一个三角矩阵.")
   ((theorem #:n "6")
    "令" $V "是域" $F "上的有限维向量空间, " $T "是" $V "上的一个线性算子, 那么" $T
    "是可对角化的当且仅当" $T "的极小多项式具有形式"
    (MB (&= $p (&i* (@- $x $c_1) $..c (@- $x $c_k))))
    "其中" (&cm $c_1 $..h $c_k) "是" $F "的不同元素.")
   ((proof)
    "之前我们已经注意到, 如果" $T "是可对角化的, 那么极小多项式是不同的线性因子之积 (见例子4前的讨论). "
    "为了证明其逆, 令" $W "是" $T "的所有特征向量张成的子空间, 并设" (&!= $W $V)
    ". 根据定理5的证明所用到的引理, 存在向量" (&!in $alpha $W) "和" $T "的一个特征值" $c_j "满足"
    (MB (&= $beta (&in (ap (@- $T (&i* $c_j $I)) $alpha) $W)) ".")
    "既然" (∈ $beta $W) ", 那么"
    (MB (&= $beta (&+ $beta_1 $..c $beta_k)))
    "其中" (&cm (&= (ap $T $beta_i) (&i* $c_i $beta_i)) (&<= $1 $i $k))
    ", 因而对于每个多项式" $h "有"
    (MB (&= (ap (app $h $T) $beta)
            (&in (LC0 (app $h $c_1) $beta_1 (app $h $c_k) $beta_k) $W)) ".")
    "既然" (&= $p (&i* (@- $x $c_j) $q)) ", 其中" $q "是某个多项式, 并且"
    (MB (&= (&- $q (app $q $c_j)) (&i* (@- $x $c_j) $h)))
    "我们有"
    (MB (&= (&- (ap (app $q $T) $alpha) (&i* (app $q $c_j) $alpha))
            (ap (app $h $T) (ap (@- $T (&i* $c_j $I)) $alpha))
            (ap (app $h $T) $beta)))
    "但是" (∈ (ap (app $h $T) $beta) $W) ", 并且因为"
    (MB (&= $0 (ap (app $p $T) $alpha)
            (ap (@- $T (&i* $c_j $I)) (ap (app $q $T) $alpha))))
    "向量" (∈ (ap (app $q $T) $alpha) $W) ", 于是"
    (∈ (&i* (app $q $c_j) $alpha) $W) ". 既然" (&!in $alpha $W)
    ", 我们有" (&= (app $q $c_j) $0) ", 但这与" $p "的根互异矛盾"
    " [译注: 显然, 此时需要计入重数].")
   (P "在第6.7节末, 我们将给出定理6的另一个证明. 定理6除了作为优雅的结果, "
      "其在计算方面也是实用的. 设我们有一个线性算子" $T ", 在某个有序基下由矩阵"
      $A "表示, 现在我们想要知道" $T "是否是可对角化的. 我们计算其特征多项式"
      $f ", 如果我们可以将" $f "分解为"
      (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
      "那么我们有两种判断的方法. 第一种方法是看我们能否对于每个" $i
      "找到与特征值" $c_i "相关的" $d_i "个线性无关的特征向量. 另一种方法是检验"
      (&i* (@- $T (&i* $c_1 $I)) $..c (@- $T (&i* $c_k $I)))
      "是否是零算子.")
   (P "定理5提供了对于Cayley-Hamilton定理的一个不同的证明. 这个定理对于三角矩阵而言"
      "是容易证明, 而通过定理5, 对于任意代数闭域上的矩阵我们都可以得到此结果. 实际上, "
      "任何域都是某个代数闭域的子域. 如果读者知道这个结果, 那么就得到了任意域上的矩阵的"
      "Cayley-Hamilton定理. 如果我们至少承认我们对于代数基本定理 (即复数域是代数闭域) "
      "的讨论, 那么定理5提供了对于复矩阵的Cayley-Hamilton的一个证明, "
      "此证明独立于我们之前所给出的.")
   ((exercise #:n "1")
    "令" $T "是" $RR^2 "上的线性算子, 其在标准有序基下的矩阵为"
    (MB (&= $A (Mat (1 -1) (2 2))) ".")
    (Ol #:attr* '((type "a"))
        (Li "证明" $T "的不变子空间仅可能是平凡的.")
        (Li "如果" $U "是" $CC^2 "上的线性算子, 其在标准有序基下的矩阵和" $T
            "一样, 表明" $U "拥有一维的不变子空间.")))
   ((exercise #:n "2")
    "令" $W "是" $T "的一个不变子空间. 证明限制算子" $T_W "的极小多项式整除"
    $T "的极小多项式, 但是不涉及矩阵的概念.")
   ((exercise #:n "3")
    "令" $c "是" $T "的一个特征值, " $W "是与特征值" $c "相关的特征空间. 限制算子"
    $T_W "是什么?")
   ((exercise #:n "4")
    "令"
    (MB (&= $A (Mat (0 1 0) (2 -2 2) (2 -3 2))) ".")
    $A "在实数域上相似于三角矩阵吗? 如果可以, 找出这样的一个三角矩阵.")
   ((exercise #:n "5")
    "每个满足" (&= $A^2 $A) "的矩阵" $A "都是可对角化的.")
   ((exercise #:n "6")
    "令" $T "是" $n "维向量空间" $V "上的一个可对角化算子, " $W
    "是在" $T "下不变的一个子空间. 证明限制算子" $T_W "也是可对角化的.")
   ((exercise #:n "7")
    "令" $T "是域" $CC "上的一个有限维向量空间上的一个线性算子. 证明"
    $T "是可对角化的当且仅当" $T "可由某个域" $CC "上根互异的多项式零化.")
   ((exercise #:n "8")
    "令" $T "是" $V "上的一个线性算子. 如果" $V "的每个子空间都在" $T
    "下不变, 那么" $T "是恒等算子的标量倍数.")
   ((exercise #:n "9")
    "令" $T "是区间" (li0 $0 $1) "上的连续函数空间上的不定积分算子"
    (MB (&= (app (@ap $T $f) $x) (integral $0 $x (app $f $t) $t)) ".")
    "多项式函数空间在" $T "下不变吗? 可微函数空间呢? " (&= $x 1/2)
    "时为零的函数空间呢?")
   ((exercise #:n "10")
    "令" $A "是一个" (&c* $3 $3) "的实矩阵. 证明如果" $A "在" $RR
    "上不相似于一个三角矩阵, 那么" $A "在" $CC "上相似于一个对角矩阵.")
   ((exercise #:n "11")
    "对还是错? 若三角矩阵" $A "相似于一个对角矩阵, 那么" $A
    "已经是一个对角矩阵了.")
   ((exercise #:n "12")
    "令" $T "是某个代数闭域" $F "上的一个有限维向量空间上的一个线性算子, "
    $f "是域" $F "上的一个多项式. 证明" $c "是" (app $f $T)
    "的特征值当且仅当" (&= $c (app $f $t)) ", 其中" $t "是" $T "的一个特征值.")
   ((exercise #:n "13")
    "令" (&= $V (^ $F n*n)) ", " (&in $A $V) ", " $V "上的线性算子"
    $T "和" $U "分别由"
    (&cm (&= (app $T $B) (&i* $A $B))
         (&= (app $U $B) (&- (&i* $A $B) (&i* $B $A))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li "对还是错? 如果" $A "(在" $F "上)可对角化, 那么" $T "是可对角化的.")
        (Li "对还是错? 如果" $A "是可对角化的, 那么" $U "是可对角化的.")))
   (H3 "第6.5节 同时三角化; 同时对角化")
   (P "令" $V "是一个有限维向量空间, " $FFF "是" $V "上的一族线性算子. "
      "我们可以问何时能够同时三角化或者对角化这些" $FFF "中的线性算子, 即找到一个基"
      $BBB "使得矩阵" (&cm (coordm $T) (∈ $T $FFF)) "都是三角矩阵 (或者对角矩阵). "
      "在可对角化的情形, " $FFF "必然是可交换算子族, 即对于所有" (∈ $T $U $FFF)
      ", " (commute* $U $T) ". 当然, 每个" $FFF "中的算子也必然是可对角化的. "
      "为了同时三角化, 每个" $FFF "中的算子必然是可三角化的, 但是" $FFF
      "不必是一个可交换算子族. 然而, 可交换是同时三角化的充分条件 (如果每个"
      $T "都可以被单独三角化). 这些结果只需对于定理5和定理6的证明作小的修改即可得到.")
   (P "子空间" $W "在算子族" $FFF "下不变, 如果其在" $FFF "中的每个算子下不变.")
   ((lemma)
    "令" $FFF "是" $V "上一个可三角化算子的交换族. 令" $W "是一个" $V "的真子空间, 其在"
    $FFF "下不变. 存在" $V "中向量" $alpha "满足"
    (Ol #:attr* '((type "a"))
        (Li (&!in $alpha $W) ";")
        (Li "对于每个" (∈ $T $FFF) ", 向量" (ap $T $alpha) "在" $alpha
            "和" $W "张成的子空间之中.")))
   ((proof)
    "不失一般性, 假定" $FFF "仅包含有限数目的算子, 这是出于以下观察. 令"
    (setE $T_1 $..h $T_r) "是" $FFF "的一个极大线性无关子集, 即" $FFF
    "张成的子空间的一个基. 如果" $alpha "是使得b对于每个" $T_i
    "成立的向量, 那么b将对于" (&cm $T_1 $..h $T_r) "的每个线性组合成立." (Br)
    "根据定理5之前的引理 (这个引理是对于单一的算子而言的), 我们可以找到向量"
    (&!in $beta_1 $W) "和标量" $c_1 "满足" (∈ (ap (@- $T_1 (&i* $c_1 $I)) $beta_1) $W)
    ". 令" (&= $V_1 (setI (∈ $beta $V) (∈ (ap (@- $T_1 (&i* $c_1 $I)) $beta) $W)))
    ", 那么" $V_1 "是" $V "的一个子空间且以" $W "为真子空间. 更进一步, " $V_1 "在"
    $FFF "下不变, 以下是原因. 如果" $T "与" $T_1 "交换, 那么"
    (MB (&= (ap (@- $T_1 (&i* $c_1 $I)) (@ap $T $beta))
            (ap $T (ap (@- $T_1 (&i* $c_1 $I)) $beta))) ".")
    "如果" (∈ $beta $V_1) ", 那么" (∈ (ap (@- $T_1 (&i* $c_1 $I)) $beta) $V_1)
    ". 既然" $W "在" $FFF "下不变, 那么对于每个" (∈ $beta $V_1) "和每个" (∈ $T $FFF)
    ", 我们有" (∈ (ap $T (ap (@- $T_1 (&i* $c_1 $I)) $beta)) $W) ", 即"
    (∈ (ap $T $beta) $V_1) "." (Br)
    "现在" $W "是" $V_1 "的一个真子空间. 令" $U_2 "是由" $T_2 "限制于子空间" $V_1
    "得到的线性算子. " $U_2 "的极小多项式整除" $T_2 "的极小多项式. 因此, 我们可以应用"
    "定理5之前的引理于" $U_2 "和不变子空间" $W ". 我们得到了一个向量" (∈ $beta_2 $V_1)
    "但是" (&!in $beta_2 $W) "和一个标量" $c_2 "满足"
    (∈ (ap (@- $T_2 (&i* $c_2 $I)) $beta_2) $W) ". [译注: 实际上先是" $U_2
    ", 然后变为" $T_2 ".] 注意到"
    (Ol #:attr* '((type "a"))
        (Li (&!in $beta_2 $W) ";")
        (Li (∈ (ap (@- $T_1 (&i* $c_1 $I)) $beta_2) $W) ";")
        (Li (∈ (ap (@- $T_2 (&i* $c_2 $I)) $beta_2) $W) "."))
    "令" (&= $V_2 (setI (∈ $beta $V_1) (∈ (ap (@- $T_2 (&i* $c_2 $I)) $beta) $W)))
    ", 那么" $V_2 "在" $FFF "下不变. 应用定理5之前的引理于" $U_3 ", 即限制" $T_3
    "于" $V_2 "得到的算子. 不断重复施行这样的过程, 我们将抵达一个向量"
    (&= $alpha (&!in $beta_r $W)) "满足"
    (&cm (∈ (ap (@- $T_j (&i* $c_j $I)) $alpha) $W)
         (&= $j (&cm $1 $..h $r))) ".")
   ((theorem #:n "7")
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $FFF "是" $V
    "上的一个可三角化算子的交换族. 存在" $V "的一个有序基使得每个" $FFF
    "中的算子在这个基下都由三角矩阵表示.")
   ((proof)
    "考虑到刚才我们证明的引理, 这个定理的证明和定理5是一样的, 如果读者将"
    $T "替换为" $FFF ".")
   ((corollary)
    "令" $FFF "是某个代数闭域" $F "上的一个" n*n "矩阵的交换族, 存在域"
    $F "上的一个非奇异矩阵" $P "使得对于每个矩阵" (∈ $A $FFF)
    ", " (sim $A) "是上三角矩阵.")
   ((theorem #:n "8")
    "令" $FFF "是有限维向量空间" $V "上的一个可对角化算子的交换族, 存在" $V
    "的一个有序基使得每个" $FFF "中的算子在这个基下都由对角矩阵表示.")
   ((proof)
    "我们可以修饰定理7之前的引理, 使其适应于可对角化的情形, 以此来证明"
    "定理8. 之前在证明定理6的时候, 我们就已经这么做了, 通过修饰定理5"
    "之前的引理以使其适应于可对角化的情形. 然而, 此时通过" $V
    "的维数上的归纳进行证明是更加容易的." (Br)
    "如果" (&= (&dim $V) $1) ", 没有需要证明的东西. 假定定理对于维数小于"
    $n "的向量空间成立, 令" $V "是一个" $n "维空间. 选择任意不是恒等算子"
    "标量倍数的算子" (∈ $T $FFF) ". [译注: 若不然, 则" $FFF "中的算子在任意的基下均可同时对角化.] 令"
    (&cm $c_1 $..h $c_k) "是" $T "不同的特征值, 并令" $W_i "是" $c_i "所对应的特征空间. "
    "[译注: " (&>= $k $2) ".] 固定一个下标" $i ", 那么" $W_i "在任意与" $T
    "交换的算子下都是不变的. 令" $FFF_i "是限制" $FFF "中算子于(不变)子空间"
    $W_i "的线性算子族. 因为限制算子的极小多项式整除本来的算子的极小多项式, 所以每个" $FFF_i
    "中的算子也都是可对角化的. 既然" (&< (&dim $W_i) (&dim $V)) ", 根据归纳假设, " $FFF_i
    "中的算子可以被同时对角化. [译注: 这个限制算子族当然也是交换的族.] 换言之, " $W_i
    "拥有一个基" $BBB_i ", 其包含的向量同时为每个" $FFF_i "中的算子的特征向量." (Br)
    "既然" $T "是可对角化的, 定理2之前的引理告诉我们" (&= $BBB (tu0 $BBB_1 $..h $BBB_k))
    "是" $V "的一个基. 这就是我们要找的基.")
   ((exercise #:n "1")
    "找到一个可逆的实矩阵" $P "使得" (sim $A) "和" (sim $B) "都是对角矩阵, 其中"
    $A "和" $B "是实矩阵"
    (Ol #:attr* '((type "a"))
        (Li (MB (&cm (&= $A (Mat (1 2) (0 2))) (&= $B (Mat (3 -8) (0 -1))))))
        (Li (MB (&cm (&= $A (Mat (1 1) (1 1))) (&= $B (Mat (1 $a) ($a 1))))))))
   ((exercise #:n "2")
    "令" $FFF "是一个" (&c* $3 $3) "复矩阵的交换族. " $FFF
    "至多可以包含多少线性无关的矩阵? " n*n "的情形呢?")
   ((exercise #:n "3")
    "令" $T "是" $n "维空间" $V "上的一个线性算子, 设" $T "具有" $n
    "个不同的特征值. 证明对于任意与" $T "交换的线性算子" $U ", 存在多项式" $g
    "使得" (&= $U (app $g $T)) ".")
   ((exercise #:n "4")
    "令" (&cm $A $B $C $D) "是交换的" n*n "复矩阵. 令" $E "是"
    (&c* (&i* $2 $n) (&i* $2 $n)) "矩阵"
    (MB (&= $E (Mat ($A $B) ($C $D))) ".")
    "证明" (&= (&det $E) (&det (&- (&i* $A $D) (&i* $B $C)))) ".")
   ((exercise #:n "5")
    "令" (&= $V (^ $F n*n)) ", " (∈ $A $V) ", " $V "上的线性算子"
    (&= (app $T_A $B) (&- (&i* $A $B) (&i* $B $A)))
    ". 考虑线性算子族" (setI (∈ $T_A (&L $V $V)) (: $A "为对角矩阵"))
    ", 证明其可以被同时对角化.")
   (H3 "第6.6节 直和分解")
   (P "当我们继续分析单一的线性算子, 我们将以稍微复杂一点的方式刻画我们的想法"
      "&mdash;&mdash;基于子空间而不是矩阵. 本章之初, 我们这样描述我们的目的: "
      "找到一个基使得线性算子的矩阵呈现特别简单的形式. 现在, 我们将我们的目的描述为: "
      "将线性算子所在的空间分解为不变子空间的直和使得这些子空间上的限制算子是简单的.")
   ((definition)
    "令" (&cm $W_1 $..h $W_k) "是向量空间" $V "的子空间. 我们称" (&cm $W_1 $..h $W_k)
    "是线性无关的, 如果"
    (MB (&cm (&= (&+ $alpha_1 $..c $alpha_k) $0) (∈ $alpha_i $W_i)))
    "可以推出每个" (&= $alpha_i $0) ".")
   (P "对于" (&= $k $2) ", " $W_1 "和" $W_2 "线性无关当且仅当"
      (&= (&cap $W_1 $W_2) (setE $0)) ". 如果" (&> $k $2)
      ", " (&cm $W_1 $..h $W_k) "线性无关不仅是说" (&= (&cap $W_1 $..c $W_k) (setE $0))
      ", 实际上每个" $W_j "与其他子空间" $W_i "之交都仅是零子空间.")
   (P "令" (&= $W (&+ $W_1 $..c $W_k)) ", 那么每个向量" (∈ $alpha $W) "均可被表示为和"
      (MB (&cm (&= $alpha (&+ $alpha_1 $..c $alpha_k)) (∈ $alpha_i $W_i)) ".")
      "线性无关的重要性在于, 如果" (&cm $W_1 $..h $W_k) "是线性无关的, 那么" $alpha
      "的这种表示是唯一的, 因为如果"
      (MB (&cm (&= $alpha (&+ $beta_1 $..c $beta_k)) (∈ $beta_i $W_i)))
      "那么" (&= $0 (&+ (@- $alpha_1 $beta_1) $..c (@- $alpha_k $beta_k)))
      ", 于是" (&cm (&= (&- $alpha_i $beta_i) $0) (&= $i (&cm $1 $..h $k)))
      ". 因此, 当" (&cm $W_1 $..h $W_k) "线性无关时, 我们可以将" $W "中的向量当作"
      $k "元组" (&cm (tu0 $alpha_1 $..h $alpha_k) (∈ $alpha_i $W_i))
      "操作, 就像我们操作" $RR^k "的向量一样.")
   ((lemma)
    "令" $V "是有限维向量空间, " (&cm $W_1 $..h $W_k) "是" $V "的子空间, "
    (&= $W (&+ $W_1 $..c $W_k)) ", 那么以下条件等价."
    (Ol #:attr* '((type "a"))
        (Li (&cm $W_1 $..h $W_k) "线性无关.")
        (Li "对于每个" (&cm $j (&<= $2 $j $k)) ", 我们有"
            (MB (&= (&cap $W_j (@+ $W_1 $..c (_ $W (&- $j $1))))
                    (setE $0)) "."))
        (Li "如果" $BBB_i "是" $W_i "的一个有序基, 其中" (&<= $1 $i $k)
            ", 那么" (&= $BBB (tu0 $BBB_1 $..h $BBB_k)) "是"
            $W "的一个有序基.")))
   ((proof)
    "假定a成立, 令向量" (∈ $alpha (&cap $W_j (@+ $W_1 $..c (_ $W (&- $j $1)))))
    ", 那么存在向量" (&cm $alpha_1 $..h (_ $alpha (&- $j $1)) (∈ $alpha_i $W_i))
    "满足" (&= $alpha (&+ $alpha_1 $..c (_ $alpha (&- $j $1)))) ". 鉴于"
    (MB (&= (&+ $alpha_1 $..c (_ $alpha (&- $j $1)) (@- $alpha)
                $0 $..c $0) $0))
    "以及" (&cm $W_1 $..h $W_k) "是线性无关的, 必然有"
    (&= $alpha_1 $alpha_2 $..c (_ $alpha (&- $j $1)) $alpha $0) "." (Br)
    "现在我们证明b可以推出a. 假定b成立, 若a不成立, 存在不全为零的向量"
    (&cm $alpha_1 $..h $alpha_k (∈ $alpha_i $W_i)) "使得"
    (MB (&= $0 (&+ $alpha_1 $..c $alpha_k)) ".")
    "令" (&= $j (ap $max (setI (∈ $i $NN) (&!= $alpha_i $0))))
    ", " $j "是良定义的, 那么"
    (MB (&cm (&= $0 (&+ $alpha_1 $..c $alpha_j)) (&!= $alpha_j $0)))
    "于是" (&= $alpha_j (&- (&- $alpha_1) $..c (_ $alpha (&- $j $1))))
    "是" (&cap $W_j (@+ $W_1 $..c (_ $W (&- $j $1))))
    "中的一个非零向量, 这与条件b相矛盾." (Br)
    "现在我们已经知道a和b是等价的, 让我们看看为什么a等价于c. 假定a成立, 令"
    $BBB_i "是" $W_i "的一个基, 其中" (&<= $1 $i $k) ", 并设"
    (&= $BBB (tu0 $BBB_1 $..h $BBB_k)) ". " $BBB "中向量之间任意的线性关系都具有形式"
    (MB (&= (&+ $beta_1 $..c $beta_k) $0))
    "其中" $beta_i "是" $BBB_i "的某个线性组合. 既然" (&cm $W_1 $..h $W_k)
    "是线性无关的, 每个" $beta_i "都是" $0 ". 又因为每个" $BBB_i "都是线性无关的, "
    $BBB "中的向量之间的线性关系只可能是平凡的. [译注: 这段论证实际上是从定理2之前的引理"
    "以及该引理的证明那里照搬过来的.]" (Br)
    "我们将由c推出a的证明留作练习 (练习2).")
   (P "若以上引理中任意的条件成立 (自然其他条件也成立), 那么我们称和"
      (&= $W (&+ $W_1 $..c $W_k)) "是直的, 或者说" $W "是" (&cm $W_1 $..h $W_k)
      "的直和, 记作"
      (MB (&= $W (&d+ $W_1 $..c $W_k)) ".")
      "在其他文献中, 读者会发现这种和也被称为" (&cm $W_1 $..h $W_k)
      "的独立和或者内直和.")
   ((example #:n "11")
    "令" $V "是域" $F "上的一个有限维向量空间, " (setE $alpha_1 $..h $alpha_n)
    "是" $V "任意的基. 如果" $W_i "是由" $alpha_i "张成的一维子空间, 那么"
    (&= $V (&d+ $W_1 $..c $W_n)) ".")
   ((example #:n "12")
    "令" $n "是一个正整数, " $F "是复数域的一个子域, " $V "是" (^ $F n*n)
    ", " $W_1 "是所有对称矩阵构成的子空间, " $W_2 "是所有斜对称矩阵构成的子空间, 那么"
    (&= $V (&d+ $W_1 $W_2)) ". 如果" (∈ $A $V) ", 那么" $A "作为" $W_1 "的向量和" $W_2
    "的向量之和的唯一表达为"
    (MB (&cm (&= $A (&+ $A_1 $A_2))
             (&= $A_1 (&i* 1/2 (@+ $A $A^t)))
             (&= $A_2 (&i* 1/2 (@- $A $A^t)))) "."))
   ((example #:n "13")
    "令" $T "是有限维向量空间" $V "上任意的线性算子, " (&cm $c_1 $..h $c_k)
    "是其不同的特征值, " $W_i "是" $c_i "对应的特征空间, 那么"
    (&cm $W_1 $..h $W_k) "是线性无关的, 见定理2之前的引理. 特别地, 如果"
    $T "是可对角化的, 那么" (&= $V (&d+ $W_1 $..c $W_k))
    ". [译注: 特征值当然有可能并不存在.]")
   ((definition)
    "如果" $V "是一个向量空间, " $V "的一个投影是" $V
    "上一个满足" (&= $E^2 $E) "的线性算子" $E ".")
   (P "设" $E "是一个投影, 令" $R "是" $E "的像, " $N "是" $E "的零空间."
      (Ol (Li "向量" (∈ $beta $R) "当且仅当" (&= (ap $E $beta) $beta)
              ". 若存在" $alpha "使得" (&= $beta (ap $E $alpha)) ", 那么"
              (&= (ap $E $beta) (ap $E^2 $alpha) (ap $E $alpha) $beta)
              ". 反过来, 如果" (&= $beta (ap $E $beta)) ", 那么(当然有)"
              (∈ $beta $R) ".")
          (Li (&= $V (&d+ $R $N)) ".")
          (Li $alpha "作为" $R "和" $N "的向量之和的唯一表达为"
              (&= $alpha (&+ (ap $E $alpha) (@- $alpha (ap $E $alpha)))) "."))
      "根据1, 2, 3, 很容易看出以下事实. 如果" $R "和" $N "是" $V "的子空间满足"
      (&= $V (&d+ $R $N)) ", 那么存在唯一的投影算子" $E "以" $R "为像且以" $N
      "为零空间. 这个算子被称为沿着" $N "到" $R "上的投影.")
   (P "任意的投影" $E "都可以被(平凡地)对角化. 如果" (setE $alpha_1 $..h $alpha_r)
      "是" $R "的一个基, " (setE (_ $alpha (&+ $r $1)) $..h $alpha_n)
      "是" $N "的一个基, 那么基" basis:def "可以对角化" $E ":"
      (MB (&= (coordm $E) (Mat ($I $0) ($0 $0))))
      "其中" $I "是" (&c* $r $r) "的恒等矩阵. 这有助于解释某些和投影相关的术语. "
      "读者应该看看平面" $RR^2 "或者空间" $RR^3 "里的各种例子以使得他们"
      "信服投影具有特定的几何意义.")
   (P "投影可以用来刻画空间" $V "的直和分解. 设" (&= $V (&d+ $W_1 $..c $W_k))
      ". 对于每个" $j "我们可以定义一个" $V "上的算子" $E_j ". 令" (∈ $alpha $V)
      ", 若" (&cm (&= $alpha (&+ $alpha_1 $..c $alpha_k)) (∈ $alpha_i $W_i))
      ", 定义" (&= (ap $E_j $alpha) $alpha_j) ", 那么" $E_j "是良定义的法则. 容易看出"
      $E_j "是线性的, " $E_j "的像是" $W_j ", 以及" (&= (_^ $E $j $2) $E_j)
      ". " $E_j "的零空间是子空间"
      (MB (@+ $W_1 $..c (_ $W (&- $j $1)) (_ $W (&+ $j $1)) $..c $W_k) ".")
      "这是因为" (&= (ap $E_j $alpha) $0) "的意思即" (&= $alpha_j $0)
      ", 或者说" $alpha "是除了" $W_j "之外的子空间" $W_i "的向量的和. 基于投影" $E_j
      ", 对于每个" (∈ $alpha $V) ", 我们有"
      (MB (&= $alpha (&+ (ap $E_1 $alpha) $..c (ap $E_k $alpha))) ".")
      "这是在说"
      (MB (&= $I (&+ $E_1 $..c $E_k)) ".")
      "注意到如果" (&!= $i $j) ", 那么" (&= (&i* $E_i $E_j) $0)
      ", 因为" $E_j "的像" $W_j "包含于" $E_i "的零空间之中. "
      "我们现在将我们的发现总结如下, 并证明其逆.")
   ((theorem #:n "9")
    "如果" (&= $V (&d+ $W_1 $..c $W_k)) ", 那么存在" $V "上的"
    $k "个线性算子" (&cm $E_1 $..h $E_k) "满足"
    (Ol #:attr* '((type "i"))
        (Li "每个" $E_i "都是投影, 即" (&= (_^ $E $i $2) $E_i) ";")
        (Li "若" (&!= $i $j) ", 那么" (&= (&i* $E_i $E_j) $0) ";")
        (Li (&= $I (&+ $E_1 $..c $E_k)) ";")
        (Li $E_i "的像是" $W_i "."))
    "反过来, 如果" (&cm $E_1 $..h $E_k) "是" $V "上的" $k
    "个线性算子并且满足条件i, ii, iii, 令" $W_i "是" $E_i
    "的像, 那么" (&= $V (&d+ $W_1 $..c $W_k))
    ". [译注: 实际上, ii和iii可以推出i.]")
   ((proof)
    "我们仅需证明逆命题. 设" (&cm $E_1 $..h $E_k) "是" $V
    "上满足前三个条件的线性算子, 令" $W_i "是" $E_i "的像, 那么定有"
    (MB (&= $V (&+ $W_1 $..c $W_k)))
    "这是因为根据条件iii, 对于每个" (∈ $alpha $V) "我们有"
    (MB (&= $alpha (&+ (ap $E_1 $alpha) $..c (ap $E_k $alpha))))
    "而" (∈ (ap $E_i $alpha) $W_i) ". 这个" $alpha "的表达方式是唯一的, 因为若"
    (MB (&= $alpha (&+ $alpha_1 $..c $alpha_k)))
    "而" (∈ $alpha_i $W_i) ", 即存在" $beta_i "满足"
    (&= $alpha_i (ap $E_i $beta_i)) ", 那么根据i和ii我们有"
    (MB (deriv (ap $E_j $alpha)
               (sum (&= $i $1) $k (ap $E_j $alpha_i))
               (sum (&= $i $1) $k
                    (ap $E_j (ap $E_i $beta_i)))
               (ap (_^ $E $j $2) $beta_j)
               (ap $E_j $beta_j)
               $alpha_j))
    "这表明" $V "是" $W_i "的直和.")
   ((exercise #:n "1")
    "令" $V "是一个有限维向量空间, " $W_1 "是" $V "任意的子空间, 证明存在"
    $V "的子空间" $W_2 "满足" (&= $V (&d+ $W_1 $W_2)) ".")
   ((exercise #:n "2")
    "令" $V "是一个有限维向量空间, 而" (&cm $W_1 $..h $W_k) "是满足"
    (MB (&= $V (&+ $W_1 $..c $W_k)) "且"
        (&= (&dim $V) (&+ (&dim $W_1) $..c (&dim $W_k))))
    "的子空间, 证明" (&= $V (&d+ $W_1 $..c $W_k)) ".")
   ((exercise #:n "3")
    "寻找这样一个投影" $E ", 其将" $RR^2 "沿着由" (tu0 $1 $2)
    "张成的子空间投影至由" (tu0 $1 $-1) "张成的子空间.")
   ((exercise #:n "4")
    "如果" $E_1 "和" $E_2 "是投影至线性无关的子空间的算子, 那么"
    (&+ $E_1 $E_2) "也是一个投影, 对还是错呢?")
   ((exercise #:n "5")
    "如果" $E "是一个投影而" $f "是一个多项式, 那么"
    (&= (app $f $E) (LC $a $I $b $E)) ". 如何以" $f
    "的系数表示" $a "和" $b "?")
   ((exercise #:n "6")
    "对还是错? 如果一个可对角化算子的特征值仅是" $0 "和" $1
    ", 那么它是一个投影.")
   ((exercise #:n "7")
    "证明如果" $E "是沿着" $N "到" $R "上的投影, 那么" (@- $I $E)
    "是沿着" $R "到" $N "上的投影.")
   ((exercise #:n "8")
    "令" (&cm $E_1 $..h $E_k) "是空间" $V "上满足"
    (&= (&+ $E_1 $..c $E_k) $I) "的线性算子."
    (Ol #:attr* '((type "a"))
        (Li "证明若" (&!= $i $j) "时有" (&= (&i* $E_i $E_j) $0)
            ", 那么对于每个" $i "有" (&= (_^ $E $i $2) $E_i) ".")
        (Li "在" (&= $k $2) "的情形下, 证明a的逆, 即若有"
            (&= (&+ $E_1 $E_2) $I) "且"
            (&cm (&= (_^ $E $1 $2) $E_1) (&= (_^ $E $2 $2) $E_2))
            ", 那么" (&= (&i* $E_1 $E_2) $0) ".")))
   ((exercise #:n "9")
    "令" $V "是一个实向量空间, " $E "是" $V "上的一个幂等线性算子, 即"
    "投影, 证明" (@+ $I $E) "是可逆的, 并找出" (inv (@+ $I $E)) "是什么.")
   ((exercise #:n "10")
    "令" $F "是复数域的一个子域 (或者一个特征为零的域), " $V "是" $F
    "上的一个有限维向量空间, " (&cm $E_1 $..h $E_k) "是" $V
    "的投影并且满足" (&= (&+ $E_1 $..c $E_k) $I) ". 证明如果"
    (&!= $i $j) ", 那么" (&= (&i* $E_i $E_j) $0)
    ". (提示: 使用迹函数并问问自己投影的迹是什么.)")
   ((exercise #:n "11")
    "令" $V "是一个向量空间, " (&cm $W_1 $..h $W_k) "是" $V "的子空间, "
    (MB (&= $V_j (&+ $W_1 $..c (_ $W (&- $j $1))
                     (_ $W (&+ $j $1)) $..c $W_k)) ".")
    "设" (&= $V (&d+ $W_1 $..c $W_k)) ", 证明对偶空间" V* "拥有直和分解"
    (&= V* (&d+ (_^ $V $1 $0) $..c (_^ $V $k $0))) ".")
   (H3 "第6.7节 不变直和")
   (P "我们主要对于这样的直和分解" (&= $V (&d+ $W_1 $..c $W_k))
      "感兴趣, 其每个子空间" $W_i "都在某个给定的线性算子" $T
      "下不变. 给定这样一种对于" $V "的分解, " $T "通过限制导出了每个"
      $W_i "上的线性算子" $T_i ". " $T "的作用方式如下. 如果" (∈ $alpha $V)
      ", 那么我们有着唯一的分解"
      (MB (&cm (&= $alpha (&+ $alpha_1 $..c $alpha_k)) (∈ $alpha_i $W_i)))
      "然后"
      (MB (&= (ap $T $alpha)
              (&+ (ap $T_1 $alpha_1) $..c (ap $T_k $alpha_k))) ".")
      "我们将这种情况描述为" $T "是算子" (&cm $T_1 $..h $T_k)
      "的直和. 必须要记得使用此术语时" $T_i "不是" $V "上而是子空间"
      $W_i "上的线性算子. " (&= $V (&d+ $W_1 $..c $W_k)) "的事实允许我们将每个"
      (∈ $alpha $V) "与唯一的一个" $k "元组" (tu0 $alpha_1 $..h $alpha_k)
      "联系起来, 其中" (∈ $alpha_i $W_i) " (通过"
      (&= $alpha (&+ $alpha_1 $..c $alpha_k)) "), 再加上每个" $W_i
      "都在" $T "下不变, 我们可以将" $T "在" $V "上的作用视为" $T_i "于" $W_i
      "上的各独立作用之和. 我们寻找不变直和分解的最终目的当然还是研究"
      $T ", 分解中的每个" $T_i "的性质都应该是比较简单的.")
   (P "在观察例子之前, 让我们先来指出其矩阵形式的类比. 设我们为每个" $W_i
      "挑选了一个有序基" $BBB_i ", 那么" (&= $BBB (tu0 $BBB_1 $..h $BBB_k)) "是" $V
      "的一个有序基. 根据之前讨论单一不变子空间的矩阵类比的经验, 很容易看出来如果"
      (&= $A (coordm $T)) "且" (&= $A_i (coordm $T_i $BBB_i)) ", 那么" $A "具有分块形式"
      (MB (&= $A (Mat ($A_1 $0 $..c $0)
                      ($0 $A_2 $..c $0)
                      ($..v $..v $ $..v)
                      ($0 $0 $..c $A_k))) "."))
   (P "往往我们藉由与直和分解相关联的投影来刻画那些子空间 (定理9), "
      "于是我们需要能够基于投影来重述不变直和.")
   ((theorem #:n "10")
    "令" $T "是空间" $V "上的一个线性算子, 而" (&cm $W_1 $..h $W_k) "和"
    (&cm $E_1 $..h $E_k) "的情况和定理9一样, 那么每个" $W_i "都在" $T
    "下不变的充要条件是" $T "与每个" $E_i "交换, 即"
    (MB (&cm (commute* $T $E_i) (&= $i (&cm $1 $..h $k))) "."))
   ((proof)
    "设" $T "与每个" $E_i "交换. 令" (∈ $alpha $W_j) ", 那么"
    (&= (ap $E_j $alpha) $alpha) ", 并有"
    (eqnderiv (ap $T $alpha)
              (app $T (ap $E_j $alpha))
              (app $E_j (ap $T $alpha)))
    "这表明" (∈ (ap $T $alpha) $W_j) ", 即" $W_j
    "在" $T "下不变." (Br)
    "现在假定每个" $W_i "都在" $T "下不变, 我们将证明" (commute* $T $E_j)
    ". 令" (∈ $alpha $V) ", 那么"
    (MB (&cm (&= $alpha (&+ (ap $E_1 $alpha) $..c (ap $E_k $alpha)))
             (&= (ap $T $alpha)
                 (&+ (ap $T (ap $E_1 $alpha)) $..c
                     (ap $T (ap $E_k $alpha))))) ".")
    "因为" (∈ (ap $E_i $alpha) $W_i) ", 并且" $W_i "在" $T
    "下不变, 于是" (∈ (app $T (ap $E_i $alpha)) $W_i) ", 存在向量" $beta_i
    "满足" (&= (app $T (ap $E_i $alpha)) (ap $E_i $beta_i)) ", 那么"
    (eqnderiv (ap $E_j (ap $T (ap $E_i $alpha)))
              (ap $E_j (ap $E_i $beta_i))
              (Choice0
               ($0 ", 如果" (&!= $i $j))
               ((ap $E_j $beta_j) ", 如果" (&= $i $j))))
    "因此"
    (eqnderiv (ap $E_j (ap $T $alpha))
              (&+ (ap $E_j (ap $T (ap $E_1 $alpha))) $..c
                  (ap $E_j (ap $T (ap $E_k $alpha))))
              (ap $E_j $beta_j)
              (ap $T (ap $E_j $alpha)))
    "这对于每个" (∈ $alpha $V) "自然都是成立的, 所以" (commute* $T $E_j)
    ". [译注: 以" $beta_i "作为媒介实际上是不必要的, 在译者看来直接讨论更加清晰明了.]")
   (P "现在我们将以不变直和分解 (与" $T "交换的投影) 的语言刻画可对角化算子"
      $T ". 这将有助于我们理解之后一些更加深刻的分解定理. 这种描述乍看上去"
      "可能比较复杂, 但是读者应该明白这是我们第一次得以瞥见一种非常有效的方法, 其可以将"
      "子空间, 基, 矩阵之类的相关问题规约为线性算子的代数计算. 在稍微熟悉之后, "
      "这种推理方法的有效和优雅应该是显然的.")
   ((theorem #:n "11")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 如果" $T "是可对角化的并且"
    (&cm $c_1 $..h $c_k) "是其不同的特征值, 那么存在" $V "上的线性算子"
    (&cm $E_1 $..h $E_k) "满足"
    (Ol #:attr* '((type "i"))
        (Li (&= $T (LC0 $c_1 $E_1 $c_k $E_k)) ";")
        (Li (&= $I (&+ $E_1 $..c $E_k)) ";")
        (Li "若" (&!= $i $j) ", 则" (&= (&i* $E_i $E_j) $0) ";")
        (Li (&= (_^ $E $i $2) $E_i) " (即" $E_i "是投影);")
        (Li $E_i "的像是与" $c_i "相关联的特征空间."))
    "反过来, 如果存在" $k "个不同的标量" (&cm $c_1 $..h $c_k)
    "和" $k "个非零的线性算子" (&cm $E_1 $..h $E_k)
    "满足条件i, ii, iii, 那么" $T "是可对角化的, " (&cm $c_1 $..h $c_k)
    "是" $T "的不同的特征值, 并且条件iv和v也得到满足.")
   ((proof)
    "设" $T "是可对角化的, 并以" (&cm $c_1 $..h $c_k)
    "为不同的特征值. 令" $W_i "是与" $c_i "相关联的特征空间. 正如我们之前所见,"
    (MB (&= $V (&d+ $W_1 $..c $W_k)) ".")
    "和定理9一样, 令" (&cm $E_1 $..h $E_k) "是与该分解对应的投影, 那么"
    "ii, iii, iv, v被满足是显然的. 为了验证i, 我们按照以下方式处理. 对于每个"
    (∈ $alpha $V) ", 我们有"
    (MB (&= $alpha (&+ (ap $E_1 $alpha) $..c (ap $E_k $alpha))))
    "于是"
    (eqnderiv (ap $T $alpha)
              (&+ (ap $T (ap $E_1 $alpha)) $..c (ap $T (ap $E_k $alpha)))
              (LC0 $c_1 (ap $E_1 $alpha) $c_k (ap $E_k $alpha)))
    "换言之, " (&= $T (LC0 $c_1 $E_1 $c_k $E_k)) "." (Br)
    "现在设我们给定了一个以不同的标量" $c_i "为特征值的线性算子" $T
    "以及非零的线性算子" $E_i "满足i, ii, iii. 既然当" (&!= $i $j)
    "时有" (&= (&i* $E_i $E_j) $0) ", 那么我们给"
    (&= $I (&+ $E_1 $..c $E_k)) "两边同乘" $E_i "就立即得到了"
    (&= (_^ $E $i $2) $E_i) ". 对于" (&= $T (LC0 $c_1 $E_1 $c_k $E_k))
    "两边右乘" $E_i ", 那么我们有" (&= (&i* $T $E_i) (&i* $c_i $E_i))
    ", 这表明了" $E_i "的像之中的向量也在" (@- $T (&i* $c_i $I))
    "的零空间里. 因为我们已经假定" (&!= $E_i $0) ", 所以" (@- $T (&i* $c_i $I))
    "的零空间中至少存在一个非零向量, 即" $c_i "是" $T "的一个特征值. 而且, 这些"
    $c_i "就是" $T "的全部的特征值了. 这是因为如果" $c "是任意的特征值, 那么"
    (MB (&= (&- $T (&i* $c $I)) (LC0 (@- $c_1 $c) $E_1 (@- $c_k $c) $E_k)))
    "于是若" (&= (ap (@- $T (&i* $c $I)) $alpha) $0) ", 我们必有"
    (&= (&i* (@- $c_i $c) (ap $E_i $alpha)) $0) ". 如果" $alpha
    "不是零向量, 那么存在某个" $i "使得" (&!= (ap $E_i $alpha) $0)
    ", 于是对于这个" $i "我们有" (&= (&- $c_i $c) $0) "." (Br)
    "当然" $T "是可对角化的, 因为我们已经表明了每个" $E_i "的像中的向量都是"
    $T "的特征向量, 而且" (&= $I (&+ $E_1 $..c $E_k))
    "告诉我们这些特征向量可以张成" $V ". 剩下来我们需要说明的就只是"
    (@- $T (&i* $c_i $I)) "的零空间恰为" $E_i "的像. 但这是显然的, 因为如果"
    (&= (ap $T $alpha) (&i* $c_i $alpha)) ", 那么"
    (MB (&= (sum (&= $j $1) $k (&i* (@- $c_j $c_i) (ap $E_j $alpha))) $0))
    "因此对于每个" $j "有"
    (MB (&= (&i* (@- $c_j $c_i) (ap $E_j $alpha)) $0))
    "那么对于" (&!= $j $i) "都有"
    (MB (&= (ap $E_j $alpha) $0))
    "既然" (&= $alpha (&+ (ap $E_1 $alpha) $..c (ap $E_k $alpha)))
    "并且" (&!= $j $i) "时有" (&= (ap $E_j $alpha) $0)
    ", 我们有" (&= $alpha (ap $E_i $alpha)) ", 即" $alpha
    "在" $E_i "的像之中.")
   (P "定理9的一部分告诉我们, 对于一个可对角化算子" $T "而言, 标量"
      (&cm $c_1 $..h $c_k) "和算子" (&cm $E_1 $..h $E_k)
      "由条件i, ii, iii以及" $c_i "不同和" $E_i "非零的事实所唯一确定. 这种分解"
      (&= $T (LC0 $c_1 $E_1 $c_k $E_k)) "的一个令人愉快的特性在于如果"
      $g "是域" $F "上任意的多项式, 那么"
      (MB (&= (app $g $T) (LC0 (app $g $c_1) $E_1 (app $g $c_k) $E_k)) ".")
      "我们将证明的细节留给读者. 为了看明白其是如何得以证明的, 读者只需对于每个正整数"
      $r "计算" $T^r ", 例如"
      (eqnderiv $T^2
                (&i* (@sum (&= $i $1) $k (&i* $c_i $E_i))
                     (@sum (&= $j $1) $k (&i* $c_j $E_j)))
                (sum (&= $i $1) $k
                     (sum (&= $j $1) $k
                          (&i* $c_i $c_j $E_i $E_j)))
                (sum (&= $i $1) $k
                     (&i* (_^ $c $i $2) (_^ $E $i $2)))
                (sum (&= $i $1) $k
                     (&i* (_^ $c $i $2) $E_i)))
      "读者应该将这个结果与" $A "为对角矩阵时的" (app $g $A)
      "进行比较, 因为" (app $g $A) "就是以"
      (&cm (app $g (mref $A $1 $1)) $..h (app $g (mref $A $n $n)))
      "为对角元素的对角矩阵.")
   (P "我们特别想要指出当人们应用与" (&cm $c_1 $..h $c_k)
      "相对应的Lagrange多项式"
      (MB (&= $p_j (prod (&!= $i $j) $
                         (~ (@- $x $c_i)
                            (@- $c_j $c_i)))))
      "时会发生什么. 我们有" (&= (app $p_j $c_i) δij) ", 这表明"
      (eqnderiv (app $p_j $T)
                (sum (&= $i $1) $k (&i* δij $E_i))
                $E_j)
      "因此投影" $E_i "不仅与" $T "交换, 还是多项式应用于" $T "的结果.")
   (P "这样应用多项式于" $T "的计算可以用来给出定理6的另一个证明, 定理6"
      "基于极小多项式刻画了可对角化的条件. 这个证明完全独立于我们先前所给出的.")
   (P "如果" $T "是可对角化的, " (&= $T (LC0 $c_1 $E_1 $c_k $E_k))
      ", 那么对于每个多项式" $g "有"
      (MB (&= (app $g $T) (LC0 (app $g $c_1) $E_1 (app $g $c_k) $E_k)))
      "因此" (&= (app $g $T) $0) "当且仅当对于每个" $i "有"
      (&= (app $g $c_i) $0) ". 特别地, " $T "的极小多项式为"
      (MB (&= $p (&i* (@- $x $c_1) $..c (@- $x $c_k))) "."))
   (P "现在设" $T "是以" (&= $p (&i* (@- $x $c_1) $..c (@- $x $c_k)))
      "为极小多项式的线性算子, 其中" (&cm $c_1 $..h $c_k)
      "是标量域的不同元素. 我们构造Lagrange多项式"
      (MB (&= $p_j (prod (&!= $i $j) $
                         (~ (@- $x $c_i)
                            (@- $c_j $c_i)))) ".")
      "回忆一下第4章, " (&= (app $p_j $c_i) δij) "以及对于任意次数小于等于"
      (@- $k $1) "的多项式, 我们有"
      (MB (&= $g (LC0 (app $g $c_1) $p_1 (app $g $c_k) $p_k)) ".")
      "取" $g "为标量多项式" $1 ", 然后是多项式" $x ", 我们得到"
      (MB (&cm (&= $1 (&+ $p_1 $..c $p_k))
               (&= $x (LC0 $c_1 $p_1 $c_k $p_k))) ".")
      "(聪明的读者可能会注意到应用Lagrange插值于" $x
      "可能并不合法, 因为" $k "可能是" $1 ". 但是如果" (&= $k $1)
      ", " $T "是恒等算子的一个标量倍数, 因而是可对角化的.) 现在令"
      (&= $E_j (app $p_j $T)) ", 根据Lagrange插值我们有"
      (MB (&cm (&= $I (&+ $E_1 $..c $E_k))
               (&= $T (LC0 $c_1 $E_1 $c_k $E_k))) ".")
      "观察到如果" (&!= $i $j) ", 那么" (&i* $p_i $p_j)
      "被极小多项式" $p "整除, 因为每个" $c_r
      "都是其根. 因此, 我们可以推出"
      (MB (&cm (&= (&i* $E_i $E_j) $0) (&!= $i $j)) ".")
      "我们还需要注意到另一个事实, 即对于每个" $i "有"
      (&!= $E_i $0) ". 这是因为" $p "是" $T
      "的极小多项式, 而" $p_i "的次数小于" $p "的次数, 所以不可能有"
      (&= (app $p_i $T) $0) ". 现在应用定理11, 我们可以得出"
      $T "是可对角化的. [译注: 实际上, 即便没有" (&!= $E_i $0)
      ", 也足够断言" $T "是可对角化的. 这是因为" (&cm $E_1 $..h $E_k)
      "显然可以被同时对角化, 而恰恰在这个同时对角化的基下, 鉴于"
      (&= $T (LC0 $c_1 $E_1 $c_k $E_k)) ", 直接就可以看出" $T
      "的表示矩阵是对角矩阵. 之所以定理11需要额外的条件, 那是因为"
      "定理11作出了额外的断言.]")
   ((exercise #:n "1")
    "令" $E "是一个" $V "的投影, " $T "是" $V "上的一个线性算子. 证明"
    $E "的像在" $T "下不变当且仅当" (&= (&i* $E $T $E) (&i* $T $E))
    ". 证明" $E "的像与零空间均在" $T "下不变当且仅当" (commute* $E $T) ".")
   ((exercise #:n "2")
    "令" $T "是" $RR^2 "上的线性算子, 其在标准有序基下的矩阵为"
    (MB (Mat ($2 $1) ($0 $2)) ".")
    "令" $W_1 "是由" (&= $epsilon_1 (tu0 $1 $0)) "张成的" $RR^2 "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W_1 "在" $T "下不变.")
        (Li "证明不存在子空间" $W_2 "满足其在" $T "下不变且与" $W_1 "互补:"
            (MB (&= $RR^2 (&d+ $W_1 $W_2)) "."))))
   ((exercise #:n "3")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $R "是" $T
    "的像, " $N "是" $T "的零空间, 证明" $R "和" $N "线性无关当且仅当"
    (&= $V (&d+ $R $N)) ".")
   ((exercise #:n "4")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 设"
    (&= $V (&d+ $W_1 $..c $W_k)) ", 其中每个" $W_i "都在" $T
    "下不变, 令" $T_i "是" $W_i "上导出的(限制)算子."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (&det $T) (&i* (&det $T_1) $..c (&det $T_k))) ".")
        (Li "证明" $T "的特征多项式是" (&cm $T_1 $..h $T_k)
            "的特征多项式之积.")
        (Li "证明" $T "的极小多项式是" (&cm $T_1 $..h $T_k)
            "的极小多项式的最小公倍式. (提示: 证明并使用与矩阵直和有关的相应事实.)")))
   ((exercise #:n "5")
    "令" $T "是第6.2节例子3中的线性算子, 使用Lagrange多项式将表示矩阵" $A "写成"
    (&cm (&= $A (&+ $E_1 (&i* $2 $E_2)))
         (&= (&+ $E_1 $E_2) $I)
         (&= (&i* $E_1 $E_2) $0))
    "的形式.")
   ((exercise #:n "6")
    "令" $A "是第6.3节例子5中的矩阵, 找出矩阵" (&cm $E_1 $E_2 $E_3) "使得"
    (&cm (&= $A (LC $c_1 $E_1 $c_2 $E_2 $c_3 $E_3))
         (&= (&+ $E_1 $E_2 $E_3) $I)
         (&= (&i* $E_i $E_j) $0) (&!= $i $j)) ".")
   ((exercise #:n "7")
    "在练习5和6中, 注意到(对于每个" $i ")与特征值" $c_i
    "相关联的特征空间由满足" (&!= $j $i) "的各个矩阵" $E_j
    "的列向量张成, 这是巧合吗? [译注: 练习本身很有可能是错误的, "
    "应该将其改为&quot;由" $E_i "的列向量张成&quot;.]")
   ((exercise #:n "8")
    "令" $T "是" $V "上的一个线性算子, 其与每个" $V "的投影交换, 关于"
    $T "你能知道什么?")
   ((exercise #:n "9")
    "令" $V "是区间" (li0 $-1 $1) "上的实值连续函数的向量空间, "
    $W_e "是由偶函数构成的子空间, " $W_o "是由奇函数构成的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= $V (&d+ $W_e $W_o)) ".")
        (Li "如果" $T "是不定积分算子"
            (MB (&= (app (@ap $T $f) $x)
                    (integral $0 $x (app $f $t) $t)))
            $W_e "和" $W_o "在" $T "下不变吗?")))
   (H3 "第6.8节 准素分解定理")
   (P "我们一直在尽力研究有限维空间" $V "上的线性算子" $T
      ", 通过将其分解为算子的直和, 这些算子在某种意义上是简单的. 在特定的情况下, "
      "即" $T "的极小多项式在标量域" $F "上可以被分解为不同的首项系数为一的"
      "一次多项式之积时, 我们藉由特征值和特征向量的概念就可以完成分解. 那么"
      "对于一般情况下的" $T ", 我们该怎么做呢? 如果我们想要通过特征值来研究"
      $T ", 我们将面临两个问题. 第一个问题是" $T "可能压根没有特征值, "
      "这或许应该归咎于标量域, 即它不是代数闭域. 第二个问题是即便特征多项式在"
      $F "上可以被完全分解为一次多项式之积, 仍然可能没有足够的特征向量以张成"
      $V ", 这显然应该归咎于" $T ". 我们用一个例子来刻画第二种情况. 现在给定"
      $F^3 " (" $F "为任意的域) 上的线性算子" $T ", 其在标准有序基下由"
      (MB (&= $A (Mat (2 0 0) (1 2 0) (0 0 -1))))
      "表示. " $A "的特征多项式为" (&i* (^ (@- $x $2) $2) (@+ $x $1))
      ", 这也是" $A " (或者" $T ") 的极小多项式. 因此, " $T
      "是不可对角化的. 读者可以看出来, 这种情况会发生是因为" (@- $T (&i* $2 $I))
      "的零空间仅是一维的. 另一方面, " (@+ $T $I) "的零空间和"
      (^ (@- $T (&i* $2 $I)) $2) "的零空间一起可以张成" $V
      ", 前者是由" $epsilon_3 "张成的子空间, 后者是由" $epsilon_1 "和"
      $epsilon_2 "张成的子空间.")
   (P "这或多或少将会是我们处理第二个问题的一般方法. 如果 (记住这是一个假设) "
      $T "的极小多项式可以被分解为"
      (MB (&= $p (decomp $c_1 $r_1 $c_k $r_k)))
      "其中" (&cm $c_1 $..h $c_k) "是" $F "的不同元素, 那么我们可以证明空间"
      $V "是" (&cm (^ (@- $T (&i* $c_i $I)) $r_i) (&= $i (&cm $1 $..h $k)))
      "的零空间的直和. 这关于极小多项式" $p "的假设等价于" $T
      "是可三角化的 (定理5). 然而, 这条知识并不会帮到我们.")
   (P "我们实际将要证明的定理比起刚才所描述的要更加一般, 因为它考虑的是极小多项式的"
      "素因子分解, 不论素因子本身的次数是否为一. 读者或许会发现思考素因子均为一次的"
      "特殊情形是有用的, 甚至是思考定理6的基于投影概念的证明, 定理6是这个定理更加特殊的情形.")
   ((theorem #:n "12. 准素分解定理 (Primary Decomposition Theorem)")
    "令" $T "是域" $F "上的有限维向量空间" $V "上的线性算子, 设" $p "是" $T
    "的极小多项式, 其分解为"
    (MB (&= $p (&i* (_^ $p $1 $r_1) $..c (_^ $p $k $r_k))))
    "其中" $p_i "是域" $F "上互异的首项系数为一的素多项式而" $r_i "是正整数. "
    "[译注: 原文用的是irreducible而不是prime, 但是如果追究第4章的定义的细节的话, "
    "素多项式是更加适合的, 因为素多项式被定义为非标量的不可约多项式, 虽然即便在第4章原文中"
    "作者已经开始混淆这两个概念.] 令" $W_i "是"
    (&cm (app (_^ $p $i $r_i) $T) (&= $i (&cm $1 $..h $k))) "的零空间, 那么"
    (Ol #:attr* '((type "i"))
        (Li (&= $V (&d+ $W_1 $..c $W_k)) ";")
        (Li "每个" $W_i "都在" $T "下不变;")
        (Li "如果" $T_i "是" $T "在" $W_i "上由限制导出的算子, 那么" $T_i
            "的极小多项式为" (_^ $p $i $r_i) ".")))
   ((proof)
    "证明的想法如下. 如果i的直和分解是可能的, 那么我们该如何得到与之相关的投影"
    (&cm $E_1 $..h $E_k) "呢? 投影" $E_i "在" $W_i "上是恒等算子, 在其他的"
    $W_j "上则是零算子. 我们将寻找一个多项式" $h_i "使得" (app $h_i $T)
    "在" $W_i "上是恒等算子而在其他" $W_j "上均是零算子, 于是"
    (&= (&+ (app $h_1 $T) $..c (app $h_k $T)) $I) ", 等等." (Br)
    "对于每个" $i ", 令"
    (MB (&= $f_i (~ $p (_^ $p $i $r_i)) (prod (&!= $j $i) $ (_^ $p $j $r_j))) ".")
    "既然" (&cm $p_1 $..h $p_k) "是不同的素多项式, 多项式" (&cm $f_1 $..h $f_k)
    "是互素的 (第4章的定理10). 因此, 存在多项式" (&cm $g_1 $..h $g_k) "满足"
    (MB (&= (sum (&= $i $1) $n (&i* $f_i $g_i)) $1) ".")
    "我们也注意到, 如果" (&!= $i $j) ", 那么" (&i* $f_i $f_j) "被多项式" $p
    "整除, 因为" (&i* $f_i $f_j) "包含每个" (_^ $p $m $r_m)
    "作为因子. 我们将说明多项式" (&= $h_i (&i* $f_i $g_i))
    "表现得如同证明的第一段所述的那样." (Br)
    "令" (&= $E_i (app $h_i $T) (&i* (app $f_i $T) (app $g_i $T)))
    ". 既然" (&= (&+ $h_1 $..c $h_k) $1) "且" $p "整除"
    (&cm (&i* $f_i $f_j) (&!= $i $j)) ", 我们有"
    (MB (&cm (&= (&+ $E_1 $..c $E_k) $I)
             (&= (&i* $E_i $E_j) $0) (&!= $i $j)) ".")
    "因此, 这些" $E_i "是与某个" $V "的直和分解相对应的投影. 我们想要证明"
    $E_i "的像恰是子空间" $W_i ". 显然" $E_i "的像的每个向量都在" $W_i
    "之中, 因为若" $alpha "在" $E_i "的像中, 那么" (&= $alpha (ap $E_i $alpha)) ", 于是"
    (eqnderiv (ap (app (_^ $p $i $r_i) $T) $alpha)
              (ap (app (_^ $p $i $r_i) $T) (ap $E_i $alpha))
              (ap (app (_^ $p $i $r_i) $T) (ap (&i* (app $f_i $T) (app $g_i $T)) $alpha))
              (ap (app (@i* $p $g_i) $T) $alpha)
              $0)
    "鉴于" $p "是极小多项式. 反过来, 设" $alpha "在" (app (_^ $p $i $r_i) $T)
    "的零空间之中. 如果" (&!= $j $i) ", 那么" (&i* $f_j $g_j) "被" (_^ $p $i $r_i)
    "整除, 于是" (&= (ap (app (@i* $f_j $g_j) $T) $alpha) $0) ", 即"
    (&cm (&= (ap $E_j $alpha) $0) (&!= $j $i)) ". 但是, 这立刻就可以推出"
    (&= (ap $E_i $alpha) $alpha) ", 即" $alpha "在" $E_i "的像之中. "
    "这就完成了陈述i的证明." (Br)
    "子空间" $W_i "显然在" $T "是不变的. [译注: 可以直接证明, 也可应用定理10.] 如果"
    $T_i "是由" $T "限制于" $W_i "导出的算子, 那么显然有"
    (&= (app (_^ $p $i $r_i) $T_i) $0) ", 因为根据定义, " (app (_^ $p $i $r_i) $T)
    "在子空间" $W_i "上的值均为" $0 ". 这表明" $T_i "的极小多项式整除"
    (_^ $p $i $r_i) ". 反过来, 令" $g "是" $T_i "的一个零化多项式, 即"
    (&= (app $g $T_i) $0) ", 那么" (&= (&i* (app $g $T) (app $f_i $T)) $0)
    ". [译注: 这里没有那么平凡, 对于" (∈ $alpha $W_i) "有"
    (&= (ap (app $g $T) $alpha) (ap (app $g $T_i) $alpha) $0)
    ", 而对于" (&cm (∈ $alpha $W_j) (&!= $j $i)) ", 我们知道" (_^ $p $j $r_j)
    "整除" $f_i ", 所以" (&= (ap (app $f_i $T) $alpha) $0)
    ", 将这两者综合, 又因为" $V "是" $W_i "的直和, 我们才得到" (&i* $g $f_i)
    "是" $T "的一个零化多项式.] 因此, " (&i* $g $f_i) "被" $T "的极小多项式" $p
    "整除, 即" (&i* (_^ $p $i $r_i) $f_i) "整除" (&i* $g $f_i)
    ". 很容易看出来" (_^ $p $i $r_i) "整除" $g ". [译注: 这是因为" (&!= $f_i $0)
    ".] 因此, " (_^ $p $i $r_i) "也整除" $T_i "的极小多项式, 那么" $T_i
    "的极小多项式就是" (_^ $p $i $r_i) ".")
   ((corollary)
    "如果" (&cm $E_1 $..h $E_k) "是与" $T "的准素分解相关的投影, 那么每个"
    $E_i "都是应用某个多项式于" $T "的值. 因此, 如果线性算子" $U "与" $T
    "交换, 那么" $U "与每个" $E_i "交换, 即每个子空间" $W_i "都在"
    $U "下不变.")
   (P "在定理12的证明的记号下, 让我们看看" $T "的极小多项式是一次多项式之积的"
      "特殊情形, 即每个" $p_i "都具有形式" (&= $p_i (&- $x $c_i))
      ". 现在" $E_i "的像是" (^ (@- $T (&i* $c_i $I)) $r_i)
      "的零空间" $W_i ". 让我们置" (&= $D (LC0 $c_1 $E_1 $c_k $E_k))
      ". 根据定理11, " $D "是一个可对角化算子, 我们将其称为" $T
      "的" (B "可对角化部分") ". 让我们看看算子" (&= $N (&- $T $D)) ". 因为"
      (MB (&cm (&= $T (&+ (&i* $T $E_1) $..c (&i* $T $E_k)))
               (&= $D (LC0 $c_1 $E_1 $c_k $E_k))))
      "所以"
      (MB (&= $N (&+ (&i* (@- $T (&i* $c_1 $I)) $E_1) $..c
                     (&i* (@- $T (&i* $c_k $I)) $E_k))))
      "读者现在对于投影已经足够熟悉了, 可以看出"
      (MB (&= $N^2 (&+ (&i* (^ (@- $T (&i* $c_1 $I)) $2) $E_1) $..c
                       (&i* (^ (@- $T (&i* $c_k $I)) $2) $E_k))))
      "以及在一般情况下"
      (MB (&= $N^r (&+ (&i* (^ (@- $T (&i* $c_1 $I)) $r) $E_1) $..c
                       (&i* (^ (@- $T (&i* $c_k $I)) $r) $E_k))))
      "当" $r "满足对于每个" $i "有" (&>= $r $r_i)
      "时, 我们有" (&= $N^r $0) ", 因为算子" (^ (@- $T (&i* $c_i $I)) $r)
      "在" $E_i "的像上为" $0 ".")
   ((definition)
    "令" $N "是向量空间" $V "上的一个线性算子. 我们称" $N
    "是幂零算子, 如果存在某个正整数" $r "满足" (&= $N^r $0) ".")
   ((theorem #:n "13")
    "令" $T "是域" $F "上的有限维向量空间" $V "上的一个线性算子, 设"
    $T "的极小多项式在" $F "上被分解为线性多项式之积, 那么存在" $V
    "上的一个可对角化算子" $D "和一个幂零算子" $N "满足"
    (Ol #:attr* '((type "i"))
        (Li (&= $T (&+ $D $N)) ";")
        (Li (commute* $D $N) "."))
    "可对角化算子" $D "和幂零算子" $N "由i和ii唯一确定, 并且它们都是某个"
    "多项式应用于" $T "的结果.")
   ((proof)
    "我们刚才观察到我们可以将" $T "写成" (&+ $D $N) ", 其中" $D
    "是可对角化的而" $N "是幂零算子. 并且, " $D "和" $N
    "不仅是可交换的, 它们还是应用多项式于" $T "的值. 现在设"
    (&= $T (&+ $D^ $N^)) ", 其中" $D^ "是可对角化的, " $N^
    "是幂零的, 并且" (commute* $D^ $N^) ". 我们将证明"
    (&= $D $D^) "和" (&= $N $N^) "." (Br)
    "既然" $D^ "和" $N^ "可以交换而" (&= $T (&+ $D^ $N^))
    ", 我们可以看出" $D^ "和" $N^ "与" $T
    "也是可以交换的. 因此, " $D^ "和" $N^ "与任意应用多项式于"
    $T "的结果交换. 现在我们有"
    (MB (&= (&+ $D $N) (&+ $D^ $N^)))
    "或者说"
    (MB (&= (&- $D $D^) (&- $N^ $N)))
    "并且这四个算子是互相交换的. 既然" $D "和" $D^
    "都是可对角化的并且是可交换的, 它们可以被同时对角化, 于是"
    (&- $D $D^) "是可对角化的. 既然" $N "和" $N^
    "都是幂零的并且是可交换的, 算子" (@- $N^ $N)
    "也是幂零的. 这是因为, 使用" $N "和" $N^
    "可以交换的事实, 可以得到"
    (MB (&= (^ (@- $N^ $N) $r)
            (sum (&= $j $0) $r
                 (&i* (comb $r $j)
                      (^ (@ $N^) (&- $r $j))
                      (^ (@- $N) $j)))))
    "于是当" $r "足够大时这个" (^ (@- $N^ $N) $r)
    "的表达式中的每一项都是" $0
    ". (实际上, " $n "维空间上的幂零算子的" $n "次幂必然为"
    $0 ". 如果我们以上取" (&= $r (&i* $2 $n))
    ", 那肯定是足够大了. 当然接着可以知道" (&= $r $n)
    "已经足够大了, 但是这不能直接从上面的表达式看出来.) "
    "现在我们知道可对角化算子" (&- $D $D^) "也是幂零算子. "
    "这样一个算子显然是零算子, 以下是论证. 作为幂零算子, 其极小多项式显然具有"
    $x^r "的形式. [译注: 根据定义, 存在正整数" $m "满足"
    (&= $N^m $0) ", 鉴于极小多项式整除零化多项式" $x^m ", 因而对于某个"
    (&<= $r $m) "有极小多项式" (&= $p $x^r) ".] 但是既然它也是可对角化的, "
    "极小多项式不可能有重复的根. 因此" (&= $r $1) ", 或者说极小多项式就是"
    $x ", 即" (&= (&- $D $D^) $0) ". [译注: 在一般情况下, 极小多项式的次数大于等于一, "
    "除非是零维向量空间上的算子, 但是本书除了第2章提及了这种可能性之外 (那里说仅包含"
    "零向量的平凡空间的维数要么不定义, 要么就定义为零), 其余地方提及有限维向量空间时"
    "都排除了零维的情况. 基本上所有结果包含零维的情况仍然成立, 只是许多证明需要打上补丁.] "
    "于是, 我们可以看出" (&= $D $D^) "和" (&= $N $N^) ".")
   ((corollary)
    "令" $V "是某个代数闭域 (例如复数域) 上的有限维向量空间, 那么" $V "上的每个线性算子"
    $T "都可以写成交换的可对角化算子" $D "和幂零算子" $N "之和. " $D "和" $N
    "是唯一确定的, 并且每个都是应用多项式于" $T "的结果.")
   (P "从以上这些结果来看, 读者应该明白对于代数闭域上的向量空间上的线性算子的研究"
      "基本上可以归结为对于幂零算子的研究. 对于非代数闭域上的向量空间而言, "
      "我们仍然需要寻找特征值和特征向量的某种替代物. 有趣的是, 这两个问题可以被"
      "同时处理, 而这就是我们在下一章所要做的事情.")
   (P "为了给本节作结, 我们想要举一个例子, 它刻画了准素分解定理的某些想法. "
      "之所以我们选择把它放在本节的最后, 是因为它处理微分方程, 并不是纯粹的线性代数.")
   ((example #:n "14")
    "在准素分解定理中, 向量空间" $V "是有限维的是不必要的条件. 另外, 对于i和ii而言, "
    $p "是" $T "的极小多项式也是不必要的. 如果" $T "是任意向量空间上的线性算子, "
    "如果存在一个首项系数为一的多项式" $p "满足" (&= (app $p $T) $0)
    ", 那么定理12的i和ii在我们之前给出的证明下对于" $T "也是成立的. "
    "[译注: 注意到定理9并不局限于有限维的情形.]" (Br)
    "令" $n "是一个正整数, 令" $V "是满足微分方程"
    (let ((deriv (lambda (n)
                   (~ (ap (^ $diff n) $f) (ap $diff (^ $t n))))))
      (MB (&= (&+ (deriv $n) (&i* (_ $a (&- $n $1)) (deriv (&- $n $1))) $..c
                  (&i* $a_1 (~ (ap $diff $f) (ap $diff $t))) (&i* $a_0 $f)) $0)))
    "的所有实轴上的" $n "次连续可微函数" $f "构成的空间, 其中"
    (&cm $a_0 $..h (_ $a (&- $n $1))) "是一些固定的常数. 如果用" $C^n
    "表示" $n "次连续可微函数构成的空间, 那么作为这个微分方程的解空间的"
    $V "是" $C^n "的子空间. 如果" $D "代表微分算子而" $p "是多项式"
    (MB (&= $p (&+ $x^n (&i* (_ $a (&- $n $1)) (^ $x (&- $n $1)))
                   $..c (&i* $a_1 $x) $a_0)))
    "那么" $V "是算子" (app $p $D) "的零空间, 因为这个微分方程就是在说"
    (&= (ap (app $p $D) $f) $0) ". 因此, " $V "在" $D "下不变. 现在让我们将"
    $D "视为子空间" $V "上的一个线性算子, 那么" (&= (app $p $D) $0) "." (Br)
    "如果我们讨论的是复值可微函数, 那么" $C^n "和" $V "是复向量空间而"
    (&cm $a_0 $..h (_ $a (&- $n $1))) "可以是任意的复数. 现在我们将" $p "写成"
    (MB (&= $p (decomp $c_1 $r_1 $c_k $r_k)))
    "其中" (&cm $c_1 $..h $c_k) "是不同的复数. 如果" $W_j "是"
    (^ (@- $D (&i* $c_j $I)) $r_j) "的零空间, 那么定理12告诉我们"
    (MB (&= $V (&d+ $W_1 $..c $W_k)) ".")
    "换言之, 如果" $f "满足这个微分方程, 那么" $f "可以被唯一地表示为"
    (MB (&= $f (&+ $f_1 $..c $f_k)))
    "的形式, 其中" $f_j "满足微分方程"
    (&= (ap (^ (@- $D (&i* $c_j $I)) $r_j) $f_j) $0)
    ". 因此, 对于这个大的微分方程的解的研究可以被规约为对于具有形式"
    (MB (&= (ap (^ (@- $D (&i* $c $I)) $r) $f) $0))
    "的小的微分方程的解空间的研究. 这种规约是藉由线性代数的一般方法"
    "实现的, 即准素分解定理." (Br)
    "为了刻画这个小的微分方程的解空间, 我们必须要了解一些关于微分方程的"
    "知识. 也就是说, 除了" $D "是线性算子的事实之外, 我们必须还要了解一些关于"
    $D "的其他性质. 然而, 实际上并不需要太多. 很容易对于" $r "进行归纳得到如果"
    (∈ $f $C^r) ", 那么"
    (MB (&= (ap (^ (@- $D (&i* $c $I)) $r) $f)
            (&i* (^ $e (&i* $c $t))
                 (app $D^r (&i* (^ $e (&- (&i* $c $t))) $f)))))
    "也就是说,"
    (MB (&= (&- (~ (ap $diff $f) (ap $diff $t)) (&i* $c (app $f $t)))
            (&i* (^ $e (&i* $c $t))
                 (app (~ $diff (ap $diff $t))
                      (&i* (^ $e (&- (&i* $c $t))) $f))))
        ", 等等.")
    "因此, " (&= (ap (^ (@- $D (&i* $c $I)) $r) $f) $0) "当且仅当"
    (&= (app $D^r (&i* (^ $e (&- (&i* $c $t))) $f)) $0)
    ". 一个满足" (&= (app $D^r $g) $0) "的函数" $g ", 即"
    (&= (&/ (ap (^ $diff $r) $g) (ap $diff $t^r)) $0)
    ", 必然是一个次数小于等于" (@- $r $1) "的多项式函数 "
    "[译注: 严格说来, 次数是定义在多项式而非多项式函数上的, 但是这里的意思"
    "应该是明了的, 即由次数小于等于" (@- $r $1) "的多项式导出的函数, "
    "并且在这种意义下次数对于这里的多项式函数是良定的]:"
    (MB (&= (app $g $t)
            (&+ $b_0 (&i* $b_1 $t) $..c
                (&i* (_ $b (&- $r $1)) (^ $t (&- $r $1))))) ".")
    "于是, " (&= (ap (^ (@- $D (&i* $c $I)) $r) $f) $0)
    "当且仅当" $f "具有形式"
    (MB (&= (app $f $t)
            (&i* (^ $e (&i* $c $t))
                 (@+ $b_0 (&i* $b_1 $t) $..c
                     (&i* (_ $b (&- $r $1)) (^ $t (&- $r $1)))))) ".")
    "据此, &quot;函数&quot;"
    (let ((e^ct (^ $e (&i* $c $t))))
      (&cm e^ct (&i* $t e^ct) $..h (&i* (^ $t (&- $r $1)) e^ct)))
    "可以张成这个小的微分方程的解空间. 鉴于" (&cm $1 $t $..h (^ $t (&- $r $1)))
    "是线性无关的函数并且指数函数 (exponential function) 没有零点, 这" $r
    "个函数" (&cm (&i* $t^j (^ $e (&i* $c $t))) (&<= $0 $j (&- $r $1)))
    "构成了解空间的一个基." (Br)
    "回到本来的微分方程上去, 即"
    (MB (&cm (&= (ap (app $p $D) $f) $0)
             (&= $p (decomp $c_1 $r_1 $c_k $r_k))))
    "我们可以看到"
    (&cm (&i* $t^m (^ $e (&i* $c_j $t)))
         (&<= $0 $m (&- $r_j $1))
         (&<= $1 $j $k))
    "构成了解空间的一个基. 特别地, 解空间是有限维的, 其维数等于多项式"
    $p "的次数.")
   (P (B "译者注记. ")
      "以上的例子中的推理过程存在不甚严格的步骤, 即微分算子" $D
      "并非严格意义上的" $C^n "上的线性算子, 因为" $n "次连续可微函数的导数"
      "并不一定仍然是" $n "次连续可微的. 因此, 鉴于" (app $p $D) "和" $D
      "交换, 所以" (app $p $D) "的零空间在" $D "下不变这样的推理"
      "也不能称得上令人满意. 当然, 如果将我们所考虑的函数类限制于无穷可微的"
      (^ $C $inf) "的情形, 上述的推理倒是相当严密, 结果也没有改变.")
   ((exercise #:n "1")
    "令" $T "是" $RR^3 "上的一个线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (6 -3 -2) (4 -1 -2) (10 -5 -3)))
    "表示. 将" $T "的极小多项式" $p "表示为" (&= $p (&i* $p_1 $p_2))
    "的形式, 其中" $p_1 "和" $p_2 "是实数域上首项系数为一的素多项式. 令"
    $W_i "是" (app $p_i $T) "的零空间, 找出" $W_1 "和" $W_2
    "各自的一个基" $BBB_i ". 如果" $T_i "是" $T "在" $W_i
    "上由限制导出的算子, 求出" $T_i "在基" $BBB_i "下的矩阵.")
   ((exercise #:n "2")
    "令" $T "是" $RR^3 "上的一个线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (3 1 -1) (2 2 -1) (2 2 0)))
    "表示. 证明" $RR^3 "上存在可对角化算子" $D "和幂零算子" $N
    "满足" (&= $T (&+ $D $N)) "且" (commute* $D $N)
    ". 找出" $D "和" $N "在标准基下的矩阵. (只需要对于这个特殊情形"
    "重复定理12的证明就够了.)")
   ((exercise #:n "3")
    "如果" $V "是域" $F "上所有次数小于等于" $n "的多项式构成的向量空间, 证明"
    $V "上的微分算子是幂零的.")
   ((exercise #:n "4")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 其特征多项式为"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "而极小多项式为"
    (MB (&= $p (decomp $c_1 $r_1 $c_k $r_k)) ".")
    "令" $W_i "是" (^ (@- $T (&i* $c_i $I)) $r_i) "的零空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W_i "是集合"
            (setI (∈ $alpha $V)
                  (: "存在正整数" $m "满足"
                     (&= (ap (^ (@- $T (&i* $c_i $I)) $m) $alpha) $0)))
            " (" $m "可以依赖于" $alpha ").")
        (Li "证明" $W_i "的维数是" $d_i ". (提示: 如果" $T_i
            "是" $T "于" $W_i "上通过限制导出的算子, 那么" (&- $T_i (&i* $c_i $I))
            "是幂零的; 因而" (&- $T_i (&i* $c_i $I)) "的特征多项式必然是"
            (^ $x $e_i) ", 其中" $e_i "是" $W_i "的维数 (证明?); 于是" $T_i
            "的特征多项式为" (^ (@- $x $c_i) $e_i) "; 现在使用" $T
            "的特征多项式是" $T_i "的特征多项式之积的事实来说明"
            (&= $e_i $d_i) ".)")))
   ((exercise #:n "5")
    "令" $V "是复数域上的一个有限维向量空间. 令" $T "是" $V
    "上的一个线性算子, " $D "是" $T "的可对角化部分. 证明如果" $g
    "是复数域上任意的多项式, 那么" (app $g $T) "的可对角化部分是"
    (app $g $D) ".")
   ((exercise #:n "6")
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子且" (&= (&rank $T) $1) ". 证明" $T
    "要么是可对角化的, 要么是幂零的, 但不可兼任.")
   ((exercise #:n "7")
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子. 设" $T "与" $V "上的每个可对角化算子交换, 证明"
    $T "是恒等算子的标量倍数.")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的" n*n "矩阵的空间, " $A "是域" $F
    "上一个固定的" n*n "矩阵. 我们定义" $V "上的线性算子"
    (&= (app $T_A $B) (&- (&i* $A $B) (&i* $B $A)))
    ". 证明如果" $A "是一个幂零矩阵, 那么" $T_A "是一个幂零算子. "
    "[译注: 参照幂零算子的定义, 可以定义幂零矩阵.]")
   ((exercise #:n "9")
    "给出这样的一个例子, 两个" (&c* $4 $4) "的幂零矩阵具有相同的极小多项式 "
    "(它们的特征多项式必然也是相同的), 但是并不相似.")
   ((exercise #:n "10")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, "
    (&= $p (&i* (_^ $p $1 $r_1) $..c (_^ $p $k $r_k)))
    "是" $T "的极小多项式, " (&= $V (&d+ $W_1 $..c $W_k))
    "是" $T "的准素分解, 即" $W_i "是" (app (_^ $p $i $r_i) $T)
    "的零空间, " $W "是" $V "任意的在" $T "下不变的子空间, 证明"
    (MB (&= $W (&d+ (@cap $W $W_1) (@cap $W $W_2) $..c
                    (@cap $W $W_k))) "."))
   ((exercise #:n "11")
    "以下对于定理13的证明有何问题? 设" $T "的极小多项式是线性因子之积. "
    "那么, 根据定理5, " $T "是可三角化的. 令" $BBB "是一个使得"
    (&= $A (coordm $T)) "为上三角矩阵的有序基. 令" $D
    "是以" (&cm (mref $A $1 $1) $..c (mref $A $n $n))
    "为对角线元素的对角矩阵, 那么" (&= $A (&+ $D $N))
    ", 其中" $N "是一个严格上三角矩阵. 显然" $N "是幂零的. "
    "[译注: 严格上三角矩阵指的是对角线元素均为零的上三角矩阵.]")
   ((exercise #:n "12")
    "如果你已经思考过了练习11, 在你观察到定理7告诉你的关于" $T
    "的可对角化部分和幂零部分的东西之后, 再次思考这个练习.")
   ((exercise #:n "13")
    "令" $T "是" $V "上的一个线性算子, 它的极小多项式具有" $p^n
    "的形式, 其中" $p "在标量域上是不可约的. 证明存在" (∈ $alpha $V)
    "使得" $alpha "的" $T "零化子为" $p^n ".")
   ((exercise #:n "14")
    "使用准素分解定理和练习13的结果证明以下结论. 如果" $T
    "是有限维向量空间" $V "上任意的线性算子, 那么存在" (∈ $alpha $V)
    "使得" $alpha "的" $T "零化子等于" $T "的极小多项式.")
   ((exercise #:n "15")
    "如果" $N "是" $n "维向量空间" $V "上的一个幂零线性算子, 那么"
    $N "的特征多项式为" $x^n ".")
   ))