#lang racket
(provide div:hoffman_ch1)
(require SMathML "linear_algebra_utils.rkt")
(define div:hoffman_ch1
  (TmDiv
   (H2 "第1章 线性方程")
   (H3 "第1.1节 域")
   (P "我们假定读者熟悉实数和复数的初等代数. 对于本书的很大一部分, 数字"
      "的代数性质可从以下所列加法和乘法的性质简单推导出来. 我们令"
      $F "代表实数集或复数集.")
   (Ol (Li "加法是交换的,"
           (MB (commute+ $x $y))
           "对于所有" $F "中的" $x "和" $y "成立.")
       (Li "加法是结合的,"
           (MB (assoc+ $x $y $z))
           "对于所有" $F "中的" $x ", " $y "和" $z "成立.")
       (Li $F "中存在唯一的元素" $0 " (零) 满足"
           (&= (&+ $x $0) $x) "对于每个" $F "中的" $x "成立.")
       (Li "对于每个" $F "中的" $x "存在唯一的" $F
           "中的元素" (@- $x) "满足" (&= (&+ $x (@- $x)) $0) "与之对应.")
       (Li "乘法是交换的,"
           (MB (commute* $x $y))
           "对于所有" $F "中的" $x "和" $y "成立.")
       (Li "乘法是结合的,"
           (MB (assoc* $x $y $z))
           "对于所有" $F "中的" $x ", " $y "和" $z "成立.")
       (Li $F "中存在唯一的非零元素" $1 " (幺) 满足"
           (&= (&i* $x $1) $x) "对于每个" $F "中的" $x "成立.")
       (Li "对于每个" $F "中非零的" $x "存在唯一的" $F
           "中的元素" (inv $x) " (或" (&/ $1 $x)
           ") 满足" (&= (&i* $x (inv $x)) $1) "与之对应.")
       (Li "乘法对于加法分配, 即" (disR $x $y $z)
           "对于所有" $F "中的" $x ", " $y "和" $z "成立."))
   (P "假定我们拥有一个包含对象" (&cm $x $y $z $..h) "的集合" $F
      "和如下两种" $F "上的运算. 第一种运算, 被称为加法, 联系每对"
      $F "中的" $x "和" $y "以" $F "中的元素" (@+ $x $y)
      ". 第二种运算, 被称为乘法, 联系每对" $F "中的" $x "和" $y "以" $F "中的元素"
      (&i* $x $y) ". 若是这两种运算满足如上从1到9的条件, 那么集合"
      $F "以及此两种运算被合称为一个域. 粗略说来, 一个域就是一个集合"
      "带有某些运算, 这些运算表现得就像通常的数字加减乘除一样, 在满足如上九条"
      "代数法则的意义下. 带有通常的加法和乘法运算, 复数集" $CC "是一个域, 实数集"
      $RR "也是一个域.")
   (P "对于本书的大部分内容而言, 我们使用的&quot;数字&quot;可以来源于任意的域. "
      "为了允许这种一般性, 我们将使用术语&quot;标量&quot;而不是&quot;数字&quot;. "
      "如果读者总是认为标量域是一个复数域的子域, 他也不会损失太多. 域" $CC
      "的一个子域是一个复数的集合" $F ", 其在通常的加法和乘法下自身就是一个域. "
      "这意味着" $0 "和" $1 "在" $F "之中, 并且如果" $x "和" $y "是" $F "的元素, 那么"
      (@+ $x $y) ", " (&- $x) ", " (&i* $x $y) "和" (inv $x)
      " (如果" (&!= $x $0) ") 也是" $F "的元素. "
      "[译注: 实际上这给出了子域的判则.] "
      "这样的子域的一个例子是实数域" $RR ", 因为如果我们把实数当作是虚部为"
      $0 "的复数, 复数域的" $0 "和" $1 "是实数, 并且如果"
      $x "和" $y "是实数, 那么" (@+ $x $y) ", " (&- $x) ", " (&i* $x $y) "和" (inv $x)
      " (如果" (&!= $x $0) ") 也是实数. 我们讨论子域的要义如下, "
      "若是我们处理来源于某个特定子域的标量, 那么施行加减乘除不会将我们带出"
      "给定的子域.")
   ((example #:n "1")
    "正整数" (&cm $1 $2 $3 $..h) "的集合不是一个" $CC "的子域, "
    "出于各种原因. 例如, " $0 "不是正整数, 没有正整数" $n "的加法逆元" (&- $n)
    "是正整数. 除了" $1 "之外, 没有正整数" $n "的乘法逆元" (&/ $1 $n) "是正整数.")
   ((example #:n "2")
    "整数" (&cm $..h $-2 $-1 $0 $1 $2 $..h) "的集合不是" $CC "的子域, 因为除了" $0 "和" $1
    ", 没有整数的乘法逆元是一个整数. 整数集在通常的加法和乘法下除了条件8其余都满足.")
   ((example #:n "3")
    "有理数集是复数域的子域. 整数集里并不可能的除法, 在有理数集里是可能的. "
    "有兴趣的读者应该验证一下每个复数域的子域都必须包含所有的有理数.")
   ((example #:n "4")
    "所有具有" (&+ $x (&i* $y (Msqrt $2))) "形式的数字构成的集合, 其中"
    $x "和" $y "是有理数, 是一个" $CC "的子域. "
    "我们将其留给读者进行验证.")
   (P "在本书的例子和练习中, 读者应该将其中的域当成是复数域的某个子域, 除非另有说明"
      "这个域更加一般. 我们不想对于该点多加讨论. 然而, 我们应该指出我们为什么采用"
      "这样的约定. 如果" $F "是一个域, 有限多个单位元" $1 "加起来"
      "有可能得到" $0 " (见第1.2节练习5):"
      (MB (&= (&+ $1 $1 $..c $1) $0))
      "复数域并不会发生这样的事情 (或者在任何复数域的子域). 如果在域" $F
      "中的确发生了这样的事情, 那么使得有限个" $1 "加起来等于" $0
      "所用的" $1 "的最少数目被称为域" $F "的特征. 若是没有这样的"
      "事情, (出于某种奇怪的原因) 我们就称域" $F "的特征为零. 经常的情况是, "
      "我们假定" $F "是" $CC "的子域是希望保证" $F
      "的特征为零. 不过, 在初次接触线性代数的时候, 通常最好还是别太担心关于"
      "域的特征的事情.")
   (H3 "第1.2节 线性方程组")
   (P "设" $F "是一个域. 我们考虑找出满足下列条件的" $n
      "个标量 (即" $F "的元素) " (&cm $x_1 $..h $x_n) "的问题."
      (MB
       (let ((A (lambda (i j) (mref $A i j))))
         (Choice
          ((&i* (A $1 $1) $x_1) $+ (&i* (A $1 $2) $x_2) $+ $..c $+ (&i* (A $1 $n) $x_n) $= $y_1)
          ((&i* (A $2 $1) $x_1) $+ (&i* (A $2 $2) $x_2) $+ $..c $+ (&i* (A $2 $n) $x_n) $= $y_2)
          ($..v $ $..v $ $ $ $..v $ $..v)
          ((&i* (A $m $1) $x_1) $+ (&i* (A $m $2) $x_2) $+ $..c $+ (&i* (A $m $n) $x_n) $= $y_m))))
      "其中" (&cm $y_1 $..h $y_m) "和" (&cm Aij (&<= $1 $i $m) (&<= $1 $j $n))
      "是给定的" $F "的元素. 我们称其为具" $m "个方程" $n "个未知元的线性方程组. 任何满足每个方程的由"
      $F "的元素构成的" $n "元组" (tu0 $x_1 $..h $x_n) "都被称为方程组的一个解. 如果" (&= $y_1 $..c $y_m $0)
      ", 我们称该方程组是齐次的, 或者说每个方程是齐次的.")
   (P "或许寻找线性方程组的解的最根本的技术就是消元法. 我们可以对于以下齐次方程组刻画这种方法."
      (MB (Choice ((&i* $2 $x_1) $- $x_2 $+ $x_3 $= $0)
                  ($x_1 $+ (&i* $3 $x_2) $+ (&i* $4 $x_3) $= $0)))
      "如果我们加" (@ $-2) "倍的第二个方程到第一个方程上去, 就得到了"
      (MB (&Table ((&i* $-7 $x_2) $- (&i* $7 $x_3) $= $0)))
      "或" (&= $x_2 (&- $x_3)) ". 如果加" $3 "倍的第一个方程到第二个方程上去, 就得到了"
      (MB (&Table ((&i* $7 $x_1) $+ (&i* $7 $x_3) $= $0)))
      "或" (&= $x_1 (&- $x_3)) ". 因此, 我们总结道, 如果" (tu0 $x_1 $x_2 $x_3) "是一个解, 那么"
      (&= $x_1 $x_2 (&- $x_3)) ". 反过来, 我们可以验证每个这样的三元组"
      "都是一个解, 于是解集就由所有的三元组" (tu0 (&- $a) (&- $a) $a) "构成.")
   (P "我们通过&quot;消去未知元&quot;找到了方程组的解, 也就是通过给方程乘上标量"
      "再加起来的方式产生有些" $x_j "不存在的方程. "
      "我们希望形式化这个过程一点, 以理解为什么这种方法有效, 并按照秩序井然的"
      "方式来施行解方程组所必要的计算.")
   (P "对于这样的一般性方程组, 假定我们挑选" $m "个标量" (&cm $c_1 $..h $c_m) ", 将第" $j "个方程乘上"
      $c_j "并将它们加起来, 我们就得到了方程"
      (let ((A (lambda (i j) (mref $A i j))))
        (MB (&= (LC0 (@LC0 $c_1 (A $1 $1) $c_m (A $m $1)) $x_1
                     (@LC0 $c_1 (A $1 $n) $c_m (A $m $n)) $x_n)
                (LC0 $c_1 $y_1 $c_m $y_m))))
      "这样的方程被我们称为该线性方程组的线性组合. 显然, 每个方程组的解也是这个新的方程的解. "
      "这就是消元过程的根本想法. 如果我们有了另外一个线性方程组"
      (MB
       (let ((B (lambda (i j) (mref $B i j))))
         (Choice
          ((&i* (B $1 $1) $x_1) $+ (&i* (B $1 $2) $x_2) $+ $..c $+ (&i* (B $1 $n) $x_n) $= $z_1)
          ((&i* (B $2 $1) $x_1) $+ (&i* (B $2 $2) $x_2) $+ $..c $+ (&i* (B $2 $n) $x_n) $= $z_2)
          ($..v $ $..v $ $ $ $..v $ $..v)
          ((&i* (B $k $1) $x_1) $+ (&i* (B $k $2) $x_2) $+ $..c $+ (&i* (B $k $n) $x_n) $= $z_k))))
      "其每个方程都是原本的线性方程组的方程的线性组合, 那么每个原本的线性方程组的解"
      "也是这个新的线性方程组的解. 当然, 新的方程组的解不一定是原本方程组的解. "
      "但要是原本方程组的每个方程都是新的线性方程组的方程的线性组合的话, 这种事情"
      "就不会发生. 我们称两个线性方程组是等价的, 如果它们的每个方程都能表示为另一个"
      "线性方程组的方程的线性组合.")
   ((theorem #:n "1") "等价的线性方程组拥有相同的解.")
   (P "欲使消元过程在线性方程组求解中发挥效用, 人们就必须找出产生更容易求解的"
      "等价线性方程组的手段. 接下来的一节, 我们将讨论其中一种方法.")
   ((exercise #:n "1")
    "验证例子4的集合是" $CC "的子域.")
   ((exercise #:n "2")
    "令" $F "是复数域. 下面两个线性方程组等价吗? 如果是, 就互相表示成线性组合."
    (MB (choice (list (list $x_1 $- $x_2 $= $0)
                      (list (&i* $2 $x_1) $+ $x_2 $= $0)))
        (Mspace #:attr* '((width "16ex")))
        (choice (list (list (&i* $3 $x_1) $+ $x_2 $= $0)
                      (list $x_1 $+ $x_2 $= $0)))))
   ((exercise #:n "3")
    "像练习2一样测试以下的线性方程组."
    (MB (choice
         (list
          (list (&- $x_1) $+ $x_2 $+ (&i* $4 $x_3) $= $0)
          (list $x_1 $+ (&i* $3 $x_2) $+ (&i* $8 $x_3) $= $0)
          (list (&i* $1/2 $x_1) $+ $x_2 $+ (&i* 5/2 $x_3) $= $0)))
        (&space 16)
        (choice
         (list
          (list $x_1 $ $ $- $x_3 $= $0)
          (list $ $ $x_2 $+ (&i* $3 $x_3) $= $0)))))
   ((exercise #:n "4")
    "像练习2一样测试以下的线性方程组."
    (MB
     (choice
      (list
       (list (&i* $2 $x_1) $+ (&i* (@+ $-1 $i) $x_2) $ $ $+ $x_4 $= $0)
       (list $ $ (&i* $3 $x_2) $- (&i* $2 $i $x_3) $+ (&i* $5 $x_4) $= $0)))
     (&space 8)
     (choice
      (list
       (list (&i* (@+ $1 (~ $i $2)) $x_1) $+ (&i* $8 $x_2)
             $- (&i* $i $x_3) $- $x_4 $= $0)
       (list (&i* 2/3 $x_1) $- (&i* $1/2 $x_2)
             $+ $x_3 $+ (&i* $7 $x_4) $= $0)))))
   ((exercise #:n "5")
    "令" $F "是恰包含两个元素" $0 "和" $1 "的集合. "
    "由以下表格定义加法和乘法:"
    (MB (set-attr*
         (&table `((,$+ ,$0 ,$1)
                   (,$0 ,$0 ,$1)
                   (,$1 ,$1 ,$0)))
         'rowlines "solid" 'columnlines "solid")
        (&space 16)
        (set-attr*
         (&table `((,$d* ,$0 ,$1)
                   (,$0 ,$0 ,$0)
                   (,$1 ,$0 ,$1)))
         'rowlines "solid" 'columnlines "solid"))
    "验证集合" $F "带有这两种运算是一个域.")
   ((exercise #:n "6")
    "证明若两个具二未知元的线性方程组具有相同的解, 那么它们等价.")
   ((exercise #:n "7")
    "证明每个" $CC "的子域都包含所有的有理数.")
   ((exercise #:n "8")
    "证明每个特征为零的域都包含一个有理数域的复制.")
   (H3 "第1.3节 矩阵和初等行变换")
   (P "读者不可能没注意到, 在构造线性方程的线性组合时, 未知元"
      (&cm $x_1 $..h $x_n) "是没有必要写下来的, "
      "因为你实际上只是根据系数" Aij "和常元"
      $y_i "进行计算. 现在我们将线性方程组简写成"
      (MB AX=Y)
      "其中"
      (let ((A (lambda (i j) (mref $A i j))))
        (MB
         (&cm (&= $A (Mat ((A $1 $1) $..c (A $1 $n))
                          ($..v $ $..v)
                          ((A $m $1) $..c (A $m $n))))
              (&= $X (Mat ($x_1) ($..v) ($x_n)))
              (&= $Y (Mat ($y_1) ($..v) ($y_m)))
              )))
      "我们将" $A "称为系数矩阵. 严格说来, 上面显示的矩形阵列不是矩阵, 而是矩阵的表示. 一个域" $F "上的"
      m*n "矩阵是一个从序对" (&cm (tu0 $i $j) (&<= $1 $i $m) (&<= $1 $j $n))
      "的集合到域" $F "的函数. [译注: 或许读者会对于这句话感到迷惑, 这是因为中文将matrix翻译成矩阵.] "
      "矩阵" $A "的元素即标量" (&= (appl $A $i $j) Aij) ", 并且往往描述矩阵的最简单方式是将其元素写成如上"
      $m "行" $n "列的矩形阵列的形式. 因此, 上面的" $X "是 (或者说定义了) 一个" n*1 "的矩阵, 而" $Y "是一个" m*1
      "的矩阵. 暂时, " AX=Y "只是一种简记法. 之后, 我们将定义矩阵乘法, 那么它的意思就是" $Y "是" $A "和" $X "之积.")
   (P "我们现在希望考虑与构造线性方程的线性组合有关的矩阵" $A "的行上的操作. 我们将我们的注意力限制在域" $F "上的"
      m*n "矩阵" $A "的三种初等行变换上:"
      (Ol (Li "给矩阵" $A "的一行乘上一个非零的标量" $c ";")
          (Li "将" $A "的第" $r "行替换以第" $r "行加上" $c "乘上第" $s "行, 其中"
              $c "是任意的标量, 并且" (&!= $r $s) ";")
          (Li "交换" $A "的第" $r "行和第" $s "行."))
      "因此, 一个初等行变换是一个特别的函数" $e "联系每个" m*n "矩阵" $A "以一个" m*n "的矩阵"
      eA ". 我们可以精确地将三种" $e "刻画如下:"
      (Ol (Li (&= (mref eA $i $j) Aij) "如果" (&!= $i $r) ", "
              (&= (mref eA $r $j) (&i* $c (mref $A $r $j))) ".")
          (Li (&= (mref eA $i $j) Aij) "如果" (&!= $i $r) ", "
              (&= (mref eA $r $j)
                  (&+ (mref $A $r $j) (&i* $c (mref $A $s $j)))) ".")
          (Li (&= (mref eA $i $j) Aij)
              "如果" $i "异于" $r "和" $s ", "
              (&= (mref eA $r $j) (mref $A $s $j)) ", "
              (&= (mref eA $s $j) (mref $A $r $j)) "."))
      "在定义" eA "时, " $A "的列数并不重要, 但" $A "的行数是关键的. 例如, 我们不得不担心能否交换一个" (&c* $5 $5)
      "矩阵的第" $5 "行和第" $6 "行. 为了避免这种复杂性, 我们约定一个初等行变换" $e "定义在由所有域" $F "的" m*n
      "矩阵构成的类之上, 其中" $m "是固定的而" $n "是任意的. 换句话说, 一个特定的" $e "定义在由所有域" $F "上的"
      $m "行矩阵构成的类之上.")
   (P "之所以我们将我们自己限制于这三种简单的行变换上, 是因为既已施行这样的" $e
      "于" $A "之上后, 我们能够通过在" eA "上施行一个类似的操作来恢复" $A ".")
   ((theorem #:n "2")
    "对于每个初等行变换" $e ", 存在一个与之对应的具有相同类型的初等行变换"
    $e_1 "满足" (&= (app $e_1 eA) (app $e (app $e_1 $A)) $A) ". "
    "换言之, 初等行变换的逆变换存在, 并与之具有相同的类型. "
    "[译注: 显然不仅存在, 也是唯一的.]")
   ((proof)
    (Ol (Li "设" $e "是给第" $r "行乘上非零标量" $c "的变换, 令" $e_1
            "为给第" $r "行乘上" (inv $c) "的变换.")
        (Li "设" $e "是将第" $r "行替换以第" $r "行加上" $c "乘上第" $s "行的变换, 其中" (&!= $r $s)
            ", 令" $e_1 "为将第" $r "行替换以第" $r "行加上" (@- $c) "乘上第" $s "行的变换.")
        (Li "设" $e "是交换第" $r "行和第" $s "行的变换, 令" (&= $e_1 $e) "."))
    "每种情形之下, 显然有" (&= (app $e_1 (app $e $A)) (app $e (app $e_1 $A)) $A)
    "对于每个" $A "成立.")
   ((definition)
    "如果" $A "和" $B "是域" $F "上的" m*n "矩阵, 我们称" $B "行等价于" $A ", 如果" $B "可由" $A
    "通过 (有限的) 一系列初等行变换得到. [译注: 原则上包含0步, 尽管包不包含均不影响结果, "
    "因为本身初等行变换就包含恒等变换.]")
   (P "使用定理2, 容易验证以下事实. 每个矩阵都行等价于自身. 如果" $B "行等价于" $A ", 那么" $A
      "行等价于" $B ". 如果" $B "行等价于" $A "而" $C "行等价于" $B ", 那么" $C "行等价于" $A
      ". 换句话说, 行等价是等价关系 (见附录).")
   ((theorem #:n "3")
    "如果" $A "和" $B "是域" $F "上行等价的" m*n "矩阵, 那么齐次线性方程组" AX=0 "和"
    (&= (&i* $B $X) $0) "拥有相同的解.")
   ((proof)
    "设经过一系列变换我们从" $A "得到了" $B ":"
    (MB (&= $A (&-> $A_0 $A_1 $..c $A_k) $B) ".")
    "只需要证明线性方程组" (LE $A_j $X $0) "和" (LE (_ $A (&+ $j $1)) $X $0)
    "拥有相同的解就够了, 即一次初等行变换不改变解集." (Br)
    "因此, 设" $B "是由" $A "通过一次初等行变换得到的, 不论它是三种变换的哪一种, 线性方程组" (&= (&i* $B $X) $0)
    "的每个方程都是线性方程组" AX=0 "的方程的线性组合. 鉴于初等行变换的逆也是初等行变换, 每个线性方程组"
    AX=0 "的方程也是线性方程组" (&= (&i* $B $X) $0) "的方程的线性组合. 于是, 两个线性方程组是等价的. "
    "根据定理1, 它们拥有相同的解.")
   ((example #:n "5")
    "设" $F "是有理数域, 并且"
    (MB (&= $A (mat `((,$2 ,$-1 ,$3 ,$2)
                      (,$1 ,$4 ,$0 ,$-1)
                      (,$2 ,$6 ,$-1 ,$5))))
        ".")
    "我们将施行一系列初等行变换于" $A ", 并在箭头上标示出变换的类型."
    (MB (mat `((,$2 ,$-1 ,$3 ,$2)
               (,$1 ,$4 ,$0 ,$-1)
               (,$2 ,$6 ,$-1 ,$5)))
        (Mover $-> $2)
        (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$4 ,$0 ,$-1)
               (,$2 ,$6 ,$-1 ,$5)))
        (Mover $-> $2)
        (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$4 ,$0 ,$-1)
               (,$0 ,$-2 ,$-1 ,$7)))
        (Mover $-> $1))
    (MB (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$4 ,$0 ,$-1)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$0 ,$-2 ,13)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,$0 ,15/2 ,-55/2)
               (,$1 ,$0 ,$-2 ,13)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $1))
    (MB (mat `((,$0 ,$0 ,$1 ,-11/3)
               (,$1 ,$0 ,$-2 ,13)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,$0 ,$1 ,-11/3)
               (,$1 ,$0 ,$0 ,17/3)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,$0 ,$1 ,-11/3)
               (,$1 ,$0 ,$0 ,17/3)
               (,$0 ,$1 ,$0 ,(&- 5/3)))))
    "上面的一系列初等行变换告诉我们"
    (MB
     (choice
      (list
       (list (&i* $2 $x_1) $- $x_2 $+ (&i* $3 $x_3) $+ (&i* $2 $x_4) $= $0)
       (list $x_1 $+ (&i* $4 $x_2) $ $ $- $x_4 $= $0)
       (list (&i* $2 $x_1) $+ (&i* $6 $x_2) $- $x_3 $+ (&i* $5 $x_4) $= $0)
       )))
    "和"
    (MB
     (choice
      (list (list $ $ $ $ $x_3 $- (&i* 11/3 $x_4) $= $0)
            (list $x_1 $ $ $ $ $+ (&i* 17/3 $x_4) $= $0)
            (list $ $ $x_2 $ $ $- (&i* 5/3 $x_4) $= $0))))
    "拥有相同的解. 对于第二个线性方程组, 显然如果我们赋任意的有理数值"
    $c "给" $x_4 "就得到了一个解"
    (tu0 (&i* -17/3 $c)
         (&i* 5/3 $c)
         (&i* 11/3 $c)
         $c)
    ", 并且每个解都具有这样的形式.")
   ((example #:n "6")
    "设" $F "是复数域并且"
    (MB (&= $A (mat (list (list $-1 $i)
                          (list (&- $i) $3)
                          (list $1 $2)))))
    "施行行变换的时候通常把几个类型2的变换组合起来是方便的. 把这点记在心中,"
    (MB (mat (list (list $-1 $i)
                   (list (&- $i) $3)
                   (list $1 $2)))
        (Mover $-> $2)
        (mat (list (list $0 (&+ $2 $i))
                   (list $0 (&+ $3 (&i* $2 $i)))
                   (list $1 $2)))
        (Mover $-> $1)
        (mat (list (list $0 $1)
                   (list $0 (&+ $3 (&i* $2 $i)))
                   (list $1 $2)))
        (Mover $-> $2)
        (mat (list (list $0 $1)
                   (list $0 $0)
                   (list $1 $0))))
    "因此线性方程组"
    (MB
     (choice
      (list
       (list (&- $x_1) $+ (&i* $i $x_2) $= $0)
       (list (&i* (&- $i) $x_1) $+ (&i* $3 $x_2) $= $0)
       (list $x_1 $+ (&i* $2 $x_2) $= $0))))
    "只有平凡解" (&= $x_1 $x_2 $0) ".")
   (P "例子5和例子6里我们显然不是在随意施行行变换. 我们对于行变换的选择是由"
      "想要像消去未知元解线性方程组一样化简系数矩阵的欲望驱使的. 现在让我们"
      "给出一个形式化的定义, 对于我们想要抵达什么类型的矩阵.")
   ((definition)
    "一个" m*n "矩阵" $R "被称为行简化的, 如果"
    (Ol #:attr* '((type "a"))
        (Li "每个" $R "的非零行的第一个非零元素是" $1 ";")
        (Li "每个包含首非零元的列, 其余的元素均为" $0 ".")))
   ((example #:n "7")
    "一个行简化矩阵的例子是" n*n "的恒等矩阵" $I ". "
    "这是由"
    (MB
     (&= (_ $I (&cm $i $j)) δij
         (choice
          (list
           (list $1 (: $cm "如果" (&= $i $j)))
           (list $0 (: $cm "如果" (&!= $i $j)))))))
    "定义的矩阵. 目前是我们第一次使用Kronecker delta, 之后也将经常用到.")
   (P "例子5和例子6最终呈现的矩阵都是行简化矩阵. 以下是两个不是行简化矩阵的例子:"
      (MB (mat (list (list $1 $0 $0 $0)
                     (list $0 $1 $-1 $0)
                     (list $0 $0 $1 $0)))
          (&space 16)
          (mat (list (list $0 $2 $1)
                     (list $1 $0 $-3)
                     (list $0 $0 $0))))
      "第二个矩阵没有满足条件a, 因为第一行的首非零元不是" $1 ". "
      "第一个矩阵满足了条件a, 但是第三列没有满足条件b.")
   (P "现在我们将证明我们可以从任意的矩阵出发, 通过有限数目的初等行变换, "
      "得到一个行简化矩阵. 结合定理3, 这给我们提供了一个解决线性方程组的"
      "有效工具.")
   ((theorem #:n "4")
    "每个域" $F "上的" m*n "矩阵都行等价于一个"
    "行简化矩阵.")
   ((proof)
    "令" $A "是一个域" $F "上的" m*n "矩阵. 如果" $A "的第一行的每个元素都是" $0 ", 那么只考虑第一行"
    "条件a就是成立的. 如果第一行有非零的元素, 令" $k "是满足" (&!= (_ $A (&cm $1 $j)) $0) "的正整数"
    $j "中最小的. 给第一行乘上" (_^ $A (&cm $1 $k) $-1) ", 那么第一行就满足条件a了. "
    "现在对于每个" (&>= $i $2) ", 将第一行乘上" (@- (mref $A $i $k)) "加到第" $i "行. 现在第一行的"
    "首非零元出现在第" $k "列, 其值为" $1 ", 并且第" $k "列的每个其他元素都是" $0 "." (Br)
    "现在考虑上面得到的矩阵. 如果第二行的每个元素都是" $0 ", 我们就什么也不做. "
    "如果第二行有异于零的元素, 就给第二行乘上一个标量使其首非零元为" $1 ". "
    "在第一行首非零元位于第" $k "列的情况下, 第二行的首非零元不可能出现在第"
    $k "列, 设其出现在第" $k^ "列. 通过给第二行乘上合适的标量"
    "加到其他行上去, 就能使得第" $k^ "列除了第二行之外都是" $0 ". "
    "重要的是注意到以下这点, 在施行这些操作的时候, 我们不会改变第一行处于第"
    (&cm $1 $..h $k) "列的元素, 也不会改变第" $k "列的元素. "
    "当然, 如果第一行全是零, 那么这些操作就不会影响第一行." (Br)
    "以如上方式逐行操作, 显然在有限步内我们能够抵达一个行简化矩阵.")
   ((exercise #:n "1")
    "找出下列线性方程组的所有解."
    (MB
     (choice
      (list (list (&i* (@- $1 $i) $x_1) $- (&i* $i $x_2) $= $0)
            (list (&i* $2 $x_1) $+ (&i* (@- $1 $i) $x_2) $= $0)))))
   ((exercise #:n "2")
    "如果"
    (MB (&= $A (Mat ($3 $-1 $2)
                    ($2 $1 $1)
                    ($1 $-3 $0))))
    "通过行简化" $A "以找出" AX=0
    "的所有解.")
   ((exercise #:n "3")
    "如果"
    (MB (&= $A (mat (list (list $6 $-4 $0)
                          (list $4 $-2 $0)
                          (list $-1 $0 $3)))))
    "找出" (&= (&i* $A $X) (&i* $2 $X)) "和"
    (&= (&i* $A $X) (&i* $3 $X)) "的解. "
    "(符号" (&i* $c $X) "表示一个矩阵, 其每个元素都是"
    $c "乘上相对应的" $X "的元素.)")
   ((exercise #:n "4")
    "找出一个与下列矩阵行等价的行简化矩阵."
    (MB (&= $A (mat (list (list $i (&- (@+ $1 $i)) $0)
                          (list $1 $-2 $1)
                          (list $1 (&i* $2 $i) $-1))))))
   ((exercise #:n "5")
    "证明下列两个矩阵不是行等价的."
    (MB (mat (list (list $2 $0 $0)
                   (list $a $-1 $0)
                   (list $b $c $3)))
        (Mspace #:attr* '((width "16ex")))
        (mat (list (list $1 $1 $2)
                   (list $-2 $0 $-1)
                   (list $1 $3 $5)))))
   ((exercise #:n "6")
    "令"
    (MB (&= $A (mat (list (list $a $b)
                          (list $c $d)))))
    "是一个复数域上的" 2*2 "矩阵. 设" $A
    "是行简化的, 并且" (&= (&+ $a $b $c $d) $0) ". "
    "证明恰存在三个这样的矩阵.")
   ((exercise #:n "7")
    "证明交换矩阵两行的操作可由其他两种操作达成.")
   ((exercise #:n "8")
    "考虑线性方程组" AX=0 ", 其中"
    (MB (&= $A (mat (list (list $a $b)
                          (list $c $d)))))
    "是一个域" $F "上的" 2*2 "矩阵. "
    "[译注: 意即线性方程组就是域" $F "上的.] "
    "证明以下陈述."
    (Ol #:attr* '((type "a"))
        (Li "如果" $A "的每个元素都是" $0 ", 那么"
            "每个序对" (tu0 $x_1 $x_2) "都是"
            AX=0 "的解.")
        (Li "如果" (&!= (&- (&i* $a $d) (&i* $b $c)) $0)
            ", 那么线性方程组" AX=0
            "仅有平凡解" (&= $x_1 $x_2 $0) ".")
        (Li "如果" (&= (&- (&i* $a $d) (&i* $b $c)) $0)
            "并且某个" $A "的元素异于" $0 ", 那么"
            "存在一个解" (tu0 (_^ $x $1 $0) (_^ $x $2 $0))
            "满足, " (tu0 $x_1 $x_2) "是一个解当且仅当"
            "存在标量" $y "满足"
            (&cm (&= $x_1 (&i* $y (_^ $x $1 $0)))
                 (&= $x_2 (&i* $y (_^ $x $2 $0))))
            ".")))
   (H3 "第1.4节 行简化阶梯矩阵")
   (P "到目前为止, 我们对于线性方程组的处理是由找出方程组的解的尝试"
      "推动的. 在第1.3节, 我们建立了找出这些解的一种标准化技术. "
      "现在我们希望获得一些稍微理论一点的信息, 出于这样的目的, "
      "走得比行简化矩阵更远一点是方便的.")
   ((definition)
    "一个" m*n "的矩阵" $R "被称为一个行简化阶梯矩阵, 如果"
    (Ol #:attr* '((type "a"))
        (Li $R "是行简化的;")
        (Li $R "的每个元素全为" $0
            "的行在具有非零元素的行的下方;")
        (Li "如果第" (&cm $1 $..h $r) "行是" $R
            "的非零行, 并且如果第" $i "行的首非零元出现在第"
            $k_i "列, " (&= $i (&cm $1 $..h $r))
            ", 那么" (&< $k_1 $k_2 $..c $k_r) ".")))
   (P "人们也可以按照以下方式刻画" m*n "的行简化阶梯矩阵" $R ". "
      "要么" $R "的每个元素都是" $0 ", 要么存在一个正整数"
      (&cm $r (&<= $1 $r $m)) ", 以及" $r "个正整数"
      (&cm (&cm $k_1 $..h $k_r) (&<= $1 $k_i $n)) "满足"
      (Ol #:attr* '((type "a"))
          (Li "对于" (&> $i $r) ", " (&= (mref $R $i $j) $0)
              ", 并且" (&= (mref $R $i $j) $0) "如果"
              (&< $j $k_i) ".")
          (Li (&cm (&= (mref $R $i $k_j) δij)
                   (&<= $1 $i $r) (&<= $1 $j $r)) ".")
          (Li (&< $k_1 $..c $k_r) ".")))
   ((example #:n "8")
    "两个行简化阶梯矩阵的例子分别是" n*n "的恒等矩阵和"
    m*n "的零矩阵" (^ $0 (&cm $m $n)) ", 其每个元素都是零. "
    "当然读者构造出其他例子也没有困难, 不过这里我们给出一个非平凡的例子."
    (MB (mat (list (list $0 $1 $-3 $0 $1/2)
                   (list $0 $0 $0 $1 $2)
                   (list $0 $0 $0 $0 $0)))))
   ((theorem #:n "5")
    "每个" m*n "的矩阵" $A "都行等价于一个行简化阶梯矩阵.")
   ((proof)
    "我们知道" $A "行等价于一个行简化矩阵, 所有我们需要做的只是观察到"
    "通过有限次的行交换我们可以将行简化矩阵变成行简化阶梯矩阵.")
   (P "在例子5和例子6中我们看到了在求解齐次线性方程组时行简化矩阵的重要性. "
      "现在让我们来简要讨论方程组" RX=0 ", 其中" $R
      "是一个行简化阶梯矩阵. 令第" (&cm $1 $..h $r) "行是" $R
      "的非零行, 并设第" $i "行的首非零元出现在第" $k_i "列. "
      "于是, 方程组" RX=0 "包含" $r "个非平凡方程. "
      "并且, 未知元" (_ $x $k_i) "仅会出现在第" $i "行. "
      "如果我们用" (&cm $u_1 $..h (_ $u (&- $n $r))) "代表异于"
      (&cm (_ $x $k_1) $..h (_ $x $k_r)) "的" (@- $n $r)
      "个未知元, 那么" RX=0 "的" $r "个非平凡方程"
      "具有如下的形式."
      (MB (choice
           (list
            (list (_ $x $k_1) $+
                  (sum (&= $j $1) (&- $n $r)
                       (&i* (mref $C $1 $j) $u_j))
                  $= $0)
            (list $ $..v $ $ $..v)
            (list (_ $x $k_r) $+
                  (sum (&= $j $1) (&- $n $r)
                       (&i* (mref $C $r $j) $u_j))
                  $= $0))))
      "线性方程组" RX=0 "的所有解都可以由给"
      (&cm $u_1 $..h (_ $u (&- $n $r))) "赋任意的值然后计算"
      "相对应的" (&cm (_ $x $k_1) $..h (_ $x $k_r))
      "的值获得. 例如, 如果" $R "是例子8展示的那个矩阵, 那么"
      (&cm (&= $r $2) (&= $k_1 $2) (&= $k_2 $4))
      ", 并且" RX=0 "的两个非平凡方程是"
      (MB (choice
           (list
            (list $x_2 $- (&i* $3 $x_3) $ $ $+ (&i* $1/2 $x_5) $= $0)
            (list $ $ $ $ $x_4 $+ (&i* $2 $x_5) $= $0)))
          "或者写成"
          (choice
           (list
            (list $x_2 $= (&- (&i* $3 $x_3) (&i* $1/2 $x_5)))
            (list $x_4 $= (&i* $-2 $x_5)))))
      "于是我们可以给" $x_1 ", " $x_3 "和" $x_5
      "赋任意的值, 比如" (&cm (&= $x_1 $a) (&= $x_3 $b) (&= $x_5 $c))
      ", 然后就得到了解"
      (tu0 $a (&- (&i* $3 $b) (&i* $1/2 $c)) $b
           (&i* $-2 $c) $c) ".")
   (P "让我们再观察到与线性方程组" RX=0 "有关的另一个事实. "
      "如果" $R "的非零行数" (Math $r) "小于" $n ", 那么方程组"
      RX=0 "具有一个非平凡的解, 即一个解" (tu0 $x_1 $..h $x_n) ", 其中"
      "不是每个" $x_j "都是" $0 ". 这是因为, 既然" (&< $r $n)
      ", 我们可以挑选一个" $x_j ", 其异于"
      (&cm (_ $x $k_1) $..h (_ $x $k_r)) ", 那么我们可以按照如上方式"
      "构造出一个解, 其中令" (&= $x_j $1) ". 这个观察将我们引导至"
      "和齐次线性方程组有关的最根本性的事实之一.")
   ((theorem #:n "6")
    "如果" $A "是一个" m*n "的矩阵并且" (&< $m $n) ", 那么齐次线性方程组" AX=0 "具有非平凡解.")
   ((proof)
    "令" $R "是一个行等价于" $A "的行简化阶梯矩阵, 那么根据定理3, 方程组" AX=0 "和" RX=0 "具有相同的解. 令"
    $r "是" $R "的非零行数, 那么肯定" (&<= $r $m) ". 既然" (&< $m $n) ", 就有"
    (&< $r $n) ". 立刻从我们以上的观察中就得知" AX=0 "具有非平凡解.")
   ((theorem #:n "7")
    "如果" $A "是一个" n*n "的矩阵, 那么" $A "行等价于" n*n "的恒等矩阵当且仅当线性方程组" AX=0 "仅有平凡解.")
   ((proof)
    "如果" $A "行等价于" $I ", 那么" AX=0 "和" (LE $I $X $0) "具有相同的解. 反过来, 设" AX=0
    "仅有平凡解" (&= $X $0) ". 令" $R "是一个与" $A "行等价的" n*n "的行简化阶梯矩阵, 并令" $r "是" $R
    "的非零行数. 既然" RX=0 "没有非平凡的解, 那么" (&>= $r $n) ". 又因为" $R "只有" $n "行, 所以当然"
    (&<= $r $n) ", 于是" (&= $r $n) ". 这意味着" $R "的每一行都具有首非零元" $1
    ", 而且因为它们分布于不同的" $n "列里, " $R "只可能是"
    n*n "的恒等矩阵.")
   (P "现在让我们来探究如何使用初等行变换求解非齐次的线性方程组" AX=Y ". "
      "首先, 读者应该注意到它与齐次情形的一个基本区别, 即尽管齐次线性方程组总有"
      "平凡的解" (&= $x_1 $..c $x_n $0) ", 非齐次的情况压根不一定有解.")
   (P "我们来构造线性方程组" AX=Y "的增广矩阵" $A^ ". 这是一个" (&c* $m (@+ $n $1)) "的矩阵, 其中前" $n "列是"
      $A "的列, 最后一列是" $Y ". 更精确地,"
      (MB (&cm (: (&= (_^ $A (&cm $i $j) $prime) Aij) "如果" (&<= $j $n))
               (&= (_^ $A (&cm $i (&+ $n $1)) $prime) $y_i))
          ".")
      "设我们施行了一系列初等行变换于" $A ", 得到了一个行简化阶梯矩阵"
      $R ". 如果我们施行相同的初等行变换于" $A^ ", 就会得到一个矩阵" $R^ ", 其前" $n "列是" $R "的列, "
      "而最后一列包含特定的标量" (&cm $z_1 $..h $z_m) ". 标量" $z_i "是" m*1 "矩阵"
      (MB (&= $Z (Mat ($z_1) ($..v) ($z_m))))
      "的元素, 它是由施行相同的初等行变换于" $Y "得到的. 显然读者应该认识到, 正如定理3的证明一样, 线性方程组"
      AX=Y "和" RX=Z "是等价的, 因而拥有相同的解. 很容易确定" RX=Z "是否有解"
      "并在有解的情况下确定所有的解. 这是因为, 如果" $R "具有" $r "个非零行, "
      "并且其第" $i "行的首非零元出现在第" $k_i "列, 其中" (&= $i (&cm $1 $..h $r)) ", 那么" RX=Z "的前"
      $r "行有效地表达了" (&cm (_ $x $k_1) $..h (_ $x $k_r)) ", 基于"
      (@- $n $r) "个剩余的" $x_j "和标量" (&cm $z_1 $..h $z_r) ". 最后的" (@- $m $r) "个方程是"
      (MB (&table (list (list $0 $= (_ $z (&+ $r $1)))
                        (list $..v $ $..v)
                        (list $0 $= $z_m))))
      "据此, 方程组拥有解的条件是" (&> $i $r) "时" (&= $z_i $0) ". "
      "如果这个条件被满足, 所有线性方程组的解就可以像齐次的情况一样被找到, 即给"
      (@- $n $r) "个" $x_j "赋任意的值, 然后根据第" $i "个方程计算" (_ $x $k_i) "的值.")
   ((example #:n "9")
    "令" $F "是有理数域, 并且"
    (MB (&= $A (mat (list (list $1 $-2 $1)
                          (list $2 $1 $1)
                          (list $0 $5 $-1)))))
    "设我们希望求解线性方程组" AX=Y ", 对于某些" $y_1 ", " $y_2 "和" $y_3 ". 让我们将行规约"
    $A "的一系列初等行变换施行于" $A^ "之上:"
    (MB (mat (list (list $1 $-2 $1 $y_1)
                   (list $2 $1 $1 $y_2)
                   (list $0 $5 $-1 $y_3)))
        (Mover $-> $2)
        (mat (list (list $1 $-2 $1 $y_1)
                   (list $0 $5 $-1 (@- $y_2 (&i* $2 $y_1)))
                   (list $0 $5 $-1 $y_3)))
        (Mover $-> $2)
        (mat (list (list $1 $-2 $1 $y_1)
                   (list $0 $5 $-1 (@- $y_2 (&i* $2 $y_1)))
                   (list $0 $0 $0 (@+ (&- $y_3 $y_2) (&i* $2 $y_1)))))
        (Mover $-> $1))
    (MB (mat (list (list $1 $-2 $1 $y_1)
                   (list $0 $1 -1/5
                         (&i* 1/5 (@- $y_2 (&i* $2 $y_1))))
                   (list $0 $0 $0 (@+ (&- $y_3 $y_2) (&i* $2 $y_1)))))
        (Mover $-> $2)
        (mat (list (list $1 $0 3/5
                         (&i* 1/5 (@+ $y_1 (&i* $2 $y_2))))
                   (list $0 $1 -1/5
                         (&i* 1/5 (@- $y_2 (&i* $2 $y_1))))
                   (list $0 $0 $0 (@+ (&- $y_3 $y_2) (&i* $2 $y_1))))))
    "那么线性方程组" AX=Y "有解的条件就是"
    (MB (&= (&+ (&- (&i* $2 $y_1) $y_2) $y_3) $0))
    "并且如果给定的标量" $y_i "满足这个条件, 所有的解都可以由以下方式获得, 赋一个值" $c "给" $x_3 ", 然后计算"
    (MB (&table
         (list
          (list $x_1 $= (LC -3/5 $c 1/5 (@+ $y_1 (&i* $2 $y_2))))
          (list $x_2 $= (LC 1/5 $c 1/5 (@- $y_2 (&i* $2 $y_1))))))))
   (P "让我们再做关于线性方程组" AX=Y "的最后一个观察. 设矩阵" $A "的元素和标量" (&cm $y_1 $..h $y_m)
      "恰好落入域" $F "的一个子域" $F_1 "中. 如果线性方程组" AX=Y "拥有在域" $F "中的解, 那么它也拥有在域"
      $F_1 "中的解, 因为不论对于哪一个域而言, 线性方程组有解的条件都是域" $F_1 "中" (&cm $y_1 $..h $y_m)
      "之间的特定关系成立 (也就是上面的关系" (&= $z_i $0) "对于" (&> $i $r) "成立). 举个例子, 如果"
      AX=Y "是一个线性方程组, 其标量" $y_k "和" Aij "都是实数, 若其有复数的解, 那么它也有实数的解.")
   ((exercise #:n "1")
    "通过行规约系数矩阵来找出下列线性方程组的所有解."
    (MB (Choice
         ((&i* $1/3 $x_1) $+ (&i* $2 $x_2) $- (&i* $6 $x_3) $= $0)
         ((&i* $-4 $x_1) $ $ $+ (&i* $5 $x_3) $= $0)
         ((&i* $-3 $x_1) $+ (&i* $6 $x_2) $- (&i* 13 $x_3) $= $0)
         ((&i* -7/3 $x_1) $+ (&i* $2 $x_2) $- (&i* 8/3 $x_3) $= $0))))
   ((exercise #:n "2")
    "找出与下列矩阵行等价的一个行简化阶梯矩阵."
    (MB (&= $A (mat (list (list $1 (&- $i))
                          (list $2 $2)
                          (list $i (&+ $1 $i))))))
    AX=0 "的解是什么?")
   ((exercise #:n "3")
    "显式描述所有" 2*2 "的行简化阶梯矩阵.")
   ((exercise #:n "4")
    "考虑以下线性方程组."
    (MB (choice
         (list
          (list $x_1 $- $x_2 $+ (&i* $2 $x_3) $= $1)
          (list (&i* $2 $x_1) $ $ $+ (&i* $2 $x_3) $= $1)
          (list $x_1 $- (&i* $3 $x_2) $+ (&i* $4 $x_3) $= $2))))
    "这个方程组有解吗? 如果有的话, 显式描述所有的解.")
   ((exercise #:n "5")
    "给出一个无解的具有两个方程和两个未知元的线性方程组的例子.")
   ((exercise #:n "6")
    "证明线性方程组"
    (MB (choice
         (list
          (list $x_1 $- (&i* $2 $x_2) $+ $x_3 $+ (&i* $2 $x_4) $= $1)
          (list $x_1 $+ $x_2 $- $x_3 $+ $x_4 $= $2)
          (list $x_1 $+ (&i* $7 $x_2) $- (&i* $5 $x_3) $- $x_4 $= $3))))
    "没有解.")
   ((exercise #:n "7")
    "找出下列线性方程组的所有解."
    (MB
     (choice
      (list
       (list (&i* $2 $x_1) $- (&i* $3 $x_2) $- (&i* $7 $x_3) $+
             (&i* $5 $x_4) $+ (&i* $2 $x_5) $= $-2)
       (list $x_1 $- (&i* $2 $x_2) $- (&i* $4 $x_3) $+
             (&i* $3 $x_4) $+ $x_5 $= $-2)
       (list (&i* $2 $x_1) $ $ $- (&i* $4 $x_3) $+
             (&i* $2 $x_4) $+ $x_5 $= $3)
       (list $x_1 $- (&i* $5 $x_2) $- (&i* $7 $x_3) $+
             (&i* $6 $x_4) $+ (&i* $2 $x_5) $= $-7)))))
   ((exercise #:n "8")
    "令"
    (MB (&= $A (mat (list (list $3 $-1 $2)
                          (list $2 $1 $1)
                          (list $1 $-3 $0)))))
    "对于什么样的三元组" (tu0 $y_1 $y_2 $y_3) "线性方程组"
    AX=Y "有解?")
   ((exercise #:n "9")
    "令"
    (MB (&= $A (mat (list (list $3 $-6 $2 $-1)
                          (list $-2 $4 $1 $3)
                          (list $0 $0 $1 $1)
                          (list $1 $-2 $1 $0)))))
    "对于什么样的四元组" (tu0 $y_1 $y_2 $y_3 $y_4) "线性方程组" AX=Y "有解?")
   ((exercise #:n "10")
    "设" $R "和" $R^ "是" (&c* $2 $3) "的行简化阶梯矩阵并且线性方程组" RX=0 "和" (LE $R^ $X $0)
    "具有相同的解, 证明" (&= $R $R^) ".")
   (H3 "第1.5节 矩阵乘法")
   (P "显然构造矩阵的行的线性组合的过程是一种根本性的运算. 出于这样的理由, 引入指示何种"
      "操作将被施行的系统记号是很有好处的. 更细致地说, 设" $B "是域" $F "上的"
      n*p "矩阵, 其行分别为" (&cm $beta_1 $..h $beta_n) ". 从" $B "我们构造出" $C ", 其行分别为"
      (&cm $gamma_1 $..h $gamma_m) "而"
      (MB (&= $gamma_i (LC0 (mref $A $i $1) $beta_1 (mref $A $i $2) $beta_2 (mref $A $i $n) $beta_n)) ".")
      $C "的行是由" (&i* $m $n) "个标量" Aij "决定的, 而它们本身是一个" m*n "矩阵" $A "的元素. 将"
      $gamma_i "展开来看,"
      (MB (&= (tu0 (_ $C (&cm $i $1)) $..h (_ $C (&cm $i $p)))
              (sum (&= $r $1) $n
                   (tu0 (&i* (mref $A $i $r) (mref $B $r $1))
                        $..h
                        (&i* (mref $A $i $r) (mref $B $r $p))))))
      "我们发现" $C "的元素由"
      (MB (&= (_ $C (&cm $i $j))
              (sum (&= $r $1) $n
                   (&i* (mref $A $i $r) (mref $B $r $j)))))
      "给出.")
   ((definition)
    "令" $A "是一个域" $F "上的" m*n "矩阵, 令" $B "是一个域" $F "上的"
    n*p "矩阵. 积" AB "是一个" (&c* $m $p) "矩阵" $C
    ", 其第" $i "行" $j "列的元素为"
    (MB (&= (mref $C $i $j)
            (sum (&= $r $1) $n
                 (&i* (mref $A $i $r) (mref $B $r $j))))
        "."))
   ((example #:n "10")
    "这里给出一些有理数域上的矩阵之积."
    (Ol #:attr* '((type "a"))
        (Li (MB (&= (mat (list (list $5 $-1 $2)
                               (list $0 $7 $2)))
                    (&i* (mat (list (list $1 $0)
                                    (list $-3 $1)))
                         (mat (list
                               (list $5 $-1 $2)
                               (list 15 $4 $8))))))
            "其中"
            (MB (&table
                 (list
                  (list $gamma_1 $= (tu0 $5 $-1 $2)
                        $= (&d* $1 (tu0 $5 $-1 $2)) $+
                        (&d* $0 (tu0 15 $4 $8)))
                  (list $gamma_2 $= (tu0 $0 $7 $2)
                        $= (&i* $-3 (tu0 $5 $-1 $2)) $+
                        (&d* $1 (tu0 15 $4 $8)))))))
        (Li (MB (&= (mat (list
                          (list $0 $6 $1)
                          (list $9 12 $-8)
                          (list 12 62 $-3)
                          (list $3 $8 $-2)))
                    (&i* (mat
                          (list
                           (list $1 $0)
                           (list $-2 $3)
                           (list $5 $4)
                           (list $0 $1)))
                         (mat
                          (list
                           (list $0 $6 $1)
                           (list $3 $8 $-2))))))
            "其中"
            (MB (&table
                 (list
                  (list $gamma_2 $= (tu0 $9 12 $-8)
                        $= (&+ (&i* $-2 (tu0 $0 $6 $1))
                               (&i* $3 (tu0 $3 $8 $-2))))
                  (list $gamma_3 $= (tu0 12 62 $-3)
                        $= (&+ (&i* $5 (tu0 $0 $6 $1))
                               (&i* $4 (tu0 $3 $8 $-2))))))))
        (Li (MB (&= (Mat ($8) (29))
                    (&i* (mat (list (list $2 $1)
                                    (list $5 $4)))
                         (mat (list (list $1)
                                    (list $6)))))))
        (Li (MB (&= (mat (list (list $-2 $-4)
                               (list $6 12)))
                    (&i* (mat (list (list $-1)
                                    (list $3)))
                         (mat (list (list $2 $4))))))
            "其中"
            (MB (&= $gamma_2 (tu0 $6 12)
                    (&i* $3 (tu0 $2 $4)))))
        (Li (MB (&= (&i* (mat (list (list $2 $4)))
                         (mat (list (list $-1)
                                    (list $3))))
                    (mat (list (list $10))))))
        (Li (MB (&= (&i* (mat (list (list $0 $1 $0)
                                    (list $0 $0 $0)
                                    (list $0 $0 $0)))
                         (mat (list (list $1 (&- $5) $2)
                                    (list $2 $3 $4)
                                    (list $9 $-1 $3))))
                    (mat (list (list $2 $3 $4)
                               (list $0 $0 $0)
                               (list $0 $0 $0))))))
        (Li (MB (&= (&i* (mat (list (list $1 (&- $5) $2)
                                    (list $2 $3 $4)
                                    (list $9 $-1 $3)))
                         (mat (list (list $0 $1 $0)
                                    (list $0 $0 $0)
                                    (list $0 $0 $0))))
                    (mat (list (list $0 $1 $0)
                               (list $0 $2 $0)
                               (list $0 $9 $0))))))))
   (P "注意到两个矩阵之积不必有定义是重要的. 积有定义当且仅当第一个矩阵的列数与"
      "第二个矩阵的行数相合. 因此, 交换以上a, b, c中因子的顺序是没有意义的. "
      "往往我们写下如" AB "一样的积时并不显式提及因子的尺寸, 在这种情况下, "
      "应该理解为积是有定义的. 从d, e, f, g中我们发现, 即便" AB "和"
      (&i* $B $A) "都有定义, 也不一定有" (&= AB (&i* $B $A)) ". "
      "换句话说, 矩阵乘法不是交换的.")
   ((example #:n "11")
    (Ol #:attr* '((type "a"))
        (Li "如果" $I "是" m*m "的恒等矩阵, 而" $A "是一个" m*n "的矩阵, 那么"
            (&= (&i* $I $A) $A) ".")
        (Li "如果" $I "是" n*n "的恒等矩阵, 而" $A "是一个" m*n "的矩阵, 那么"
            (&= (&i* $A $I) $A) ".")
        (Li "如果" (^ $0 (&cm $k $m)) "是" (&c* $k $m) "的零矩阵, 那么"
            (&= (^ $0 (&cm $k $n)) (&i* (^ $0 (&cm $k $m)) $A)) ". 类似地, "
            (&= (&i* $A (^ $0 (&cm $n $p))) (^ $0 (&cm $m $p))) ".")))
   ((example #:n "12")
    "令" $A "是域" $F "上的一个" m*n "矩阵. 我们之前对于线性方程组的简记法" AX=Y
    "和我们对于矩阵乘法的定义是一致的, 因为如果"
    (MB (&= $X (mat (map list (list $x_1 $x_2 $..v $x_n)))))
    "其中" $x_i "在" $F "中, 那么" (&i* $A $X) "是" m*1 "矩阵"
    (MB (&= $Y (mat (map list (list $y_1 $y_2 $..v $y_m)))))
    "满足" (&= $y_i (LC0 (mref $A $i $1) $x_1 (mref $A $i $2) $x_2 (mref $A $i $n) $x_n)) ".")
   (P "列矩阵的使用提示了一种往往有用的记号. 如果" $B "是一个" n*p "的矩阵, 那么"
      $B "的列是" n*1 "矩阵" (&cm $B_1 $..h $B_p) ", 由"
      (MB (&cm (&= $B_j (Mat ((mref $B $1 $j)) ($..v) ((mref $B $n $j)))) (&<= $1 $j $p)))
      "定义. 矩阵" $B "是由这些列相继构成的:"
      (MB (&= $B (li0 $B_1 $..h $B_p)))
      "积矩阵" AB "的第" $i "行" $j "列元素是由" $A "的第" $i "行和" $B
      "的第" $j "列构造出来的. 读者应该验证" AB "的第" $j "列就是"
      (&i* $A $B_j) ":"
      (MB (&= AB (li0 (&i* $A $B_1) $..h (&i* $A $B_p)))))
   (P "尽管矩阵之积依赖于因子的顺序, 但是它独立于结合的方式, 这正是下一个定理表明的.")
   ((theorem #:n "8")
    "如果" $A ", " $B ", " $C "是域" $F "上的矩阵, 满足乘积" (&i* $B $C) "和"
    (&i* $A (@i* $B $C)) "有定义, 那么乘积" AB "和"
    (&i* @AB $C) "也有定义, 并且"
    (MB (&= (&i* $A (@i* $B $C)) (&i* @AB $C))))
   ((proof)
    "设" $B "是一个" n*p "矩阵. 既然" (&i* $B $C) "是有定义的, 那么" $C "就是一个有"
    $p "行的矩阵, 而" (&i* $B $C) "有" $n "行. 因为" (&i* $A (@i* $B $C))
    "是有定义的, 我们可以假定" $A "是一个" m*n "矩阵. 因此, 积" AB
    "存在, 是一个" (&c* $m $p) "矩阵, 从中又可以知道"
    (&i* @AB $C) "存在. 为了证明"
    (&= (&i* $A (@i* $B $C)) (&i* @AB $C))
    "其实也就是要证明"
    (MB (&= (mref (bra0 (&i* $A (@i* $B $C))) $i $j)
            (mref (bra0 (&i* @AB $C)) $i $j)))
    "对于每个" $i "和" $j "成立. 根据定义,"
    (MB (deriv (_ (bra0 (&i* $A (@i* $B $C))) (&cm $i $j))
               (sum $r $
                    (&i* (mref $A $i $r)
                         (mref (@i* $B $C) $r $j)))
               (sum $r $
                    (&i* (mref $A $i $r)
                         (sum $s $
                              (&i* (mref $B $r $s)
                                   (mref $C $s $j)))))
               (sum $r $
                    (sum $s $
                         (&i* (mref $A $i $r)
                              (mref $B $r $s)
                              (mref $C $s $j))))
               (sum $s $
                    (sum $r $
                         (&i* (mref $A $i $r)
                              (mref $B $r $s)
                              (mref $C $s $j))))
               (sum $s $
                    (&i* (@ (sum $r $
                                 (&i* (mref $A $i $r)
                                      (mref $B $r $s))))
                         (mref $C $s $j)))
               (sum $s $
                    (&i* (_ @AB (&cm $i $s))
                         (mref $C $s $j)))
               (_ (bra0 (&i* @AB $C)) (&cm $i $j)))))
   (P "当" $A "是一个" n*n "矩阵时, 积" (&i* $A $A) "是有定义的. "
      "我们用" $A^2 "表示这个矩阵. 根据定理8, "
      (&= (&i* (@i* $A $A) $A) (&i* $A (@i* $A $A))) "或者说"
      (&= (&i* $A^2 $A) (&i* $A $A^2)) ", 于是积" (&i* $A $A $A)
      "是良定的. 我们用" $A^3 "表示这个积. 一般地, 积"
      (&i* $A $A $..c $A) " (" $k "次) 是良定的, 我们将其记作" $A^k ".")
   (P "注意到" (assoc* $A $B $C) "可以推出" $C "的行的线性组合的线性组合也是" $C "的行的线性组合.")
   (P "如果" $B "是一个给定的矩阵而" $C "是由" $B "通过一次初等行变换得到的, 那么"
      $C "的每一行都是" $B "的行的线性组合, 因此存在一个矩阵" $A "满足"
      (&= AB $C) ". 一般而言, 这样的" $A "不止一个, 而从诸多这样的矩阵中"
      "挑选出一个具有许多特别性质的矩阵是可能的也是方便的. 在讨论这个之前我们需要"
      "先引入一类矩阵.")
   ((definition)
    "一个" m*m "矩阵被称为是一个初等矩阵, 如果它是可由" m*m
    "的恒等矩阵通过一次初等行变换得到.")
   ((example #:n "13")
    "一个" 2*2 "的初等矩阵只可能是以下几种之一:"
    (MB (&cm (Mat ($0 $1)
                  ($1 $0))
             (Mat ($1 $c)
                  ($0 $1))
             (Mat ($1 $0)
                  ($c $1))))
    (MB (&cm (Mat ($c $0)
                  ($0 $1))
             (&!= $c $0)
             (Mat ($1 $0)
                  ($0 $c))
             (&!= $c $0))))
   ((theorem #:n "9")
    "令" $e "是一个初等行变换, 令" m*m "矩阵" (&= $E (app $e $I)) ". "
    "那么, 对于每一个" m*n "矩阵" $A ","
    (MB (&= eA (&i* $E $A))))
   ((proof)
    "证明的要点在于积矩阵" (&i* $E $A) "第" $i "行" $j "列的元素是由" $E
    "的第" $i "行和" $A "的第" $j "列得到的. 三种初等行变换应该分开看待. "
    "我们将给出对于类型2的变换的详细证明. 其他两种情况更加简单, 留给读者作为练习. "
    "设" (&!= $r $s) "而" $e "是将第" $r "行替换为第" $r "行加上" $c "乘上第" $s
    "行的变换, 那么"
    (MB (&= (_ $E (&cm $i $k))
            (Choice
             ((_ $delta (&cm $i $k)) (: $cm (&!= $i $r)))
             ((&+ (_ $delta (&cm $r $k))
                  (&i* $c (_ $delta (&cm $s $k))))
              (: $cm (&= $i $r))))))
    "因此,"
    (MB (&= (mref (@i* $E $A) $i $j)
            (sum (&= $k $1) $m
                 (&i* (mref $E $i $k)
                      (mref $A $k $j)))
            (Choice
             (Aij (: $cm (&!= $i $r)))
             ((&+ (mref $A $r $j)
                  (&i* $c (mref $A $s $j)))
              (: $cm (&= $i $r))))))
    "换句话说, " (&= (&i* $E $A) eA) ".")
   ((corollary)
    "令" $A "和" $B "是域" $F "上的" m*n "矩阵, 那么" $B "行等价于" $A "当且仅当"
    (&= $B (&i* $P $A)) ", 其中" $P "是一系列" m*m "的初等矩阵之积.")
   ((proof)
    "设" (&= $B (&i* $P $A)) ", 其中" (&= $P (&i* $E_s $..c $E_2 $E_1)) "而"
    $E_i "是" m*m "的初等矩阵, 那么" (&i* $E_1 $A) "行等价于" $A ", 并且"
    (&i* $E_2 (@i* $E_1 $A)) "行等价于" (&i* $E_1 $A) ", 于是" (&i* $E_2 $E_1 $A)
    "行等价于" $A ". 如法炮制我们可以看到" (&i* (@i* $E_s $..c $E_1) $A)
    "行等价于" $A "." (Br)
    "现在设" $B "行等价于" $A ". 令" (&cm $E_1 $E_2 $..h $E_s) "为与将" $A
    "变为" $B "的一系列初等行变换相对应的初等矩阵, 那么"
    (&= $B (&i* (@i* $E_s $..c $E_1) $A)) ".")
   ((exercise #:n "1")
    "令"
    (MB (&cm (&= $A (Mat ($2 $-1 $1)
                         ($1 $2 $1)))
             (&= $B (Mat ($3)
                         ($1)
                         ($-1)))
             (&= $C (Mat ($1 $-1)))))
    "计算" (&i* $A $B $C) "和" (&i* $C $A $B) ".")
   ((exercise #:n "2")
    "令"
    (MB (&cm (&= $A (Mat ($1 $-1 $1)
                         ($2 $0 $1)
                         ($3 $0 $1)))
             (&= $B (Mat ($2 $-2)
                         ($1 $3)
                         ($4 $4)))))
    "验证" (&= (&i* $A @AB) (&i* $A^2 $B)) ".")
   ((exercise #:n "3")
    "找出两个不同的" 2*2 "矩阵" $A "满足" (&= $A^2 $0) "但是" (&!= $A $0) ".")
   ((exercise #:n "4")
    "对于练习2的矩阵" $A ", 找出初等矩阵" (&cm $E_1 $E_2 $..h (_ $E $k)) "满足"
    (MB (&= (&i* (_ $E $k) $..c $E_2 $E_1 $A) $I)))
   ((exercise #:n "5")
    "令"
    (MB (&cm (&= $A (Mat ($1 $-1)
                         ($2 $2)
                         ($1 $0)))
             (&= $B (Mat ($3 $1)
                         ($-4 $4)))))
    "存在矩阵" $C "满足" (LE $C $A $B) "吗?")
   ((exercise #:n "6")
    "令" $A "是一个" m*n "矩阵而" $B "是一个" (&c* $n $k) "矩阵. 证明"
    (&= $C AB) "的列是" $A "的列的线性组合, 并且如果"
    alpha_1..n "是" $A "的列, 而"
    (&cm $gamma_1 $..h $gamma_k) "是" $C "的列, 那么"
    (MB (&= $gamma_j
            (sum (&= $r $1) $n
                 (&i* (mref $B $r $j) $alpha_r)))))
   ((exercise #:n "7")
    "令" $A "和" $B "是" 2*2 "的矩阵满足" (LE $A $B $I) ", 证明"
    (LE $B $A $I) ".")
   ((exercise #:n "8")
    "令"
    (MB (&= $C (Mat ((_ $C (&cm $1 $1)) (_ $C (&cm $1 $2)))
                    ((_ $C (&cm $2 $1)) (_ $C (&cm $2 $2))))))
    "是一个" 2*2 "的矩阵. 我们想问什么情况下有可能找到两个"
    2*2 "的矩阵" $A "和" $B "满足"
    (&= $C (&- AB (&i* $B $A))) ". 证明这样的矩阵可以被找到当且仅当"
    (&= (&+ (_ $C (&cm $1 $1)) (_ $C (&cm $2 $2))) $0) ".")
   (H3 "第1.6节 可逆矩阵")
   (P "设" m*m "矩阵" $P "是初等矩阵之积. 对于每个" m*n "矩阵" $A ", 矩阵"
      (&= $B (&i* $P $A)) "行等价于" $A ", 因此" $A "行等价于" $B ", 存在一个初等矩阵之积"
      $Q "满足" (&= $A (&i* $Q $B)) ". 特别地, 当" $A "是" m*m "的恒等矩阵时"
      "亦成立. 换言之, 存在一个" m*m "矩阵" $Q ", 其自身是初等矩阵之积, 满足"
      (LE $Q $P $I) ". 正如我们将看到的, 存在" $Q "满足" (LE $Q $P $I) "等价于"
      $P "是初等矩阵之积.")
   ((definition)
    "令" $A "是域" $F "上的一个" n*n "矩阵. 一个" n*n "矩阵" $B "若是满足"
    (LE $B $A $I) ", 则被称为" $A "的一个左逆. 一个" n*n "矩阵" $B "若是满足"
    (LE $A $B $I) ", 则被称为" $A "的一个右逆. 如果" (&= AB (&i* $B $A) $I)
    ", 则" $B "被称为" $A "的双端逆, 而" $A "被称为可逆的.")
   ((lemma)
    "如果" $A "有一个左逆" $B "和一个右逆" $C ", 那么" (&= $B $C) ".")
   ((proof)
    "设" (LE $B $A $I) "且" (LE $A $C $I) ", 那么"
    (MB (&= $B (&i* $B $I) (&i* $B (@i* $A $C))
            (&i* (@i* $B $A) $C) (&i* $I $C) $C)))
   (P "因此, 如果" $A "有一个左逆和一个右逆, " $A "就是可逆的, 并且拥有一个唯一的双端逆, "
      "我们将其表示为" (^ $A $-1) "并简单地称其为" $A "的逆.")
   ((theorem #:n "10")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵."
    (Ol #:attr* '((type "i"))
        (Li "如果" $A "可逆, 那么" (inv $A) "也可逆, 并且"
            (&= (inv (@ (inv $A))) $A) ".")
        (Li "如果" $A "和" $B "都可逆, 那么" AB "也可逆, 并且"
            (&= (inv @AB) (&i* (inv $B) (inv $A))) ".")))
   ((proof)
    "第一条陈述从定义的对称性来看是显然的. 第二条陈述由验证以下关系自然得到."
    (MB (&= (&i* @AB (@ (&i* (inv $B) (inv $A))))
            (&i* (@ (&i* (inv $B) (inv $A))) @AB)
            $I)))
   ((corollary)
    "一系列可逆矩阵之积是可逆的.")
   ((theorem #:n "11")
    "初等矩阵是可逆的. [译注: 并且逆也是初等矩阵.]")
   ((proof)
    "令" $E "是与初等行变换" $e "相对应的初等矩阵. 如果" $e_1 "是" $e "的逆变换 (见定理2) "
    "而" (&= $E_1 (app $e_1 $I)) ", 那么有"
    (MB (&= (&i* $E $E_1) (app $e $E_1) (app $e (app $e_1 $I)) $I))
    "和"
    (MB (&= (&i* $E_1 $E) (app $e_1 $E) (app $e_1 (app $e $I)) $I))
    "于是" $E "是可逆的且" (&= $E_1 (inv $E)) ".")
   ((example #:n "14")
    (Ol #:attr* '((type "a"))
        (Li (MB (&= (inv (Mat ($0 $1)
                              ($1 $0)))
                    (Mat ($0 $1)
                         ($1 $0)))))
        (Li (MB (&= (inv (Mat ($1 $c)
                              ($0 $1)))
                    (Mat ($1 (&- $c))
                         ($0 $1)))))
        (Li (MB (&= (inv (Mat ($1 $0)
                              ($c $1)))
                    (Mat ($1 $0)
                         ((&- $c) $1)))))
        (Li "当" (&!= $c $0) ","
            (MB (&= (inv (Mat ($c $0)
                              ($0 $1)))
                    (Mat ((inv $c) $0)
                         ($0 $1)))
                "且"
                (&= (inv (Mat ($1 $0)
                              ($0 $c)))
                    (Mat ($1 $0)
                         ($0 (inv $c))))))))
   ((theorem #:n "12")
    "如果" $A "是一个" n*n "的矩阵, 那么以下命题等价."
    (Ol #:attr* '((type "i"))
        (Li $A "可逆.")
        (Li $A "行等价于" n*n "的恒等矩阵.")
        (Li $A "是一系列初等矩阵之积.")))
   ((proof)
    "令" $R "是行等价于" $A "的一个行简化阶梯矩阵. 根据定理9 (或其推论),"
    (MB (&= $R (&i* (_ $E $k) $..c $E_2 $E_1 $A)))
    "其中" (&cm $E_1 $..h (_ $E $k)) "是初等矩阵. 每个" $E_j "都是可逆的, 于是"
    (MB (&= $A (&i* (_^ $E $1 $-1) $..c (_^ $E $k $-1) $R)))
    "既然可逆矩阵之积是可逆的, 我们看到" $A "可逆当且仅当" $R "可逆. 因为" $R
    "是一个 (方的) 行简化阶梯矩阵, " $R "可逆当且仅当" $R "的每一行都包含非零元, 即"
    "当且仅当" (&= $R $I) ". 现在我们已经证明了" $A "可逆当且仅当" (&= $R $I) ", "
    "并且如果" (&= $R $I) ", 那么" (&= $A (&i* (_^ $E $1 $-1) $..c (_^ $E $k $-1)))
    ". 现在i, ii, iii是关于" $A "的等价陈述应该是显然的了.")
   ((corollary)
    "如果" $A "是一个" n*n "的可逆矩阵, 并且一系列初等行变换将" $A "规约为" $I ", "
    "那么相同的初等行变换应用于" $I "就得到" (inv $A) ".")
   ((corollary)
    "令" $A "和" $B "是" m*n "的矩阵, 那么" $B "行等价于" $A "当且仅当"
    (&= $B (&i* $P $A)) ", 其中" $P "是一个" m*m "的可逆矩阵.")
   ((theorem #:n "13")
    "对于" n*n "矩阵" $A ", 以下命题等价."
    (Ol #:attr* '((type "i"))
        (Li $A "可逆.")
        (Li "齐次线性方程组" AX=0 "仅有平凡解.")
        (Li "线性方程组" AX=Y "对于每个" n*1 "的" $Y "都有一个解" $X ".")))
   ((proof)
    "根据定理7, 条件ii等价于" $A "行等价于恒等矩阵. 根据定理12, i和ii因此是等价的. "
    "如果" $A "可逆, " AX=Y "的解是" (&= $X (&i* (inv $A) $Y)) ". "
    "反过来, 设" AX=Y "对于每个给定的" $Y "都有一个解. 令" $R "是行等价于" $A
    "的一个行简化阶梯矩阵. 我们想要证明" (&= $R $I) ". 这只需要证明" $R
    "的最后一行不都是零即可. 令"
    (MB (&= $E (Mat ($0) ($0) ($..v) ($0) ($1))))
    "若" (LE $R $X $E) "有解, 那么" $R "的最后一行就不可能都是零. "
    "我们知道" (&= $R (&i* $P $A)) ", 其中" $P "可逆, 因而" (LE $R $X $E) "和"
    (LE $A $X (&i* (inv $P) $E)) "拥有相同的解. 根据条件iii, 后一个线性方程组有解, 故"
    $A "可逆.")
   ((corollary)
    "一个有左逆或右逆的方阵是可逆的.")
   ((proof)
    "令" $A "是一个" n*n "矩阵. 设" $A "有一个左逆, 即一个矩阵" $B "满足"
    (LE $B $A $I) ", 那么" AX=0 "仅有平凡解, 因为"
    (&= $X (&i* $I $X) (&i* $B (@ (&i* $A $X)))) ", 故" $A "可逆. "
    "另一方面, 设" $A "有一个右逆, 即一个矩阵" $C "满足" (LE $A $C $I) ", 那么"
    $C "有一个左逆, 故是可逆的, 于是就有" (&= $A (inv $C)) ", 那么" $A "可逆, 其逆为"
    $C ".")
   ((corollary)
    "令" (&= $A (&i* $A_1 $A_2 $..c $A_k)) ", 其中" (&cm $A_1 $..h $A_k)
    "是" n*n "的方阵, 那么" $A "可逆当且仅当每个" $A_j "可逆.")
   ((proof)
    "我们已经证明了两个可逆矩阵之积是可逆的, 从中读者可以简单地看出来若是每个" $A_j
    "可逆, 则" $A "可逆. [译注: 实际上之前有一个推论陈述了这个事实.]" (Br)
    "现在设" $A "可逆. 我们先来证明" $A_k "是可逆的. 设" $X "是一个" n*1
    "的矩阵并且" (LE $A_k $X $0) ", 那么"
    (&= (&i* $A $X) (&i* (@ (&i* $A_1 $..c (_ $A (&- $k $1)))) $A_k $X) $0)
    ". 既然" $A "是可逆的, 那么" $X "就必须是" $0 ". 因此, " (LE $A_k $X $0)
    "没有非平凡的解, 于是" $A_k "可逆. 现在, "
    (&= (&i* $A_1 $..c (_ $A (&- $k $1))) (&i* $A (_^ $A $k $-1)))
    "也是可逆的了. 施行前述论证, 可知" (_ $A (&- $k $1)) "是可逆的. "
    "续行此法, 可得每个" $A_j "都是可逆的.")
   (P "我们想要作出关于求解线性方程组的最后一个注记. 设" $A "是一个" m*n "的矩阵, 并且"
      "我们想要求解线性方程组" AX=Y ". 如果" $R "是行等价于" $A "的一个行简化阶梯矩阵, "
      "那么" (&= $R (&i* $P $A)) ", 其中" $P "是一个" m*m "的可逆矩阵. "
      "方程组" AX=Y "的解恰好就和" (: (LE $R $X (&i* $P $Y)) (@ $= $Z)) "相同. "
      "在实践中, 找到矩阵" $P "并不比行规约" $A "至" $R "困难. "
      "这是因为, 设我们构造了方程组" AX=Y "的增广矩阵" $A^ ", 其最后一行是任意的标量"
      (&cm $y_1 $..h $y_m) ", 然后我们施行将" $A "变为" $R "的初等行变换于"
      (&prime $A) ", 那么矩阵" $P "是什么就很清楚了. (读者应该参考例子9, 那里我们基本上"
      "执行了这套过程.) [译注: 这段话并不十分清楚, 但实际上它的意思就是将"
      (&cm $y_1 $..h $y_m) "当作符号带入计算.] "
      "特别地, 如果" $A "是一个方阵, 那么这个过程将会表明" $A "是否可逆, "
      "以及若可逆, 逆" $P "是什么. 既然我们已经给出这样的计算的一个例子的核心了, 那么现在"
      "我们举一个" 2*2 "的例子就心满意足了.")
   ((example #:n "15")
    "设" $F "是有理数域, 而"
    (MB (&= $A (Mat ($2 $-1)
                    ($1 $3))))
    "那么"
    (MB (deriv0 (Mat ($2 $-1 $y_1)
                     ($1 $3 $y_2))
                (Mover $-> $3)
                (Mat ($1 $3 $y_2)
                     ($2 $-1 $y_1))
                (Mover $-> $2)
                (Mat ($1 $3 $y_2)
                     ($0 $-7 (&- $y_1 (&i* $2 $y_2))))
                (Mover $-> $1)
                (Mat ($1 $3 $y_2)
                     ($0 $1 (&i* 1/7 (@ (&- (&i* $2 $y_2) $y_1)))))
                (Mover $-> $2)
                (Mat ($1 $0 (&i* 1/7 (@ (&+ $y_2 (&i* $3 $y_1)))))
                     ($0 $1 (&i* 1/7 (@ (&- (&i* $2 $y_2) $y_1)))))
                ))
    "从中可以清楚地看出来" $A "可逆, 并且"
    (MB (&= (inv $A) (Mat (3/7 1/7)
                          (-1/7 2/7)))))
   (P "或许看上去一直把任意的标量" (&cm $y_1 $y_2 $..h) "写下来太过繁琐. "
      "有的人觉得同时操作两列矩阵不那么尴尬一点, 一列描述了从" $A "到恒等矩阵的规约过程, "
      "另一列记录了相同的操作对于恒等矩阵的影响. "
      "读者或许应该自行决定哪一种对于他而言是更加利落的簿记格式.")
   ((example #:n "16")
    "让我们找出"
    (MB (&= $A (Mat ($1 $1/2 $1/3)
                    ($1/2 $1/3 1/4)
                    ($1/3 1/4 1/5))))
    "的逆."
    (MB (&Table
         ((Mat ($1 $1/2 $1/3)
               ($1/2 $1/3 1/4)
               ($1/3 1/4 1/5))
          (Mat ($1 $0 $0)
               ($0 $1 $0)
               ($0 $0 $1)))
         ((Mat ($1 $1/2 $1/3)
               ($0 1/12 1/12)
               ($0 1/12 4/45))
          (Mat ($1 $0 $0)
               (-1/2 $1 $0)
               ((&- $1/3) $0 $1)))
         ((Mat ($1 $1/2 $1/3)
               ($0 1/12 1/12)
               ($0 $0 1/180))
          (Mat ($1 $0 $0)
               (-1/2 $1 $0)
               (1/6 $-1 $1)))
         ((Mat ($1 $1/2 $1/3)
               ($0 $1 $1)
               ($0 $0 $1))
          (Mat ($1 $0 $0)
               ((&- $6) 12 $0)
               (30 -180 180)))
         ((Mat ($1 $1/2 $0)
               ($0 $1 $0)
               ($0 $0 $1))
          (Mat ((&- $9) 60 -60)
               (-36 192 -180)
               (30 -180 180)))
         ((Mat ($1 $0 $0)
               ($0 $1 $0)
               ($0 $0 $1))
          (Mat ($9 -36 30)
               (-36 192 -180)
               (30 -180 180))))))
   (P "读者肯定想过我们详细地讨论了矩阵的行但很少涉及列. "
      "我们专注于行是因为从线性方程的角度来看这似乎更加自然. "
      "既然行没有什么神圣的地方, 后几节的讨论当然本可用列来展开而不是行. "
      "如果有人仿照初等行变换和行等价定义了初等列变换和列等价, 那么显然每个"
      m*n "的矩阵都列等价于一个&quot;列简化阶梯&quot;矩阵. "
      "另外, 每个初等列变换将拥有" (&\|-> $A (&i* $A $E))
      "的形式, 其中" $E "是一个" n*n "的初等矩阵. 诸如此类, 留给读者自行思考.")
   ((exercise #:n "1")
    "令"
    (MB (&= $A (Mat ($1 $2 $1 $0)
                    ($-1 $0 $3 $5)
                    ($1 $-2 $1 $1))))
    "找出一个行等价于" $A "的行简化阶梯矩阵" $R "以及一个可逆的" (&c* $3 $3)
    "矩阵" $P "满足" (&= $R (&i* $P $A)) ".")
   ((exercise #:n "2")
    "做练习1, 但是"
    (MB (&= $A (Mat ($2 $0 $i)
                    ($1 $-3 (&- $i))
                    ($i $1 $1)))))
   ((exercise #:n "3")
    "对于以下两个矩阵的每一个"
    (MB (&cm (Mat ($2 $5 $-1)
                  ($4 $-1 $2)
                  ($6 $4 $1))
             (Mat ($1 $-1 $2)
                  ($3 $2 $4)
                  ($0 $1 $-2))))
    "使用初等行变换来判断其是否可逆, 并且在可逆的情况下找出其逆.")
   ((exercise #:n "4")
    "令"
    (MB (&= $A (Mat ($5 $0 $0)
                    ($1 $5 $0)
                    ($0 $1 $5))))
    "对于什么样的" $X "存在标量" $c "满足" (LE $A $X (&i* $c $X)) "?")
   ((exercise #:n "5")
    "判断"
    (MB (&= $A (Mat ($1 $2 $3 $4)
                    ($0 $2 $3 $4)
                    ($0 $0 $3 $4)
                    ($0 $0 $0 $4))))
    "是否可逆, 并且在" (inv $A) "存在的情况下找到它.")
   ((exercise #:n "6")
    "设" $A "是一个" (&c* $2 $1) "矩阵而" $B "是一个" (&c* $1 $2) "矩阵, "
    "证明" (&= $C AB) "不可逆.")
   ((exercise #:n "7")
    "令" $A "是一个" n*n "的方阵. 证明以下两个陈述:"
    (Ol #:attr* '((type "a"))
        (Li "如果" $A "可逆而对于某个" n*n "的矩阵" $B "有" (LE $A $B $0)
            ", 那么" (&= $B $0) ".")
        (Li "如果" $A "不可逆, 那么存在一个" n*n "的矩阵" $B "满足"
            (LE $A $B $0) "但是" (&!= $B $0) ".")))
   ((exercise #:n "8")
    "令"
    (MB (&= $A (Mat ($a $b)
                    ($c $d))))
    "使用初等行变换证明, " $A "可逆当且仅当"
    (&!= (@ (&- (&i* $a $d) (&i* $b $c))) $0) ".")
   ((exercise #:n "9")
    "一个" n*n "矩阵" $A "被称为是上三角的, 如果" (&> $i $j) "时"
    (&= Aij $0) ", 即主对角线以下的元素均为零. "
    "证明一个上三角矩阵可逆当且仅当其每个主对角线上的元素均不为零.")
   ((exercise #:n "10")
    "证明以下练习6的一般化版本. 若" $A "是一个" m*n "矩阵而" $B "是一个"
    (&c* $n $m) "矩阵, 并且" (&< $n $m) ", 那么" AB "不可逆.")
   ((exercise #:n "11")
    "令" $A "是一个" m*n "矩阵. 证明通过一系列初等行变换和初等列变换可以从"
    $A "得到一个矩阵" $R ", 其既是行简化阶梯矩阵, 也是列简化阶梯矩阵. 也就是说, 如果"
    (&!= $i $j) ", 那么" (&= (mref $R $i $j) $0) "; 如果" (&<= $1 $i $r) ", 那么"
    (&= (mref $R $i $i) $1) "; 如果" (&> $i $r) ", 那么"
    (&= (mref $R $i $i) $0) ". 证明" (&= $R (&i* $P $A $Q)) ", 其中" $P
    "是一个" m*m "的可逆矩阵, 而" $Q "是一个" n*n "的可逆矩阵.")
   ((exercise #:n "12")
    "例子16的结果暗示或许矩阵"
    (MB (&= $A (Mat ($1 $1/2 $..c (~ $1 $n))
                    ($1/2 $1/3 $..c (~ $1 (&+ $n $1)))
                    ($..v $..v $ $..v)
                    ((~ $1 $n) (~ $1 (&+ $n $1)) $..c (~ $1 (&- (&i* $2 $n) $1))))))
    "可逆并且" (inv $A) "的元素都是整数. 你能证明吗?")
   ))