#lang racket
(provide div:hoffman_appendix)
(require SMathML "linear_algebra_utils.rkt")
(define div:hoffman_appendix
  (TmDiv
   (H2 "附录")
   (P "这个附录逻辑上分为两个部分. 第一部分由前三节构成, "
      "包含了整本书 (实际上是整个数学) 会出现的特定基础概念. "
      "对于本书而言其更像引论而非附录. 第二部分则诚然"
      "作为本书的实际附录出现.")
   (P "第1节包含了对于集合以及交集和并集的讨论. "
      )
   (H3 "第A.1节 集合")
   
   (H3 "第A.2节 函数")
   (P "一个函数包含以下资料:"
      (Ol (Li "一个集合" $X ", 被称为函数的定义域;")
          (Li "一个集合" $Y ", 被称为函数的陪域 (codomain);")
          (Li "一个规则 (或者说对应关系) " $f ", 其将" $X
              "的每个元素" $x "联系以" $Y "的单独一个元素" (app $f $x) "."))
      "如果" (tu0 $X $Y $f) "是一个函数, 我们也称" $f "是一个从" $X
      "到" $Y "的函数. 这稍微有些混乱了, 因为" $f "本身不是函数, 而是函数的"
      "规则. [译注: 实际上, " $X "和" $Y "可以被视为附着在规则" $f
      "上的元数据. 另外, 规则在现代数学中通常被解释/实现为序对的集合, "
      "这是外延性的观念.] 然而, 对于函数和规则使用相同的符号为我们提供了"
      "更加容易的讨论函数的方式. 因此, 当我们说" $f "是从" $X "到" $Y
      "的函数, 或者" $X "是" $f "的定义域, " $Y "是" $f "的陪域时, 这意味着"
      (tu0 $X $Y $f) "是一个如之前所定义的那样的函数. 许多词汇经常用于代替函数, "
      "例如变换, 算子, 映射. 它们在特定的上下文中使用以暗示函数所扮演的角色.")
   (P "如果" $f "是一个从" $X "到" $Y "的函数, 那么" $f "的值域 (或者说像) 是由所有"
      $X "中" $x "的" (app $f $x) "构成的集合. 换言之, " $f "的值域由" $Y "中所有满足存在"
      $X "中的" $x "使得" (&= $y (app $f $x)) "的元素" $y "构成. 如果" $f "的值域是整个"
      $Y ", 那么我们称" $f "是从" $X "到" $Y "的满射, 或者就说" $f "是一个满射. " $f
      "的值域经常被记为" (app $f $X) ". [译注: 这里术语稍有修改, 以符合数学界的潮流.]")
   ((example #:n "2")
    (Ol #:attr* '((type "a"))
        (Li "令" $X "是实数集, " (&= $Y $X) ", 那么由" (&= (app $f $x) $x^2)
            "定义的从" $X "到" $Y "的函数" $f "的值域是非负实数构成的集合, 所以" $f
            "不是满射.")
        (Li ""
            )
        )
    )
   (H3 "第A.3节 等价关系")
   (H3 "第A.4节 商空间")
   (P "令" $V "是域" $F "上的一个向量空间, " $W "是" $V "的子空间. 一般来说, 存在许多与"
      $W "互补的子空间" $W^ ", 即满足" (&= $V (&d+ $W $W^)) "的子空间. 如果" $V
      "上定义了一个内积, 而且" $W "是有限维的, 在某种意义上存在可以称得上是自然的" $W
      "的补子空间, 即" $W "的正交补. 但是, 如果" $V "没有附加于其向量空间结构"
      "之上的其他结构, 那么我们并不能挑选出一个自然的补子空间. 然而, 我们可以从" $V
      "和" $W "中构造出向量空间" (&/ $V $W) ", 所谓的" $V "和" $W "的商, 其可以扮演"
      $W "的自然的补的角色. 这个商空间并非" $V "的子空间, 但是其仅由" $V "和" $W
      "定义, 并且同构于任何与" $W "互补的子空间" $W^ ".")
   (P "令" $W "是" $V "的一个子空间, 如果" $alpha "和" $beta "是" $V
      "中任意的向量, 那么我们称" $alpha "模" $W "与" $beta "同余, 若向量" (@- $alpha $beta)
      "在" $W "之中. 如果" $alpha "模" $W "与" $beta "同余, 我们将其记为"
      (MB (equivmod $alpha $beta $W) ".")
      "现在模" $W "的同余关系是" $V "上的一个等价关系."
      (Ol (Li (equivmod $alpha $alpha $W) ", 因为" (&= (&- $alpha $alpha) $0)
              "在" $W "之中.")
          (Li "如果" (equivmod $alpha $beta $W) ", 那么"
              (equivmod $beta $alpha $W) ", 因为向量" (@- $alpha $beta) "在" $W
              "中当且仅当向量" (@- $beta $alpha) "在" $W "中.")
          (Li "如果" (equivmod $alpha $beta $W) "且" (equivmod $beta $gamma $W)
              ", 那么" (equivmod $alpha $gamma $W)
              ", 因为若" (@- $alpha $beta) "和" (@- $beta $gamma) "都在" $W
              "中, 则有" (&= (&- $alpha $gamma) (&+ (@- $alpha $beta) (@- $beta $gamma)))
              "在" $W "之中.")))
   (P "这个等价关系的等价类被称为" $W "的陪集. 一个向量" $alpha "的等价类 (陪集) "
      "是什么样的呢? 其由所有" $V "中所有满足" (@- $beta $alpha) "属于" $W
      "的向量" $beta "构成. 换言之, 其由所有具有形式" (&= $beta (&+ $alpha $gamma))
      "的向量" $beta "构成, 其中" $gamma "在" $W "中. 出于此缘由, " $alpha "的陪集记作"
      (MB (&+ $alpha $W) ".")
      "在某种意义上, 将" $alpha "相对于" $W "的陪集想成是将子空间" $W "平移向量"
      $alpha "得到的集合是合理的. 为了描绘出这些陪集, 读者或许可以想象一下以下的特殊情形. 令"
      $V "是空间" $RR^2 ", " $W "是" $V "的一个一维子空间. 如果我们将" $V
      "画成是Euclid平面, 那么" $W "就是穿过原点的一条直线. 如果" (&= $alpha (tu0 $x_1 $x_2))
      "是" $V "中的一个向量, 那么陪集" (&+ $alpha $W) "是经过点" (tu0 $x_1 $x_2)
      "且与" $W "平行的直线.")
   (P "所有" $W "的陪集构成的集合被记为" (&/ $V $W) ". 我们现在定义" (&/ $V $W)
      "上的向量加法与标量乘法如下:"
      (MB ((Ttable (lambda (d i j)
                     (cond ((= j 0) (set-right d))
                           ((= j 2) (set-left d))
                           (else d))))
           (&Table
            ((&+ (@+ $alpha $W) (@+ $beta $W)) $= (&+ (@+ $alpha $beta) $W))
            ((&i* $c (@+ $alpha $W)) $= (&+ (@i* $c $alpha) $W)))))
      "换言之, " $alpha "的陪集加上" $beta "的陪集是" (@+ $alpha $beta)
      "的陪集, 标量" $c "和" $alpha "的陪集的乘积是向量" (&i* $c $alpha)
      "的陪集. 既然" $V "中许多不同的向量都可能拥有相同的相对于" $W
      "的陪集, 那么我们必须验证向量加法和标量乘法只依赖于其所牵涉的陪集. 也就是说, 我们必须证明以下事实:"
      (Ol #:attr* '((type "a"))
          (Li "如果" (equivmod $alpha $alpha^ $W) "且" (equivmod $beta $beta^ $W) ", 那么"
              (MB (equivmod (&+ $alpha $beta) (&+ $alpha^ $beta^) $W) "."))
          (Li "如果" (equivmod $alpha $alpha^ $W) ", 那么"
              (equivmod (&i* $c $alpha) (&i* $c $alpha^) $W) "."))
      "这些事实是容易验证的. a. 如果" (&- $alpha $alpha^) "属于" $W "且" (&- $beta $beta^)
      "属于" $W ", 那么因为"
      (&= (&- (@+ $alpha $beta) (@+ $alpha^ $beta^))
          (&+ (@- $alpha $alpha^) (@- $beta $beta^)))
      ", 我们看到" (&+ $alpha $beta) "模" $W "与" (&+ $alpha^ $beta^) "同余. b. 如果"
      (&- $alpha $alpha^) "属于" $W "且" $c "是任意的标量, 那么"
      (&= (&- (&i* $c $alpha) (&i* $c $alpha^)) (&i* $c (@- $alpha $alpha^)))
      "也属于" $W ".")
   (P "现在很容易验证" (&/ $V $W) "在上述向量加法和标量乘法下是一个域" $F
      "上的向量空间. 读者必须直接验证向量空间的每条公理. 向量加法和标量乘法的每条性质"
      "都是从相应的" $V "中的运算性质推得的. 还有要说的一件事情是, " (&/ $V $W)
      "的零向量是" $V "的零向量的陪集. 换言之, " $W "是" (&/ $V $W) "的零向量.")
   (P "向量空间" (&/ $V $W) "被称为" $V "和" $W "的商 (在这种情况下偶尔也有人使用&quot;差&quot;). "
      "存在一个自然的从" $V "到" (&/ $V $W) "的满射的线性变换" $Q ", 其由"
      (&= (app $Q $alpha) (&+ $alpha $W)) "定义. 根据刚才定义的" (&/ $V $W)
      "上的运算, 变换" $Q "的线性性质是显然的. 注意到" $Q "的零空间恰是子空间" $W
      ". 我们称" $Q "是从" $V "到" (&/ $V $W) "的商变换 (或者商映射).")
   (P "现在我们可以陈述商空间" (&/ $V $W) "和" $W "的补子空间之间的关系了.")
   ((theorem)
    "令" $W "是向量空间" $V "的一个子空间, " $Q "是从" $V "到" (&/ $V $W)
    "的商变换. 设" $W^ "是" $V "的一个子空间, 那么" (&= $V (&d+ $W $W^))
    "当且仅当" $Q "于" $W^ "的限制是从" $W^ "到" (&/ $V $W) "的同构.")
   ((proof)
    
    )
   (H3 "第A.5节 线性代数中的等价关系")
   (H3 "第A.6节 选择公理")
   ))