#lang racket
(provide div:hoffman_ch3)
(require SMathML "linear_algebra_utils.rkt")
(define div:hoffman_ch3
  (TmDiv
   (H2 "第3章 线性变换")
   (H3 "第3.1节 线性变换")
   (P "我们将引入线性变换, 本书的剩余部分我们将研究的对象. 读者或许会发现阅读 (或重读) "
      "附录里关于函数的部分是有用的, 因为我们将自由地使用其中的术语.")
   ((definition)
    "令" $V "和" $W "是域" $F "上的向量空间. 一个从" $V "到" $W
    "的线性变换是一个从" $V "到" $W "的函数" $T "满足"
    (MB (&= (app $T (LC $c $alpha $beta))
            (LC $c (@ap $T $alpha) (ap $T $beta))))
    "对于所有" $V "中" $alpha "和" $beta "以及所有" $F "中标量" $c "成立.")
   ((example #:n "1")
    "如果" $V "是任意的向量空间, 恒等变换" $I ", 由"
    (&= (ap $I $alpha) $alpha) "定义, 是一个从" $V "到"
    $V "的线性变换. 零变换, 由" (&= (ap $0 $alpha) $0)
    "定义, 也是一个从" $V "到" $V "的线性变换.")
   ((example #:n "2")
    "令" $F "是一个域, " $V "是从" $F "到" $F "的多项式函数"
    $f "构成的空间, " $f "由"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* (_ $c $k) (^ $x $k)))))
    "给定. 令"
    (MB (&= (app (@ (ap $D $f)) $x)
            (&+ $c_1 (&i* $2 $c_1 $x) $..c
                (&i* $k (_ $c $k) (^ $x (&- $k $1)))))
        ".")
    "那么" $D "是一个从" $V "到" $V "的线性变换, 即微分变换.")
   ((example #:n "3")
    "令" $A "是域" $F "上一个固定的" m*n "矩阵, "
    "由" (&= (app $T $X) (&i* $A $X)) "定义的函数" $T "是一个从"
    $F^n*1 "到" $F^m*1 "的线性变换. "
    "由" (&= (app $U $alpha) (&i* $alpha $A)) "定义的函数" $U
    "是一个从" $F^m "到" $F^n "的线性变换.")
   ((example #:n "4")
    "令" $P "是域" $F "上一个固定的" m*m "矩阵, 令" $Q "是域" $F "上一个固定的" n*n "矩阵. "
    "定义一个从" (^ $F m*n) "到自身的函数" $T ", " (&= (app $T $A) (&i* $P $A $Q)) ". 那么"
    $T "是一个线性变换, 因为"
    (MB (deriv (app $T (&+ (&i* $c $A) $B))
               (&i* $P (@ (&+ (&i* $c $A) $B)) $Q)
               (&i* (@ (&+ (&i* $c $P $A) (&i* $P $B))) $Q)
               (&+ (&i* $c $P $A $Q) (&i* $P $B $Q))
               (&+ (&i* $c (app $T $A)) (app $T $B)))))
   ((example #:n "5")
    "令" $V "是所有从" $RR "到" $RR "的连续函数构成的空间, 由"
    (MB (&= (app (@ (ap $T $f)) $x) (integral $0 $x (app $f $t) $t)))
    "定义" $T ", 那么" $T "是一个从" $V "到" $V "的线性变换. 函数" (ap $T $f)
    "不仅是连续的, 还拥有连续的一阶导数. 积分的线性性质是其根本性质之一.")
   (P "读者验证例子1, 2, 3, 5是线性变换是没有难度的. 当我们了解更多关于线性变换的东西时, "
      "例子也会随之得到扩展.")
   (P "注意到以下事实是重要的. 如果" $T "是一个从" $V "到" $W
      "的线性变换, 那么" (&= (app $T $0) $0) ". 人们可以从定义中看出来, 因为"
      (MB (&= (app $T $0) (app $T (&+ $0 $0)) (&+ (app $T $0) (app $T $0))) ".")
      "这点对于线性代数的初学者而言有时令人迷惑, 因为他可能已经接触过术语&quot;线性函数&quot;"
      "一个稍微有点不同的用法. 扼要的注记应该能够扫清这种迷惑. 设" $V "是向量空间"
      $RR^1 ", 那么一个从" $V "到" $V "的线性变换是一种特定的实数轴" $RR
      "上的实值函数. 在一个微积分课程中, 人们可能会将图像是直线的函数称为线性的. 一个从"
      $RR^1 "到" $RR^1 "的线性变换, 根据我们的定义, 将会是一个从" $RR "到" $RR
      "的函数, 其图像是经过原点的直线.")
   (P "不仅是" (&= (app $T $0) $0) ", 让我们指出一般的线性变换" $T "的另一个性质. "
      "这样的线性变换&quot;保持&quot;线性组合, 也就是说, 如果"
      alpha_1..n "是" $V "中的向量, " (&cm $c_1 $..h $c_n)
      "是标量, 那么"
      (MB (&= (app $T (LC0 $c_1 $alpha_1 $c_n $alpha_n))
              (&+ (&i* $c_1 (@ (ap $T $alpha_1))) $..c
                  (&i* $c_n (@ (ap $T $alpha_n))))))
      "这可由定义直接推得, 例如"
      (MB (deriv (app $T (LC $c_1 $alpha_1 $c_2 $alpha_2))
                 (LC $c_1 (@ap $T $alpha_1)
                     (app $T (&i* $c_2 $alpha_2)))
                 (LC $c_1 (@ap $T $alpha_1)
                     $c_2 (@ap $T $alpha_2)))))
   ((theorem #:n "1")
    "令" $V "是一个域" $F "上的有限维向量空间, 令"
    (setE $alpha_1 $..h $alpha_n) "是" $V "的一个有序基. 令" $W
    "也是域" $F "上的一个向量空间, 并且令" (&cm $beta_1 $..h $beta_n)
    "是" $W "中任意的向量. 那么, 恰存在唯一的从" $V "到" $W
    "的线性映射" $T "满足"
    (MB (&cm (&= (ap $T $alpha_j) $beta_j)
             (&= $j (&cm $1 $..h $n)))))
   ((proof)
    "为了证明存在某个线性变换" $T "满足" (&= (ap $T $alpha_j) $beta_j)
    "我们按照以下方式推进. 给定" $V "中的" $alpha ", 存在唯一的" $n
    "元组" (tu0 $x_1 $..h $x_n) "满足"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)) ".")
    "对于这个向量" $alpha "我们定义"
    (MB (&= (ap $T $alpha) (LC0 $x_1 $beta_1 $x_n $beta_n)) ".")
    "那么" $T "是一个将每个" $V "中的向量" $alpha "与一个" $W
    "中的向量" (ap $T $alpha) "联系起来的良定义的规则. "
    "从此定义中显然可以看出对于每个" $j "有" (&= (ap $T $alpha_j) $beta_j)
    ". 为了说明" $T "是线性的, 令"
    (MB (&= $beta (LC0 $y_1 $alpha_1 $y_n $alpha_n)))
    "是" $V "中的向量, 令" $c "是任意的标量. 现在"
    (MB (&= (LC $c $alpha $beta)
            (LC0 (@ (LC $c $x_1 $y_1)) $alpha_1
                 (@ (LC $c $x_n $y_n)) $alpha_n)))
    "于是根据定义"
    (MB (&= (app $T (LC $c $alpha $beta))
            (LC0 (@ (LC $c $x_1 $y_1)) $beta_1
                 (@ (LC $c $x_n $y_n)) $beta_n)))
    "另一方面"
    (MB (deriv (LC $c (@ap $T $alpha) (ap $T $beta))
               (LC $c (sum (&= $i $1) $n (&i* $x_i $beta_i))
                   (sum (&= $i $1) $n (&i* $y_i $beta_i)))
               (sum (&= $i $1) $n
                    (&i* (@ (LC $c $x_i $y_i)) $beta_i))))
    "因此"
    (MB (&= (app $T (LC $c $alpha $beta))
            (LC $c (@ap $T $alpha) (ap $T $beta))) ".")
    "如果" $U "也是一个满足"
    (&cm (&= (ap $U $alpha_j) $beta_j)
         (&= $j (&cm $1 $..h $n)))
    "的从" $V "到" $W "的线性变换, 那么对于向量"
    (&= $alpha (sum (&= $i $1) $n (&i* $x_i $alpha_i)))
    "我们有"
    (MB (deriv (ap $U $alpha)
               (ap $U (pare (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
               (sum (&= $i $1) $n
                    (&i* $x_i (@ap $U $alpha_i)))
               (sum (&= $i $1) $n (&i* $x_i $beta_i))))
    "因此" $U "恰是我们之前所定义的规则" $T ". 这表明满足"
    (&= (ap $T $alpha_j) $beta_j) "的线性变换" $T "是唯一的.")
   (P "定理1是相当初等的. 然而, 它是如此基本以至于我们形式化地陈述了该定理. "
      "函数的概念是非常一般的. 如果" $V "和" $W "是(非零的)向量空间, "
      "那么从" $V "到" $W "的函数存在相当多样的可能性. 定理1强调了"
      "线性函数是极其特殊的.")
   ((example #:n "6")
    "向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $2))
             (&= $alpha_2 (tu0 $3 $4))))
    "是线性无关的, 因此构成了" $RR^2 "的一个基. 根据定理1, 存在唯一的一个从"
    $RR^2 "到" $RR^3 "的线性变换满足"
    (MB (&cm (&= (ap $T $alpha_1) (tu0 $3 $2 $1))
             (&= (ap $T $alpha_2) (tu0 $6 $5 $4))))
    "如果是这样的话, 我们必须能够找出" (app $T $epsilon_1)
    ". 我们先找到满足" (&= $epsilon_1 (&+ (&i* $c_1 $alpha_1) (&i* $c_2 $alpha_2)))
    "的标量" $c_1 "和" $c_2 ", 然后我们就知道"
    (&= (ap $T $epsilon_1) (&+ (&i* $c_1 (ap $T $alpha_1)) (&i* $c_2 (ap $T $alpha_2))))
    ". 如果" (&= (tu0 $1 $0) (&+ (&i* $c_1 (tu0 $1 $2)) (&i* $c_2 (tu0 $3 $4))))
    ", 那么" (&= $c_1 $-2) "且" (&= $c_2 $1) ", 因此"
    (MB (deriv (ap $T (tu0 $1 $0))
               (LC $-2 (tu0 $3 $2 $1) (tu0 $6 $5 $4))
               (tu0 $0 $1 $2))))
   ((example #:n "7")
    "令" $T "是一个从" $m "元组空间" $F^m "到" $n "元组空间" $F^n "的线性变换. 定理1告诉我们"
    $T "由向量的序列" (&cm $beta_1 $..h $beta_m) "唯一地确定, 其中"
    (MB (&cm (&= $beta_i (ap $T $epsilon_i)) (&= $i (&cm $1 $..h $m))) ".")
    "简而言之, " $T "由其在标准基向量下的像唯一地确定, 而这个确定就是"
    (MB (&cm (&= $alpha (tu0 $x_1 $..h $x_m))
             (&= (ap $T $alpha) (LC0 $x_1 $beta_1 $x_m $beta_m))) ".")
    "如果" $B "是一个以" (&cm $beta_1 $..h $beta_m) "为行向量的" m*n
    "矩阵, 那么上面就是在说"
    (MB (&= (ap $T $alpha) (&i* $alpha $B)) ".")
    "换言之, 如果" (&= $beta_i (tu0 (mref $B $i $1) $..h (mref $B $i $n))) ", 那么"
    (MB (&= (ap $T (tu0 $x_1 $..h $x_m))
            (&i* (Mat ($x_1 $..c $x_m))
                 (Mat ((mref $B $1 $1) $..c (mref $B $1 $n))
                      ($..v $ $..v)
                      ((mref $B $m $1) $..c (mref $B $m $n))))) ".")
    "这是一种对于线性变换相当显式的刻画. 在第3.4节我们将严肃地研究线性变换和矩阵之间的关系. "
    "之后我们并不会追求" (&= (ap $T $alpha) (&i* $alpha $B)) "这种特定的描述, 因为它将矩阵"
    $B "置于向量" $alpha "的右边, 而这可能会引起一些困惑. 这个例子的要点在于展现了我们对于所有从"
    $F^m "到" $F^n "的线性变换可以给出显式且相当简单的描述.")
   (P "如果" $T "是一个从" $V "到" $W "的线性变换, 那么" $T "的像不仅是" $W "的子集, 而且是"
      $W "的子空间. 令" $R_T "是" $T "的像, 即满足存在某个" $V "中" $alpha "使得"
      (&= $beta (ap $T $alpha)) "的所有" $W "中向量" $beta "构成的集合. 令" $beta_1 "和"
      $beta_2 "是" $R_T "的元素, 令" $c "是一个标量. 存在" $V "中向量" $alpha_1 "和" $alpha_2
      "满足" (&= (ap $T $alpha_1) $beta_1) "和" (&= (ap $T $alpha_2) $beta_2)
      ". 既然" $T "是线性的, 那么"
      (MB (deriv (app $T (LC $c $alpha_1 $alpha_2))
                 (LC $c (ap $T $alpha_1) (ap $T $alpha_2))
                 (LC $c $beta_1 $beta_2)))
      "这表明" (LC $c $beta_1 $beta_2) "也在" $R_T "之中.")
   (P "另一个与线性变换" $T "相关的有趣子空间是由所有满足" (&= (ap $T $alpha) $0)
      "的" $V "中的向量" $alpha "构成的集合" $N ". 它是" $V "的一个子空间, 因为"
      (Ol #:attr* '((type "a"))
          (Li (&= (app $T $0) $0) ", 于是" $N "非空;")
          (Li "如果" (&= (ap $T $alpha_1) (ap $T $alpha_2) $0) ", 那么"
              (MB (deriv (app $T (LC $c $alpha_1 $alpha_2))
                         (LC $c (ap $T $alpha_1) (ap $T $alpha_2))
                         (LC $c $0 $0)
                         $0))
              "于是" (LC $c $beta_1 $beta_2) "也在" $N "之中.")))
   ((definition)
    "令" $V "和" $W "是域" $F "上的向量空间, 令" $T "是一个从" $V "到" $W
    "的线性变换. " $T "的零空间是所有满足" (&= (ap $T $alpha) $0)
    "的" $V "中向量" $alpha "构成的集合. 如果" $V "是有限维的, 那么称" $T
    "的像的维数为" $T "的秩, " $T "的零空间的维数为" $T "的零化度.")
   (P "以下是线性代数中最重要的结果之一.")
   ((theorem #:n "2")
    "令" $V "和" $W "是域" $F "上的向量空间, 令" $T "是一个从" $V "到" $W
    "的线性变换, 设" $V "是有限维的, 那么"
    (MB (&= (&+ (&rank $T) (&nullity $T)) (&dim $V)) "."))
   ((proof)
    "令" (setE $alpha_1 $..h $alpha_k) "是" $N "的一个基, " $N "即" $T "的零空间. 存在"
    $V "中向量" (&cm (_ $alpha (&+ $k $1)) $..h $alpha_n) "满足"
    (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基. 我们将证明"
    (setE (ap $T (_ $alpha (&+ $k $1))) $..h (ap $T $alpha_n))
    "是" $T "的像的一个基. 向量" (&cm (ap $T $alpha_1) $..h (ap $T $alpha_n))
    "当然能够张成" $T "的像, 并且既然对于" (&<= $j $k) "有" (&= (ap $T $alpha_j) $0)
    ", 我们可以看出" (&cm (ap $T (_ $alpha (&+ $k $1))) $..h (ap $T $alpha_n))
    "能够张成像. 为了看出这些像是线性无关的, 设我们有标量" $c_i "满足"
    (MB (&= (sum (&= $i (&+ $k $1)) $n (&i* $c_i (@ap $T $alpha_i))) $0) ".")
    "这说明"
    (MB (&= (ap $T (pare (sum (&= $i (&+ $k $1)) $n (&i* $c_i $alpha_i)))) $0))
    "并且可知" (&= $alpha (sum (&= $i (&+ $k $1)) $n (&i* $c_i $alpha_i)))
    "在" $T "的零空间中. 既然" (&cm $alpha_1 $..h $alpha_k) "构成了" $N
    "的一个基, 那么必须存在标量" (&cm $b_1 $..h $b_k) "满足"
    (MB (&= $alpha (sum (&= $i $1) $k (&i* $b_i $alpha_i))) ".")
    "因此"
    (MB (&= (&- (sum (&= $i $1) $k (&i* $b_i $alpha_i))
                (sum (&= $j (&+ $k $1)) $n (&i* $c_j $alpha_j)))
            $0))
    "并且既然" (&cm $alpha_1 $..h $alpha_n) "是线性无关的, 我们必须有"
    (MB (&= $b_1 $..c $b_k (_ $c (&+ $k $1)) $..c $c_n $0) ".")
    "如果" $r "是" $T "的秩, 那么" (&cm (ap $T (_ $alpha (&+ $k $1))) $..h (ap $T $alpha_n))
    "构成了" $T "的像的基的事实告诉我们" (&= $r (&- $n $k)) ". 既然" $k "是" $T
    "的零化度而" $n "是" $V "的维数, 证明结束了.")
   ((theorem #:n "3")
    "如果" $A "是域" $F "上的一个" m*n "矩阵, 那么"
    (MB (&= (&row-rank $A) (&column-rank $A)) "."))
   ((proof)
    "令" $T "是由" (&= (app $T $X) (&i* $A $X)) "定义的从" $F^n*1 "到"
    $F^m*1 "的线性变换. " $T "的零空间是线性方程组" AX=0
    "的解空间, 即由所有满足" AX=0 "的列矩阵" $X "构成的集合. " $T "的像是由所有满足线性方程组"
    AX=Y "有解的" m*1 "的列矩阵" $Y "构成的集合. 如果" (&cm $A_1 $..h $A_n)
    "是" $A "的列, 那么"
    (MB (&= (&i* $A $X) (LC0 $x_1 $A_1 $x_n $A_n)))
    "于是" $T "的像是由" $A "的列张成的子空间. 换句话说, " $T "的像就是" $A "的列空间, 因此"
    (MB (&= (&rank $T) (&column-rank $A)) ".")
    "定理2告诉我们如果" $S "是线性方程组" AX=0 "的解空间, 那么"
    (MB (&= (&+ (&dim $S) (&column-rank $A)) $n) ".")
    "我们现在引用第2章的例子15. 我们的意图在于, 如果" $r "是" $A "的行空间的维数, 那么解空间"
    $S "拥有一个由" (&- $n $r) "个向量构成的基:"
    (MB (&= (&dim $S) (&- $n (&row-rank $A))) ".")
    "现在显然有"
    (MB (&= (&row-rank $A) (&column-rank $A)) "."))
   (P "刚刚我们给出的对于定理3的证明依赖于和线性方程组有关的显式计算. 实际上存在一个不依赖于这样的计算的"
      "概念性证明. 我们将在第3.7节给出这个证明.")
   ((exercise #:n "1")
    "以下哪些函数" $T "是从" $RR^2 "到" $RR^2 "的线性变换呢?"
    (let ((Tdef (lambda (v1 v2)
                  (&= (ap $T (tu0 $x_1 $x_2)) (tu0 v1 v2)))))
      (Ol #:attr* '((type "a"))
          (Li (Tdef (&+ $1 $x_1) $x_2) ";")
          (Li (Tdef $x_2 $x_1) ";")
          (Li (Tdef (_^ $x $1 $2) $x_2) ";")
          (Li (Tdef (&sin $x_1) $x_2) ";")
          (Li (Tdef (&- $x_1 $x_2) $0) "."))))
   ((exercise #:n "2")
    "找出有限维向量空间" $V "上的零变换和恒等变换的像, 秩, 零空间, 零化度.")
   ((exercise #:n "3")
    "描述例子2的微分变换和例子5的积分变换的像和零空间.")
   ((exercise #:n "4")
    "存在从" $RR^3 "到" $RR^2 "的线性变换满足" (&= (ap $T (tu0 $1 $-1 $1)) (tu0 $1 $0))
    "且" (&= (ap $T (tu0 $1 $1 $1)) (tu0 $0 $1)) "吗?")
   ((exercise #:n "5")
    "如果"
    (MB (&cm (&= $alpha_1 (tu0 $1 $-1)) (&= $beta_1 (tu0 $1 $0))
             (&= $alpha_2 (tu0 $2 $-1)) (&= $beta_2 (tu0 $0 $1))
             (&= $alpha_3 (tu0 $-3 $2)) (&= $beta_3 (tu0 $1 $1))))
    "存在从" $RR^2 "到" $RR^2 "的线性变换" $T "满足" (&= (ap $T $alpha_i) $beta_i)
    "对于" (&= $i (&cm $1 $2 $3)) "成立吗?")
   ((exercise #:n "6")
    "显式描述 (如练习1和2) 满足"
    (&cm (&= (ap $T $epsilon_1) (tu0 $a $b))
         (&= (ap $T $epsilon_2) (tu0 $c $d)))
    "的从" $F^2 "到" $F^2 "的线性变换" $T ".")
   ((exercise #:n "7")
    "令" $F "是一个复数域的子域, 令" $T "是由"
    (MB (&= (ap $T (tu0 $x_1 $x_2 $x_3))
            (tu0 (&+ (&- $x_1 $x_2) (&i* $2 $x_3))
                 (&+ (&i* $2 $x_1) $x_2)
                 (&+ (&- (&- $x_1) (&i* $2 $x_2)) (&i* $2 $x_3)))))
    "定义的从" $F^3 "到" $F^3 "的函数."
    (Ol #:attr* '((type "a"))
        (Li "验证" $T "是一个线性变换.")
        (Li "如果" (tu0 $a $b $c) "是" $F^3 "中向量, 那么" (&cm $a $b $c)
            "满足什么条件时向量在" $T "的像中? " $T "的秩是多少?")
        (Li (&cm $a $b $c) "满足什么条件时" (tu0 $a $b $c) "在" $T
            "的零空间中? " $T "的零化度是多少?")))
   ((exercise #:n "8")
    "显式描述一个从" $RR^3 "到" $RR^3 "的线性变换, 其像是由"
    (tu0 $1 $0 $-1) "和" (tu0 $1 $2 $2) "张成的子空间.")
   ((exercise #:n "9")
    "令" $V "是域" $F "上的所有" n*n "矩阵构成的向量空间, 令" $B
    "是一个固定的" n*n "矩阵. 如果"
    (MB (&= (app $T $A) (&- AB (&i* $B $A))))
    "验证" $T "是一个从" $V "到" $V "的线性变换.")
   ((exercise #:n "10")
    "令" $V "是所有复数的集合, 其被当作实数域上的向量空间 (在通常的运算下). 找出一个从"
    $V "到" $V "的线性变换, 但不是" $CC^1 "上的线性变换, 即不是复线性的.")
   ((exercise #:n "11")
    "令" $V "是" $F "上的" n*1 "矩阵的空间, 令" $W "是" $F "上的" m*1 "矩阵的空间. 令"
    $A "是" $F "上的一个固定的" m*n "矩阵, 令" $T "是由" (&= (app $T $X) (&i* $A $X))
    "定义的从" $V "到" $W "的线性变换. 证明" $T "是零变换当且仅当" $A "是零矩阵.")
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个" $n "维向量空间, 令" $T "是一个从" $V "到" $V
    "的线性变换, 并且" $T "的像和零空间是相等的. 证明" $n "是偶数. (你能给出这样的线性变换"
    $T "的例子吗?)")
   ((exercise #:n "13")
    "令" $V "是一个向量空间, 令" $T "是一个从" $V "到" $V "的线性变换. 证明以下两个关于"
    $T "的陈述是等价的."
    (Ol #:attr* '((type "a"))
        (Li $T "的像与零空间之交是" $V "的零子空间.")
        (Li "如果" (&= (app $T (ap $T $alpha)) $0) ", 那么" (&= (ap $T $alpha) $0) ".")))
   (H3 "第3.2节 线性变换的代数")
   (P "在研究从" $V "到" $W "的线性变换时, 这些变换的集合继承了自然的向量空间结构"
      "具有根本的重要性. 从空间" $V "到自身的线性变换的集合甚至有着更多的代数结构, "
      "因为通常的函数复合提供了这样的变换的&quot;乘法&quot;. 我们将在本节探索这些想法.")
   ((theorem #:n "4")
    "令" $V "和" $W "是域" $F "上的向量空间. 令" $T "和" $U "是从" $V "到" $W "的线性变换. 由"
    (MB (&= (app (@+ $T $U) $alpha) (&+ (ap $T $alpha) (ap $U $alpha))))
    "定义的函数" (@+ $T $U) "是一个从" $V "到" $W "的线性变换. 如果" $c "是" $F
    "任意的元素, 那么由"
    (MB (&= (app (@i* $c $T) $alpha) (&i* $c (@ap $T $alpha))))
    "定义的函数" (@i* $c $T) "是一个从" $V "到" $W "的线性变换. 所有从" $V "到" $W
    "的线性变换的集合, 与其上定义的加法和标量乘法一起, 构成了一个域" $F "上的向量空间.")
   ((proof)
    "设" $T "和" $U "是从" $V "到" $W "的线性变换, 而" (@+ $T $U) "定义如上, 那么"
    (MB (deriv (app (@+ $T $U) (LC $c $alpha $beta))
               (&+ (app $T (LC $c $alpha $beta))
                   (app $U (LC $c $alpha $beta)))
               (&+ (LC $c (@ap $T $alpha) (ap $T $beta))
                   (LC $c (@ap $U $alpha) (ap $U $beta)))
               (LC $c (@+ (ap $T $alpha) (ap $U $alpha))
                   (@+ (ap $T $beta) (ap $U $beta)))
               (LC $c (app (@+ $T $U) $alpha)
                   (app (@+ $T $U) $beta))))
    "这表明" (@+ $T $U) "是一个线性变换. 类似地,"
    (MB (deriv (app (@i* $c $T) (LC $d $alpha $beta))
               (&i* $c (bra0 (app $T (LC $d $alpha $beta))))
               (&i* $c (bra0 (LC $d (@ap $T $alpha) (ap $T $beta))))
               (&+ (&i* $c $d (@ap $T $alpha))
                   (&i* $c (@ap $T $beta)))
               (LC $d (bra0 (&i* $c (@ap $T $alpha)))
                   $c (@ap $T $beta))
               (LC $d (bra0 (ap (@i* $c $T) $alpha))
                   (ap (@i* $c $T) $beta))))
    "这表明" (@i* $c $T) "是一个线性变换." (Br)
    "为了验证从" $V "到" $W "的线性变换的集合 (以及这些运算) 是一个向量空间, 我们还必须直接检验每个"
    "向量加法和数乘上的条件是否满足. 我们将这些工作留给读者, 并满足于以下的评论: 这个空间里的零向量"
    "是零变换, 其将每个" $V "的向量送至" $W "的零向量; 这两个运算的每个性质都对应于空间" $W
    "的运算的相应性质.")
   (P "或许我们应该提及另一种看待这个定理的方式. 如果我们如果上面那样定义和与标量积, 那么所有从"
      $V "到" $W "的函数构成了一个域" $F "上的向量空间. 这与" $V "是向量空间无关, " $V
      "是一个非空集合足矣. 当" $V "是向量空间的时候我们可以定义从" $V "到" $W "的线性变换, 那么"
      "定理4告诉我们这些变换构成了从" $V "到" $W "的所有函数构成的空间的一个子空间.")
   (P "我们将从" $V "到" $W "的线性变换的空间记作" (&L $V $W) ". 我们提醒读者只有当" $V
      "和" $W "是定义于同一个域上的向量空间时" (&L $V $W) "才有定义.")
   ((theorem #:n "5")
    "令" $V "是域" $F "上的" $n "维向量空间而" $W "是域" $F "上的" $m "维向量空间, 那么"
    (&L $V $W) "是有限维的, 并且维数是" (&i* $m $n) ".")
   ((proof)
    "令"
    (MB basis:def
        "和" (&= $BBB^ (setE $beta_1 $..h $beta_m)))
    "分别是" $V "和" $W "的有序基. 对于每个满足" (&<= $1 $p $m) "和" (&<= $1 $q $n)
    "的整数序对" (tu0 $p $q) ", 我们定义从" $V "到" $W "的线性变换" (^ $E (&cm $p $q)) "如下."
    (MB (deriv (app (^ $E (&cm $p $q)) $alpha_i)
               (Choice0
                ($0 ", 如果" (&!= $i $q))
                ($beta_p ", 如果" (&= $i $q)))
               (&i* (&delta $i $q) $beta_p)))
    "根据定理1, 存在唯一的从" $V "到" $W "的线性变换满足这些条件. 我们要证明的是这"
    (&i* $m $n) "个线性变换构成了" (&L $V $W) "的一个基." (Br)
    "令" $T "是从" $V "到" $W "的线性变换. 对于每个" (&cm $j (&<= $1 $j $n))
    ", 令" (&cm (mref $A $1 $j) $..h (mref $A $m $j)) "是向量" (ap $T $alpha_j)
    "相对于有序基" $BBB^ "的坐标, 即"
    (MB (&= (ap $T $alpha_j) (sum (&= $p $1) $m (&i* (mref $A $p $j) $beta_p))) ".")
    "我们想要表明"
    (MB (&= $T (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (^ $E (&cm $p $q)))))) ".")
    "令" $U "是上面这个式子右侧的线性变换, 那么对于每个" $j ","
    (MB (deriv (ap $U $alpha_j)
               (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q)
                              (app (^ $E (&cm $p $q)) $alpha_j))))
               (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (&delta $j $q) $beta_p)))
               (sum (&= $p $1) $m (&i* (mref $A $p $j) $beta_p))
               (ap $T $alpha_j)))
    "因此" (&= $U $T) ". 目前我们已经证明了" (^ $E (&cm $p $q)) "可以张成" (&L $V $W)
    ", 我们必须还要证明它们是线性无关的, 然而从我们上面写下的东西来看这是显然的, 因为如果变换"
    (MB (&= $U (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (^ $E (&cm $p $q)))))))
    "是零变换, 那么对于每个" $j "有" (&= (ap $U $alpha_j) $0) ", 于是"
    (MB (&= (sum (&= $p $1) $m (&i* (mref $A $p $j) $beta_p)) $0))
    "而" $beta_p "的线性无关性质又可推出对于每个" $p "和" $j "我们有" (&= (mref $A $p $j) $0) ".")
   ((theorem #:n "6")
    "令" (&cm $V $W $Z) "是域" $F "上的向量空间, 令" $T "是从" $V "到" $W "的线性变换, 令" $U
    "是从" $W "到" $Z "的线性变换, 那么由" (&= (app (@i* $U $T) $alpha) (app $U (app $T $alpha)))
    "定义的复合函数" (&i* $U $T) "是一个从" $V "到" $Z "的线性变换.")
   ((proof)
    (MB (deriv (app (&i* $U $T) (LC $c $alpha $beta))
               (ap $U (bra0 (app $T (LC $c $alpha $beta))))
               (app $U (LC $c (ap $T $alpha) (ap $T $beta)))
               (LC $c (bra0 (app $U (ap $T $alpha))) (app $U (ap $T $beta)))
               (LC $c (app (@i* $U $T) $alpha) (app (@i* $U $T) $beta)))))
   (P "接下来, 我们将主要关注从一个向量空间到自身的线性变换. 鉴于我们经常得说&quot;" $T
      "是一个从" $V "到" $V "的线性变换&quot;, 以后我们将说&quot;" $T "是" $V
      "上的一个线性算子&quot;.")
   ((definition)
    "如果" $V "是域" $F "上的一个向量空间, 那么一个" $V "上的线性算子就是一个从" $V
    "到" $V "的线性变换.")
   (P "在定理6的情况下, 当" (&= $V $W $Z) "时, 以至于" $U "和" $T "都是空间" $V
      "上的线性算子, 那么其复合" (&i* $U $T) "也是一个" $V "上的线性算子. 因此, 空间"
      (&L $V $V) "有一个乘法定义于其上, 即复合. 当然算子" (&i* $T $U) "也是有定义的, 不过"
      "读者应该注意一般" (&!= (&i* $U $T) (&i* $T $U)) ", 即" (&!= (&- (&i* $U $T) (&i* $T $U)) $0)
      ". 我们还应该特别注意如果" $T "是一个" $V "上的线性算子, 那么我们可以将" $T "和"
      $T "复合. 我们将使用记号" (&= $T^2 (&i* $T $T)) ", 而一般地, 对于" (&= $n (&cm $1 $2 $3 $..h))
      ", " (&= $T^n (&i* $T $..c $T)) "(" $n "个" $T "相乘). 我们定义" (&= $T^0 $I)
      ", 如果" (&!= $T $0) ". [译注: " (&= $T $0) "时定义" (&= $T^0 $I) "也是合理且必要的.]")
   ((lemma)
    "令" $V "是域" $F "上的向量空间, 令" (&cm $U $T_1 $T_2) "是" $V "上的线性算子, 令"
    $c "是" $F "的元素."
    (Ol #:attr* '((type "a"))
        (Li (&= (&i* $I $U) (&i* $U $I) $U) ";")
        (Li (disR $U $T_1 $T_2) "; " (disL $T_1 $T_2 $U) ";")
        (Li (&= (&i* $c (@i* $U $T_1)) (&i* (@i* $c $U) $T_1) (&i* $U (@i* $c $T_1))) ".")))
   ((proof)
    (Ol #:attr* '((type "a"))
        (Li "这个关于恒等函数的性质是显然的, 我们列在这里仅是为了强调一下.")
        (Li (MB (deriv (app (bra0 (&i* $U (@+ $T_1 $T_2))) $alpha)
                       (ap $U (bra0 (app (@+ $T_1 $T_2) $alpha)))
                       (app $U (&+ (ap $T_1 $alpha) (ap $T_2 $alpha)))
                       (&+ (app $U (ap $T_1 $alpha)) (app $U (ap $T_2 $alpha)))
                       (&+ (app (@i* $U $T_1) $alpha) (app (@i* $U $T_2) $alpha))))
            "于是" (disR $U $T_1 $T_2) ". 另外,"
            (MB (deriv (app (bra0 (&i* (@+ $T_1 $T_2) $U)) $alpha)
                       (app (@+ $T_1 $T_2) (ap $U $alpha))
                       (&+ (app $T_1 (ap $U $alpha)) (app $T_2 (ap $U $alpha)))
                       (&+ (app (@i* $T_1 $U) $alpha) (app (@i* $T_2 $U) $alpha))))
            "于是" (disL $T_1 $T_2 $U) ". (读者或许注意到了这两个分配律的证明并没有用到"
            $T_1 "和" $T_2 "是线性的这个事实, 而且第二个证明也没有用到" $U "是线性的.)")
        (Li "我们将c的证明留给读者.")))
   (P "这个引理的内容和定理5的一部分告诉我们向量空间" (&L $V $V) "和复合运算构成了一个叫做"
      "含幺元的线性代数的结构. 我们将在第4章讨论这个东西. [译注: 其实在一般的代数学书籍里"
      "这种结构就叫代数.]")
   ((example #:n "8")
    "如果" $A "是一个元素来源于" $F "的" m*n "矩阵, 我们可以由" (&= (app $T $X) (&i* $A $X))
    "定义一个从" (^ $F n*1) "到" (^ $F m*1) "的线性变换" $T ". 如果" $B "是一个" (&c* $p $m)
    "的矩阵, 那么我们可以通过" (&= (app $U $Y) (&i* $B $Y)) "定义一个从" (^ $F m*1) "到"
    (^ $F (&c* $p $1)) "的线性变换" $U ". 它们的复合" (&i* $U $T) "是很容易描述的:"
    (MB (deriv (app (@i* $U $T) $X)
               (app $U (app $T $X))
               (app $U (&i* $A $X))
               (&i* $B (@i* $A $X))
               (&i* (@i* $B $A) $X)))
    "因此" (&i* $U $T) "即&quot;左乘积矩阵" (&i* $B $A) "&quot;.")
   ((example #:n "9")
    "令" $F "是一个域而" $V "是所有从" $F "到" $F "的多项式函数构成的向量空间. 令" $D
    "是例子2所定义的微分算子, 令" $T "是&quot;乘上" $x "&quot;的线性算子:"
    (MB (&= (app (@ap $T $f) $x) (&i* $x (app $f $x))) ".")
    "那么" (&!= (&i* $D $T) (&i* $T $D)) ". 实际上, 读者应该很容易验证"
    (&= (&- (&i* $D $T) (&i* $T $D)) $I) ", 即恒等算子.")
   (P "即便我们定义的" (&L $V $V) "上的乘法并不交换, 其与" (&L $V $V)
      "的向量空间运算有着很好的联系.")
   ((example #:n "10")
    "令" basis:def "是向量空间" $V "的一个有序基. "
    "考虑定理5的证明中出现的线性算子" (^ $E (&cm $p $q)) ":"
    (MB (&= (app (^ $E (&cm $p $q)) $alpha_i) (&i* (&delta $i $q) $alpha_p)) ".")
    "这" $n^2 "个线性算子构成了" $V "上的线性算子空间的一个基. " (&i* (&E $p $q) (&E $r $s))
    "是什么呢? 我们有"
    (MB (deriv (app (@i* (&E $p $q) (&E $r $s)) $alpha_i)
               (app (&E $p $q) (&i* (&delta $i $s) $alpha_r))
               (&i* (&delta $i $s) (app (&E $p $q) $alpha_r))
               (&i* (&delta $i $s) (&delta $r $q) $alpha_p)))
    "因此"
    (MB (&= (&i* (&E $p $q) (&E $r $s))
            (Choice0
             ($0 ", 如果" (&!= $r $q))
             ((&E $p $s) ", 如果" (&= $q $r)))))
    "令" $T "是一个" $V "上的线性算子, 我们在定理5的证明中表明如果"
    (MB (&cm (&= $A_j (coordm (ap $T $alpha_j)))
             (&= $A (li0 $A_1 $..h $A_n))))
    "那么"
    (MB (&= $T (sum (&= $p $1) $n
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (&E $p $q))))) ".")
    "如果"
    (MB (&= $U (sum (&= $r $1) $n
                    (sum (&= $s $1) $n
                         (&i* (mref $B $r $s) (&E $r $s))))))
    "是" $V "上另一个线性算子, 那么上一条引理告诉我们"
    (MB (deriv (&i* $T $U)
               (&i* (@sum (&= $p $1) $n
                          (sum (&= $q $1) $n
                               (&i* (mref $A $p $q) (&E $p $q))))
                    (@sum (&= $r $1) $n
                          (sum (&= $s $1) $n
                               (&i* (mref $B $r $s) (&E $r $s)))))
               (sum (&= $p $1) $n
                    (sum (&= $q $1) $n
                         (sum (&= $r $1) $n
                              (sum (&= $s $1) $n
                                   (&i* (mref $A $p $q) (mref $B $r $s)
                                        (&E $p $q) (&E $r $s))))))))
    "我们注意到, 这巨大的求和之中只有满足" (&= $q $r) "的项才能活下来, 又因为"
    (&= (&i* (&E $p $r) (&E $r $s)) (&E $p $s)) ", 我们有"
    (MB (deriv (&i* $T $U)
               (sum (&= $p $1) $n
                    (sum (&= $s $1) $n
                         (&i* (@sum (&= $r $1) $n
                                    (&i* (mref $A $p $r) (mref $B $r $s)))
                              (&E $p $s))))
               (sum (&= $p $1) $n
                    (sum (&= $s $1) $n
                         (&i* (mref (@i* $A $B) $p $s)
                              (&E $p $s))))))
    "因此, 复合" $T "和" $U "的效用相当于矩阵" $A "和" $B "相乘.")
   (P "在我们对于线性变换的代数运算的讨论中, 我们还没有说任何与可逆性相关的东西. "
      "我们所特别关心的问题之一是, 对于向量空间" $V "上什么样的线性算子" $T
      "存在线性算子" (inv $T) "满足" (&= (&i* $T (inv $T)) (&i* (inv $T) $T) $I) "? "
      "[译注: 读者应该将这里的" (inv $T) "当作一个整体, 而不是" $T "的逆, 因为还没有定义逆运算.]")
   (P "从" $V "到" $W "的函数称为可逆的, 如果存在一个从" $W "到" $V "的函数" $U
      "满足" (&i* $U $T) "是" $V "上的恒等函数而" (&i* $T $U) "是" $W "上的恒等函数. 如果"
      $T "是可逆的, 那么函数" $U "是唯一的, 我们将其记作" (inv $T) ". (见附录.) 而且, " $T
      "可逆当且仅当"
      (Ol (Li $T "是一一的, 即" (&= (ap $T $alpha) (ap $T $beta)) "可以推出" (&= $alpha $beta) ";")
          (Li $T "是映上的, 即" $T "的像是(整个的)" $W "."))
      "[译注: 一一和映上是过时的术语, 之后我们将用单射和满射.]")
   ((theorem #:n "7")
    "令" $V "和" $W "是域" $F "上的向量空间, 令" $T "是从" $V "到" $W "的线性变换. 如果" $T
    "是可逆的, 那么逆函数是一个从" $W "到" $V "的线性变换. [译注: 这里说的可逆是函数的可逆.]")
   ((proof)
    "这里我们重复以强调一个点. 当" $T "是单射且是满射, 那么存在唯一决定的从" $W "到" $V"的逆函数"
    (inv $T) "满足" (&i* (inv $T) $T) "是" $V "上的恒等函数而" (&i* $T (inv $T)) "是" $W
    "上的恒等函数. 现在我们要证明的是, 如果线性函数" $T "是可逆的, 那么其逆" (inv $T)
    "也是线性的." (Br)
    "令" $beta_1 "和" $beta_2 "是" $W "的向量而" $c "是一个标量, 我们想要证明"
    (MB (&= (app (inv $T) (LC $c $beta_1 $beta_2))
            (LC $c (ap (inv $T) $beta_1) (ap (inv $T) $beta_2))) ".")
    "令" (&cm (&= $alpha_i (ap (inv $T) $beta_i)) (&= $i (&cm $1 $2))) ", 即令" $alpha_i
    "是" $V "中唯一满足" (&= (ap $T $alpha_i) $beta_i) "的向量. 既然" $T "是线性的, 那么"
    (MB (deriv (app $T (LC $c $alpha_1 $alpha_2))
               (LC $c (ap $T $alpha_1) (ap $T $alpha_2))
               (LC $c $beta_1 $beta_2)))
    "因此" (LC $c $alpha_1 $alpha_2) "是" $V "中唯一的由" $T "送至" (LC $c $beta_1 $beta_2)
    "的向量, 于是"
    (MB (deriv (app (inv $T) (LC $c $beta_1 $beta_2))
               (LC $c $alpha_1 $alpha_2)
               (LC $c (@ap (inv $T) $beta_1) (ap (inv $T) $beta_2)))))
   (P "设我们有一个从" $V "到" $W "的可逆的线性变换" $T "和一个从" $W "到" $Z "的可逆的线性变换"
      $U ", 那么" (&i* $U $T) "是可逆的并且" (&= (inv (@i* $U $T)) (&i* (inv $T) (inv $U)))
      ". 这个结论并不需要线性性质, 也不需要分开检验" (&i* $U $T) "是单射和满射. 所有需要做的事情"
      "只是验证" (&i* (inv $T) (inv $U)) "既是" (&i* $U $T) "的左逆也是" (&i* $U $T) "的右逆.")
   (P "如果" $T "是线性的, 那么" (&= (app $T (&- $alpha $beta)) (&- (ap $T $alpha) (ap $T $beta)))
      ". 因此, " (&= (ap $T $alpha) (ap $T $beta)) "当且仅当" (&= (app $T (&- $alpha $beta)) $0)
      ". 这极大地简化了对于" $T "是否为单射的验证. 让我们称一个线性变换是非奇异的, 如果"
      (&= (ap $T $gamma) $0) "可以推出" (&= $gamma $0) ", 即" $T "的零空间是" (setE $0)
      ". 显然, " $T "是单射当且仅当" $T "非奇异. 这个评注的一个扩展是非奇异的线性变换就是那些"
      "保持线性无关的线性变换.")
   ((theorem #:n "8")
    "令" $T "是一个从" $V "到" $W "的线性变换, 那么" $T "是非奇异的当且仅当" $V
    "的每个线性无关子集在" $T "下的像是" $W "的线性无关子集.")
   ((proof)
    "首先设" $T "是非奇异的. 令" $S "是" $V "的一个线性无关子集. 如果" (&cm $alpha_1 $..h $alpha_k)
    "是" $S "中的向量 [译注: 不同的向量], 那么" (&cm (ap $T $alpha_1) $..h (ap $T $alpha_k))
    "是线性无关的, 因为如果"
    (MB (&= (LC0 $c_1 (@ap $T $alpha_1) $c_k (@ap $T $alpha_k)) $0))
    "那么"
    (MB (&= (app $T (LC0 $c_1 $alpha_1 $c_k $alpha_k)) $0))
    "既然" $T "是非奇异的, 那么"
    (MB (&= (LC0 $c_1 $alpha_1 $c_k $alpha_k) $0))
    "从中我们可以得出每个" (&= $c_i $0) ", 因为" $S "是一个线性无关的集合. 这个论证表明" $S
    "在" $T "下的像是线性无关的." (Br)
    "设" $T "将线性无关的子集映射至线性无关的子集. 令" $alpha "是" $V "的一个非零向量, 那么仅包含"
    $alpha "的集合" $S "是线性无关的. " $S "的像是仅包含向量" (ap $T $alpha) "的集合, 而这个集合"
    "是线性无关的. 因而" (&!= (ap $T $alpha) $0) ", 否则的话就是线性相关的了. 这表明" $T
    "的零空间是零子空间, 即" $T "是非奇异的.")
   ((example #:n "11")
    "令" $F "是一个复数域的子域 (或者特征为零的域), 令" $V "是域" $F "上的多项式函数的空间. "
    "考虑例子9的微分算子" $D "和&quot;乘上" $x "&quot;的算子" $T ". 既然" $D "将每个常函数送至"
    $0 ", " $D "是奇异的. 然而, 因为" $V "不是有限维的, " $D "的像是整个" $V ", 于是定义一个"
    $D "的右逆是有可能的. 例如, 如果" $E "是不定积分算子:"
    (MB (&= (app $E (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)))
            (&+ (&i* $c_0 $x) (&i* 1/2 $c_1 $x^2) $..c
                (&i* (~ $1 (&+ $n $1)) $c_n (^ $x (&+ $n $1))))))
    "那么" $E "是" $V "上的线性算子并且" (&= (&i* $D $E) $I) ". 另一方面, "
    (&!= (&i* $E $D) $I) ", 因为" (&i* $E $D) "将每个常函数都送至" $0 ". 与之相对地, 算子" $T
    "是非奇异的, 因为如果对于每个" $x "有" (&= (&i* $x (app $f $x)) $0) ", 那么" (&= $f $0)
    ". 因此, 可以找到" $T "的一个左逆. 例如, 如果" $U "是&quot;移除常数项并除以" $x "&quot;的操作:"
    (MB (&= (app $U (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)))
            (&+ $c_1 (&i* $c_2 $x) $..c (&i* $c_n (^ $x (&- $n $1))))))
    "那么" $U "是一个" $V "上的线性算子并且" (&= (&i* $U $T) $I) ". 但是" (&!= (&i* $T $U) $I)
    ", 因为每个" (&i* $T $U) "的像中的函数自然也在" $T "的像中, 而" $T "的像是所有满足"
    (&= (app $f $0) $0) "的函数" $f "构成的空间. [译注: 而不是整个" $V ".]")
   ((example #:n "12")
    "令" $F "是一个域而" $T "是一个" $F^2 "上的线性算子, 其由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 (&+ $x_1 $x_2) $x_1)))
    "定义. 那么, " $T "是非奇异的, 因为如果" (&= (appl $T $x_1 $x_2) $0) ", 我们有"
    (MB (Choice ($x_1 $+ $x_2 $= $0)
                ($    $  $x_1 $= $0)))
    "于是" (&= $x_1 $x_2 $0) ". 我们也看出" $T "是满射, 因为如果令" (tu0 $z_1 $z_2)
    "是" $F^2 "中任意的向量, 为了证明" (tu0 $z_1 $z_2) "在" $T "的像中, 我们必须找出满足"
    (MB (Choice ($x_1 $+ $x_2 $= $z_1)
                ($    $  $x_1 $= $z_2)))
    "的标量" $x_1 "和" $x_2 ", 而" (&cm (&= $x_1 $z_2) (&= $x_2 (&- $z_1 $z_2)))
    "就是显而易见的解. 这个计算为我们提供了" (inv $T) "的显式公式, 即"
    (MB (&= (appl (inv $T) $z_1 $z_2) (tu0 $z_2 (&- $z_1 $z_2))) "."))
   (P "在例子11之中我们看到一个线性变换可能是非奇异的但不是满射, 或者可能是满射但不是非奇异的. "
      "然而, 上面这个例子为我们刻画了一种情形, 其中例子11的这种事情不可能发生.")
   ((theorem #:n "9")
    "令" $V "和" $W "是域" $F "上的有限维向量空间, 并且" (&= (&dim $V) (&dim $W))
    ". 如果" $T "是一个从" $V "到" $W "的线性变换, 那么以下陈述是等价的:"
    (Ol #:attr* '((type "i"))
        (Li $T "是可逆的.")
        (Li $T "是非奇异的.")
        (Li $T "是满射, 即" $T "的像是" $W ".")))
   ((proof)
    "令" (&= $n (&dim $V) (&dim $W)) ", 从定理2我们知道"
    (MB (&= (&+ (&rank $T) (&nullity $T)) $n) ".")
    "既然" $T "是非奇异的当且仅当" (&= (&nullity $T) $0) ", " $T "的像是" $W
    "当且仅当" (&= (&rank $T) $n) " (因为" (&= $n (&dim $W)) "), 而且零化度是" $0
    "当且仅当秩为" $n ", 那么" $T "是非奇异的当且仅当" (&= (app $T $V) $W) ". 于是, 只要"
    "ii或iii其中之一成立, 那么另一条也成立, 那么" $T "就是可逆的了.")
   (P "我们提醒读者一下, 除非有限维和" (&= (&dim $V) (&dim $W)) "的条件都满足, 否则"
      "就不要应用定理9. 在定理9的假设下, 条件i, ii, iii还等价于以下陈述."
      (Ol #:attr* '((type "i") (start "4"))
          (Li "如果" (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基, 那么"
              (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "是" $W "的一个基.")
          (Li "存在" $V "的某个基" (setE $alpha_1 $..h $alpha_n) "使得"
              (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "是" $W "的一个基."))
      "我们将给出一个这五个条件等价的证明, 它不同于之前给出的三个条件等价的证明.")
   (P "i推出ii. 如果" $T "是可逆的, " $T "当然是非奇异的. ii推出iii. 设" $T
      "是非奇异的. 令" (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基, 那么根据定理8, "
      (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "是" $W "的一个线性无关集合. 而且, 因为"
      $W "的维数也是" $n ", 所以这个集合也构成了" $W "的一个基. 现在令" $beta "是" $W
      "任意的向量, 那么存在标量" (&cm $c_1 $..h $c_n) "满足"
      (MB (deriv $beta
                 (LC0 $c_1 (@ap $T $alpha_1) $c_n (@ap $T $alpha_n))
                 (app $T (LC0 $c_1 $alpha_1 $c_n $alpha_n))))
      "这表明" $beta "在" $T "的像之中. iii推出iv. 现在我们假定" $T "是满射. 如果"
      (setE $alpha_1 $..h $alpha_n) "是" $V "任意的基, 那么"
      (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "可以张成" $T
      "的像, 根据假设也就是整个" $W ". 既然" $W "的维数是" $n ", 那么这" $n
      "个向量必然是线性无关的, 也就是说构成了" $W "的一个基. iv推出v. 这不需要证明. "
      "v推出i. 设存在" $V "的某个基满足" (setE (ap $T $alpha_1) $..h (ap $T $alpha_n))
      "是" $W "的一个基. 既然" (ap $T $alpha_i) "可以张成" $W ", 那么显然" $T
      "的像是整个" $W ". 如果" (&= $alpha (LC0 $c_1 $alpha_1 $c_n $alpha_n))
      "在" $T "的零空间之中, 那么"
      (MB (&= (app $T (LC0 $c_1 $alpha_1 $c_n $alpha_n)) $0))
      "或者"
      (MB (&= (LC0 $c_1 (@ap $T $alpha_1) $c_n (@ap $T $alpha_n)) $0))
      "既然" (ap $T $alpha_i) "是线性无关的, 那么每个" (&= $c_i $0) ", 因此"
      (&= $alpha $0) ". 我们已经证明了" $T "的像是" $W "和" $T "是非奇异的, 所以"
      $T "是可逆的.")
   (P "一个空间" $V "上的可逆线性算子, 连带着复合运算, 提供了一个代数中被称为&quot;群"
      "&quot;的例子. 尽管我们没有时间细致地讨论群, 但是我们至少可以给出群的定义.")
   ((definition)
    "一个群由以下资料构成."
    (Ol (Li "一个集合" $G ";")
        (Li "一个法则 (或者说一个运算), 其联系" $G "中每对元素" $x "和" $y "以一个" $G
            "中元素" (&i* $x $y) ", 并且满足"
            (Ol #:attr* '((type "a"))
                (Li "对于所以" $G "中" (&cm $x $y $z) ", " (assoc* $x $y $z) ";")
                (Li "存在一个" $G "中的元素" $e "满足对于每个" $G "中的" $x
                    "有" (&= (&i* $e $x) (&i* $x $e) $x) ";")
                (Li "对于每个" $G "的元素" $x "存在一个" $G "中元素" (inv $x)
                    "与之对应, 满足" (&= (&i* $x (inv $x)) (&i* (inv $x) $x) $e) ".")))))
   (P "我们已经证明了复合" (&\|-> (tu0 $U $T) (&i* $U $T)) "联系空间" $V "上的每对可逆线性算子以另一个"
      $V "上的可逆线性算子. 复合是一个结合运算. 恒等算子" $I "对于每个" $T "有"
      (&= (&i* $I $T) (&i* $T $I) $T) ". 对于可逆的" $T ", (根据定理7)存在一个可逆的线性算子"
      (inv $T) "满足" (&= (&i* $T (inv $T)) (&i* (inv $T) $T) $I) ". 因此, " $V "上的可逆线性算子"
      "的集合, 连带着复合运算, 构成了一个群. 以矩阵乘法作为运算的" n*n "可逆矩阵的集合是另一个群的"
      "例子. 一个群是交换的, 如果它满足对于每个" $x "和" $y "有" (commute* $x $y) ". 以上两个我们"
      "给出的例子一般不是交换群. 人们经常将交换群的运算写成" (&\|-> (tu0 $x $y) (&+ $x $y))
      "而不是" (&\|-> (tu0 $x $y) (&i* $x $y)) ", 并用符号" $0 "表示&quot;恒元&quot;" $e
      ". 向量空间的向量的集合, 连带着向量加法, 是一个交换群. 一个域可以被描述为一个带有加法和乘法"
      "运算的集合, 其在加法下是一个交换群, 而非零元素在乘法下也构成了一个交换群, 并且分配律"
      (disR $x $y $z) "成立.")
   ((exercise #:n "1")
    "令" $T "和" $U "是" $RR^2 "上由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 $x_2 $x_1))
        "和" (&= (appl $U $x_1 $x_2) (tu0 $x_1 $0)))
    "定义的线性算子."
    (Ol #:attr* '((type "a"))
        (Li "如何几何地描述" $T "和" $U "?")
        (Li "像定义" $T "和" $U "一样给出刻画" (&cm (@+ $U $T) (&i* $U $T) (&i* $T $U) $T^2 $U^2)
            "的规则.")))
   ((exercise #:n "2")
    "令" $T "是" $CC^3 "上满足"
    (MB (&cm (&= (ap $T $epsilon_1) (tu0 $1 $0 $i))
             (&= (ap $T $epsilon_2) (tu0 $0 $1 $1))
             (&= (ap $T $epsilon_3) (tu0 $i $1 $0))))
    "的(唯一的)线性算子. " $T "可逆吗?")
   ((exercise #:n "3")
    "令" $T "是" $RR^3 "上由"
    (MB (&= (appl $T $x_1 $x_2 $x_3)
            (tu0 (&i* $3 $x_1) (&- $x_1 $x_2) (&+ (&i* $2 $x_1) $x_2 $x_3))))
    "定义的线性算子. " $T "可逆吗? 如果可逆的话, 像定义" $T "一样给出" (inv $T) "的规则.")
   ((exercise #:n "4")
    "对于练习3的线性算子" $T ", 证明"
    (MB (&= (&i* (@- $T^2 $I) (@- $T (&i* $3 $I))) $0) "."))
   ((exercise #:n "5")
    "令"
    (MB (&= $B (Mat ($1 $-1) ($-4 $4))))
    "令" $T "是由" (&= (app $T $A) (&i* $B $A)) "定义的" (^ $CC (&c* $2 $2))
    "上的线性算子. " $T "的秩是多少? 你能描述" $T^2 "吗?")
   ((exercise #:n "6")
    "令" $T "是从" $RR^3 "到" $RR^2 "的线性变换, 令" $U "是从" $RR^2 "到" $RR^3 "的线性变换. 证明变换"
    (&i* $U $T) "是不可逆的. 给出这个定理的一般化版本.")
   ((exercise #:n "7")
    "找出" $RR^2 "上两个线性算子" $T "和" $U "满足" (&= (&i* $T $U) $0) "但是" (&!= (&i* $U $T) $0) ".")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的向量空间, 令" $T "是" $V "上的一个线性算子. 如果" (&= $T^2 $0)
    ", 关于" $T "的像和零空间的关系你有什么可说的? 给出一个" $RR^2 "上的线性算子" $T
    "的例子, 其满足" (&= $T^2 $0) "但" (&!= $T $0) ".")
   ((exercise #:n "9")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 设存在一个" $V "上的线性算子" $U "满足"
    (&= (&i* $T $U) $I) ". 证明" $T "是可逆的, 并且" (&= $U (inv $T)) ". 给出一个例子表明在"
    $V "不是有限维的情况下这是错的. (提示: 令" (&= $T $D) ", 多项式函数空间上的微分算子.)")
   ((exercise #:n "10")
    "令" $A "是域" $F "上的一个" m*n "矩阵, 令" $T "是由" (&= (app $T $X) (&i* $A $X))
    "定义的从" (^ $F n*1) "到" (^ $F m*1) "的线性变换. 说明在" (&< $m $n) "的情况下" $T
    "可以是满射但不是非奇异的. 类似地, 说明在" (&> $m $n) "的情况下" $T "可以是非奇异的但不是满射.")
   ((exercise #:n "11")
    "令" $V "是一个有限维向量空间, 令" $T "是" $V "上的一个线性算子. 设" (&= (&rank $T^2) (&rank $T))
    ". 证明" $T "的像和零空间是不相交的 (disjoint), 即只有零向量作为共同元素.")
   ((exercise #:n "12")
    "令" (&cm $p $m $n) "是正整数而" $F "是一个域. 令" $V "是域" $F "上的" m*n "矩阵的空间, " $W
    "是域" $F "上的" (&c* $p $n) "矩阵的空间. 令" $B "是一个固定的" (&c* $p $m) "矩阵而" $T
    "是一个由" (&= (app $T $A) (&i* $B $A)) "定义的从" $V "到" $W "的线性变换. 证明" $T
    "可逆当且仅当" (&= $p $m) "且" $B "是一个可逆的" m*m "矩阵.")
   (H3 "第3.3节 同构")
   (P "如果" $V "和" $W "是域" $F "上的向量空间, 那么任何从" $V "到" $W "的双射的"
      "线性变换" $T "都被称为从" $V "到" $W "的同构. 如果存在从" $V "到" $W
      "的同构, 那么就称" $V "同构于" $W ". [译注: 更直接和正确的说法其实是可逆而不是双射, "
      "不过在向量空间的情况下这二者是等价的.]")
   (P "注意到" $V "平凡地同构于" $V ", 恒等算子是一个从" $V "到" $V "的同构. 并且, 如果"
      $V "通过" $T "同构于" $W ", 那么" $W "也同构于" $V ", 因为" (inv $T) "是一个从"
      $W "到" $V "的同构. 读者应该很容易验证如果" $V "同构于" $W "且" $W "同构于" $Z
      ", 那么" $V "同构于" $Z ". 简而言之, 同构是向量空间的类上的等价关系. [译注: 这里"
      "的用词是class而不是set, 因为所有的向量空间的确不构成一个集合.] 当存在一个从" $V
      "到" $W "的同构时, 我们有时也说" $V "和" $W "是同构的, 而不说" $V "同构于" $W
      ". 鉴于" $V "同构于" $W "当且仅当" $W "同构于" $V ", 这不会引起歧义.")
   ((theorem #:n "10")
    "每个域" $F "上的" $n "维向量空间都同构于空间" $F^n ".")
   ((proof)
    "令" $V "是域" $F "上的" $n "维向量空间, 令" basis:def
    "是" $V "的一个有序基. 我们按照以下方式定义从" $V "到" $F^n "的函数" $T ": 如果"
    $alpha "在" $V "中, 令" (ap $T $alpha) "是" $alpha "相对于有序基" $BBB
    "的坐标" $n "元组" (tu0 $x_1 $..h $x_n) ", 即满足"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)))
    "的" $n "元组. 根据我们第2章对于坐标的讨论, 我们验证这个" $T "是线性的且是双射的.")
   (P "出于许多目的我们可以将同构的向量空间视为&quot;相同的&quot;, 尽管空间中的向量和"
      "运算可能是相当不同的. 我们目前不会详细讨论这个想法, 但将在我们对于向量空间的研究"
      "中积累对于同构的理解以及同构空间是&quot;相同的&quot;这个感觉.")
   (P "我们将作出一些简要的评注. 设" $T "是一个从" $V "到" $W "的同构. 如果" $S
      "是" $V "的一个子集, 那么定理8告诉我们" $S "是线性无关的当且仅当集合" (app $T $S)
      "在" $W "中是线性无关的. 因此, 在判断" $S "是否线性无关时, 检视" $S "还是" (app $T $S)
      "是无关紧要的. 从中我们可以看出, 同构是&quot;维数保持的&quot;, 也就是说对于" $V
      "任意的有限维子空间, 其在" $T "下的像有着相同的维数. 现在我们给出这个想法的一个非常"
      "简单的刻画. 设" $A "是域" $F "上的一个" m*n "矩阵, 实际上我们给过两种对于矩阵" $A
      "的解空间的定义. 第一种是" $F^n "中所有满足线性方程组" AX=0 "的每个方程的" $n "元组"
      (tu0 $x_1 $..h $x_n) "构成的集合. 第二种是所有满足" AX=0 "的" n*1 "列矩阵" $X
      "构成的集合. 第一种解空间是" $F^n "的子空间, 第二种解空间是" (^ $F n*1) "的子空间. "
      "实际上" $F^n "和" (^ $F n*1) "之间有一个显见的同构, 即"
      (MB (&\|-> (tu0 $x_1 $..h $x_n) (Mat ($x_1) ($..v) ($x_n))) ".")
      "在这个同构下, " $A "的第一种解空间被映射至第二种解空间. 这两个空间有着相同的维数, "
      "于是在证明关于解空间的维数的定理时, 选择那个空间来讨论是无关紧要的. 实际上, 读者"
      "或许并不会产生一点犹豫, 如果我们选择将" $F^n "和" (^ $F n*1) "视为等同的. "
      "当方便的时候, 我们就会这么做, 而不方便的时候, 我们就不这么做.")
   ((exercise #:n "1")
    "令" $V "是复数集, 令" $F "是实数域. 在通常的运算下, " $V "是" $F
    "上的一个向量空间. 显式描述一个从该空间到" $RR^2 "的同构.")
   ((exercise #:n "2")
    "令" $V "是复数域上的向量空间, 并设存在一个从" $V "到" $CC^3 "的同构" $T
    ". 令" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "是" $V "中向量, 满足"
    (MB (&cm (&= (ap $T $alpha_1) (tu0 $1 $0 $i))
             (&= (ap $T $alpha_2) (tu0 $-2 (&+ $1 $i) $0))
             (&= (ap $T $alpha_3) (tu0 $-1 $1 $1))
             (&= (ap $T $alpha_4) (tu0 (Msqrt $2) $i $3))) ".")
    (Ol #:attr* '((type "a"))
        (Li $alpha_1 "在" $alpha_2 "和" $alpha_3 "张成的子空间中吗?")
        (Li "令" $W_1 "是" $alpha_1 "和" $alpha_2 "张成的子空间, 令" $W_2 "是" $alpha_3
            "和" $alpha_4 "张成的子空间, 那么" $W_1 "和" $W_2 "的交是什么呢?")
        (Li "找出一个这四个向量" $alpha_j "张成的" $V "的子空间的基.")))
   ((exercise #:n "3")
    "令" $W "是所有" 2*2 "的复Hermite矩阵构成的集合. 正如我们在第2章的例子6中所指出的, 在通常的运算下, "
    $W "是一个实数域上的向量空间. 验证"
    (MB (&\|-> (tu0 $x $y $z $t)
               (Mat ((&+ $t $x) (&+ $y (&i* $i $z)))
                    ((&- $y (&i* $i $z)) (&- $t $x)))))
    "是一个从" $RR^4 "到" $W "的同构.")
   ((exercise #:n "4")
    "表明" (^ $F m*n) "同构于" (^ $F (&i* $m $n)) ".")
   ((exercise #:n "5")
    "令" $V "是复数集, 其可以被视为实数域上的向量空间 (练习1). 我们按照以下方式定义一个从"
    $V "到" 2*2 "实矩阵空间的函数" $T ". 如果" (&= $z (&+ $x (&i* $i $y))) ", 其中"
    $x "和" $y "是实数, 那么"
    (MB (&= (app $T $z) (Mat ((&+ $x (&i* $7 $y)) (&i* $5 $y))
                             ((&- (&i* $10 $y)) (&- $x (&i* $7 $y))))) ".")
    (Ol #:attr* '((type "a"))
        (Li "验证" $T "是一个单射的(实)线性变换.")
        (Li "验证" (preserve* $T $z_1 $z_2) ".")
        (Li "你如何描述" $T "的像?")))
   ((exercise #:n "6")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 证明" $V "和" $W "同构当且仅当"
    (&= (&dim $V) (&dim $W)) ".")
   ((exercise #:n "7")
    "令" $V "和" $W "是域" $F "上的向量空间, " $U "是一个从" $V "到" $W
    "的同构. 证明" (&\|-> $T (&i* $U $T (inv $U))) "是一个从" (&L $V $V) "到"
    (&L $W $W) "的同构.")
   (H3 "第3.4节 通过矩阵表示变换")
   (P "令" $V "是域" $F "上的" $n "维向量空间, 令" $W "是域" $F "上的" $m
      "维向量空间. 令" basis:def
      "是" $V "的一个有序基, 令" (&= $BBB^ (setE $beta_1 $..h $beta_m))
      "是" $W "的一个有序基. 如果" $T "是任意的从" $V "到" $W "的线性变换, 那么" $T
      "由其施加于向量" $alpha_j "的作用决定. 每个向量" (ap $T $alpha_j)
      "皆可唯一地表示为" $beta_i "的线性组合"
      (MB (&= (ap $T $alpha_j)
              (sum (&= $i $1) $m
                   (&i* (mref $A $i $j) $beta_i))))
      "其中" (&cm (mref $A $1 $j) $..h (mref $A $m $j)) "是" (ap $T $alpha_j)
      "在有序基" $BBB^ "下的坐标. 于是, 变换" $T "可由" (&i* $m $n) "个标量"
      (mref $A $i $j) "决定. 由" (&= (appl $A $i $j) (mref $A $i $j))
      "定义的" m*n "矩阵" $A "被称为" $T "相对于有序基" $BBB "和" $BBB^
      "的矩阵. 我们即时的任务在于显式地理解矩阵" $A "是如何决定线性变换" $T "的.")
   (P "如果" (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)) "是" $V "中的一个向量, 那么"
      (MB (deriv (ap $T $alpha)
                 (ap $T (@sum (&= $j $1) $n (&i* $x_j $alpha_j)))
                 (sum (&= $j $1) $n (&i* $x_j (@ap $T $alpha_j)))
                 (sum (&= $j $1) $n
                      (&i* $x_j (sum (&= $i $1) $m
                                     (&i* (mref $A $i $j) $beta_i))))
                 (sum (&= $i $1) $m
                      (&i* (@sum (&= $j $1) $n
                                 (&i* (mref $A $i $j) $x_j))
                           $beta_i))))
      "如果" $X "是" $alpha "在有序基" $BBB "下的坐标矩阵, 那么以上的计算表明"
      (&i* $A $X) "是向量" (ap $T $alpha) "在有序基" $BBB^ "下的坐标矩阵, 因为标量"
      (MB (sum (&= $j $1) $n (&i* (mref $A $i $j) $x_j)))
      "是列矩阵" (&i* $A $X) "第" $i "行的元素. 让我们也观察到如果" $A "是域" $F
      "上任意的" m*n "矩阵, 那么"
      (MB (&= (ap $T (@sum (&= $j $1) $n (&i* $x_j $alpha_j)))
              (sum (&= $i $1) $m
                   (&i* (@sum (&= $j $1) $n
                              (&i* (mref $A $i $j) $x_j))
                        $beta_i))))
      "定义了一个从" $V "到" $W "的线性变换" $T ", 并且其相对于" $BBB "和" $BBB^
      "的矩阵是" $A ". 我们形式地总结如下:")
   ((theorem #:n "11")
    "令" $V "是域" $F "上的" $n "维向量空间, 令" $W "是域" $F "上的" $m
    "维向量空间. 令" basis:def
    "是" $V "的一个有序基, 令" (&= $BBB^ (setE $beta_1 $..h $beta_m))
    "是" $W "的一个有序基. 对于每个从" $V "到" $W "的线性变换" $T
    ", 存在一个域" $F "上的" m*n "矩阵" $A "满足"
    (MB (&= (coordm (ap $T $alpha) $BBB^)
            (&i* $A (coordm $alpha $BBB))))
    "对于每个" $V "中向量" $alpha "成立. 并且, " (&\|-> $T $A)
    "是一个从所有从" $V "到" $W "的线性变换构成的集合到所有域" $F
    "上的" m*n "矩阵构成的集合的一一对应.")
   (P "定理11中与" $T "相关联着的矩阵" $A "被称为" $T "相对于有序基" $BBB "和"
      $BBB^ "的矩阵. 注意到式子"
      (&= (ap $T $alpha_j)
          (sum (&= $i $1) $m
               (&i* (mref $A $i $j) $beta_i)))
      "是说矩阵" $A "的列" (&cm $A_1 $..h $A_n) "由"
      (MB (&cm (&= $A_j (coordm (ap $T $alpha_j) $BBB^))
               (&= $j (&cm $1 $..h $n))))
      "给出. 如果" $U "是另一个从" $V "到" $W "的线性变换, 并且" (&= $B (li0 $B_1 $..h $B_n))
      "是" $U "相对于有序基" $BBB "和" $BBB^ "的矩阵, 那么" (LC $c $A $B) "是" (LC $c $T $U)
      "相对于有序基" $BBB "和" $BBB^ "矩阵. 这是显然的, 因为"
      (let ((cm (lambda (T) (coordm T $BBB^))))
        (MB (deriv (LC $c $A_j $B_j)
                   (LC $c (cm (ap $T $alpha_j)) (cm (ap $U $alpha_j)))
                   (cm (LC $c (ap $T $alpha_j) (ap $U $alpha_j)))
                   (cm (ap (@LC $c $T $U) $alpha_j))))))
   ((theorem #:n "12")
    "令" $V "是域" $F "上的" $n "维向量空间, 令" $W "是域" $F "上的" $m
    "维向量空间. 对于" $V "和" $W "相应的每对有序基" $BBB "和" $BBB^ ", 为线性变换" $T
    "赋予其相对于" $BBB "和" $BBB^ "的矩阵的函数是一个空间" (&L $V $W) "和" (^ $F m*n)
    "之间的同构.")
   ((proof)
    "我们观察到这个函数是线性的 [译注: 就是上一段], 并且如定理11所言, 这个函数是"
    (&L $V $W) "和" (^ $F m*n) "之间的双射.")
   (P "我们将特别关心从一个空间到自身的线性变换的矩阵表示, 也就是线性算子的矩阵表示. 在"
      "这种情况下使用相同的基是方便的, 即取" (&= $BBB $BBB^) ". 我们将称这个表示矩阵为"
      $T "相对于有序基" $BBB "的矩阵. 因为这个概念是如此重要, 以至于我们将重复这个定义. 如果"
      $T "是有限维向量空间" $V "上的一个线性算子而" basis:def
      "是" $V "的一个有序基, 那么" $T "相对于" $BBB "的矩阵 (或者说, " $T "在有序基" $BBB
      "下的矩阵) 是一个" n*n "矩阵" $A ", 其元素" Aij "由式子"
      (MB (&cm (&= (ap $T $alpha_j) (sum (&= $i $1) $n (&i* Aij $alpha_i)))
               (&= $j (&cm $1 $..h $n))))
      "定义. 读者必须记住这个表示" $T "的矩阵依赖于有序基" $BBB ", 而" $V "的每个有序基下都有一个"
      $T "的表示矩阵. (如果是从一个空间" $V "到另一个空间" $W "的线性变换, 那就是依赖于两个有序基, 一个是"
      $V "的有序基, 另一个是" $W "的有序基.) 为了不忘记这个依赖关系, 我们将使用记号"
      (MB (coordm $T))
      "表示线性算子" $T "在有序基" $BBB "下的矩阵. 这个矩阵以及相关的有序基刻画" $T "的方式在于对于每个"
      $V "中的" $alpha "有"
      (MB (&= (coordm (ap $T $alpha)) (&i* (coordm $T) (coordm $alpha))) "."))
   ((example #:n "13")
    "令" $V "是域" $F "上的" n*1 "列矩阵构成的空间, 令" $W "是域" $F "上的" m*1 "列矩阵构成的空间, 令"
    $A "是域" $F "上一个固定的" m*n "矩阵. 令" $T "是一个从" $V "到" $W "的线性变换, 由"
    (&= (app $T $X) (&i* $A $X)) "定义. 令" $BBB "是" $V "的有序基, 其类似于" $F^n "的标准有序基, "
    "也就是说, " $BBB "的第" $i "个向量是" n*1 "矩阵" $X_i ", 其第" $i "行是" $1 ", 而其他元素为"
    $0 ". 令" $BBB^ "是" $W "的有序基, 其定义方式与" $V "的这个有序基类似. 那么, " $T "相对于"
    $BBB "和" $BBB^ "的矩阵就是" $A "本身. 这是显然的, 因为矩阵" (&i* $A $X_j) "就是" $A
    "的第" $j "列.")
   ((example #:n "14")
    "令" $F "是一个域, 令" $T "是" $F^2 "上的一个线性算子, 由"
    (MB (&= (app $T $x_1 $x_2) (tu0 $x_1 $0)))
    "定义. 令" $BBB "是" $F^2 "的标准有序基, " (&= $BBB (tu0 $epsilon_1 $epsilon_2)) ". 既然"
    (MB (&cm (&= (ap $T $epsilon_1) (appl $T $1 $0) (tu0 $1 $0) (LC $1 $epsilon_1 $0 $epsilon_2))
             (&= (ap $T $epsilon_2) (appl $T $0 $1) (tu0 $0 $0) (LC $0 $epsilon_1 $0 $epsilon_2))) ",")
    "那么" $T "在有序基" $BBB "下的矩阵是"
    (MB (&= (coordm $T) (Mat ($1 $0) ($0 $0))) "."))
   ((example #:n "15")
    "令" $V "是所有具有形式"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2) (&i* $c_3 $x^3))))
    "的从" $RR "到" $RR "的多项式函数构成的向量空间, 即次数小于等于三的多项式函数的空间. 例子2的微分算子"
    $D "映射" $V "至" $V ", 鉴于" $D "是&quot;降次的&quot;. 令" $BBB "是" $V "的有序基, 其由四个函数"
    (&cm $f_1 $f_2 $f_3 $f_4) "构成, 通过" (&= (app $f_j $x) (^ $x (&- $j $1))) "定义, 那么"
    (let* ((lc (lambda (a b c d) (LC a $f_1 b $f_2 c $f_3 d $f_4)))
           (Df (lambda (n) (ap $D (_ $f n))))
           (Dfx (lambda (n) (app (@ (Df n)) $x)))
           (template (lambda (n e a b c d)
                       (list (Dfx n) $= (: e ",") $ (Df n) $= (lc a b c d)))))
      (MB
       ((Ttable (lambda (d i j)
                  (if (= j 2)
                      (set-attr* d 'columnalign "right")
                      d)))
        (&table
         (list (template $1 $0 $0 $0 $0 $0)
               (template $2 $1 $1 $0 $0 $0)
               (template $3 (&i* $2 $x) $0 $2 $0 $0)
               (template $4 (&i* $3 $x^2) $0 $0 $3 $0)
               )))))
    "于是" $D "在有序基" $BBB "下的矩阵是"
    (MB (&= (coordm $D) (Mat ($0 $1 $0 $0) ($0 $0 $2 $0) ($0 $0 $0 $3) ($0 $0 $0 $0))) "."))
   (P "我们已经见过把变换相加时表示矩阵会怎么变化了, 即把矩阵相加. 现在我们想问把变换复合起来时"
      "会发生些什么. 更准确地说, 令" (&cm $V $W $Z) "是域" $F "上相应维数为" (&cm $n $m $p)
      "的向量空间. 令" $T "是一个从" $V "到" $W "的线性变换, 令" $U "是一个从" $W "到" $Z
      "的线性变换. 设" (&cm $V $W $Z) "相应的有序基分别为"
      (MB (&cm basis:def
               (&= $BBB^ (setE $beta_1 $..h $beta_m))
               (&= $BBB^^ (setE $gamma_1 $..h $gamma_p))) ".")
      "令" $A "是" $T "相对于" $BBB "和" $BBB^ "的矩阵, 令" $B "是" $U "相对于" $BBB^ "和"
      $BBB^^ "的矩阵. 那么, 很容易看出来变换" (&i* $U $T) "相对于" $BBB "和" $BBB^^
      "的矩阵" $C "就是" $B "和" $A "的积. 这是因为, 如果" $alpha "是" $V "中任意的向量, 那么"
      (MB (&cm (&= (coordm (ap $T $alpha) $BBB^)
                   (&i* $A (coordm $alpha $BBB)))
               (&= (coordm (ap $U (@ap $T $alpha)) $BBB^^)
                   (&i* $B (coordm (ap $T $alpha) $BBB^)))))
      "于是"
      (MB (&= (coordm (app (@i* $U $T) $alpha) $BBB^^)
              (&i* (@i* $B $A) (coordm $alpha $BBB))))
      "根据表示矩阵的定义和唯一性, 我们必有" (&= $C (&i* $B $A)) ". 读者也可通过施行以下计算来看出这点."
      (MB (deriv (app (@i* $U $T) $alpha_j)
                 (ap $U (@ap $T $alpha_j))
                 (ap $U (@sum (&= $k $1) $m (&i* (mref $A $k $j) $beta_k)))
                 (sum (&= $k $1) $m (&i* (mref $A $k $j) (@ap $U $beta_k)))
                 (sum (&= $k $1) $m
                      (&i* (mref $A $k $j)
                           (sum (&= $i $1) $p
                                (&i* (mref $B $i $k) $gamma_i))))
                 (sum (&= $i $1) $p
                      (&i* (@sum (&= $k $1) $m
                                 (&i* (mref $B $i $k) (mref $A $k $j)))
                           $gamma_i))))
      "于是我们必有"
      (MB (&= (mref $C $i $j)
              (sum (&= $k $1) $m (&i* (mref $B $i $k) (mref $A $k $j)))) ".")
      "之前我们定义矩阵乘法的动机在于矩阵行上的操作. 这里我们看到线性变换的复合也提供了强烈的动机. "
      "让我们形式化地总结一下这个结果.")
   ((theorem #:n "13")
    "令" (&cm $V $W $Z) "是域" $F "上的有限维向量空间. 令" $T "是从" $V "到" $W "的线性变换, " $U
    "是从" $W "到" $Z "的线性变换. 如果" (&cm $BBB $BBB^ $BBB^^) "分别是" (&cm $V $W $Z)
    "的有序基, 如果" $A "是" $T "相对于" $BBB "和" $BBB^ "的矩阵, " $B "是" $U "相对于" $BBB^
    "和" $BBB^^ "的矩阵, 那么变换的复合" (&i* $U $T) "相对于" $BBB "和" $BBB^^ "的矩阵是积"
    (&= $C (&i* $B $A)) ".")
   (P "注意到定理13给我们了一个矩阵乘法是结合运算的证明, 这个证明不需要计算, 并且独立于我们在第1章给出的证明."
      " 我们还应该指出我们在例子10中证明了定理13的特殊情况. [译注: 原文是例子12, 疑似应该是例子10.]")
   (P "如果" $T "和" $U "是空间" $V "上的线性算子, 并且我们以单一的有序基" $BBB "表示这两个变换, "
      "那么定理13呈现出特别简单的形式" (preserve coordm $U &i* $T) ". 因此, 在这种情况下由" $BBB
      "所决定的算子和矩阵之间的对应不仅是向量空间的同构, 还保持乘法. 这个事实的一个简单推论是线性算子" $T
      "可逆当且仅当矩阵" (coordm $T) "可逆. 这是因为恒等算子" $I "在任意的有序基下都由恒等矩阵表示, 于是"
      (MB (&= (&i* $U $T) (&i* $T $U) $I))
      "等价于"
      (MB (&= (&i* (coordm $U) (coordm $T)) (&i* (coordm $T) (coordm $U)) $I) ".")
      "当然, " $T "可逆时有"
      (MB (&= (coordm (inv $T)) (_^ (bra0 $T) $BBB $-1)) "."))
   (P "现在我们想要探究当有序基改变时表示矩阵会怎样变化. 为了简单起见, 我们将只考虑空间" $V
      "上的线性算子, 于是我们可以只使用一个有序基. 我们想问的特定问题如下. 令" $T "是有限维向量空间"
      $V "上的一个线性算子, 并令"
      (MB basis:def
          "和" (&= $BBB^ (setE (_^ $alpha $1 $prime) $..h (_^ $alpha $n $prime))))
      "是" $V "的两个有序基. 矩阵" (coordm $T) "和" (coordm $T $BBB^) "之间有什么联系呢? "
      "正如我们在第2章所观察到的那样, 存在一个唯一的" n*n "(可逆)矩阵" $P "满足对于每个" $V "的向量"
      $alpha "有"
      (MB (&= (coordm $alpha) (&i* $P (coordm $alpha $BBB^))) ".")
      "这个矩阵即" (&= $P (li0 $P_1 $..h $P_n)) ", 其中" (&= $P_j (coordm (_^ $alpha $j $prime)))
      ". 根据定义,"
      (MB (&= (coordm (ap $T $alpha)) (&i* (coordm $T) (coordm $alpha))) ".")
      "将坐标变换公式应用于" (ap $T $alpha) ", 我们就得到"
      (MB (&= (coordm (ap $T $alpha)) (&i* $P (coordm (ap $T $alpha) $BBB^))) ".")
      "结合这三个式子, 我们有"
      (MB (&= (&i* (coordm $T) $P (coordm $alpha $BBB^))
              (&i* $P (coordm (ap $T $alpha) $BBB^))))
      "或是"
      (MB (&= (&i* (sim (coordm $T)) (coordm $alpha $BBB^))
              (coordm (ap $T $alpha) $BBB^)))
      "因此就得到"
      (MB (&= (coordm $T $BBB^) (sim (coordm $T))) ".")
      "这回答了我们的问题.")
   (P "在形式化陈述这个结果之前, 让我们观察一下以下事实. 存在唯一的一个线性算子" $U "将有序基" $BBB
      "映射成" $BBB^ ", 其由"
      (MB (&cm (&= (ap $U $alpha_j) (_^ $alpha $j $prime))
               (&= $j (&cm $1 $..h $n))))
      "定义. 这个算子" $U "是可逆的, 因为它将" $V "的一个基映射至" $V "的另一个基. 上面的矩阵" $P
      "恰是" $U "在有序基" $BBB "下的表示, 因为" $P "是由"
      (MB (&= (_^ $alpha $j $prime) (sum (&= $i $1) $n (&i* (mref $P $i $j) $alpha_i))))
      "定义的, 既然" (&= (ap $U $alpha_j) (_^ $alpha $j $prime)) ", 这个式子也可以写成"
      (MB (&= (ap $U $alpha_j) (sum (&= $i $1) $n (&i* (mref $P $i $j) $alpha_i))))
      "于是" (&= $P (coordm $U)) ", 根据定义.")
   ((theorem #:n "14")
    "令" $V "是一个域" $F "上的有限维向量空间. 令"
    (MB basis:def
        "和" (&= $BBB^ (setE (_^ $alpha $1 $prime) $..h (_^ $alpha $n $prime))))
    "是" $V "的有序基. 设" $T "是" $V "上的一个线性算子. 如果" (&= $P (li0 $P_1 $..h $P_n))
    "是一个以" (&= $P_j (coordm (_^ $alpha $j $prime))) "为列的" n*n "矩阵, 那么"
    (MB (&= (coordm $T $BBB^) (sim (coordm $T))) ".")
    "或者说, 如果" $U "是由" (&cm (&= (ap $U $alpha_j) (_^ $alpha $j $prime)) (&= $j (&cm $1 $..h $n)))
    "定义的" $V "上的可逆线性算子, 那么"
    (MB (&= (coordm $T $BBB^) (&i* (_^ (bra0 $U) $BBB $-1) (coordm $T) (coordm $U))) "."))
   ((example #:n "16")
    "令" $T "是" $RR^2 "上由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) "定义的线性算子. 在例子14中我们表明"
    $T "在标准有序基" (&= $BBB (setE $epsilon_1 $epsilon_2)) "下的矩阵是"
    (MB (&= (coordm $T) (Mat ($1 $0) ($0 $0))) ".")
    "设" $BBB^ "是" $RR^2 "的有序基, 其由向量" (&= (_^ $epsilon $1 $prime) (tu0 $1 $1)) "和"
    (&= (_^ $epsilon $2 $prime) (tu0 $2 $1)) "构成, 那么"
    (MB (&cm (&= (_^ $epsilon $1 $prime) (&+ $epsilon_1 $epsilon_2))
             (&= (_^ $epsilon $2 $prime) (&+ (&i* $2 $epsilon_1) $epsilon_2))))
    "于是" $P "是矩阵"
    (MB (&= $P (Mat ($1 $2) ($1 $1))) ".")
    "根据简单的计算"
    (MB (&= (inv $P) (Mat ($-1 $2) ($1 $-1))) ".")
    "因此"
    (MB (deriv (coordm $T $BBB^)
               (sim (coordm $T))
               (&i* (Mat ($-1 $2) ($1 $-1)) (Mat ($1 $0) ($0 $0)) (Mat ($1 $2) ($1 $1)))
               (&i* (Mat ($-1 $2) ($1 $-1)) (Mat ($1 $2) ($0 $0)))
               (Mat ($-1 $-2) ($1 $2))))
    "我们很容易验证这是正确的, 因为"
    (MB (&cm (&= (ap $T (_^ $epsilon $1 $prime)) (tu0 $1 $0)
                 (&+ (&- (_^ $epsilon $1 $prime)) (_^ $epsilon $2 $prime)))
             (&= (ap $T (_^ $epsilon $2 $prime)) (tu0 $2 $0)
                 (LC $-2 (_^ $epsilon $1 $prime) $2 (_^ $epsilon $2 $prime)))) "."))
   ((example #:n "17")
    "令" $V "是从" $RR "到" $RR "的次数小于等于" $3 "的多项式函数构成的向量空间. 如例子15, 令"
    $D "是" $V "上的微分算子, 并令"
    (MB (&= $BBB (setE $f_1 $f_2 $f_3 $f_4)))
    "是" $V "的有序基, 其由" (&= (app $f_i $x) (^ $x (&- $i $1))) "定义. 令" $t "是一个实数, 定义"
    (&= (app $g_i $x) (^ (@+ $x $t) (&- $i $1))) ", 即"
    (MB (set-attr*
         (&Table
          ($g_1 $= $f_1)
          ($g_2 $= (&+ (&i* $t $f_1) $f_2))
          ($g_3 $= (&+ (&i* $t^2 $f_1) (&i* $2 $t $f_2) $f_3))
          ($g_4 $= (&+ (&i* $t^3 $f_1) (&i* $3 $t^2 $f_2) (&i* $3 $t $f_3) $f_4)))
         'columnalign "left"))
    "既然矩阵"
    (MB (&= $P (Mat ($1 $t $t^2 $t^3)
                    ($0 $1 (&i* $2 $t) (&i* $3 $t^2))
                    ($0 $0 $1 (&i* $3 $t))
                    ($0 $0 $0 $1))))
    "很容易看出来是可逆的, 并有"
    (MB (&= (inv $P)
            (Mat ($1 (&- $t) $t^2 (&- $t^3))
                 ($0 $1 (&i* $-2 $t) (&i* $3 $t^2))
                 ($0 $0 $1 (&i* $-3 $t))
                 ($0 $0 $0 $1))))
    "从中我们得知" (&= $BBB^ (setE $g_1 $g_2 $g_3 $g_4)) "是" $V "的一个有序基. 在例子15里, 我们发现"
    $D "在有序基" $BBB "下的矩阵为"
    (MB (&= (coordm $D)
            (Mat ($0 $1 $0 $0)
                 ($0 $0 $2 $0)
                 ($0 $0 $0 $3)
                 ($0 $0 $0 $0))) ".")
    "因此" $D "相对于有序基" $BBB^ "的矩阵为"
    (MB (deriv (sim (coordm $D))
               (&i* (Mat ($1 (&- $t) $t^2 (&- $t^3))
                         ($0 $1 (&i* $-2 $t) (&i* $3 $t^2))
                         ($0 $0 $1 (&i* $-3 $t))
                         ($0 $0 $0 $1))
                    (Mat ($0 $1 $0 $0)
                         ($0 $0 $2 $0)
                         ($0 $0 $0 $3)
                         ($0 $0 $0 $0))
                    (Mat ($1 $t $t^2 $t^3)
                         ($0 $1 (&i* $2 $t) (&i* $3 $t^2))
                         ($0 $0 $1 (&i* $3 $t))
                         ($0 $0 $0 $1)))
               (&i* (Mat ($1 (&- $t) $t^2 (&- $t^3))
                         ($0 $1 (&i* $-2 $t) (&i* $3 $t^2))
                         ($0 $0 $1 (&i* $-3 $t))
                         ($0 $0 $0 $1))
                    (Mat ($0 $1 (&i* $2 $t) (&i* $3 $t^2))
                         ($0 $0 $2 (&i* $6 $t))
                         ($0 $0 $0 $3)
                         ($0 $0 $0 $0)))
               (Mat ($0 $1 $0 $0)
                    ($0 $0 $2 $0)
                    ($0 $0 $0 $3)
                    ($0 $0 $0 $0))))
    "于是" $D "在有序基" $BBB "和" $BBB^ "下由相同的矩阵表示. 当然, 或许我们可以更直接地看出这点来, 因为"
    (MB (&cm (&= (ap $D $g_1) $0)
             (&= (ap $D $g_2) $g_1)
             (&= (ap $D $g_3) (&i* $2 $g_2))
             (&= (ap $D $g_4) (&i* $3 $g_3))) ".")
    "这个例子刻画了很好的一点. 如果读者已知一个线性算子在某个有序基" $BBB "下的矩阵, 并想要找出其在另一个有序基"
    $BBB^ "下的矩阵, 经常的情况是使用可逆矩阵" $P "施行坐标变换是最方便的. 然而, 有时直接诉诸定义来寻找"
    "表示矩阵可能要简单得多.")
   ((definition)
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵. 我们称" $B "在" $F "上相似于" $A ", 如果存在一个域" $F
    "上的可逆矩阵" $P "满足" (&= $B (sim $A)) ".")
   (P "根据定理14, 我们知道: 如果" $V "是一个域" $F "上的" $n "维向量空间而" $BBB "和" $BBB^
      "是" $V "的两个有序基, 那么对于每个" $V "上的线性算子" $T ", 矩阵" (&= $B (coordm $T $BBB^))
      "相似于矩阵" (&= $A (coordm $T)) ". 我们也可以从另一个方向看待这个事情. 设" $A "和" $B
      "是域" $F "上的" n*n "矩阵, 令" $BBB "是" $V "的一个有序基. 令" $T "是" $V "上的线性算子, 其在基"
      $BBB "下由" $A "表示. 如果" (&= $B (sim $A)) ", 令" $BBB^ "是经" $P "由" $BBB "得到的" $V
      "的有序基, 即"
      (MB (&= (_^ $alpha $j $prime) (sum (&= $i $1) $n (&i* (mref $P $i $j) $alpha_i))) ",")
      "那么" $T "在有序基" $BBB^ "下的矩阵就是" $B ".")
   (P "因此, 陈述" $B "相似于" $A "意味着在每个域" $F "上的" $n "维空间上, 矩阵" $A "和" $B
      "在两个(可能)不同的有序基下表示着相同的线性变换.")
   (P "注意到每个" n*n "矩阵" $A "都相似于自身, 只需令" (&= $P $I) "; 如果" $B "相似于" $A ", 那么"
      $A "相似于" $B ", 因为" (&= $B (sim $A)) "可以推出" (&= $A (&i* (inv (@ (inv $P))) $B (inv $P)))
      "; 如果" $B "相似于" $A "而" $C "相似于" $B ", 那么" $C "相似于" $A ", 因为" (&= $B (sim $A))
      "和" (&= $C (sim $B $Q)) "可以推出" (&= $C (sim $A (@i* $P $Q))) ". 因此, 相似性是域" $F "上的"
      n*n "矩阵的集合上的一个等价关系. 读者还应该注意到唯一与恒等矩阵" $I "相似的矩阵就是" $I
      "本身, 唯一与零矩阵相似的矩阵就是零矩阵本身.")
   ((exercise #:n "1")
    "令" $T "是" $CC^2 "上由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $x_2)) "定义的线性算子. 令" $BBB
    "是" $CC^2 "的标准有序基而" (&= $BBB^ (setE $alpha_1 $alpha_2)) "是由"
    (&cm (&= $alpha_1 (tu0 $1 $i)) (&= $alpha_2 (tu0 (&- $i) $2))) "定义的有序基."
    (Ol #:attr* '((type "a"))
        (Li $T "相对于" $BBB "和" $BBB^ "的矩阵是什么?")
        (Li $T "相对于" $BBB^ "和" $BBB "的矩阵是什么?")
        (Li $T "在有序基" $BBB^ "下的矩阵是什么?")
        (Li $T "在有序基" (setE $alpha_2 $alpha_1) "下的矩阵是什么?")))
   ((exercise #:n "2")
    "令" $T "是从" $RR^3 "到" $RR^2 "的线性变换, 其由"
    (MB (&= (appl $T $x_1 $x_2 $x_3) (tu0 (&+ $x_1 $x_2) (&- (&i* $2 $x_3) $x_1))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li "如果" $BBB "是" $RR^3 "的标准有序基而" $BBB^ "是" $RR^2 "的标准有序基, 那么" $T
            "相对于" $BBB "和" $BBB^ "的矩阵是什么?")
        (Li "如果" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "且" (&= $BBB^ (tu0 $beta_1 $beta_2)) ", 其中"
            (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1)) (&= $alpha_2 (tu0 $1 $1 $1)) (&= $alpha_3 (tu0 $1 $0 $0))
                     (&= $beta_1 (tu0 $0 $1)) (&= $beta_2 (tu0 $1 $0))))
            $T "相对于" $BBB "和" $BBB^ "的矩阵是什么?")))
   ((exercise #:n "3")
    "令" $T "是" $F^n "上的线性算子, 令" $A "是" $T "在" $F^n "的标准基下的矩阵, 令" $W "是由" $A
    "的列向量张成的" $F^n "的子空间. 请问" $W "和" $T "有何关系?")
   ((exercise #:n "4")
    "令" $V "是域" $F "上的一个二维向量空间, 令" $BBB "是" $V "的一个有序基. 如果" $T "是" $V
    "上的一个线性算子, 并且"
    (MB (&= (coordm $T) (Mat ($a $b) ($c $d))))
    "证明" (&= (: $T^2 $- (&i* (@+ $a $d) $T) $+ (&i* (@- (&i* $a $d) (&i* $b $c)) $I)) $0) ".")
   ((exercise #:n "5")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下的矩阵为"
    (MB (&= $A (Mat ($1 $2 $1) ($0 $1 $1) ($-1 $3 $4))) ".")
    "找出" $T "的像的一个基和" $T "的零空间的一个基.")
   ((exercise #:n "6")
    "令" $T "是" $RR^2 "上由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 (&- $x_2) $x_1)))
    "定义的线性算子."
    (Ol #:attr* '((type "a"))
        (Li $T "在" $RR^2 "的标准基下的矩阵是什么?")
        (Li $T "在有序基" (&= $BBB (setE $alpha_1 $alpha_2)) "下的矩阵是什么, 其中"
            (&= $alpha_1 (tu0 $1 $2)) "且" (&= $alpha_2 (tu0 $1 $-1)) "?")
        (Li "证明对于每个实数" $c ", 算子" (@- $T (&i* $c $I)) "都是可逆的.")
        (Li "证明如果" $BBB "是" $RR^2 "任意的有序基并且" (&= (coordm $T) $A) ", 那么"
            (&!= (&i* (mref $A $1 $2) (mref $A $2 $1)) $0) ".")))
   ((exercise #:n "7")
    "令" $T "是" $RR^3 "上的线性算子, 由"
    (MB (&= (ap $T (tu0 $x_1 $x_2 $x_3))
            (tu0 (&+ (&i* $3 $x_1) $x_3) (&+ (&i* $-2 $x_1) $x_2)
                 (&+ (&- $x_1) (&i* $2 $x_2) (&i* $4 $x_3)))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li $T "在" $RR^3 "的标准有序基下的矩阵是什么?")
        (Li $T "在有序基"
            (MB (setE $alpha_1 $alpha_2 $alpha_3))
            "下的矩阵是什么, 其中"
            (&cm (&= $alpha_1 (tu0 $1 $0 $1)) (&= $alpha_2 (tu0 $-1 $2 $1))
                 (&= $alpha_3 (tu0 $2 $1 $1))) "?")
        (Li "证明" $T "是可逆的, 并如定义" $T "一样给出" (inv $T) "的规则.")))
   ((exercise #:n "8")
    "令" $theta "是一个实数. 证明以下两个矩阵在复数域上是相似的:"
    (MB (&cm (Mat ((&cos $theta) (&- (&sin $theta)))
                  ((&sin $theta) (&cos $theta)))
             (Mat ((^ $e (&i* $i $theta)) $0)
                  ($0 (^ $e (&- (&i* $i $theta)))))))
    "(提示: 令" $T "是" $CC^2 "上的线性算子, 其在标准有序基下由第一个矩阵表示. 接着, 找出向量"
    $alpha_1 "和" $alpha_2 "使得"
    (&cm (&= (ap $T $alpha_1) (&i* (^ $e (&i* $i $theta)) $alpha_1))
         (&= (ap $T $alpha_2) (&i* (^ $e (&- (&i* $i $theta))) $alpha_2)))
    "并且" (setE $alpha_1 $alpha_2) "是一个基.)")
   ((exercise #:n "9")
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $S "和" $T "是" $V "上的线性算子. 我们问: "
    "什么时候存在" $V "的有序基" $BBB "和" $BBB^ "使得" (&= (coordm $S) (coordm $T $BBB^))
    "? 证明这样的基存在当且仅当存在一个" $V "上的可逆线性算子" $U "使得" (&= $T (&i* $U $S (inv $U)))
    ". (证明大纲: 如果" (&= (coordm $S) (coordm $T $BBB^)) ", 令" $U "是将" $BBB "映射成"
    $BBB^ "的线性算子, 然后表明" (&= $S (&i* $U $T (inv $U))) ". 反过来, 如果对于某个可逆的"
    $U "有" (&= $T (&i* $U $S (inv $U))) ", 令" $BBB "是" $V "任意的有序基, 令" $BBB^
    "是其在" $U "下的像 [译注: 当然要保持顺序], 然后表明" (&= (coordm $S) (coordm $T $BBB^)) ".)")
   ((exercise #:n "10")
    "我们已经知道由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) "定义的" $RR^2 "上的线性算子" $T
    "在标准有序基下由矩阵"
    (MB (&= $A (Mat ($1 $0) ($0 $0))))
    "表示. 这个算子满足" (&= $T^2 $T) ". 证明如果" $S "是一个" $RR^2 "上满足" (&= $S^2 $S)
    "的线性算子, 那么" (&= $S $0) ", 或者" (&= $S $I) ", 或者存在" $RR^2 "的一个有序基使得"
    (&= (coordm $S) $A) ".")
   ((exercise #:n "11")
    "令" $W "是域" $F "上所有" n*1 "矩阵构成的空间. 如果" $A "是域" $F "上的一个" n*n "矩阵, 那么"
    $A "通过左乘定义了一个" $W "上的线性算子" $L_A ": " (&= (app $L_A $X) (&i* $A $X))
    ". 证明每个" $W "上的线性算子都是左乘某个" n*n "矩阵, 即是对于某个矩阵" $A "而言的" $L_A "." (Br)
    "现在设" $V "是域" $F "上的一个" $n "维向量空间, 令" $BBB "是" $V "的一个有序基. 对于每个" $V
    "中的" $alpha ", 定义" (&= (ap $U $alpha) (coordm $alpha)) ". 证明" $U "是一个从" $V "到" $W
    "的线性算子. 如果" $T "是一个" $V "的线性算子, 那么" (&i* $U $T (inv $U)) "是一个" $W
    "上的线性算子. 于是, " (&i* $U $T (inv $U)) "是一个左乘某个" n*n "矩阵" $A "的变换, 那么"
    $A "是什么呢?")
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个" $n "维向量空间, 令" basis:def
    "是" $V "的一个有序基."
    (Ol #:attr* '((type "a"))
        (Li "根据定理1, 存在唯一的" $V "上的线性算子" $T "满足"
            (MB (&cm (&= (ap $T $alpha_j) (_ $alpha (&+ $j $1)))
                     (&= $j (&cm $1 $..h (&- $n $1)))
                     (&= (ap $T $alpha_n) $0)) ".")
            $T "在有序基" $BBB "下的矩阵" $A "是什么?")
        (Li "证明" (&= $T^n $0) "但是" (&!= (^ $T (&- $n $1)) $0) ".")
        (Li "令" $S "是" $V "上任意的满足" (&= $S^n $0) "但是" (&!= (^ $S (&- $n $1)) $0)
            "的线性算子. 证明存在" $V "的有序基" $BBB^ "使得" $S "在" $BBB^ "下的表示是a里的矩阵" $A ".")
        (Li "证明如果" $M "和" $N "是域" $F "上满足" (&= $M^n $N^n $0) "但是" (&!= (^ $M (&- $n $1)) $0)
            "且" (&!= (^ $N (&- $n $1)) $0) "的" n*n "矩阵, 那么" $M "和" $N "是相似的.")))
   ((exercise #:n "13")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 令" $T "是一个从" $V "到" $W "的线性变换. 如果"
    (MB basis:def
        "和" (&= $BBB^ (setE $beta_1 $..h $beta_m)))
    "分别是" $V "和" $W "的有序基, 如定理5的证明一样定义线性变换" (&E $p $q) ": "
    (&= (app (&E $p $q) $alpha_i) (&i* (&delta $i $q) $beta_p)) ", 那么"
    (&cm (&E $p $q) (&<= $1 $p $m) (&<= $1 $q $n)) "构成了" (&L $V $W) "的一个基, 并且对于特定的标量"
    (mref $A $p $q) "有"
    (MB (&= $T (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (&E $p $q))))) ".")
    (mref $A $p $q) "即" $T "在这个" (&L $V $W) "的基下的坐标. 证明以" (&= (appl $A $p $q) (mref $A $p $q))
    "为元素的矩阵" $A "就恰是" $T "相对于" $BBB "和" $BBB^ "的表示矩阵.")
   (H3 "第3.5节 线性泛函")
   (P "如果" $V "是一个域" $F "上的向量空间, 那么从" $V "到标量域" $F "的线性变换" $f
      "也被称为" $V "上的线性泛函. 如果我们从头开始, 那么这意味着" $f "是一个从" $V
      "到" $F "的函数, 并且满足"
      (MB (&= (app $f (LC $c $alpha $beta))
              (LC $c (app $f $alpha) (app $f $beta))))
      "对于所有" $V "中的" $alpha "和" $beta "以及所有" $F "中的标量" $c "成立. "
      "线性泛函这个概念的重要性在于它有助于组织和澄清关于子空间, 线性方程和坐标的讨论.")
   ((example #:n "18")
    "令" $F "是一个域而" (&cm $a_1 $..h $a_n) "是" $F "中标量, 我们根据"
    (MB (&= (appl $f $x_1 $..h $x_n) (LC0 $a_1 $x_1 $a_n $x_n)))
    "定义一个" $F^n "上的函数" $f ", 那么" $f "是" $F^n "上的一个线性泛函. 它是这样的泛函, 其在"
    $F^n "的标准有序基和" $F "的基" (setE $1) "下由矩阵" (Mat ($a_1 $..c $a_n)) "表示:"
    (MB (&cm (&= $a_j (app $f $epsilon_j)) (&= $j (&cm $1 $..h $n))) ".")
    "[译注: 其实" (setE $1) "就是" $F "的标准有序基.] 每个" $F^n "上的线性泛函都具有这种形式, 对于某些标量"
    (&cm $a_1 $..h $a_n) "而言. 这是由线性泛函的定义立即得到的, 因为如果我们定义"
    (&= $a_j (app $f $epsilon_j)) "并使用线性性质, 那么"
    (MB (deriv (appl $f $x_1 $..h $x_n)
               (ap $f (@sum (&= $j $1) $n (&i* $x_j $epsilon_j)))
               (sum (&= $j $1) $n (&i* $x_j (app $f $epsilon_j)))
               (sum (&= $j $1) $n (&i* $a_j $x_j)))))
   ((example #:n "19")
    "这里给出一个线性泛函的重要例子. 令" $n "是一个正整数而" $F "是一个域, 如果" $A "是一个以" $F
    "中标量为元素的" n*n "矩阵, 那么" $A "的迹是标量"
    (MB (&= (&tr $A) (&+ (mref $A $1 $1) (mref $A $2 $2) $..c (mref $A $n $n))) ".")
    "迹函数是一个矩阵空间" (^ $F n*n) "上的线性泛函, 因为"
    (MB (deriv (&tr (LC $c $A $B))
               (sum (&= $i $1) $n (@LC $c (mref $A $i $i) (mref $B $i $i)))
               (LC $c (sum (&= $i $1) $n (mref $A $i $i))
                   (sum (&= $i $1) $n (mref $B $i $i)))
               (LC $c (&tr $A) (&tr $B)))))
   ((example #:n "20")
    "令" $V "是所有从域" $F "到自身的多项式函数构成的空间. 令" $t "是" $F "的一个元素. 如果我们定义"
    (MB (&= (app $L_t $p) (app $p $t)))
    "那么" $L_t "是一个" $V "上的线性泛函. 人们经常这样描述这个泛函, 对于每个" $t
    ", &quot;在" $t "处求值&quot;是一个多项式函数空间上的线性泛函. 或许我们应该指出, 在这个例子里"
    "多项式函数实际上并不发挥任何作用, 对于所有从" $F "到" $F "的函数构成的空间, 在" $t
    "处求值同样也是一个线性泛函.")
   ((example #:n "21")
    "这或许是数学中最重要的线性泛函. 令" (li0 $a $b) "是实轴上的一个闭区间, " (app $C (li0 $a $b))
    "是" (li0 $a $b) "上的连续实值函数构成的空间, 那么"
    (MB (&= (app $L $g) (integral $a $b (app $g $t) $t)))
    "定义了一个" (app $C (li0 $a $b)) "上的线性泛函" $L ".")
   (P "如果" $V "是一个向量空间, 那么所有" $V "上的线性泛函自然地构成了一个向量空间, 此即"
      (&L $V $F) ", 我们记作" V* "并将其称为" $V "的对偶空间:"
      (MB (&= V* (&L $V $F)) "."))
   (P "如果" $V "是有限维的, 那么我们可以得到一个对于对偶空间" V*
      "相当显式的描述. 从定理5我们知道了一件关于" V* "的事情, 即"
      (MB (&= (&dim V*) (&dim $V)) ".")
      "令" basis:def "是" $V "的一个基. 根据定理1, (对于每个" $i
      ")存在唯一的" $V "上的线性泛函" $f_i "满足"
      (MB (&= (app $f_i $alpha_j) δij) ".")
      "用这种方法我们从" $BBB "得到了" $n "个不同的" $V "上的线性泛函" (&cm $f_1 $..h $f_n)
      ". 这些泛函也是线性无关的, 因为若设"
      (MB (&= $f (sum (&= $i $1) $n (&i* $c_i $f_i))))
      "那么"
      (MB (deriv (app $f $alpha_j)
                 (sum (&= $i $1) $n (&i* $c_i (app $f_i $alpha_j)))
                 (sum (&= $i $1) $n (&i* $c_i δij))
                 $c_j))
      "特别地, 如果" $f "是零泛函, 那么对于每个" $j "有" (&= (app $f $alpha_j) $0)
      ", 因此标量" $c_j "都是" $0 ". 现在" (&cm $f_1 $..h $f_n) "是" $n
      "个线性无关的泛函, 而且我们知道" V* "的维数是" $n ", 那么"
      (&= (&* $BBB) (setE $f_1 $..h $f_n)) "必然是" V* "的一个基, 其被称为"
      $BBB "的对偶基.")
   ((theorem #:n "15")
    "令" $V "是域" $F "上的一个有限维向量空间, 令" basis:def
    "是" $V "的一个基. 那么, 存在唯一的" V* "的对偶基" (&= (&* $BBB) (setE $f_1 $..h $f_n))
    ", 其满足" (&= (app $f_i $alpha_j) δij) ". 对于每个" $V "上的线性泛函" $f ", 我们有"
    (MB (&= $f (sum (&= $i $1) $n (&i* (app $f $alpha_i) $f_i))))
    "以及对于每个" $V "中的" $alpha ", 我们有"
    (MB (&= $alpha (sum (&= $i $1) $n (&i* (app $f_i $alpha) $alpha_i))) "."))
   ((proof)
    "上面我们已经说明了存在唯一的基与" $BBB "&quot;对偶&quot;. 如果" $f "是一个" $V "上的线性泛函, 那么"
    $f "即是" $f_i "的某个线性组合, 并且我们观察到标量" $c_j "必然由" (&= $c_j (app $f $alpha_j))
    "给出. 类似地, 如果"
    (MB (&= $alpha (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
    "是" $V "的一个向量, 那么"
    (MB (deriv (app $f_j $alpha)
               (sum (&= $i $1) $n (&i* $x_i (app $f_j $alpha_i)))
               (sum (&= $i $1) $n (&i* $x_i δij))
               $x_j))
    "因此" $alpha "作为" $alpha_i "的线性组合的唯一表达为"
    (MB (&= $alpha (sum (&= $i $1) $n (&i* (app $f_i $alpha) $alpha_i))) "."))
   (P "上面这个式子给我们提供了一种刻画对偶基的绝佳方式. 它是说, 如果"
      basis:def "是" $V "的一个有序基, 并且"
      (&= (&* $BBB) (setE $f_1 $..h $f_n)) "是其对偶基, 那么" $f_i "就恰是那个赋予" $V
      "中的向量" $alpha "相对于有序基" $BBB "的第" $i "个坐标的函数. 因此, 我们也可以将"
      $f_i "称为" $BBB "的坐标函数. 定理15实际上告诉了我们以下事实: 如果" $f "在" V*
      "中而令" (&= (app $f $alpha_i) $a_i) ", 那么当"
      (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)))
      "时, 我们有"
      (MB (&= (app $f $alpha) (LC0 $a_1 $x_1 $a_n $x_n)) ".")
      "换言之, 如果我们选定了" $V "的一个有序基" $BBB "并描述" $V "中的每个向量以其相对于"
      $BBB "的" $n "元坐标组" (tu0 $x_1 $..h $x_n) ", 那么每个" $V "上的线性泛函都具有"
      (&= (app $f $alpha) (LC0 $a_1 $x_1 $a_n $x_n)) "的形式. 这是例子18的自然泛化, 其为"
      (&= $V $F^n) "和" (&= $BBB (setE $epsilon_1 $..h $epsilon_n)) "的特别情形.")
   ((example #:n "22")
    "令" $V "是所有从" $RR "到" $RR "的次数小于等于" $2 "的多项式函数构成的向量空间, 令"
    (&cm $t_1 $t_2 $t_3) "是三个不同的实数, 令"
    (MB (&= (app $L_i $p) (app $p $t_i)) ".")
    "那么, " (&cm $L_1 $L_2 $L_3) "是" $V "上的线性泛函. 这些线性泛函是线性无关的, 因为若设"
    (MB (&= $L (LC $c_1 $L_1 $c_2 $L_2 $c_3 $L_3)))
    "当" (&= $L $0) "时, 即对于每个" $V "中的" $p "都有" (&= (app $L $p) $0)
    ", 那么应用" $L "于特定的多项式&quot;函数&quot;" (&cm $1 $x $x^2) ", 我们就得到"
    (MB (Ttle (Choice ($c_1 $+ $c_2 $+ $c_3 $= $0)
                      ((&i* $t_1 $c_1) $+ (&i* $t_2 $c_2) $+ (&i* $t_3 $c_3) $= $0)
                      ((&i* (_^ $t $1 $2) $c_1)
                       $+ (&i* (_^ $t $2 $2) $c_2)
                       $+ (&i* (_^ $t $3 $2) $c_3) $= $0))))
    "从中我们得到" (&= $c_1 $c_2 $c_3 $0) ", 因为(根据简单的计算可知)矩阵"
    (MB (Mat ($1 $1 $1) ($t_1 $t_2 $t_3) ((_^ $t $1 $2) (_^ $t $2 $2) (_^ $t $3 $2))))
    "在" (&cm $t_1 $t_2 $t_3) "互异时是可逆的. 既然" $L_i "是线性无关的并且" $V "的维数是"
    $3 ", 这些泛函构成了" V* "的一个基. 它是什么" $V "的基的对偶呢? 这样一个" $V
    "的基" (setE $p_1 $p_2 $p_3) "必然满足"
    (MB (&= (app $L_i $p_j) δij))
    "或者说"
    (MB (&= (app $p_j $t_i) δij) ".")
    "很容易看出这些多项式函数应该是"
    (MB (&cm (&= (app $p_1 $x)
                 (~ (&i* (@- $x $t_2) (@- $x $t_3))
                    (&i* (@- $t_1 $t_2) (@- $t_1 $t_3))))
             (&= (app $p_2 $x)
                 (~ (&i* (@- $x $t_1) (@- $x $t_3))
                    (&i* (@- $t_2 $t_1) (@- $t_2 $t_3))))
             (&= (app $p_3 $x)
                 (~ (&i* (@- $x $t_1) (@- $x $t_2))
                    (&i* (@- $t_3 $t_1) (@- $t_3 $t_2))))) ".")
    $V "的基" (setE $p_1 $p_2 $p_3) "是有趣的, 因为根据定理15, 对于每个" $V "中的" $p "我们有"
    (MB (&= $p (LC (app $p $t_1) $p_1 (app $p $t_2) $p_2 (app $p $t_3) $p_3)) ".")
    "因此, 如果" (&cm $c_1 $c_2 $c_3) "是任意的实数, 那么恰存在唯一的" $RR "上的次数至多为" $2
    "的多项式函数" $p "满足" (&cm (&= (app $p $t_j) $c_j) (&= $j (&cm $1 $2 $3)))
    ". 这个多项式函数为" (&= $p (LC $c_1 $p_1 $c_2 $p_2 $c_3 $p_3)) ".")
   (P "现在让我们来讨论线性泛函和子空间之间的关系. 如果" $f "是一个非零的线性泛函, 那么" $f
      "的秩就是" $1 ", 因为其像是标量域的非零子空间, 必然是标量域本身. 如果潜在的空间" $V
      "是有限维的, 那么秩加零化度定理 (定理2) 告诉我们零空间" $N_f "的维数"
      (MB (&= (&dim $N_f) (&- (&dim $V) $1)) "."))
   (P "在一个" $n "维空间中, 具有" (&- $n $1) "维的子空间被称为超空间. 这样的空间有时也被称为"
      "超平面或者余维数为" $1 "的子空间. 每个超空间都是某个线性泛函的零空间吗? 答案很容易看出来是"
      "yes. 而且, 证明以下事实也并不更加困难. " $n "维空间的每个" $d "维子空间都是" (@- $n $d)
      "个线性泛函的零空间之交. (下面的定理16)")
   ((definition)
    "如果" $V "是域" $F "上的向量空间而" $S "是" $V "的一个子集, " $S "的零化子" $S^0
    "是" $V "上所有这样的线性泛函" $f "构成的集合, 其对于每个" $S "中的" $alpha "有"
    (&= (app $f $alpha) $0) ".")
   (P "读者应该很容易看出" $S^0 "是" V* "的子空间, 不论" $S "是否是" $V "的子空间. 如果"
      $S "仅包含零向量, 那么" (&= $S^0 V*) ". 如果" (&= $S $V) ", 那么" $S^0
      "是" V* "的零子空间. (在" $V "是有限维的情况下很容易看出来.)")
   ((theorem #:n "16")
    "令" $V "是域" $F "上的有限维向量空间, 令" $W "是" $V "的子空间, 那么"
    (MB (&= (&+ (&dim $W) (&dim $W^0)) (&dim $V)) "."))
   ((proof)
    "令" $k "是" $W "的维数而" (setE $alpha_1 $..h $alpha_k) "是" $W "的一个基. 选择"
    $V "中向量" (&cm (_ $alpha (&+ $k $1)) $..h $alpha_n) "使得" (setE $alpha_1 $..h $alpha_n)
    "是" $V "的一个基. 令" (setE $f_1 $..h $f_n) "是" V* "的基, 其对偶于这个" $V
    "的基. 我们现在证明" (setE (_ $f (&+ $k $1)) $..h $f_n) "是零化子" $W^0
    "的一个基. 显然对于" (&>= $i (&+ $k $1)) "我们知道" $f_i "属于" $W^0 ", 因为"
    (MB (&= (app $f_i $alpha_j) δij))
    "于是当" (&>= $i (&+ $k $1)) "且" (&<= $j $k) "时有" (&= δij $0)
    ". 从中我们可知当" $alpha "是" (&cm $alpha_1 $..h $alpha_k) "的线性组合时, 对于"
    (&>= $i (&+ $k $1)) "有" (&= (app $f_i $alpha) $0) ". 因为泛函"
    (setE (_ $f (&+ $k $1)) $..h $f_n) "是线性无关的, 所以剩下来我们必须要做的就是证明它们可以张成"
    $W^0 ". 设" $f "在" V* "中, 既然"
    (MB (&= $f (sum (&= $i $1) $n (&i* (app $f $alpha_i) $f_i))) ",")
    "于是若" $f "在" $W^0 "中, 我们有" (&= (app $f $alpha_i) $0) "对于" (&<= $i $k) "成立, 那么"
    (MB (&= $f (sum (&= $i (&+ $k $1)) $n (&i* (app $f $alpha_i) $f_i))) ".")
    "我们证明了如果" (&= (&dim $W) $k) "而" (&= (&dim $V) $n) ", 那么" (&= (&dim $W^0) (&- $n $k)) ".")
   ((corollary)
    "如果" $W "是" $n "维向量空间" $V "的" $k "维子空间, 那么" $W "是" $V "中" (@- $n $k)
    "个超空间之交.")
   ((proof)
    "这是定理16证明的推论而不是定理16本身的推论. 在这个证明的记号下, " $W "恰是满足"
    (&cm (&= (app $f_i $alpha) $0) (&= $i (&cm (&+ $k $1) $..h $n))) "的所有向量" $alpha
    "的集合. 在" (&= $k (&- $n $1)) "的情形, " $W "即是" $f_n "的零空间.")
   ((corollary)
    "如果" $W_1 "和" $W_2 "是某个有限维向量空间的子空间, 那么" (&= $W_1 $W_2) "当且仅当"
    (&= (_^ $W $1 $0) (_^ $W $2 $0)) ".")
   ((proof)
    "如果" (&= $W_1 $W_2) ", 那么显然有" (&= (_^ $W $1 $0) (_^ $W $2 $0)) ". 如果"
    (&!= $W_1 $W_2) ", 那么其中之一的子空间包含有不在另一个子空间的向量. 不妨设向量" $alpha
    "在" $W_2 "之中但不在" $W_1 "中. 根据前面的推论 (或者定理16的证明), 存在一个线性泛函"
    $f "满足对于所有的" $W_1 "中" $beta "有" (&= (app $f $beta) $0) "但" (&!= (app $f $alpha) $0)
    ", 那么" $f "在" (_^ $W $1 $0) "之中但不在" (_^ $W $2 $0) "中, 即"
    (&!= (_^ $W $1 $0) (_^ $W $2 $0)) ".")
   (P "接下来的一节我们将给出这两个推论的不同的证明. 第一个推论是说, 如果我们挑选了空间的某个有序基, "
      "那么每个" $k "维的子空间都可以由" (@- $n $k) "个相对于基的坐标上的齐次线性条件刻画.")
   (P "让我们从线性泛函的视角简要看看齐次线性方程组. 设我们有一个想要求解的齐次线性方程组"
      (MB (Choice ((&i* (mref $A $1 $1) $x_1) $+ $..c $+ (&i* (mref $A $1 $n) $x_n) $= $0)
                  ($..v $ $ $ $..v $ $)
                  ((&i* (mref $A $m $1) $x_1) $+ $..c $+ (&i* (mref $A $m $n) $x_n) $= $0)))
      "如果我们令" (&cm $f_i (&= $i (&cm $1 $..h $m))) "是由"
      (MB (&= (appl $f_i $x_1 $..h $x_n) (LC0 (mref $A $i $1) $x_1 (mref $A $i $n) $x_n)))
      "定义的" $F^n "上的线性泛函, 那么其实我们就是在寻找一个" $F^n "的子空间, 其由所有满足"
      (MB (&cm (&= (app $f_i $alpha) $0) (&= $i (&cm $1 $..h $m))))
      "的" $alpha "构成. 换言之, 我们在寻找被" (&cm $f_1 $..h $f_m) "零化的子空间. 对于系数矩阵"
      "进行行规约为我们提供了找出这个子空间的系统方法. " $n "元组"
      (tu0 (mref $A $i $1) $..h (mref $A $i $n)) "给出了线性泛函" $f_i "相对于与" $F^n
      "的标准基对偶的基的坐标. 系数矩阵的行空间因此可被视为由" (&cm $f_1 $..h $f_m)
      "张成的线性泛函的空间, 而解空间是被这个泛函的空间零化的子空间.")
   (P "现在我们或许可以从&quot;对偶&quot;的角度看待线性方程组, 即给定" $F^n "中的" $m "个向量"
      (MB (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n))))
      "我们希望寻找由这些向量张成的子空间的零化子. 既然" $F^n "上一个典型的线性泛函具有形式"
      (MB (&= (appl $f $x_1 $..h $x_n) (LC0 $c_1 $x_1 $c_n $x_n)))
      "那么" $f "在这个零化子之中的条件即"
      (MB (&cm (&= (sum (&= $j $1) $n (&i* (mref $A $i $j) $c_j)) $0)
               (&= $i (&cm $1 $..h $m))))
      "换言之, " (tu0 $c_1 $..h $c_n) "是线性方程组" AX=0 "的一个解. 从此观点来看, 行规约为我们提供了"
      "一种系统性的方法来寻找由给定的" $F^n "的有限子集张成的子空间的零化子.")
   ((example #:n "23")
    "现在我们给出" $RR^4 "上的三个线性泛函:"
    (MB (set-attr*
         (&Table
          ((appl $f_1 $x_1 $x_2 $x_3 $x_4) $= (&+ $x_1 (&i* $2 $x_2) (&i* $2 $x_3) $x_4))
          ((appl $f_2 $x_1 $x_2 $x_3 $x_4) $= (LC $2 $x_2 $x_4))
          ((appl $f_3 $x_1 $x_2 $x_3 $x_4) $= (&+ (&- (&i* $-2 $x_1) (&i* $4 $x_3)) (&i* $3 $x_4))))
         'columnalign "left"))
    "它们所零化的子空间可以通过显式寻找矩阵"
    (MB (&= $A (Mat ($1 $2 $2 $1) ($0 $2 $0 $1) ($-2 $0 $-4 $3))))
    "的行简化阶梯形式得到. 经过简单的计算, 或者看看第2章的例子21, 我们知道"
    (MB (&= $R (Mat ($1 $0 $2 $0) ($0 $1 $0 $0) ($0 $0 $0 $1))) ".")
    "因此, 线性泛函"
    (MB (set-attr*
         (&Table
          ((appl $g_1 $x_1 $x_2 $x_3 $x_4) $= (&+ $x_1 (&i* $2 $x_3)))
          ((appl $g_2 $x_1 $x_2 $x_3 $x_4) $= $x_2)
          ((appl $g_3 $x_1 $x_2 $x_3 $x_4) $= $x_4))
         'columnalign "left"))
    "与" (&cm $f_1 $f_2 $f_3) "张成了相同的" (&* (@ $RR^4)) "的子空间, 并且零化了相同的"
    $RR^4 "的子空间. 被零化的子空间由所有满足"
    (MB (&cm (&= $x_1 (&i* $-2 $x_3)) (&= $x_2 $x_4 $0)))
    "的向量构成.")
   ((example #:n "24")
    "令" $W "是由"
    (MB (&cm (&= $alpha_1 (tu0 $2 $-2 $3 $4 $-1))
             (&= $alpha_2 (tu0 $-1 $1 $2 $5 $2))
             (&= $alpha_3 (tu0 $0 $0 $-1 $-2 $3))
             (&= $alpha_4 (tu0 $1 $-1 $2 $3 $0))))
    "张成的" $RR^5 "的子空间. 人们该如何描述" $W^0 ", 即" $W "的零化子呢? 让我们构造一个以"
    (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "为行向量的矩阵" $A ", 并找出行等价于" $A
    "的行简化阶梯矩阵" $R ":"
    (MB (&-> (&= $A (Mat ($2 $-2 $3 $4 $-1)
                         ($-1 $1 $2 $5 $2)
                         ($0 $0 $-1 $-2 $3)
                         ($1 $-1 $2 $3 $0)))
             (&= $R (Mat ($1 $-1 $0 $-1 $0)
                         ($0 $0 $1 $2 $0)
                         ($0 $0 $0 $0 $1)
                         ($0 $0 $0 $0 $0)))) ".")
    "如果" $f "是" $RR^5 "上的一个线性泛函:"
    (MB (&= (appl $f $x_1 $..h $x_5) (sum (&= $j $1) $5 (&i* $c_j $x_j))))
    "那么" $f "在" $W^0 "中当且仅当" (&cm (&= (app $f $alpha_i) $0) (&= $i (&cm $1 $2 $3 $4)))
    ", 即当且仅当"
    (MB (&cm (&= (sum (&= $j $1) $5 (&i* (mref $A $i $j) $c_j)) $0) (&<= $1 $i $4)) ".")
    "这等价于"
    (MB (&cm (&= (sum (&= $j $1) $5 (&i* (mref $R $i $j) $c_j)) $0) (&<= $1 $i $3)))
    "或者"
    (MB (set-attr*
         (&Table
          ((&- $c_1 $c_2 $c_4) $= $0)
          ((&+ $c_3 (&i* $2 $c_4)) $= $0)
          ($c_5 $= $0))
         'columnalign "right"))
    "我们可以通过给" $c_2 "和" $c_4 "赋任意的值以得到所有这样的线性泛函" $f ", 例如令" (&= $c_2 $a) "和"
    (&= $c_4 $b) ", 然后找出相应的" (&cm (&= $c_1 (&+ $a $b)) (&= $c_3 (&i* $-2 $b)) (&= $c_5 $0))
    ". 于是, " $W^0 "由所有具有形式"
    (MB (&= (appl $f $x_1 $x_2 $x_3 $x_4 $x_5)
            (&+ (&- (LC (@+ $a $b) $x_1 $a $x_2) (&i* $2 $b $x_3)) (&i* $b $x_4))))
    "的线性泛函" $f "构成. " $W^0 "的维数是" $2 ", 而" $W^0 "的一个基" (setE $f_1 $f_2)
    "可由先令" (&cm (&= $a $1) (&= $b $0)) "再令" (&cm (&= $a $0) (&= $b $1)) "得到:"
    (MB (set-attr*
         (&Table
          ((appl $f_1 $x_1 $..h $x_5) $= (&+ $x_1 $x_2))
          ((appl $f_2 $x_1 $..h $x_5) $= (: $x_1 $- (&i* $2 $x_3) $+ $x_4)))
         'columnalign "left"))
    "上面" $W^0 "中一般的" $f "即" (&= $f (LC $a $f_1 $b $f_2)) ".")
   ((exercise #:n "1")
    "在" $RR^3 "中, 令"
    (&cm (&= $alpha_1 (tu0 $1 $0 $1))
         (&= $alpha_2 (tu0 $0 $1 $-2))
         (&= $alpha_3 (tu0 $-1 $-1 $0)))
    "."
    (Ol #:attr* '((type "a"))
        (Li "如果" $f "是" $RR^3 "上满足"
            (MB (&cm (&= (app $f $alpha_1) $1)
                     (&= (app $f $alpha_2) $-1)
                     (&= (app $f $alpha_3) $3)))
            "的线性泛函, 并且" (&= $alpha (tu0 $a $b $c)) ", 找出" (app $f $alpha) ".")
        (Li "显式描述" $RR^3 "上满足"
            (MB (&= (app $f $alpha_1) (app $f $alpha_2) $0)
                "但是" (&!= (app $f $alpha_3) $0))
            "的线性泛函" $f ".")
        (Li "令" $f "是任意的满足"
            (MB (&= (app $f $alpha_1) (app $f $alpha_2) $0)
                "并且" (&!= (app $f $alpha_3) $0))
            "的线性泛函. 如果" (&= $alpha (tu0 $2 $3 $-1)) ", 表明"
            (&!= (app $f $alpha) $0) ".")))
   ((exercise #:n "2")
    "令" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "是" $CC^3 "的基, 其由"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $1 $1))
             (&= $alpha_3 (tu0 $2 $2 $0))))
    "定义. 找出" $BBB "的对偶基.")
   ((exercise #:n "3")
    "如果" $A "和" $B "是域" $F "上的" n*n "矩阵, 证明"
    (&= (&trace (&i* $A $B)) (&trace (&i* $B $A)))
    ", 接着证明相似矩阵有着相同的迹.")
   ((exercise #:n "4")
    "令" $V "是从" $RR "到" $RR "的所有次数小于等于" $2 "的多项式函数" $p ":"
    (MB (&= (app $p $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "构成的向量空间. 定义三个" $V "上的线性泛函如下:"
    (let ((fdef (lambda (n b) (&= (app (_ $f n) $p) (integral $0 b (app $p $x) $x)))))
      (MB (&cm (fdef $1 $1) (fdef $2 $2) (fdef $3 $-1)) "."))
    "证明" (setE $f_1 $f_2 $f_3) "是" $V "的基, 通过找出以其为对偶的" $V "的基.")
   ((exercise #:n "5")
    "如果" $A "和" $B "是" n*n "的复矩阵, 证明" (&= (&- (&i* $A $B) (&i* $B $A)) $I)
    "是不可能的.")
   ((exercise #:n "6")
    "令" $m "和" $n "是正整数而" $F "是一个域. 令" (&cm $f_1 $..h $f_m) "是" $F^n
    "上的线性泛函. 对于" $F^n "中的" $alpha ", 定义"
    (MB (&= (ap $T $alpha) (tu0 (app $f_1 $alpha) $..h (app $f_m $alpha))) ".")
    "证明" $T "是一个从" $F^n "到" $F^m "的线性变换, 接着表明每个从" $F^n "到" $F^m
    "的线性变换都具有以上形式, 对于特定的" (&cm $f_1 $..h $f_m) "而言.")
   ((exercise #:n "7")
    "令" (&= $alpha_1 (tu0 1 0 -1 2)) "和" (&= $alpha_2 (tu0 2 3 1 1)) ", 令" $W
    "是" $alpha_1 "和" $alpha_2 "张成的" $RR^4 "的子空间. 哪些线性泛函" $f ":"
    (MB (&= (appl $f $x_1 $x_2 $x_3 $x_4)
            (LC $c_1 $x_1 $c_2 $x_2 $c_3 $x_3 $c_4 $x_4)))
    "在" $W "的零化子之中呢?")
   ((exercise #:n "8")
    "令" $W "是" $RR^5 "的子空间, 其由下列向量张成:"
    (MB (&cm (&= $alpha_1 (&+ $epsilon_1 (&i* $2 $epsilon_2) $epsilon_3))
             (&= $alpha_2 (&+ $epsilon_2 (&i* $3 $epsilon_3) (&i* $3 $epsilon_4) $epsilon_5))
             (&= $alpha_3 (&+ $epsilon_1 (&i* $4 $epsilon_2) (&i* $6 $epsilon_3)
                              (&i* $4 $epsilon_4) $epsilon_5))) ".")
    "找出" $W^0 "的一个基.")
   ((exercise #:n "9")
    "令" $V "是实数域上的所有" 2*2 "矩阵的向量空间, 令"
    (MB (&= $B (Mat ($2 $-2) ($-1 $1))) ".")
    "令" $W "是" $V "的子空间, 其由所有满足" (&= (&i* $A $B) $0) "的矩阵" $A "构成. 令" $f
    "是" $V "上的线性泛函, 其在" $W "的零化子之中. 设" (&= (app $f $I) $0) "且"
    (&= (app $f $C) $3) ", 其中" $I "是" 2*2 "的恒等矩阵而"
    (MB (&= $C (Mat ($0 $0) ($0 $1))) ".")
    "找出" (app $f $B) ".")
   ((exercise #:n "10")
    "令" $F "是复数域的一个子域. 我们通过"
    (MB (&cm (&= (appl $f_k $x_1 $..h $x_n) (sum (&= $j $1) $n (&i* (@- $k $j) $x_j)))
             (&<= $1 $k $n)))
    "定义" $F^n "上的" $n "个线性泛函, 其中" (&>= $n $2) ". 由" (&cm $f_1 $..h $f_n)
    "零化的子空间维数是多少呢?")
   ((exercise #:n "11")
    "令" $W_1 "和" $W_2 "是有限维向量空间" $V "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (^ (@+ $W_1 $W_2) $0) (&cap (_^ $W $1 $0) (_^ $W $2 $0))) ".")
        (Li "证明" (&= (^ (@ (&cap $W_1 $W_2)) $0) (&+ (_^ $W $1 $0) (_^ $W $2 $0))) ".")))
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $W "是" $V "的一个子空间. 如果" $f
    "是" $W "上的线性泛函, 证明存在一个" $V "上的线性泛函" $g "满足对于每个" $W "中的" $alpha
    "有" (&= (app $g $alpha) (app $f $alpha)) ".")
   ((exercise #:n "13")
    "令" $F "是复数域的一个子域. 令" $V "是域" $F "上任意的向量空间. 设" $f "和" $g
    "是" $V "上的线性泛函, 并且满足由" (&= (app $h $alpha) (&i* (app $f $alpha) (app $g $alpha)))
    "定义的函数" $h "仍然是" $V "上的线性泛函. 证明" (&= $f $0) "或" (&= $g $0) ".")
   ((exercise #:n "14")
    "令" $F "是特征为零的域. 令" $V "是域" $F "上的一个有限维向量空间. 如果"
    (&cm $alpha_1 $..h $alpha_m) "是" $V "中有限多个向量, 并且每个都异于零向量, 证明存在" $V
    "上的线性泛函" $f "满足"
    (MB (&cm (&!= (app $f $alpha_i) $0) (&= $i (&cm $1 $..h $m))) "."))
   ((exercise #:n "15")
    "根据练习3, 相似的矩阵拥有相同的迹. 因此, 我们可以将有限维空间上的线性算子的迹定义为其在"
    "任意有序基下的矩阵的迹. 这是良定的, 因为所有这样的表示矩阵都是相似的." (Br)
    "现在令" $V "是域" $F "上的" 2*2 "矩阵的向量空间, 令" $P "是一个固定的" 2*2 "矩阵. 令"
    $T "是由" (&= (app $T $A) (&i* $P $A)) "定义的" $V "上的线性算子. 证明"
    (&= (&trace $T) (&i* $2 (&trace $P))) ".")
   ((exercise #:n "16")
    "证明" n*n "矩阵上的迹泛函在以下意义上唯一. 如果" $W "是域" $F "上的" n*n
    "矩阵的空间, 如果" $f "是" $W "上满足对于" $W "中的每个" $A "和" $B "有"
    (&= (app $f (&i* $A $B)) (app $f (&i* $B $A))) "的线性泛函, 那么" $f
    "是迹函数的标量倍数. 另外, 如果" (&= (app $f $I) $n) ", 那么" $f "就是迹函数.")
   ((exercise #:n "17")
    "令" $W "是域" $F "上的" n*n "矩阵的空间. 令" $W_0 "是由所有具有形式" (&= $C (&- (&i* $A $B) (&i* $B $A)))
    "的矩阵" $C "张成的子空间. 证明" $W_0 "恰好就是迹为零的矩阵构成的子空间. (提示: 迹为零的矩阵的空间"
    "的维数是什么? 使用矩阵&quot;单元&quot;, 即恰具有一个非零元素的矩阵, 来构造足够多具有"
    (&- (&i* $A $B) (&i* $B $A)) "形式的线性无关的矩阵.)")
   (H3 "第3.6节 二次对偶")
   (P "上一节我们还有一个没有回答的问题, 即是否每个" V* "的基都是某个" $V "的基的对偶. "
      "一种回答这个问题的方式是考虑" V** ", 即" V* "的对偶空间.")
   (P "如果" $alpha "是" $V "中的一个向量, 那么" $alpha "导出了一个" V* "上的线性泛函, 即"
      (MB (&cm (&= (app $L_alpha $f) (app $f $alpha)) (&in $f V*)) ".")
      $L_alpha "是线性的这一事实不过就是对于" V* "中的线性泛函的定义的重述:"
      (MB (deriv (app $L_alpha (LC $c $f $g))
                 (app (@LC $c $f $g) $alpha)
                 (&+ (app (@i* $c $f) $alpha) (app $g $alpha))
                 (LC $c (app $f $alpha) (app $g $alpha))
                 (LC $c (app $L_alpha $f) (app $L_alpha $g))))
      "如果" $V "是有限维的并且" (&!= $alpha $0) ", 那么" (&!= $L_alpha $0) ". 换言之, 存在线性泛函"
      $f "满足" (&!= (app $f $alpha) $0) ". 证明非常简单, 在第3.5节已经给过了: 选择一个" $V "的有序基"
      basis:def ", 其中" (&= $alpha_1 $alpha) ", 令" $f
      "是赋予每个" $V "中向量其在有序基" $BBB "下的坐标的第一分量的线性泛函. [译注: 换句话说, "
      $f "即满足" (&= (app $f $alpha_1) $1) "而" (&cm (&= (app $f $alpha_i) $0) (&<= $2 $i $n))
      "的存在且唯一的那个线性泛函.]")
   ((theorem #:n "17")
    "令" $V "是域" $F "上的一个有限维向量空间. 对于每个" $V "中的向量" $alpha ", 定义"
    (MB (&cm (&= (app $L_alpha $f) (app $f $alpha)) (&in $f V*)) ".")
    "映射" (&\|-> $alpha $L_alpha) "是一个从" $V "到" V** "的同构.")
   ((proof)
    "我们已经证明过对于每个" $alpha "函数" $L_alpha "是线性的了. 设" $alpha "和" $beta
    "在" $V "中而" $c "在" $F "中, 令" (&= $gamma (LC $c $alpha $beta)) ", 那么对于" V* "中的每个" $f "有"
    (MB (deriv (app $L_gamma $f)
               (app $f $gamma)
               (app $f (LC $c $alpha $beta))
               (LC $c (app $f $alpha) (app $f $beta))
               (LC $c (app $L_alpha $f) (app $L_beta $f))
               (app (@LC $c $L_alpha $L_beta) $f)))
    "于是"
    (MB (&= $L_gamma (LC $c $L_alpha $L_beta)) ".")
    "这表明映射" (&\|-> $alpha $L_alpha) "是一个从" $V "到" V** "的线性变换. 这个变换是非奇异的, "
    "因为根据之前的评注, " (&= $L_alpha $0) "当且仅当" (&= $alpha $0) ". 既然" (&\|-> $alpha $L_alpha)
    "是从" $V "到" V** "的非奇异的线性变换, 并且"
    (MB (&= (&dim V**) (&dim V*) (&dim $V)))
    "定理9告诉我们这个变换是可逆的, 因而是一个从" $V "到" V** "的同构.")
   ((corollary)
    "令" $V "是域" $F "上的一个有限维向量空间. 如果" $L "是" $V "的对偶空间" V* "上的一个线性泛函, 那么"
    $V "中存在唯一的向量" $alpha "满足"
    (MB (&= (app $L $f) (app $f $alpha)))
    "对于" V* "中的每个" $f "成立.")
   ((corollary)
    "令" $V "是域" $F "上的一个有限维向量空间. 每个" V* "的基都是某个" $V "的基的对偶.")
   ((proof)
    "令" (&= (&* $BBB) (setE $f_1 $..h $f_n)) "是" V* "的一个基. 根据定理15, 存在" V**
    "的一个基" (setE $L_1 $..h $L_n) "满足"
    (MB (&= (app $L_i $f_j) δij) ".")
    "使用上面的推论, 对于每个" $i "存在" $V "中唯一的向量" $alpha_i "满足"
    (MB (&= (app $L_i $f) (app $f $alpha_i)))
    "对于" V* "中的每个" $f "成立, 即" (&= $L_i (_ $L $alpha_i)) ". 立刻就能得到" (setE $alpha_1 $..h $alpha_n)
    "是" $V "的一个基, 并且" (&* $BBB) "是这个基的对偶.")
   (P "在定理17的观点下, 我们通常将" $alpha "和" $L_alpha "视为等同的, 并称" $V "&quot;是&quot;" V*
      "的对偶空间或者说空间" $V "和" V* "自然地相互对偶. 上面的推论中, 我们描述了该定理是怎样可能有用的. "
      "下面我们给出更进一步的刻画.")
   (P "如果" $E "是" V* "的一个子集, 那么零化子" $E^0 "(从技术上说)是" V** "的一个子集. 如果我们选择"
      "如定理17那样将" $V "和" V** "视为等同的, 那么" $E^0 "是一个" $V "的一个子空间, 即所有满足对于每个"
      $E "中的" $f "有" (&= (app $f $alpha) $0) "的" $V "中向量" $alpha "构成的集合. 在定理16的一个推论"
      "中我们注意到每个子空间" $W "是由其零化子" $W^0 "决定的. 然而是怎样决定的呢? 答案是" $W "是被所有"
      $W^0 "中的" $f "零化的子空间 [译注: 这个也是定理16的推论], 即所有" $W^0 "中的" $f
      "的零空间之交. 在我们现有的零化子的记号下, 这个定理可以被简单地陈述为: " (&= $W (^ (@ $W^0) $0)) ".")
   ((theorem #:n "18")
    "如果" $S "是有限维向量空间" $V "的子集, 那么" (^ (@ $S^0) $0) "是由" $S "张成的子空间.")
   ((proof)
    "令" $W "是由" $S "张成的子空间. 显然" (&= $W^0 $S^0) ". 因此, 我们要证明的是" (&= $W (&00 $W))
    ". 我们已经给出了一个证明, 现在我们给出另一个. 根据定理16, 我们有"
    (MB (&cm (&= (&+ (&dim $W) (&dim $W^0)) (&dim $V))
             (&= (&+ (&dim $W^0) (&dim (&00 $W))) (&dim V*))))
    "既然" (&= (&dim $V) (&dim V*)) ", 于是"
    (MB (&= (&dim $W) (&dim (&00 $W))) ".")
    "因为" $W "是" (&00 $W) "的子空间, 所以我们知道" (&= $W (&00 $W)) ".")
   (P "本节的结果对于任意的向量空间也是成立的. 然而, 证明就需要使用所谓的选择公理 (Axiom of Choice). "
      "我们想避免被卷入对于这个公理的冗长讨论之中, 所以我们不会对于一般的向量空间处理零化子的结果. "
      "然而, 有两个关于一般向量空间上的线性泛函的结果是如此基本, 以至于我们要涵盖它们.")
   (P "令" $V "是一个向量空间. 我们想要定义" $V "中的超空间. 除非" $V "是有限维的, 否则我们不能"
      "通过维数来定义超空间. 但是, 我们可以用以下的方式来表达一个空间" $N "差一个维度就能填满"
      $V "的想法:"
      (Ol (Li $N "是" $V "的一个真子空间;")
          (Li "如果" $W "是一个包含" $N "的子空间, 那么要么" (&= $W $N) "要么" (&= $W $V) "."))
      "条件1和2表达了" $N "是一个真子空间并且没有更大的真子空间, 换言之, " $N "是极大的真子空间.")
   ((definition)
    "如果" $V "是一个向量空间, 那么" $V "中的一个超空间就是" $V "的一个极大的真子空间.")
   ((theorem #:n "19")
    "如果" $f "是向量空间" $V "上的一个非零的线性泛函, 那么" $f "的零空间就是" $V
    "中的一个超空间. 反过来说, 每个" $V "中的超空间都是某个" $V "上(并不唯一的)非零的线性泛函的零空间.")
   ((proof)
    "令" $f "是" $V "上一个非零的线性泛函, 并且" $N_f "是其零空间. 我们令" $alpha "是一个不在"
    $N_f "中的" $V "的向量, 即一个满足" (&!= (app $f $alpha) $0) "的向量. 我们将证明" $V
    "中的每个向量都在" $N_f "和" $alpha "张成的子空间之中. 这个子空间由所有具有形式"
    (MB (&cm (&+ $gamma (&i* $c $alpha)) (&in $gamma $N_f) (&in $c $F)))
    "的向量构成. 令" $beta "是" $V "中的向量, 定义"
    (MB (&= $c (~ (app $f $beta) (app $f $alpha))))
    "这个定义是合理的, 因为" (&!= (app $f $alpha) $0) ". 那么, " (&= $gamma (&- $beta (&i* $c $alpha)))
    "在" $N_f "之中, 因为"
    (MB (deriv (app $f $gamma)
               (app $f (&- $beta (&i* $c $alpha)))
               (&- (app $f $beta) (&i* $c (app $f $alpha)))
               $0))
    "于是" $beta "在由" $N_f "和" $alpha "张成的子空间中." (Br)
    "现在令" $N "是" $V "中的一个超空间. 固定" $alpha "为某个不在" $N "中的向量. 既然" $N
    "是极大的真子空间, 那么由" $N "和" $alpha "张成的子空间就是整个空间" $V ". 因此, 每个" $V
    "中的向量" $beta "都具有形式"
    (MB (&cm (&= $beta (&+ $gamma (&i* $c $alpha))) (&in $gamma $N) (&in $c $F)) ".")
    "向量" $gamma "和标量" $c "是由" $beta "唯一确定的. 如果我们也有"
    (MB (&cm (&= $beta (&+ $gamma^ (&i* $c^ $alpha))) (&in $gamma^ $N) (&in $c^ $F)) ",")
    "那么"
    (MB (&= (&i* (@- $c^ $c) $alpha) (&- $gamma $gamma^)) ".")
    "如果" (&!= (&- $c^ $c) $0) ", 那么" $alpha "就应该在" $N "中了, 因而有" (&= $c^ $c)
    "且" (&= $gamma^ $gamma) ". 另一种表述这个结论的方式如下: 如果" $beta "在" $V
    "中, 那么存在唯一的标量" $c "使得" (&- $beta (&i* $c $alpha)) "在" $N "中. 称这个标量为"
    (app $g $beta) ". 很容易看出来" $g "是" $V "上的一个线性泛函并且" $N "是" $g
    "的零空间.")
   ((lemma)
    "如果" $f "和" $g "是一个向量空间" $V "上的线性泛函, 那么" $g "是" $f "的标量倍数当且仅当"
    $g "的零空间包含" $f "的零空间, 即当且仅当" (&= (app $f $alpha) $0) "可以推出"
    (&= (app $g $alpha) $0) ".")
   ((proof)
    "如果" (&= $f $0) ", 那么也有" (&= $g $0) ", " $g "平凡地是" $f "的标量倍数. 设"
    (&!= $f $0) ", 于是其零空间" $N_f "是" $V "中的一个超空间. 选择" $V "中的某个向量" $alpha
    "使得" (&!= (app $f $alpha) $0) ", 并且令"
    (MB (&= $c (~ (app $g $alpha) (app $f $alpha))) ".")
    "线性泛函" (&= $h (&- $g (&i* $c $f))) "在" $N_f "上是" $0 ", 因为" $f "和" $g "在其上都是"
    $0 ". 并且, 我们还有" (&= (app $h $alpha) (&- (app $g $alpha) (&i* $c (app $f $alpha))) $0)
    ". 因此, " $h "在由" $N_f "和" $alpha "张成的子空间上都是" $0 ", 而这个子空间就是" $V
    ". 于是, 我们得出结论" (&= $h $0) ", 即" (&= $g (&i* $c $f)) ".")
   ((theorem #:n "20")
    "令" (&cm $g $f_1 $..h $f_r) "是向量空间" $V "上的线性泛函, 设其相应的零空间分别为"
    (&cm $N $N_1 $..h $N_r) ". 那么, " $g "是" (&cm $f_1 $..h $f_r) "的线性组合当且仅当 (if and only if) "
    $N "包含交集" (&cap $N_1 $..c $N_r) ".")
   ((proof)
    "如果" (&= $g (LC0 $c_1 $f_1 $c_r $f_r)) "且对于每个" $i "有" (&= (app $f_i $alpha) $0)
    ", 那么显然" (&= (app $g $alpha) $0) ". 因此, " $N "包含" (&cm $N $N_1 $..h $N_r) "." (Br)
    "我们将通过数字" $r "上的归纳证明另一个方向 (定理的&quot;if&quot;一半). 之前的引理处理了"
    (&= $r $1) "的情况. 设我们已知结果对于" (&= $r (&- $k $1)) "成立, 并且令" (&cm $f_1 $..h $f_k)
    "是分别以" (&cm $N_1 $..h $N_k) "为零空间的线性泛函, 满足" (&cap $N_1 $..c $N_k) "是" $N
    "的子集, " $N "即" $g "的零空间. 令" (&cm $g^ (_^ $f $1 $prime) $..h (_^ $f (&- $k $1) $prime))
    "分别是" (&cm $g $f_1 $..h (_ $f (&- $k $1))) "于子空间" $N_k "上的限制, 那么"
    (&cm $g^ (_^ $f $1 $prime) $..h (_^ $f (&- $k $1) $prime)) "是向量空间" $N_k "上的线性泛函. "
    "而且, 如果" $alpha "是一个" $N_k "中的向量并有"
    (&cm (&= (app (_^ $f $i $prime) $alpha) $0) (&= $i (&cm $1 $..h (&- $k $1))))
    ", 那么" $alpha "在" (&cap $N_1 $..c $N_k) "之中, 因而有" (&= (app $g^ $alpha) $0)
    ". 根据归纳 (" (&= $r (&- $k $1)) "的情形), 存在标量" $c_i "满足"
    (MB (&= $g^ (LC0 $c_1 (_^ $f $1 $prime) (_ $c (&- $k $1)) (_^ $f (&- $k $1) $prime))) ".")
    "现在令"
    (MB (&= $h (&- $g (sum (&= $i $1) (&- $k $1) (&i* $c_i $f_i)))) ",")
    "那么" $h "是一个" $V "上的线性泛函, 并且" $h "的定义告诉我们对于每个" $N_k "中的" $alpha
    "有" (&= (app $h $alpha) $0) ". 根据之前的引理, " $h "是" $f_k "的一个标量倍数. 如果"
    (&= $h (&i* $c_k $f_k)) ", 那么"
    (MB (&= $g (sum (&= $i $1) $k (&i* $c_i $f_i))) "."))
   ((exercise #:n "1")
    "令" $n "是一个正整数而" $F "是一个域. 令" $W "是" $F^n "中所有满足"
    (&= (&+ $x_1 $..c $x_n) $0) "的" (tu0 $x_1 $..h $x_n) "构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W^0 "由所有具有形式"
            (MB (&= (appl $f $x_1 $..h $x_n) (&i* $c (sum (&= $j $1) $n $x_j))))
            "的线性泛函" $f "构成.")
        (Li "证明" $W "的对偶空间" W* "可被&quot;自然地&quot;等同为" $F^n
            "上所有满足" (&= (&+ $c_1 $..c $c_n) $0) "的线性泛函"
            (MB (&= (appl $f $x_1 $..h $x_n) (LC0 $c_1 $x_1 $c_n $x_n)))
            "构成的集合.")))
   ((exercise #:n "2")
    "运用定理20来证明以下事实. 如果" $W "是一个有限维向量空间" $V "的子空间, 并且如果"
    (setE $g_1 $..h $g_r) "是" $W^0 "任意的基, 那么"
    (MB (&= $W (&Cap (&= $i $1) $r (_ $N $g_i))) "."))
   ((exercise #:n "3")
    "令" $S "是一个集合, " $F "是一个域, 以及" (app $V (&\; $S $F)) "是所有从" $S
    "到" $F "的函数构成的空间:"
    (MB (&cm (&= (app (@+ $f $g) $x) (&+ (app $f $x) (app $g $x)))
             (&= (app (@i* $c $f) $x) (&i* $c (app $f $x)))) ".")
    "令" $W "是" (app $V (&\; $S $F)) "任意的" $n "维子空间. 证明存在" $S "中的点"
    (&cm $x_1 $..h $x_n) "和" $W "中的函数" (&cm $f_1 $..h $f_n) "满足"
    (&= (app $f_i $x_j) δij) ".")
   (H3 "第3.7节 线性变换的转置")
   (P "设我们有两个域" $F "上的向量空间" $V "和" $W ", 以及一个从" $V "到" $W
      "的线性变换" $T ", 那么" $T "按照以下方式导出了一个从" W* "到" V* "的线性变换. 设"
      $g "是" $W "上的一个线性泛函, 对于每个" $V "中的" $alpha ", 令"
      (MB (&= (app $f $alpha) (app $g (ap $T $alpha))))
      "那么这就定义了一个从" $V "到" $F "的函数" $f ", 即" $T " (一个从" $V
      "到" $W "的函数) 与" $g " (一个从" $W "到" $F "的函数) 相复合. 既然" $T
      "和" $g "都是线性的, 那么定理6告诉我们" $f "也是线性的, 即" $f "是一个" $V
      "上的线性泛函. 因此, " $T "给我们提供了一个规则" $T^t ", 其为每个" $W "上的线性泛函"
      $g "赋一个" $V "上的线性泛函" (&= $f (ap $T^t $g)) ", 如上面的式子所定义的那样. "
      "读者也应该注意到" $T^t "实际上是一个从" W* "到" V* "的线性变换, 因为如果"
      $g_1 "和" $g_2 "在" W* "中而" $c "是一个标量, 那么"
      (MB (deriv (app (bra0 (app $T^t (LC $c $g_1 $g_2))) $alpha)
                 (app (@LC $c $g_1 $g_2) (ap $T $alpha))
                 (LC $c (app $g_1 (ap $T $alpha)) (app $g_2 (ap $T $alpha)))
                 (LC $c (app (@ap $T^t $g_1) $alpha) (app (@ap $T^t $g_2) $alpha))))
      "于是" (&= (app $T^t (LC $c $g_1 $g_2)) (LC $c (ap $T^t $g_1) (ap $T^t $g_2)))
      ". 让我们总结一下.")
   ((theorem #:n "21")
    "令" $V "和" $W "是域" $F "上的向量空间. 对于每个从" $V "到" $W "的线性变换, 存在唯一的从"
    W* "到" V* "的线性变换" $T^t "满足"
    (MB (&= (app (@ap $T^t $g) $alpha) (app $g (ap $T $alpha))))
    "对于每个" W* "中的" $g "和" $V "中的" $alpha "成立.")
   (P "我们将称" $T^t "为" $T "的" (B "转置") ". 这个变换" $T^t "也常被称作" $T
      "的伴随. 然而, 我们不会使用这个术语.")
   ((theorem #:n "22")
    "令" $V "和" $W "是域" $F "上的向量空间, " $T "是一个从" $V "到" $W "的线性变换. "
    $T^t "的零空间是" $T "的像的零化子. 如果" $V "和" $W "是有限维的, 那么"
    (Ol #:attr* '((type "i"))
        (Li (&= (&rank $T^t) (&rank $T)) ";")
        (Li $T^t "的像是" $T "的零空间的零化子.")))
   ((proof)
    "如果" $g "在" W* "中, 那么根据定义有"
    (MB (&= (app (@ap $T^t $g) $alpha) (app $g (ap $T $alpha))))
    "对于每个" $V "中的" $alpha "成立. " $g "在" $T^t "的零空间之中的意思是对于每个"
    $V "中的" $alpha "有" (&= (app $g (ap $T $alpha)) $0) ". 因此, " $T^t "的零空间就恰是"
    $T "的像的零化子." (Br)
    "设" $V "和" $W "是有限维的, 比如说" (&= (&dim $V) $n) "和" (&= (&dim $W) $m) ". 对于i: 令"
    $r "是" $T "的秩, 即" $T "的像的维数. 根据定理16, " $T "的像的零化子的维数是" (@- $m $r)
    ". 根据这个定理的第一条陈述, 我们知道" $T^t "的零化度必然是" (@- $m $r) ". 但是如果这样的话, 既然"
    $T^t "是一个" $m "维空间上的线性变换, 那么" $T^t "的秩就应该是" (&= (&- $m (@- $m $r)) $r)
    ", 于是" $T "和" $T^t "有着相同的秩. 对于ii: 令" $N "是" $T "的零空间. 每个" $T^t
    "的像之中的线性泛函都在" $N "的零化子之中, 因为若设对于某个" W* "中的" $g "有"
    (&= $f (ap $T^t $g)) ", 那么如果" $alpha "在" $N "中, 有"
    (MB (&= (app $f $alpha) (app (@ap $T^t $g) $alpha) (app $g (ap $T $alpha))
            (app $g $0) $0) ".")
    "现在我们知道" $T^t "的像是空间" $N^0 "的一个子空间, 并且"
    (MB (&= (&dim $N^0) (&- $n (&dim $N)) (&rank $T) (&rank $T^t)))
    "于是" $T^t "的像必然就恰是" $N^0 ".")
   ((theorem #:n "23")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 令" $BBB "是" $V "的一个有序基, 其对偶基是"
    (&* $BBB) ". 令" $BBB^ "是" $W "的一个有序基, 其对偶基是" (&* $BBB^) ". 令" $T
    "是一个从" $V "到" $W "的线性变换, 令" $A "是" $T "相对于" $BBB "和" $BBB^
    "的矩阵. 令" $B "是" $T^t "相对于" (&* $BBB^) "和" (&* $BBB) "的矩阵, 那么"
    (&= (mref $B $i $j) (mref $A $j $i)) ".")
   ((proof)
    "令"
    (MB (&cm basis:def (&= $BBB^ (setE $beta_1 $..h $beta_m))
             (&= (&* $BBB) (setE $f_1 $..h $f_n))
             (&= (&* $BBB^) (setE $g_1 $..h $g_m))) ".")
    "根据定义,"
    (MB (&cm (&= (ap $T $alpha_j) (sum (&= $i $1) $m (&i* (mref $A $i $j) $beta_i)))
             (&= $j (&cm $1 $..h $n))
             (&= (ap $T^t $g_j) (sum (&= $i $1) $n (&i* (mref $B $i $j) $f_i)))
             (&= $j (&cm $1 $..h $m))) ".")
    "另一方面,"
    (MB (deriv (app (@ap $T^t $g_j) $alpha_i)
               (app $g_j (ap $T $alpha_i))
               (ap $g_j (@sum (&= $k $1) $m (&i* (mref $A $k $i) $beta_k)))
               (sum (&= $k $1) $m (&i* (mref $A $k $i) (app $g_j $beta_k)))
               (sum (&= $k $1) $m (&i* (mref $A $k $i) (&delta $j $k)))
               (mref $A $j $i)))
    "对于" $V "上任意的线性泛函" $f "我们有"
    (MB (&= $f (sum (&= $i $1) $n (&i* (app $f $alpha_i) $f_i))) ".")
    "如果我们将此公式应用于泛函" (&= $f (ap $T^t $g_j)) "并运用"
    (&= (app (@ap $T^t $g_j) $alpha_i) (mref $A $j $i)) "的事实, 那么我们有"
    (MB (&= (ap $T^t $g_j) (sum (&= $i $1) $n (&i* (mref $A $j $i) $f_i))))
    "从中立即可以得出" (&= (mref $B $i $j) (mref $A $j $i)) ".")
   ((definition)
    "如果" $A "是域" $F "上的一个" m*n "矩阵, 那么" $A "的转置" $A^t
    "是由" (&= (_^ $A (&cm $i $j) $t) (mref $A $j $i)) "定义的"
    (&c* $n $m) "矩阵.")
   (P "定理23是说如果" $T "是一个从" $V "到" $W "的线性变换, 其在某对有序基下的矩阵是"
      $A ", 那么转置变换" $T^t "在与之对偶的一对有序基下由转置矩阵" $A^t "表示.")
   ((theorem #:n "24")
    "令" $A "是域" $F "上任意的" m*n "矩阵, 那么" $A "的行秩等于" $A "的列秩.")
   ((proof)
    "令" $BBB "是" $F^n "的标准有序基, " $BBB^ "是" $F^m "的标准有序基. 令" $T
    "是从" $F^n "到" $F^m "的线性变换, 其相对于" $BBB "和" $BBB^ "的矩阵是" $A ", 即"
    (MB (&= (appl $T $x_1 $..h $x_n) (tu0 $y_1 $..h $y_m)))
    "其中"
    (MB (&= $y_i (sum (&= $j $1) $n (&i* (mref $A $i $j) $x_j))) ".")
    $A "的列秩等于变换" $T "的秩, 因为" $T "的像由所有这样的" $m "元组构成, 其是" $A
    "的列向量的线性组合. [译注: 在同构的意义下]" (Br)
    "相对于对偶基" (&* $BBB^) "和" (&* $BBB) ", 转置变换" $T^t "由矩阵" $A^t
    "表示. 既然" $A^t "的列即" $A "的行, 以相同的推理我们看出" $A "的行秩 (" $A^t
    "的列秩) 等于" $T^t "的秩. 根据定理22, " $T "和" $T^t "有着相同的秩, 因此" $A
    "的行秩等于" $A "的列秩.")
   (P "现在我们知道如果" $A "是一个域" $F "的" m*n "矩阵而" $T "是一个按照以上方式定义的从"
      $F^n "到" $F^m "的线性变换, 那么"
      (MB (&= (&rank $T) (&row-rank $A) (&column-rank $A)) ".")
      "我们将简单地称这个数字为" $A "的秩.")
   ((example #:n "25")
    "这个例子是一般性质的&mdash;&mdash;与其说是例子, 不如说是讨论. 令" $V "是域" $F
    "上的一个" $n "维向量空间, 令" $T "是" $V "上的一个线性变换. 设" basis:def
    "是" $V "的一个有序基. " $T "在有序基" $BBB "下的矩阵被定义为" n*n "矩阵" $A ", 即"
    (MB (&= (ap $T $alpha_j) (sum (&= $i $1) $n (&i* (mref $A $i $j) $alpha_i))) ".")
    "换言之, " (mref $A $i $j) "是向量" (ap $T $alpha_j) "在有序基" $BBB "下的第" $i
    "个坐标. 如果" (setE $f_1 $..h $f_n) "是" $BBB "的对偶基的话, 这可以被简单地陈述为"
    (MB (&= (mref $A $i $j) (app $f_i (ap $T $alpha_j))) ".")
    "让我们看看若改变基会发生什么. 设"
    (MB (&= $BBB^ (setE (_^ $alpha $1 $prime) $..h (_^ $alpha $n $prime))))
    "是" $V "的另一个有序基, 其对偶基是" (setE (_^ $f $1 $prime) $..h (_^ $f $n $prime))
    ". 如果" $B "是" $T "在有序基" $BBB^ "下的矩阵, 那么"
    (MB (&= (mref $B $i $j) (app (_^ $f $i $prime) (ap $T (_^ $alpha $j $prime)))) ".")
    "令" $U "是满足" (&= (ap $U $alpha_j) (_^ $alpha $j $prime)) "的可逆线性算子, 那么"
    $U "的转置由" (&= (ap $U^t (_^ $f $i $prime)) $f_i) "给出. 读者很容易验证如果" $U
    "是可逆的, 那么" $U^t "和" (&= (inv (@ $U^t)) (^ (@ (inv $U)) $t)) "也是可逆的. 因此, "
    (&cm (&= (_^ $f $i $prime) (ap (^ (@ (inv $U)) $t) $f_i)) (&= $i (&cm $1 $..h $n)))
    ". 于是,"
    (MB (deriv (mref $B $i $j)
               (app (_^ $f $i $prime) (ap $T (_^ $alpha $j $prime)))
               (app (bra0 (ap (^ (@ (inv $U)) $t) $f_i)) (ap $T (_^ $alpha $j $prime)))
               (app $f_i (ap (inv $U) (ap $T (_^ $alpha $j $prime))))
               (app $f_i (ap (inv $U) (ap $T (ap $U $alpha_j))))))
    "那么这说明了什么呢? 嗯, " (app $f_i (ap (inv $U) (ap $T (ap $U $alpha_j))))
    "是" (sim $T $U) "在有序基" $BBB "下的矩阵的第" $i "行" $j "列元素. 上面的计算表明这个标量也是"
    $T "在有序基" $BBB^ "下的第" $i "行" $j "列元素. 换句话说,"
    (MB (deriv (coordm $T $BBB^)
               (coordm (sim $T $U))
               (&i* (coordm (inv $U)) (coordm $T) (coordm $U))
               (&i* (_^ (bra0 $U) $BBB $-1) (coordm $T) (coordm $U))))
    "而这恰好就是我们之前推导出来的基变换公式.")
   ((exercise #:n "1")
    "令" $F "是一个域, 令" $f "是" $F^2 "上由" (&= (appl $f $x_1 $x_2) (LC $a $x_1 $b $x_2))
    "定义的线性泛函. 对于以下的每个线性算子" $T ", 令" (&= $g (ap $T^t $f)) ", 找出"
    (appl $g $x_1 $x_2) "."
    (Ol #:attr* '((type "a"))
        (Li (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) ";")
        (Li (&= (appl $T $x_1 $x_2) (tu0 (&- $x_2) $x_1)) ";")
        (Li (&= (appl $T $x_1 $x_2) (tu0 (&- $x_1 $x_2) (&+ $x_1 $x_2))) ".")))
   ((exercise #:n "2")
    "令" $V "是实数域上的多项式函数的向量空间. 令" $a "和" $b "是固定的实数, 令" $f
    "是" $V "上由"
    (MB (&= (app $f $p) (integral $a $b (app $p $x) $x)))
    "定义的线性泛函. 如果" $D "是" $V "上的微分算子, 那么" (ap $D^t $f) "是什么呢?")
   ((exercise #:n "3")
    "令" $A "是域" $F "上" n*n "矩阵的向量空间, 令" $B "是一个固定的" n*n "矩阵. 如果"
    $T "是" $V "上由" (&= (app $T $A) (&- (&i* $A $B) (&i* $B $A))) "定义的线性算子, "
    $f "是迹函数, 那么" (ap $T^t $f) "是什么呢?")
   ((exercise #:n "4")
    "令" $V "是域" $F "上的一个有限维向量空间, 令" $T "是" $V "上的一个线性算子. 令" $c
    "是一个标量, 设" $V "中存在非零的向量" $alpha "使得" (&= (ap $T $alpha) (&i* $c $alpha))
    ". 证明" $V "上存在一个非零的线性泛函" $f "使得" (&= (ap $T^t $f) (&i* $c $f)) ".")
   ((exercise #:n "5")
    "令" $A "是" $RR "上的" m*n "矩阵. 证明" (&= $A $0) "当且仅当"
    (&= (&trace (&i* $A^t $A)) $0) ".")
   ((exercise #:n "6")
    "令" $n "是一个正整数, 令" $V "是实数域上次数不超过" $n "的多项式函数构成的向量空间, 即所有具有形式"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
    "的函数构成的空间. 令" $D "是" $V "上的微分算子. 找出转置算子" $D^t "的零空间的一个基.")
   ((exercise #:n "7")
    "令" $V "是域" $F "上的一个有限维向量空间. 证明" (&\|-> $T $T^t) "是一个从" (&L $V $V)
    "到" (&L V* V*) "的同构.")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的" n*n "矩阵构成的向量空间."
    (Ol #:attr* '((type "a"))
        (Li "如果" $B "是一个固定的" n*n "矩阵, 以" (&= (app $f_B $A) (&trace (&i* $B^t $A)))
            "定义一个" $V "上的函数" $f_B ". 证明" $f_B "是" $V "上的一个线性泛函.")
        (Li "证明每个" $V "上的线性泛函都具有以上形式, 即是某个" $B "下的" $f_B ".")
        (Li "证明" (&\|-> $B $f_B) "是一个从" $V "到" V* "的同构.")))
   ))