#lang racket
(provide hoffman_ch7.html)
(require SMathML "linear_algebra_utils.rkt")
(define hoffman_ch7.html
  (TmPrelude
   #:title "线性代数 第7章 有理形式和Jordan形式"
   #:css "styles.css"
   (H1 "线性代数")
   (H2 "第7章 有理形式和Jordan形式")
   (H3 "第7.1节 循环子空间和零化子")
   (P "又一次, " $V "是域" $F "上的一个有限维向量空间, 而" $T "是" $V "上一个固定的 (但也是任意的) "
      "线性算子. 如果" $alpha "是" $V "的任意一个向量, 那么存在一个最小的包含" $alpha "且在" $T
      "下不变的" $V "的子空间. 这个子空间可以被定义为所有包含" $alpha "的" $T "不变子空间之交. "
      "然而, 现在对我们来说按照以下方式看待它是更有优势的. 如果" $W "是任意的包含" $alpha
      "且在" $T "下不变的" $V "的子空间, 那么" $W "也必然包含向量" (ap $T $alpha)
      ". 因此, " $W "还必然包含" (&= (app $T (ap $T $alpha)) (ap $T^2 $alpha)) ", "
      (&= (app $T (ap $T^2 $alpha)) (ap $T^3 $alpha)) ", 等等. 换言之, 对于每个域" $F
      "上的多项式" $g ", 必然有" (∈ (ap (app $g $T) $alpha) $W) ". 集合"
      (setI (ap (app $g $T) $alpha) (∈ $g polyF)) "显然在" $T "下不变, 因而是包含"
      $alpha "的最小" $T "不变子空间.")
   ((definition)
    "若" (∈ $alpha $V) ", " (B "由" $alpha "生成的" $T "循环子空间") "是"
    (&= (cyc $alpha $T) (setI (ap (app $g $T) $alpha) (∈ $g polyF)))
    ". 如果" (&= (cyc $alpha $T) $V) ", 那么" $alpha "被称为" $T
    "的一个" (B "循环向量") ".")
   (P "另一种描述子空间" (cyc $alpha $T) "的方式为" (cyc $alpha $T) "是由向量"
      (&cm (ap $T^k $alpha) (&>= $k $0)) "张成的子空间, 因而" $alpha "是"
      $T "的循环向量当且仅当这些向量可以张成" $V ". 我们提醒读者, 一般的线性算子"
      $T "可能没有循环向量.")
   ((example #:n "1")
    "对于任意的" $T ", 由零向量生成的" $T "循环子空间是零子空间. 空间"
    (cyc $alpha $T) "是一维的当且仅当" $alpha "是" $T "的特征向量. [译注: "
    "尽管在上一章定义特征向量时没有排除零向量, 但是从现在开始本书所称特征向量"
    "均不包括零向量, 这也与其他文本保持一致.] 对于恒等算子而言, 每个非零向量"
    "都生成了一维的循环子空间. 因此, 若" (&> (&dim $V) $1) ", 恒等算子没有循环向量. "
    "一个具有循环向量的线性算子的例子是" $F^2 "上在标准有序基下由矩阵"
    (MB (Mat (0 0) (1 0)))
    "表示的线性算子" $T ". 这里的一个循环向量是" $epsilon_1 ", 因为若"
    (&= $beta (tu0 $a $b)) ", 以" (&= $g (&+ $a (&i* $b $x))) "我们有"
    (&= $beta (ap (app $g $T) $epsilon_1)) ". 对于相同的算子" $T
    ", 由" $epsilon_2 "生成的循环子空间是一维的, 因为" $epsilon_2
    "是" $T "的特征向量.")
   (P "对于任意的" $T "和" $alpha ", 我们所感兴趣的是向量" (ap $T^j $alpha)
      "之间的线性关系"
      (MB (&= (LC0 $c_0 $alpha $c_1 (ap $T $alpha) $c_k (ap $T^k $alpha)) $0))
      "即我们所感兴趣的是具有性质" (&= (ap (app $g $T) $alpha) $0) "的多项式"
      (&= $g (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_k $x^k))) ". 集合"
      (setI (∈ $g polyF) (&= (ap (app $g $T) $alpha) $0)) "显然是" polyF
      "中的一个理想. 并且, 它也是一个非零理想, 因为它包含" $T "的极小多项式.")
   ((definition)
    "如果" (∈ $alpha $V) ", " $alpha "的" $T "零化子是" polyF "中的理想"
    (&= (ann $alpha $T) (setI (∈ $g polyF) (&= (ap (app $g $T) $alpha) $0)))
    ", 其唯一的首项系数为一的生成元" $p_alpha "也被称为" $alpha "的"
    $T "零化子. [译注: 这个定义在第6.4节{不变子空间}已经给出过了.]")
   (P "正如我们所指出的, " $T "零化子" $p_alpha "整除算子" $T
      "的极小多项式. 读者也应该注意到除非" $alpha "是零向量, "
      (&> (&deg $p_alpha) $0) ".")
   ((theorem #:n "1")
    "令" $alpha "是" $V "中的非零向量, " $p_alpha "是" $alpha "的" $T "零化子."
    (Ol #:attr* '((type "i"))
        (Li $p_alpha "的次数等于循环子空间" (cyc $alpha $T) "的维数.")
        (Li "如果" $p_alpha "的次数为" $k ", 那么向量"
            (&cm $alpha (ap $T $alpha) (ap $T^2 $alpha) $..h (ap (^ $T (&- $k $1)) $alpha))
            "构成了" (cyc $alpha $T) "的一个基.")
        (Li "如果" $U "是由" $T "于" (cyc $alpha $T) "上的限制导出的线性算子, 那么"
            $U "的极小多项式为" $p_alpha ".")))
   ((proof)
    "令" $g "是域" $F "上任意的多项式, 作带余除法"
    (MB (&= $g (&+ (&i* $p_alpha $q) $r)))
    "其中" (&= $r $0) "或" (&< (&deg $r) (&= (&deg $p_alpha) $k))
    ". 鉴于" (∈ (&i* $p_alpha $q) (ann $alpha $T)) ", 于是"
    (MB (&= (ap (app $g $T) $alpha) (ap (app $r $T) $alpha)) ".")
    "既然" (&= $r $0) "或" (&< (&deg $r) $k) ", 向量" (ap (app $r $T) $alpha)
    "是向量" (&cm $alpha (ap $T $alpha) $..h (ap (^ $T (&- $k $1)) $alpha))
    "的线性组合. 换言之, 这" $k "个向量可以张成" (cyc $alpha $T)
    ". 它们当然也是线性无关的, 因为若这些向量之间存在非平凡的线性关系, "
    "那么其可以导出一个非零的多项式" $g "满足"
    (&= (ap (app $g $T) $alpha) $0) "且" (&< (&deg $g) (&deg $p_alpha))
    ", 但这是不可能的. 现在我们已经证明了i和ii." (Br)
    "令" $U "是" $T "于" (cyc $alpha $T) "的限制. 如果" (∈ $g polyF) ", 那么"
    (eqnderiv (ap (app $p_alpha $U) (ap (app $g $T) $alpha))
              (ap (app $p_alpha $T) (ap (app $g $T) $alpha))
              (ap (app $g $T) (ap (app $p_alpha $T) $alpha))
              (ap (app $g $T) $0)
              $0)
    "因此, 算子" (app $p_alpha $U) "将每个" (cyc $alpha $T) "的向量都送至" $0
    ", 即" (cyc $alpha $T) "上的零算子. 并且, 如果" $h "是一个次数小于" $k
    "的多项式, 那么我们不可能有" (&= (app $h $U) $0) ", 不然的话"
    (&= (ap (app $h $U) $alpha) (ap (app $h $T) $alpha) $0)
    ", 但这与" $p_alpha "的定义矛盾. [译注: 此即若" $h "零化" $U ", 则" $p_alpha
    "整除" $h ". 换句话说, 就是" $p_alpha "的确生成了零化" $U "的理想.] 这表明"
    $p_alpha "是" $U "的极小多项式.")
   ((tcomment)
    "实际上, 定理1对于" (&= $alpha $0) "也成立, 此时" (&= $p_alpha $1) ", "
    (&= (&deg $p_alpha) $0) ", " (&= (cyc $alpha $T) (setE $0))
    ", " (&= (&dim (cyc $alpha $T)) $0) ", " $empty "是" (cyc $alpha $T)
    "的基, " (cyc $alpha $T) "上导出的算子即零向量空间上的平凡线性算子, "
    "其零化多项式构成的理想就是整个" polyF ", 所以极小多项式是" $1
    ", 也就是" $p_alpha ".")
   (P "该定理的一个特别推论如下: 如果" $alpha "碰巧是" $T "的一个循环向量, 那么"
      $T "的极小多项式的次数必然等于空间" $V "的维数. 因此, Cayley-Hamilton定理"
      "告诉我们" $T "的极小多项式就是" $T "的特征多项式. 之后我们将证明对于任意的"
      $T ", 存在向量" (∈ $alpha $V) "使得其" $T "零化子是" $T
      "的极小多项式. 然后, 这可以推出" $T "具有循环向量当且仅当" $T
      "的极小多项式和特征多项式是相同的. 但是, 还需要一些工作我们才能抵达这一步.")
   (P "我们的计划是利用具有循环向量的算子研究一般的" $T ". 因此, 让我们检视" $k
      "维空间" $W "上的一个具有循环向量" $alpha "的算子" $U ". 根据定理1, 向量"
      (&cm $alpha $..h (ap (^ $U (&- $k $1)) $alpha)) "构成了空间" $W
      "的一个基, 并且" $alpha "的零化子" $p_alpha "是" $U
      "的极小多项式 (因而也是" $U "的特征多项式). 如果我们令"
      (&cm (&= $alpha_i (ap (^ $U (&- $i $1)) $alpha)) (&= $i (&cm $1 $..h $k)))
      ", 那么" $U "于有序基" (&= $BBB (setE $alpha_1 $..h $alpha_k)) "上的作用为"
      (MB (set-attr*
           (&Table
            ((&cm (&= (ap $U $alpha_i) (_ $alpha (&+ $i $1)))
                  (&= $i (&cm $1 $..h (&- $k $1)))))
            ((&= (ap $U $alpha_k)
                 (&- (&- (&i* $c_0 $alpha_1)) (&i* $c_1 $alpha_2) $..c
                     (&i* (_ $c (&- $k $1)) $alpha_k)))))
           'columnalign "left"))
      "其中"
      (&= $p_alpha (&+ $c_0 (&i* $c_1 $x) $..c
                       (&i* (_ $c (&- $k $1)) (^ $x (&- $k $1)))
                       $x^k))
      ". " (ap $U $alpha_k) "的表达式是由" (&= (ap (app $p_alpha $U) $alpha) $0)
      "的事实推得的, 即"
      (MB (&= (&+ (ap $U^k $alpha)
                  (&i* (_ $c (&- $k $1)) (ap (^ $U (&- $k $1)) $alpha))
                  $..c (&i* $c_1 (ap $U $alpha)) (&i* $c_0 $alpha)) $0) ".")
      "这表明" $U "在有序基" $BBB "下的矩阵为"
      (MB (Mat (0 0 0 $..c 0 (&- $c_0))
               (1 0 0 $..c 0 (&- $c_1))
               (0 1 0 $..c 0 (&- $c_2))
               ($..v $..v $..v $ $..v $..v)
               (0 0 0 $..c 1 (&- (_ $c (&- $k $1))))) ".")
      "这个矩阵被称为首项系数为一的多项式" $p_alpha "的同伴矩阵 (companion matrix). "
      "[译注: 读者应该将同伴矩阵的概念视为多项式上的一个映射.]")
   ((theorem #:n "2")
    "如果" $U "是有限维向量空间" $W "上的一个线性算子, 那么" $U
    "拥有循环向量当且仅当存在" $W "的一个有序基使得" $U
    "在其下以" $U "的极小多项式的同伴矩阵表示.")
   ((proof)
    "我们刚才已经观察到若" $U "拥有循环向量, 那么的确存在这样一个基. "
    "反过来说, 如果我们有" $W "的一个有序基" (setE $alpha_1 $..h $alpha_k)
    "使得" $U "在其下由" $U "的极小多项式的同伴矩阵表示, 那么显然" $alpha_1
    "是" $U "的一个循环向量.")
   ((corollary)
    "如果" $A "是一个首项系数为一的多项式" $p "的同伴矩阵, 那么" $p
    "既是" $A "的极小多项式, 也是" $A "的特征多项式.")
   ((proof)
    "一种方法是令" $U "为" $F^k "上在标准有序基下由" $A "表示的线性算子, "
    "然后应用定理1和Cayley-Hamilton定理. 另一种方法是使用定理1看出" $p
    "是" $A "的极小多项式, 并通过直接的计算验证" $p "是" $A "的特征多项式.")
   ((tcomment)
    "证明的要点在于意识到" $epsilon_1 "的" $U "零化子" (_ $p $epsilon_1)
    " (根据定理1, 其等于" $A "的极小多项式) 何以等于" $p
    ". 答案是, 根据直接的计算, 可以知道" (&= (ap (app $p $U) $epsilon_1) $0)
    ", 因而" (_ $p $epsilon_1) "整除" $p ", 但是它们次数相等且首项系数都为一, "
    "所以" (&= $p (_ $p $epsilon_1)) ".")
   (P "以下是本节最后的注记. 如果" $T "是空间" $V "上任意的线性算子, "
      $alpha "是" $V "中任意的向量, 那么" $T "于循环子空间" (cyc $alpha $T)
      "上的限制算子" $U "具有一个循环向量, 即" $alpha ". 因此, " (cyc $alpha $T)
      "拥有一个有序基, " $U "在其下以" $p_alpha "的同伴矩阵表示, " $p_alpha
      "即" $alpha "的" $T "零化子. [译注: 当然, " $p_alpha
      "也是" $U "的极小多项式.]")
   ((exercise #:n "1")
    "令" $T "是" $F^2 "上的一个线性算子. 证明对于向量" $alpha ", 若" $alpha
    "非零且" $alpha "不是" $T "的特征向量, 那么" $alpha "是" $T
    "的一个循环向量. 据此, 证明要么" $T "拥有循环向量, 要么" $T
    "是恒等算子的标量倍数.")
   ((exercise #:n "2")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (2 0 0) (0 2 0) (0 0 -1)))
    "表示. 证明" $T "没有循环向量. 由向量" (tu0 1 -1 3) "生成的"
    $T "循环子空间是什么?")
   ((exercise #:n "3")
    "令" $T "是" $CC^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (1 $i 0) (-1 2 (&- $i)) (0 1 1)))
    "表示. 找出向量" (tu0 1 0 0) "的" $T "零化子. 找出"
    (tu0 1 0 $i) "的" $T "零化子.")
   ((exercise #:n "4")
    "证明如果" $T^2 "拥有循环向量, 那么" $T "拥有循环向量. 反过来正确吗?")
   ((exercise #:n "5")
    "令" $V "是域" $F "上的一个" $n "维向量空间, " $N "是" $V
    "上的一个幂零线性算子. 设" (&!= (^ $N (&- $n $1)) $0) ", 令"
    (∈ $alpha $V) "是满足" (&!= (ap (^ $N (&- $n $1)) $alpha) $0)
    "的一个向量. 证明" $alpha "是" $N "的一个循环向量. " $N "在有序基"
    (setE $alpha (ap $N $alpha) $..h (ap (^ $N (&- $n $1)) $alpha))
    "的矩阵是什么?")
   ((exercise #:n "6")
    "给出以下事实的一个直接证明. 如果" $A "是首项系数为一的多项式"
    $p "的同伴矩阵, 那么" $p "是" $A "的特征多项式.")
   ((exercise #:n "7")
    "令" $V "是一个" $n "维向量空间, " $T "是" $V "上的一个线性算子. 设"
    $T "是可对角化的."
    (Ol #:attr* '((type "a"))
        (Li "如果" $T "拥有循环向量, 证明" $T "拥有" $n "个不同的特征值.")
        (Li "如果" $T "拥有" $n "个不同的特征值, 并且" (setE $alpha_1 $..h $alpha_k)
            "是由" $T "的特征向量构成的一个基, 证明"
            (&= $alpha (&+ $alpha_1 $..c $alpha_k))
            "是" $T "的一个循环向量.")))
   ((exercise #:n "8")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 设" $T "拥有循环向量. 证明如果"
    $U "是任意与" $T "交换的线性算子, 那么" $U "是应用某个多项式于" $T "的结果.")
   (H3 "第7.2节 循环分解和有理形式")
   (P "本节的主要目的在于证明如果" $T "是有限维向量空间" $V "上任意的线性算子, "
      "那么存在向量" (∈ $alpha_1 $..h $alpha_r $V) "满足"
      (MB (&= $V (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))) ".")
      "换言之, 我们希望证明" $V "是一个" $T "循环子空间的直和. 这将表明" $T
      "是有限数目的线性算子的直和, 其中每个都拥有循环向量. 其效用在于将关于"
      "一般线性算子的诸多问题规约为关于拥有循环向量的算子的类似问题. 我们将证明的"
      "定理3是线性代数中最为深刻的结果之一, 并且拥有许多有趣的推论.")
   (P "循环分解定理与以下问题紧密关联. 对于什么样的" $T "不变子空间" $W
      "而言, 存在另一个" $T "不变子空间" $W^ "满足" (&= $V (&d+ $W $W^))
      ". 如果" $W "是有限维向量空间" $V "的任意一个子空间, 那么存在一个子空间"
      $W^ "满足" (&= $V (&d+ $W $W^)) ". 通常来说存在许多这样的子空间" $W^
      ", 其中每个都被称为与" $W^ (B "互补") ". 我们问的是何时一个" $T
      "不变子空间拥有一个与之互补的" $T "不变子空间.")
   (P "让我们设" (&= $V (&d+ $W $W^)) ", 其中" $W "和" $W^ "都在" $T
      "下不变, 然后看看我们可以发现什么关于子空间" $W "的性质. 每个向量"
      (∈ $beta $V) "都具有" (&= $beta (&+ $gamma $gamma^))
      "的形式, 其中" (∈ $gamma $W) "而" (∈ $gamma^ $W^) ". 如果" $f
      "是标量域上任意的多项式, 那么"
      (let ((fT (app $f $T)))
        (MB (&= (ap fT $beta) (&+ (ap fT $gamma) (ap fT $gamma^))) "."))
      "既然" $W "和" $W^ "都是" $T "不变的, 向量"
      (∈ (ap (app $f $T) $gamma) $W) "且" (∈ (ap (app $f $T) $gamma^) $W^)
      ". 因此, " (∈ (ap (app $f $T) $beta) $W) "当且仅当"
      (&= (ap (app $f $T) $gamma^) $0) ". 我们所感兴趣的正是这看似单纯的事实, 即如果"
      (∈ (ap (app $f $T) $beta) $W) ", 那么"
      (&= (ap (app $f $T) $beta) (ap (app $f $T) $gamma)) ".")
   ((definition)
    "令" $T "是向量空间" $V "上的线性算子, " $W "是" $V "的一个子空间. 我们称"
    $W "是" $T "可容许的 (" $T "-admissible), 如果"
    (Ol #:attr* '((type "i"))
        (Li $W "在" $T "下不变;")
        (Li "若" (∈ (ap (app $f $T) $beta) $W) ", 则存在向量" (∈ $gamma $W)
            "满足" (&= (ap (app $f $T) $beta) (ap (app $f $T) $gamma)) "."))
    "[译注: admissible暂无通行翻译, 译者将其定为&quot;可容许的&quot;.]")
   (P "刚才我们已经表明了, 如果" $W "是不变的且有一个互补的不变子空间, 那么"
      $W "是可容许的. 定理3的一个推论是其逆, 于是可容许性刻画了那些"
      "拥有互补不变子空间的不变子空间.")
   (P "让我们指出在获得分解"
      (MB (&= $V (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))))
      "的尝试里可容许性质的概念是如何牵涉其中的. 我们抵达这样一种分解的基本方法是归纳地挑选向量"
      (&cm $alpha_1 $..h $alpha_r) ". 设根据某种过程我们已经挑选了向量"
      (&cm $alpha_1 $..h $alpha_j) ", 并且子空间"
      (MB (&= $W_j (&+ (cyc $alpha_1 $T) $..c (cyc $alpha_j $T))))
      "是真子空间. 我们想要找到一个非零向量" (_ $alpha (&+ $j $1)) "满足"
      (MB (&= (&cap $W_j (cyc (_ $alpha (&+ $j $1)) $T)) (setE $0)))
      "因为这样的话子空间"
      (&= (_ $W (&+ $j $1)) (&d+ $W_j (cyc (_ $alpha (&+ $j $1)) $T)))
      "就离穷尽" $V "更进至少一维. 但是, 这样的" (_ $alpha (&+ $j $1))
      "何以存在呢? 如果" (&cm $alpha_1 $..h $alpha_j) "的挑选使得" $W_j
      "是一个" $T "可容许子空间, 那么很容易看出来我们可以找到一个合适的"
      (_ $alpha (&+ $j $1)) ". 这是使得我们对于定理3的证明成立之所在, "
      "即便这并非我们组织论证的方式.")
   (P "令" $W "是一个" $T "不变的真子空间. 让我们试着寻找一个非零的向量" $alpha "满足"
      (MB (&= (&cap $W (cyc $alpha $T)) (setE $0)) ".")
      "我们可以选择某个向量" (&!in $beta $W) ", 考虑" $T "导子" (conduct $beta $W)
      ", 其由所有满足" (∈ (ap (app $g $T) $beta) $W) "的多项式" $g
      "构成. 回忆一下, 生成理想" (conduct $beta $W) "的唯一的首项系数为一的多项式"
      (&= $f (pconduct $beta $W)) "也被称为从" $beta "到" $W
      "的" $T "导子. 向量" (ap (app $f $T) $beta) "在" $W "之中. 现在, 如果"
      $W "是" $T "可容许的, 那么存在" (∈ $gamma $W) "满足"
      (&= (ap (app $f $T) $beta) (ap (app $f $T) $gamma))
      ". 令" (&= $alpha (&- $beta $gamma)) ", " $g "是任意的多项式. 既然"
      (∈ (@- $beta $alpha) $W) ", " (∈ (ap (app $g $T) $beta) $W)
      "当且仅当" (∈ (ap (app $g $T) $alpha) $W) ". 换言之, "
      (&= (conduct $alpha $W) (conduct $beta $W)) ". 因此, 多项式" $f
      "也是从" $alpha "到" $W "的" $T "导子. 但是" (&= (ap (app $f $T) $alpha) $0)
      ", 这告诉我们" (∈ (ap (app $g $T) $alpha) $W) "当且仅当"
      (&= (ap (app $g $T) $alpha) $0) ", 即子空间" (cyc $alpha $T) "和"
      $W "是线性无关的, 并且" $f "是" $alpha "的" $T "零化子.")
   ((theorem #:n "3. 循环分解定理")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $W_0 "是一个" $T
    "可容许的" $V "的真子空间, 存在非零向量" (∈ $alpha_1 $..h $alpha_r $V) "满足"
    (Ol #:attr* '((type "i"))
        (Li (&= $V (&d+ $W_0 (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))) ";")
        (Li $p_k "整除" (_ $p (&- $k $1)) ", 其中" (&= $k (&cm $2 $..h $r))
            "而" $p_i "是" $alpha_i "的" $T "零化子."))
    "而且, 整数" $r "和零化子" (&cm $p_1 $..h $p_r) "由i, ii以及"
    (&!= $alpha_i $0) "的事实唯一确定.")
   ((proof)
    "证明相当冗长, 故我们将其分为四个步骤. 似乎初读证明时取" (&= $W_0 (setE $0))
    "会比较容易, 尽管这并不会带来任何实质性的简化. 贯穿整个证明, 我们都将"
    (ap (app $f $T) $beta) "缩略为" (ap $f $beta) "."
    (P (Em "第1步. ") "存在非零向量" (∈ $beta_1 $..h $beta_r $V) "满足"
       (Ol #:attr* '((type "a"))
           (Li (&= $V (&+ $W_0 (cyc $beta_1 $T) $..c (cyc $beta_r $T))) ";")
           (Li "如果" (&<= $1 $k $r) "并且"
               (MB (&= $W_k (&+ $W_0 (cyc $beta_1 $T) $..c (cyc $beta_k $T))))
               "那么导子" (&= $p_k (pconduct $beta_k (_ $W (&- $k $1))))
               "在所有到子空间" (_ $W (&- $k $1)) "的" $T
               "导子中拥有最大的次数, 即对于每个" $k "有"
               (MB (&= (&deg $p_k)
                       (maxi (∈ $alpha $V)
                             (&deg (pconduct $alpha (_ $W (&- $k $1)))))) ".")))
       "这一步只依赖于" $W_0 "是不变子空间的事实. 如果" $W "是一个" $T
       "不变的真子空间, 那么"
       (MB (&<= (&< $0 (maxi (∈ $alpha $V) (&deg (pconduct $alpha $W)))) (&dim $V)))
       "我们可以选择一个向量" $beta "使得" (&deg (pconduct $beta $W))
       "取得最大值, 然后子空间" (&+ $W (cyc $beta $T)) "是" $T "不变的且维数大于"
       (&dim $W) ". [译注: Cayley-Hamilton定理告诉我们特征多项式是一个零化多项式, "
       "于是" (pconduct $alpha $W) "整除特征多项式, 因而有"
       (&<= (&deg (pconduct $alpha $W)) (&dim $V)) ", 那么我们可以明白最大值是良定的"
       "且" (&<= (maxi (∈ $alpha $V) (&deg (pconduct $alpha $W))) (&dim $V))
       ". 考虑到" $W "是真子空间, 若" (&!in $alpha $W) ", 那么"
       (&> (&deg (pconduct $alpha $W)) $0) ", 由此可知"
       (&> (maxi (∈ $alpha $V) (&deg (pconduct $alpha $W))) $0)
       ". 文中" $beta "的选择必然满足" (&!in $beta $W) ", 因为否则的话" $T
       "导子的次数为零. 那么, 子空间" (&+ $W (cyc $beta $T)) "的维数的确严格大于"
       $W "的维数. 当然, 其在" $T "下不变是显然的.] 应用此过程于" (&= $W $W_0)
       "可以得到" $beta_1 ". 若" (&= $W_1 (&+ $W_0 (cyc $beta_1 $T)))
       "仍然是真子空间, 那么就再次应用该过程于" $W_1 "以得到" $beta_2
       ". 将过程继续施行下去, 鉴于" (&> (&dim $W_k) (&dim (_ $W (&- $k $1))))
       ", 我们必然可以在不超过" (&dim $V) "步的情况下抵达" (&= $W_r $V) ".")
    (P (Em "第2步. ") "令" (&cm $beta_1 $..h $beta_r) "是满足第1步的条件a和b"
       "的非零向量. 固定" $k ", 其中" (&<= $1 $k $r) ". 令" $beta "是" $V
       "中任意的向量, " (&= $f (pconduct $beta (_ $W (&- $k $1)))) ". 如果"
       (MB (&cm (&= (ap $f $beta)
                    (&+ $beta_0 (sum (&= $i $1) (&- $k $1)
                                     (ap $g_i $beta_i))))
                (∈ $beta_i $W_i)))
       "那么" $f "整除每个多项式" $g_i "并且存在" (∈ $gamma_0 $W_0) "满足"
       (&= $beta_0 (ap $f $gamma_0)) ". [译注: " (∈ $beta_i $W_i)
       "只是约束了" (∈ $beta_0 $W_0) ", 其余则是已知的.]" (Br)
       "如果" (&= $k $1) ", 此即陈述" $W_0 "是" $T "可容许的这个条件. 为了在"
       (&> $k $1) "的情形下证明断言, 应用带余除法:"
       (MB (&cm (&= $g_i (&+ (&i* $f $h_i) $r_i))
                (: (&= $r_i $0) "或者" (&< (&deg $r_i) (&deg $f)))) ".")
       "我们想要证明的是对于每个" $i "有" (&= $r_i $0) ". 令"
       (MB (&= $gamma (&- $beta (sum (&= $i $1) (&- $k $1) (ap $h_i $beta_i)))))
       "既然" (∈ (&- $gamma $beta) (_ $W (&- $k $1))) ", 我们有"
       (MB (&= (pconduct $gamma (_ $W (&- $k $1)))
               (pconduct $beta (_ $W (&- $k $1))) $f))
       "而且"
       (MB (&= (ap $f $gamma)
               (&+ $beta_0 (sum (&= $i $1) (&- $k $1)
                                (ap $r_i $beta_i)))) ".")
       "设某个" $r_i "异于" $0 ", 我们可以推导出矛盾来. 令"
       (&= $j (maxi (setI (∈ $i (setE $1 $..h (&- $k $1))) (&!= $r_i $0))))
       ", 那么"
       (MB (&cm (&= (ap $f $gamma)
                    (&+ $beta_0 (sum (&= $i $1) $j (ap $r_i $beta_i))))
                (: (&!= $r_j $0) "且"
                   (&< (&deg $r_j) (&deg $f)))) ".")
       "令" (&= $p (pconduct $gamma (_ $W (&- $j $1))))
       ", 既然" (&sube (_ $W (&- $j $1)) (_ $W (&- $k $1)))
       ", 导子" (&= $f (pconduct $gamma (_ $W (&- $k $1))))
       "必然整除" $p ":"
       (MB "存在多项式" $g ",&nbsp;" (&= $p (&i* $f $g)) ".")
       "应用" (app $g $T) "于前式两边, 可以得到:"
       (MB (&= (ap $p $gamma)
               (ap (&i* $g $f) $gamma)
               (&+ (ap (&i* $g $r_j) $beta_j)
                   (ap $g $beta_0)
                   (sum (&= $i $1) (&- $j $1)
                        (ap (&i* $g $r_i) $beta_i)))) ".")
       "根据" $p "的定义, " (∈ (ap $p $gamma) (_ $W (&- $j $1)))
       ", 而且上式最右边两项之和也在" (_ $W (&- $j $1))
       "之中, 所以" (∈ (ap (&i* $g $r_j) $beta_j) (_ $W (&- $j $1)))
       ". 现在我们使用第1步的条件b:"
       (MB (deriv0 (&deg (@i* $g $r_j)) $>=
                   (&deg (pconduct $beta_j (_ $W (&- $j $1)))) $=
                   (&deg $p_j) $>=
                   (&deg (pconduct $gamma (_ $W (&- $j $1)))) $=
                   (&deg $p) $=
                   (&deg (@i* $f $g))))
       "因此, " (&>= (&deg $r_j) (&deg $f))
       ", 但这与" $j "的选择相矛盾. 现在我们知道" $f "整除每个"
       $g_i ", 于是" (&= $beta_0 (ap $f $gamma)) ". 既然" $W
       "是" $T "可容许的, 存在" (∈ $gamma_0 $W_0) "使得"
       (&= $beta_0 (ap $f $gamma_0)) ". 顺带值得一提的是, 第2步是断言"
       (&cm $W_1 $W_2 $..h $W_r) "具有" $T "可容许性的一种增强形式.")
    (P (Em "第3步. ") "存在非零向量" (∈ $alpha_1 $..h $alpha_r $V)
       "满足定理3的条件i和ii." (Br)
       "我们自第1步的向量" (&cm $beta_1 $..h $beta_r) "始. 固定" $k
       ", 其中" (&<= $1 $k $r) ". 我们将第2步应用于" (&= $beta $beta_k)
       ", 那么" $T "导子" (&= $f $p_k) ", 于是可以得到"
       (MB (&= (ap $p_k $beta_k)
               (&+ (&i* $p_k $gamma_0)
                   (sum (&= $i $1) (&- $k $1)
                        (ap (&i* $p_k $h_i) $beta_i)))))
       "其中" (∈ $gamma_0 $W_0) "而" (&cm $h_1 $..h (_ $h (&- $k $1)))
       "是多项式. 令"
       (MB (&= $alpha_k (&- $beta_k $gamma_0
                            (sum (&= $i $1) (&- $k $1)
                                 (ap $h_i $beta_i)))))
       "鉴于" (∈ (&- $beta_k $alpha_k) (_ $W (&- $k $1))) ", 我们知道"
       (MB (&= (pconduct $alpha_k (_ $W (&- $k $1)))
               (pconduct $beta_k (_ $W (&- $k $1))) $p_k))
       "既然" (&= (ap $p_k $alpha_k) $0) ", 可以得到"
       (MB (&= (&cap (_ $W (&- $k $1)) (cyc $alpha_k $T)) (setE $0)) ".")
       "因为每个" $alpha_k "都满足以上两式, 所以"
       (MB (&= $W_k (&d+ $W_0 (cyc $alpha_1 $T) $..c (cyc $alpha_k $T))))
       "并且" $p_k "是" $alpha_k "的" $T "零化子. [译注: 读者需要注意到因为"
       (∈ (&- $beta_k $alpha_k) (_ $W (&- $k $1))) ", 所以"
       (&= (&+ (_ $W (&- $k $1)) (cyc $alpha_k $T))
           (&+ (_ $W (&- $k $1)) (cyc $beta_k $T)))
       ".] 换言之, 向量" (&cm $alpha_1 $..h $alpha_r)
       "和向量" (&cm $beta_1 $..h $beta_r) "定义了相同的子空间序列"
       (&cm $W_1 $W_2 $..h) "并且" $T "导子" (&= $p_k (pconduct $alpha_k (_ $W (&- $k $1))))
       "自然也满足最大性质, 即第1步的条件b. 其还具有额外的性质, 就是子空间"
       (&cm $W_0 (cyc $alpha_1 $T) (cyc $alpha_2 $T) $..h)
       "是线性无关的. 由此很容易验证定理3的条件ii. 既然对于每个" $i "都有"
       (&= (ap $p_i $alpha_i) $0) ", 我们有着平凡的关系"
       (MB (&= (ap $p_k $alpha_k)
               (&+ $0 (ap $p_1 $alpha_1) $..c
                   (ap (_ $p (&- $k $1)) (_ $alpha (&- $k $1))))))
       "现在应用第2步, 将" (&cm $beta_1 $..h $beta_k) "替换为" (&cm $alpha_1 $..h $alpha_k)
       "而" (&= $beta $alpha_k) ", 那么可以得到结论: " $p_k "整除每个" $p_i
       ", 其中" (&< $i $k) ".")
    (P (Em "第4步. ") "数字" $r "和多项式" (&cm $p_1 $..h $p_k) "在定理3的条件下是唯一的." (Br)
       "设除了向量" (&cm $alpha_1 $..h $alpha_r) "之外非零向量" (&cm $gamma_1 $..h $gamma_s)
       "也满足定理3的条件, 也就是说"
       (MB (&= $V (&d+ $W_0 (cyc $gamma_1 $T) $..c (cyc $gamma_s $T))))
       "并且" $g_k "整除" (_ $g (&- $k $1)) ", 其中" (&= $k (&cm $2 $..h $s)) "而"
       $g_i "是" $gamma_i "的" $T "零化子. 我们要证明的是" (&= $r $s) "以及对于每个" $i
       "有" (&= $p_i $g_i) "." (Br)
       "很容易看出来" (&= $p_1 $g_1) ". 多项式" $g_1 "实际上由前述条件可以被确定为从" $V
       "到" $W_0 "的" $T "导子. " (conduct $V $W_0) "被定义为集合"
       (setI (∈ $f polyF) (: "对于每个" (∈ $beta $V) ",&nbsp;" (∈ (ap $f $beta) $W_0)))
       ", 其中" $F "是标量域; 换言之, 多项式" (∈ $f (conduct $V $W_0)) "当且仅当"
       (app $f $T) "的像是" $W_0 "的子集. 那么, " (conduct $V $W_0)
       "是多项式代数中的一个非零理想, 而多项式" $g_1 "是该理想的首项系数为一的生成元. "
       "以下是我们的理由. 每个" (∈ $beta $V) "都具有形式"
       (MB (&= $beta (&+ $beta_0 (ap $f_1 $gamma_1) $..c (ap $f_s $gamma_s))))
       "于是"
       (MB (&= (ap $g_1 $beta)
               (&+ (ap $g_1 $beta_0)
                   (sum (&= $i $1) $s
                        (ap (&i* $g_1 $f_i) $gamma_i)))))
       "因为每个" $g_i "都整除" $g_1 ", 所以对于每个" $i "有" (&= (ap $g_1 $gamma_i) $0)
       ", 那么" (∈ (&= (ap $g_1 $beta) (ap $g_1 $beta_0)) $W_0) ", 于是"
       (∈ $g_1 (conduct $V $W_0)) ". 既然" $g_1 "是将" $gamma_1 "送至" $W_0
       "的次数最低的首项系数为一多项式, 那么" $g_1 "当然也是理想" (conduct $V $W_0)
       "中次数最低的首项系数为一多项式. 根据同样的论证, " $p_1
       "也应该是这个理想的首项系数为一的生成元, 所以" (&= $p_1 $g_1) "." (Br)
       "如果" $f "是一个多项式, " $W "是" $V "的一个子空间, 那么缩写" (ap $f $W)
       "将表示集合" (setI (ap $f $alpha) (∈ $alpha $W)) ". 我们将以下三个事实的验证留作练习."
       (Ol (Li (&= (ap $f (cyc $alpha $T)) (cyc (ap $f $alpha) $T)) ".")
           (Li "如果" (&= $V (&d+ $V_1 $..c $V_k)) ", 其中每个" $V_i "都在" $T
               "下不变, 那么" (&= (ap $f $V) (&d+ (ap $f $V_1) $..c (ap $f $V_k))) ".")
           (Li "如果" $alpha "和" $gamma "有着相同的" $T "零化子, 那么" (ap $f $alpha)
               "和" (ap $f $gamma) "也有着相同的" $T "零化子, 因而有"
               (MB (&= (&dim (cyc (ap $f $alpha) $T)) (&dim (cyc (ap $f $gamma) $T))) ".")))
       "现在我们通过归纳来论证" (&= $r $s) "以及对于" (&= $i (&cm $2 $..h $r)) "有"
       (&= $p_i $g_i) ". 论证的手法在于以恰当的方式数维数. 我们将给出" (&>= $r $2)
       "的情况下有" (&= $p_2 $g_2) "的证明, 由此怎样进行归纳则是清晰的. 设" (&>= $r $2) ", 那么"
       (MB (&< (&+ (&dim $W_0) (&dim (cyc $alpha_1 $T))) (&dim $V)))
       "既然我们已经知道了" (&= $p_1 $g_1) ", 那么" (cyc $alpha_1 $T) "和" (cyc $gamma_1 $T)
       "有着相同的维数. 因此, 也有"
       (MB (&< (&+ (&dim $W_0) (&dim (cyc $gamma_1 $T))) (&dim $V)))
       "这说明" (&>= $s $2) ". 现在问是否有" (&= $p_2 $g_2) "是有意义的了. 从两个对于" $V
       "的分解中, 我们可以得到两种对于" (ap $p_2 $V) "的分解方式:"
       (MB (set-attr*
            (&Table
             ((ap $p_2 $V)
              $=
              (&d+ (ap $p_2 $W_0) (cyc (ap $p_2 $alpha_1) $T)))
             ((ap $p_2 $V)
              $=
              (&d+ (ap $p_2 $W_0) (cyc (ap $p_2 $gamma_1) $T) $..c
                   (cyc (ap $p_2 $gamma_s) $T))))
            'columnalign "left"))
       "这里用到了事实1和2, 以及对于" (&>= $i $2) "有" (&= (ap $p_2 $alpha_i) $0)
       ". 既然我们已经知道了" (&= $p_1 $g_1) ", 事实3告诉我们" (cyc (ap $p_2 $alpha_1) $T)
       "和" (cyc (ap $p_2 $gamma_1) $T) "有着相同的维数. 显然, 我们可以得到"
       (MB (&cm (&= (&dim (cyc (ap $p_2 $gamma_i) $T)) $0)
                (&>= $i $2)) ".")
       "于是, " (&= (ap $p_2 $gamma_2) $0) ", 那么" $g_2 "整除" $p_2
       ". 同样的论证可以反过来以得到" $p_2 "整除" $g_2 ". 因此, " (&= $p_2 $g_2) "."))
   ((corollary)
    "如果" $T "是有限维向量空间上的一个线性算子, 那么每个" $T "可容许子空间都具有"
    $T "下不变的补子空间.")
   ((proof)
    "令" $W_0 "是" $V "的一个可容许子空间. 若" (&= $W_0 $V) ", 那么我们所寻求的补就是"
    (setE $0) ". 若" $W_0 "是真子空间, 那么就应用定理3, 令"
    (MB (&= (_^ $W $0 $prime) (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))))
    "于是" (_^ $W $0 $prime) "在" $T "下不变且" (&= $V (&d+ $W_0 (_^ $W $0 $prime))) ".")
   ((corollary)
    "令" $T "是有限维向量空间" $V "上的一个线性算子."
    (Ol #:attr* '((type "a"))
        (Li "存在向量" (∈ $alpha $V) "满足" $alpha "的" $T "零化子是" $T "的极小多项式.")
        (Li $T "有循环向量当且仅当" $T "的极小多项式和特征多项式相等.")))
   ((proof)
    "如果" (&= $V (setE $0)) ", 那么结果平凡地成立. 如果" (&!= $V (setE $0)) ", 令"
    (MB (&= $V (&d+ (cyc $alpha_1 $T) $..c (cyc $alpha_r $T))))
    "而" (&cm $alpha_1 $..h $alpha_r) "的" $T "零化子" (&cm $p_1 $..h $p_r)
    "满足" (_ $p (&+ $k $1)) "整除" $p_k ", 其中" (&= $k (&cm $1 $..h (&- $r $1)))
    ". 正如我们在定理3的证明中所注意到的那样, 很容易看出" $p_1 "是" $T
    "的极小多项式, 即从" $V "到" (setE $0) "的" $T "导子. 我们已然证明了a." (Br)
    "我们在第7.1节中看到, 如果" $T "拥有循环向量, 那么" $T "的极小多项式和特征多项式恰好是"
    "相等的. 为了证明b, 还需要证明的是其逆. 应用定理a, 选择一个满足要求的" $alpha
    ". 如果极小多项式的次数等于" (&dim $V) ", 那么" (cyc $alpha $T) "的维数为" (&dim $V)
    ", 即" (&= $V (cyc $alpha $T)) ".")
   ((theorem #:n "4. 一般Cayley-Hamilton定理")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $p "和" $f "分别为" $T
    "的极小多项式和特征多项式."
    (Ol #:attr* '((type "i"))
        (Li $p "整除" $f ";")
        (Li $p "和" $f "拥有相同的素因子, 在不计重数的情况下;")
        (Li "如果"
            (MB (&= $p (&i* (_^ $f $1 $r_1) $..c (_^ $f $k $r_k))))
            "是" $p "的素因子分解, 那么"
            (MB (&= $f (&i* (_^ $f $1 $d_1) $..c (_^ $f $k $d_k))))
            "其中" $d_i "是" (app (_^ $f $i $r_i) $T) "的零化度除以" $f_i
            "的次数.")))
   ((proof)
    "我们就不考虑平凡情形" (&= $V (setE $0)) "了. 为了证明i和ii, 考虑由定理3得到的" $V
    "的一个循环分解. "
    )
   (H3 "第7.3节 Jordan形式")
   
   (H3 "第7.4节 不变因子的计算")
   
   (H3 "第7.5节 总结; 半单算子")
   
   ))