#lang racket
(provide div:hoffman_ch2)
(require SMathML "linear_algebra_utils.rkt")
(define div:hoffman_ch2
  (TmDiv
   (H2 "第2章 向量空间")
   (H3 "第2.1节 向量空间")
   (P "在数学的许多部分中, 人们经常会遇到这样的集合, 其中处理对象的线性组合是有趣的. "
      "例如, 我们发现在对于线性方程的研究中, 考虑矩阵的行的线性组合是相当自然的. "
      "很有可能读者学过微积分, 那里处理函数的线性组合, 特别是学习微分方程的时候. "
      "或许读者有些与三维Euclid空间打交道的经历, 特别是处理其中向量的线性组合.")
   (P "不严格地说, 线性代数是这样的数学分支, 它讨论其中线性组合是有意义的代数系统的共同性质. "
      "本节我们将定义一种数学对象, 经验表明它是此类代数系统最有用的抽象.")
   ((definition)
    "一个向量空间 (或者说线性空间) 包含以下资料:"
    (Ol (Li "一个标量域" $F ";")
        (Li "一个对象的集合" $V ", 这些对象被称为向量;")
        (Li "一个法则 (或者说运算), 被称为向量加法, 联系每对" $V
            "中向量" $alpha "和" $beta "以一个" $V
            "中向量" (&+ $alpha $beta) ", 其被称为" $alpha "和" $beta
            "之和, 并且该运算满足"
            (Ol #:attr* '((type "a"))
                (Li "加法是交换的, " (commute+ $alpha $beta) ";")
                (Li "加法是结合的, " (assoc+ $alpha $beta $gamma) ";")
                (Li $V "中存在唯一的向量" $0 ", 被称为零向量, 满足"
                    (&= (&+ $alpha $0) $alpha) "对于" $V "中所有向量"
                    $alpha "成立;")
                (Li "对于每个" $V "中向量" $alpha ", 存在唯一的"
                    $V "中向量" (&- $alpha) "满足"
                    (&= (&+ $alpha (@- $alpha)) $0) ";")))
        (Li "一种法则 (或者说运算), 被称为标量乘法, 联系每个" $F
            "中标量" $c "和" $V "中向量" $alpha
            "以一个" $V "中向量" (&i* $c $alpha) ", 其被称为"
            $c "和" $alpha "之积, 并且该运算满足"
            (Ol #:attr* '((type "a"))
                (Li (&= (&i* $1 $alpha) $alpha) "对于每个"
                    $V "中的" $alpha "成立;")
                (Li (assoc* $c_1 $c_2 $alpha) ";")
                (Li (disR $c $alpha $beta) ";")
                (Li (disL $c_1 $c_2 $alpha) ".")))))
   (P "注意到, 正如定义所言, 一个向量空间是一个复合对象, 包含一个域, "
      "一集&quot;向量&quot;, 和两个带有特别性质的运算. 相同的向量集合可能是其他不同向量空间的"
      "组成部分 (见以下的例子5). 当没有歧义的时候, 我们就简单地以" $V "引用这个向量空间, 或者"
      "当我们想要刻画域的时候, 我们就说" $V "是一个域" $F "上的向量空间. &quot;向量&quot;"
      "这个名字应用于集合" $V "的元素很大程度上只是为了方便起见. 这个名字的由来可以从以下的"
      "例子1中找到, 但读者不应该给这个名字附加太多的重要性, 因为作为向量出现的各种对象可能"
      "与读者对于向量预先赋予的概念并无类似之处. 我们将在下面的一连串例子中尽力传达这点. "
      "随着我们开始研究向量空间, 例子也会丰富起来.")
   ((example #:n "1")
    (B $n "元组空间, " $F^n ".") " 令" $F "是任意的域, 令" $V "是所有" $n "元组"
    (&= $alpha (tu0 $x_1 $x_2 $..h $x_n)) "构成的集合, 其中" $x_i "是" $F
    "中的标量. 如果" (&= $beta (tu0 $y_1 $y_2 $..h $y_n)) ", 其中" $y_i "是" $F
    "中的标量, 那么" $alpha "和" $beta "的和由"
    (MB (&= (&+ $alpha $beta)
            (tu0 (&+ $x_1 $y_1) (&+ $x_2 $y_2) $..h (&+ $x_n $y_n))))
    "定义. 标量" $c "和向量" $alpha "的积由"
    (MB (&= (&i* $c $alpha) (tu0 (&i* $c $x_1) (&i* $c $x_2) $..h (&i* $c $x_n))))
    "定义. 这向量加法和标量乘法满足条件3和4是容易验证的, 运用" $F "的元素的加法和乘法"
    "的类似性质即可.")
   ((example #:n "2")
    (B m*n "矩阵的空间, " (^ $F m*n) ".") " 令" $F "是任意的域, 并令" $m "和"
    $n "是正整数. 令" (^ $F m*n) "是域" $F "上所有" m*n "矩阵构成的集合. "
    (^ $F m*n) "中的两个向量" $A "和" $B "的和由"
    (MB (&= (_ (@ (&+ $A $B)) (&cm $i $j))
            (&+ Aij
                (mref $B $i $j))))
    "定义. 标量" $c "和矩阵" $A "的积由"
    (MB (&= (_ (@ (&i* $c $A)) (&cm $i $j)) (&i* $c Aij)))
    "定义. 注意到" (&= (^ $F (&c* $1 $n)) $F^n) ". "
    "[译注: 在同构的意义上.]")
   ((example #:n "3")
    (B "从一个集合到一个域的函数的空间.") " 令" $F "是任意的域, 令" $S "是一个非空集合. "
    "令" $V "是所有从集合" $S "到域" $F "的函数构成的集合. " $V "中两个向量" $f "和" $g
    "之和是向量" (&+ $f $g) ", 即一个从" $S "到" $F "的函数, 由"
    (MB (&= (app (@ (&+ $f $g)) $s) (&+ (app $f $s) (app $g $s))))
    "定义. 标量" $c "和函数" $f "的积是函数" (&i* $c $f) ", 由"
    (MB (&= (app (@ (&i* $c $f)) $s) (&i* $c (app $f $s))))
    "定义. 前述例子不过就是这个的特殊情形. 对于" $F "的元素的" $n "元组而言, 其或可被视为"
    "从整数" (&cm $1 $..h $n) "的集合" $S "到" $F "的一个函数. 类似地, 一个域" $F
    "上的" m*n "矩阵是一个从整数序对"
    (&cm (tu0 $i $j) (&<= $1 $i $m) (&<= $1 $j $n)) "的集合" $S "到域" $F "的函数. "
    "对于这第三个例子, 我们将指明读者该如何验证条件3和4. 对于向量加法:"
    (Ol #:attr* '((type "a"))
        (Li "既然" $F "中的加法是交换的,"
            (MB (commute+ (app $f $s) (app $g $s)))
            "对于每个" $S "中的" $s "成立, 于是函数" (&+ $f $g) "和"
            (&+ $g $f) "是等同的.")
        (Li "既然" $F "中的加法是结合的,"
            (MB (&= (&+ (app $f $s) (bra0 (&+ (app $g $s) (app $h $s))))
                    (&+ (bra0 (&+ (app $f $s) (app $g $s)))
                        (app $h $s))))
            "对于每个" $s "成立, 于是" (&+ $f (@ (&+ $g $h))) "和"
            (&+ (@ (&+ $f $g)) $h) "是相同的函数.")
        (Li "唯一的零向量就是零函数, 其赋" $S "的每个元素以" $F "中的标量" $0 ".")
        (Li "对于每个" $V "中的" $f ", " (@ (&- $f)) "是由"
            (MB (&= (app (@ (&- $f)) $s) (&- (app $f $s))))
            "给定的函数.")
        )
    "读者应当发现验证标量乘法满足条件4是容易的, 通过施行类似于我们上面对于向量加法的论证."
    )
   ((example #:n "4")
    (B "域" $F "上的多项式函数的空间.") " 令" $F "是一个域, 令" $V "是所有具有如下形式的从"
    $F "到" $F "的函数"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
    "构成的集合, 其中" (&cm $c_0 $c_1 $..h $c_n) "是" $F "中固定的标量 (独立于" $x "). "
    "一个这种类型的函数被称为" $F "上的一个多项式函数. 令加法和标量乘法如例子3所定义的那样. "
    "读者必须观察到如果" $f "和" $g "是多项式函数而" $c "在" $F "中, 那么" (&+ $f $g) "和"
    (&i* $c $f) "也是多项式函数.")
   ((example #:n "5")
    "复数域" $CC "可以被当作实数域" $RR "上的向量空间. 更一般地, 令" $F "实数域, 而令" $V
    "是" $n "元组" (tu0 $x_1 $..h $x_n) "的集合, 其中" (&cm $x_1 $..h $x_n) "是复数. "
    "如例子1一样定义向量的加法和标量乘法, 这般我们就得到了一个实数域" $RR "上的向量空间, 其与"
    $CC^n "和" $RR^n "相当不同.")
   (P "从向量空间的定义中我们几乎立刻就能推出一些简单的事实, 接下来我们将推导它们. "
      "如果" $c "是一个标量而" $0 "是零向量, 那么根据3c和4c"
      (MB (&= (&i* $c $0) (&i* $c (@ (&+ $0 $0))) (&+ (&i* $c $0) (&i* $c $0))))
      "加上" (&- (@ (&i* $c $0))) "并使用3d, 我们就得到了"
      (MB (&= (&i* $c $0) $0))
      "类似地, 对于标量" $0 "和任意的向量" $alpha "我们发现"
      (MB (&= (&i* $0 $alpha) $0))
      "如果" $c "是一个非零标量而" $alpha "是一个向量满足" (&= (&i* $c $alpha) $0)
      "那么根据" (&= (&i* $c $0) $0) ", 我们有"
      (&= (&i* (inv $c) (@ (&i* $c $0))) $0) ", 但是又因为"
      (MB (&= (&i* (inv $c) (@ (&i* $c $0)))
              (&i* (@ (&i* (inv $c) $c)) $alpha)
              (&i* $1 $alpha) $alpha))
      "于是" (&= $alpha $0) ". 因此, 我们看到如果" $c "是一个标量而" $alpha
      "是一个向量, 并且" (&= (&i* $c $alpha) $0) ", 那么要么" $c "标量零, 要么"
      $alpha "是零向量." (Br)
      "如果" $alpha "是" $V "中任意的向量, 那么"
      (MB (&= $0 (&i* $0 $alpha) (&i* (@ (&- $1 $1)) $alpha)
              (&+ (&i* $1 $alpha) (&i* (@ $-1) $alpha))
              (&+ $alpha (&i* (@ $-1) $alpha))))
      "从中就推出"
      (MB (&= (&i* (@ $-1) $alpha) (&- $alpha)))
      "最后, 向量加法的结合和交换性质可以推出牵扯到数个向量的和独立于这些向量组合和结合的方式. "
      "例如, 如果" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "是" $V "中向量, 那么"
      (MB (&= (&+ (@ (&+ $alpha_1 $alpha_2)) (@ (&+ $alpha_3 $alpha_4)))
              (&+ (bra0 (&+ $alpha_2 (@ (&+ $alpha_1 $alpha_3)))) $alpha_4)))
      "并且这样一个和可以无歧义地被写成"
      (MB (&+ $alpha_1 $alpha_2 $alpha_3 $alpha_4)))
   ((definition)
    $V "中一个向量" $beta "被称为" $V "中向量" alpha_1..n
    "的线性组合, 只要存在" $F "中的标量" (&cm $c_1 $..h $c_n) "满足"
    (MB (&= $beta (LC0 $c_1 $alpha_1 $c_n $alpha_n) (sum (&= $i $1) $n (&i* $c_i $alpha_i)))))
   (P "对于向量加法的结合性质以及标量乘法的分配性质4c和4d的其他扩展"
      "可以施行于线性组合之上:"
      (MB (&Table
           ((&+ (sum (&= $i $1) $n (&i* $c_i $alpha_i))
                (sum (&= $i $1) $n (&i* $d_i $alpha_i)))
            $=
            (sum (&= $i $1) $n (&i* (@ (&+ $c_i $d_i)) $alpha_i)))
           ((&i* $c (sum (&= $i $1) $n (&i* $c_i $alpha_i)))
            $=
            (sum (&= $i $1) $n (&i* (@ (&i* $c $c_i)) $alpha_i)))
           )))
   (P "线性代数的特定部分与几何紧密关联. &quot;空间&quot;暗示了某种几何的东西, "
      "&quot;向量&quot;对于大多数人也是如此. 当我们进一步研究向量空间时, "
      "读者将会发现许多术语的确拥有几何的内涵. 在结束介绍向量空间的本节之前, "
      "我们将在某种程度上讨论向量空间和几何之间的关系, 至少能够指明&quot;向量空间&quot;"
      "这个名字的由来. 这将会是简要的直觉性的讨论.")
   (P "让我们考虑向量空间" $RR^3 ". 在解析几何中, 人们将实数三元组" (tu0 $x_1 $x_2 $x_3)
      "和三维Euclid空间中的点视为等同的. 在这样的上下文之中, 一个向量经常被定义成一个有向线段"
      (: $P $Q) ", 从点" $P "的位置到点" $Q ". 这相当于对从" $P "到" $Q "的&quot;箭头&quot;"
      "的想法进行小心的形式化. 当向量被使用时, 意图在于它们应该由它们的长度和方向所决定. "
      "因此, 当两个有向线段具有相同的长度和相同的方向时, 人们必须将其视为等同的.")
   (P "从" (&= $P (tu0 $x_1 $x_2 $x_3)) "到" (&= $Q (tu0 $y_1 $y_2 $y_3))
      "的有向线段" (: $P $Q) "与从原点" (&= $O (tu0 $0 $0 $0)) "到点"
      (tu0 (&- $y_1 $x_1) (&- $y_2 $x_2) (&- $y_3 $x_3)) "的有向线段具有相同的长度和方向. "
      "并且, 这是自原点出发而与" (: $P $Q) "具有相同长度和方向的唯一一条有向线段. "
      "因此, 如果读者同意仅处理从原点出发的向量, 那么与每个给定的长度和方向相关联着的"
      "仅恰有一个向量.")
   (P "从原点至" (&= $P (tu0 $x_1 $x_2 $x_3)) "的向量" (: $O $P) "完全由" $P
      "决定, 因此将这个向量与点" $P "视为等同是可能的. 在我们对于向量空间" $RR^3
      "的定义中, 那些向量就简单地被定义成三元组" (tu0 $x_1 $x_2 $x_3) ".")
   (P "给定点" (&= $P (tu0 $x_1 $x_2 $x_3)) "和" (&= $Q (tu0 $y_1 $y_2 $y_3)) ", 向量"
      (: $O $P) "和" (: $O $Q) "之和的定义可以被几何地给出. 如果这两个向量不是平行的, 那么线段"
      (: $O $P) "和" (: $O $Q) "确定了一个平面, 并且这两条线段是该平面中的一个平行四边形的两条边"
      " (见图1). 该平行四边形的一条对角线自" $O "延伸至点" $S ", 而" (: $O $P) "和" (: $O $Q)
      "之和就被定义成向量" (: $O $S) ". 点" $S "的坐标为"
      (tu0 (&+ $x_1 $y_1) (&+ $x_2 $y_2) (&+ $x_3 $y_3)) ", 因此这向量加法的几何定义"
      "就等价于例子1的代数定义.")
   ;dirty, to be improved
   (let* ((x1 0.3)
          (x2 0.6)
          (x3 0.4)
          (P (make-pt3 x1 x2 x3))
          (y1 0.2)
          (y2 -0.1)
          (y3 0.3)
          (Q (make-pt3 y1 y2 y3))
          (z1 (+ x1 y1))
          (z2 (+ x2 y2))
          (z3 (+ x3 y3))
          (S (make-pt3 z1 z2 z3))
          (draw-vec (&vec3 frame0))
          (draw-line (&line:pt3 frame0)))
     (&label
      (Svg
       #:attr* '((width "480") (height "270") (stroke "black"))
       (Defs marker0)
       (&frame frame0)
       (draw-vec (make-vec3 x1 x2 x3))
       (draw-line (make-pt3 0 x2 0) (make-pt3 x1 x2 0))
       (draw-line (make-pt3 x1 x2 0) P)
       (draw-vec (make-vec3 y1 y2 y3))
       (draw-line (make-pt3 0 0 0) (make-pt3 0 y2 0))
       (draw-line (make-pt3 0 y2 0) (make-pt3 y1 y2 0))
       (draw-line (make-pt3 y1 y2 0) Q)
       (draw-vec (make-vec3 z1 z2 z3))
       (draw-line (make-pt3 0 z2 0) (make-pt3 z1 z2 0))
       (draw-line (make-pt3 z1 z2 0) S)
       (set-attr* (draw-line P S) 'stroke-dasharray "8 4")
       (set-attr* (draw-line Q S) 'stroke-dasharray "8 4")
       (let* ((c ((pt3->2 frame0) P))
              (x (n2s (pt2-x c))) (y (n2s (- (pt2-y c) 10))))
         (ForeignObject
          #:attr* `((x ,x) (y ,y) (width "100") (height "30"))
          (: $P (tu0 $x_1 $x_2 $x_3))))
       (let* ((c ((pt3->2 frame0) Q))
              (x (n2s (- (pt2-x c) 100))) (y (n2s (- (pt2-y c) 10))))
         (ForeignObject
          #:attr* `((x ,x) (y ,y) (width "100") (height "30"))
          (: $Q (tu0 $y_1 $y_2 $y_3))))
       (let* ((c ((pt3->2 frame0) S))
              (x (n2s (- (pt2-x c) 60))) (y (n2s (- (pt2-y c) 25))))
         (ForeignObject
          #:attr* `((x ,x) (y ,y) (width "200") (height "30"))
          (: $S (tu0 (&+ $x_1 $y_1) (&+ $x_2 $y_2) (&+ $x_3 $y_3))))))
      "图1"))
   (P "标量乘法拥有一个简单的几何解释. 如果" $c "是一个实数, 那么" $c "与向量" (: $O $P)
      "之积是一个向量, 其自原点出发, 长度为" (&abs $c) "乘以" (: $O $P) "的长度, 方向在"
      (&> $c $0) "时与" (: $O $P) "相同, " (&< $c $0) "时与" (: $O $P) "相反. "
      "这标量乘法就产生向量" (: $O $T) ", 其中"
      (&= $T (tu0 (&i* $c $x_1) (&i* $c $x_2) (&i* $c $x_3)))
      ", 因此也与为" $RR^3 "给出的代数定义一致.")
   (P "时不时地, 读者可能会发现&quot;几何地思考&quot;向量空间很有助益. 也就是说, "
      "出于自身的需要, 通过绘图来刻画和启发一些想法. "
      "的确, 读者应该这么做. 然而, 在绘制这样的图形时, 读者必须记住, 由于我们是把向量空间"
      "作为代数系统进行处理的, 所有我们给出的证明在性质上都是代数的.")
   ((exercise #:n "1")
    "如果" $F "是一个域, 验证" $F^n " (在例子1中被定义) 是一个域" $F "上的向量空间.")
   ((exercise #:n "2")
    "如果" $V "是一个域" $F "上的向量空间, 验证"
    (MB (&= (&+ (@ (&+ $alpha_1 $alpha_2))
                (@ (&+ $alpha_3 $alpha_4)))
            (&+ (bra0 (&+ $alpha_2 (@ (&+ $alpha_3 $alpha_1))))
                $alpha_4)))
    "对于" $V "中所有向量" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "成立.")
   ((exercise #:n "3")
    "如果" $CC "是复数域, 那么" $CC^3 "中哪些向量是"
    (&cm (tu0 $1 $0 $-1) (tu0 $0 $1 $1) (tu0 $1 $1 $1)) "的线性组合?")
   ((exercise #:n "4")
    "令" $V "是所有实数序对" (tu0 $x $y) "的集合, 令" $F "是实数域, 定义"
    (MB (&cm (&= (&+ (tu0 $x $y) (tu0 $x_1 $y_1))
                 (tu0 (&+ $x $x_1) (&+ $y $y_1)))
             (&= (&i* $c (tu0 $x $y))
                 (tu0 (&i* $c $x) (&i* $c $y)))))
    $V "在这些运算下是一个实数域上的向量空间吗?")
   ((exercise #:n "5")
    "在" $RR^n "上定义两个运算"
    (MB (&cm (&= (&oplus $alpha $beta) (&- $alpha $beta))
             (&= (&d* $c $alpha) (&- (&i* $c $alpha)))))
    "右侧的运算即通常的运算, 那么" (tu0 $RR^n $oplus $d*)
    "满足哪些向量空间的公理?")
   ((exercise #:n "6")
    "令" $V "是所有满足"
    (MB (&= (app $f (&- $t)) (OverBar (app $f $t))))
    "的实数轴上的复值函数" $f "的集合. 横杠代表复共轭. 证明" $V
    ", 对于运算"
    (MB (&cm (&= (app (@ (&+ $f $g)) $t)
                 (&+ (app $f $t) (app $g $t)))
             (&= (app (@ (&i* $c $f)) $t)
                 (&i* $c (app $f $t)))))
    "是一个实数域上的向量空间. 给出" $V "中一个不是实值函数的例子.")
   ((exercise #:n "7")
    "令" $V "是实数序对" (tu0 $x $y) "的集合, 令" $F "是实数域, 定义"
    (MB (&cm (&= (&+ (tu0 $x $y) (tu0 $x_1 $y_1))
                 (tu0 (&+ $x $x_1) $0))
             (&= (&i* $c (tu0 $x $y))
                 (tu0 (&i* $c $x) $0))))
    $V "在这些运算下是一个向量空间吗?")
   (H3 "第2.2节 子空间")
   (P "本节我们引入一些研究向量空间的基本概念.")
   ((definition)
    "令" $V "是域" $F "上的向量空间. " $V "的子空间"
    "是" $V "的子集" $W ", 其在" $V "的加法和数乘之下是域"
    $F "上的向量空间.")
   (P "对于向量空间的公理的直接检视表明, " $V "的子集" $W "是一个子空间, 如果对于每个" $W "中的"
      $alpha "和" $beta ", 向量" (&+ $alpha $beta) "也在" $W "中; 零向量" $0 "在" $W "之中; "
      "对于每个" $W "中的" $alpha ", 向量" (@ (&- $alpha)) "在" $W "之中; 对于每个" $W "中的"
      $alpha "和每个标量" $c ", 向量" (&i* $c $alpha) "在" $W "之中. 向量加法的交换律和结合律, "
      "以及标量乘法的性质4a, 4b, 4c, 4d并不需要验证, 因为这些是" $V "上的运算所固有的性质. "
      "判断的标准还可以进一步得到简化.")
   ((theorem #:n "1")
    $V "的非空子集" $W "是" $V "的一个子空间当且仅当对于" $W "中的每对向量" $alpha "和" $beta
    "以及" $F "中的每个标量" $c ", 向量" (LC $c $alpha $beta) "仍然在" $W
    "之中. [译注: 空集显然不是子空间, 因为向量空间至少包含零向量.]")
   ((proof)
    "设" $W "是" $V "是一个非空子集, 其满足对于" $W "中所有的向量" $alpha "和" $beta
    "以及" $F "中所有的标量" $c "有" (LC $c $alpha $beta) "属于" $W ". 既然"
    $W "是非空的, " $W "中存在一个向量" $rho ", 因此" (&= (LC (@ $-1) $rho $rho) $0)
    "也在" $W "中. 然后, 如果" $alpha "是" $W "中的任意向量, " $c "是任意的标量, 那么向量"
    (&= (&i* $c $alpha) (LC $c $alpha $0)) "在" $W "中. 特别地, "
    (&= (&i* (@ $-1) $alpha) (&- $alpha)) "在" $W "中. 最后, 如果" $alpha "和"
    $beta "在" $W "中, 那么" (&= (&+ $alpha $beta) (LC $1 $alpha $beta))
    "在" $W "中. 因此, " $W "是" $V "的一个子空间." (Br)
    "反过来, 如果" $W "是" $V "的一个子空间, " $alpha "和" $beta "在" $W "中, "
    $c "是一个标量, 当然有" (LC $c $alpha $beta) "在" $W "中.")
   (P "有些人倾向于使用定理中的" (LC $c $alpha $beta) "性质作为子空间的定义. "
      "这没有什么区别. 重要的是, 如果" $W "是一个" $V "的非空子集满足对于" $W "中的"
      $alpha "和" $beta "以及" $F "中的" $c "有" (LC $c $alpha $beta)
      "在" $V "之中, 那么" $W " (在继承自" $V "的运算下) 是一个向量空间. "
      "这给我们提供了许多向量空间的新例子.")
   ((example #:n "6")
    (Ol #:attr* '((type "a"))
        (Li "如果" $V "是任意的向量空间, 那么" $V "是" $V "的一个子空间; "
            "仅包含零向量的子集也是" $V "的子空间, 被称为" $V "的零子空间.")
        (Li "在" $F^n "中, 满足" (&= $x_1 $0) "的" $n "元组"
            (tu0 $x_1 $..h $x_n) "的集合是一个子空间; 然而, 满足"
            (&= $x_1 (&+ $1 $x_2)) "的" $n
            "元组的集合不是一个子空间 (" (&>= $n $2) ").")
        (Li "域" $F "上的多项式函数的空间是从" $F "到" $F "的所有函数的空间的子空间.")
        (Li "域" $F "上的一个" n*n "矩阵" $A "是对称的, 如果对于每个" $i "和" $j "有"
            (&= Aij (mref $A $j $i)) ". 对称矩阵形成了一个域" $F
            "上的" n*n "矩阵的空间的子空间.")
        (Li "域" $CC "上的一个" n*n "矩阵" $A "是Hermite的 (或者说自伴的), 如果"
            (MB (&= (mref $A $j $k) (OverBar (mref $A $k $j))))
            "对于每个" $j "和" $k "成立, 其中横杠代表复共轭. 一个" 2*2
            "矩阵是Hermite的当且仅当其具有如下形式"
            (MB (Mat ($z (&+ $x (&i* $i $y)))
                     ((&- $x (&i* $i $y)) $w)))
            "其中" (&cm $x $y $z $w) "是实数. 所有Hermite矩阵的集合不是" $CC
            "上的" n*n "矩阵空间的子空间, 因为如果" $A "是Hermite的, 那么它的"
            "对角线元素" (&cm (mref $A $1 $1) (mref $A $2 $2) $..h)
            "都是实数, 但是" (&i* $i $A) "的对角线元素不总是实数. 另一方面, 很容易验证"
            n*n "的复Hermite矩阵的集合是一个域" $RR "上的向量空间 (在通常的运算下).")))
   ((example #:n "7")
    (B "齐次线性方程组的解空间.") " 令" $A "是域" $F "上的一个" m*n "矩阵, 那么满足"
    AX=0 "的所有" n*1 "矩阵" $X "构成的集合是域" $F "上的" n*1
    "矩阵空间的一个子空间. 为了证明这个事实, 我们必须证明当" AX=0 ", "
    (LE $A $Y $0) "以及" $c "是" $F "中任意标量时有" (LE $A (@LC $c $X $Y) $0)
    ", 而这可由以下的一般性事实立即得到.")
   ((lemma)
    "如果" $A "是域" $F "上的一个" m*n "矩阵而" $B "和" $C "是域" $F "上的"
    n*p "矩阵, 那么"
    (MB (&= (&i* $A (@LC $d $B $C))
            (LC $d @AB $A $C)))
    "对于每个" $F "中的标量" $d "成立. ")
   ((proof)
    (MB
     (deriv (mref (bra0 (&i* $A (@ (LC $d $B $C)))) $i $j)
            (sum $k $ (&i* (mref $A $i $k)
                           (mref (@ (LC $d $B $C)) $k $j)))
            (sum $k $
                 (@ (&+ (&i* $d (mref $A $i $k) (mref $B $k $j))
                        (&i* (mref $A $i $k) (mref $C $k $j)))))
            (LC $d (sum $k $ (&i* (mref $A $i $k) (mref $B $k $j)))
                (sum $k $ (&i* (mref $A $i $k) (mref $C $k $j))))
            (LC $d (mref @AB $i $j)
                (mref (&i* $A $C) $i $j))
            (mref (bra0 (LC $d @AB $A $C)) $i $j))))
   (P "类似地, 还可以证明"
      (&= (&i* (@ (LC $d $B $C)) $A) (LC $d (@i* $B $A) $C $A))
      ", 若矩阵的和与积确有定义.")
   ((theorem #:n "2")
    "令" $V "是域" $F "上的一个向量空间, 那么" $V "的任何子空间族的交是"
    $V "的子空间.")
   ((proof)
    "令" (cur0 $W_alpha) "是" $V "的一个子空间族, 令"
    (&= $W (: (Munder $Cap $alpha) $W_alpha)) "是其交. 回忆一下, "
    $W "被定义成属于每个" $W_alpha "的所有元素的集合 (见附录). "
    "既然每个" $W_alpha "都是子空间, 那么每个都包含零向量, 于是其交" $W
    "也包含零向量, " $W "非空. 令" $alpha "和" $beta "是" $W
    "中的向量, 令" $c "是一个标量. 根据" $W "的定义, " $alpha "和"
    $beta "都属于每个" $W_alpha ", 并且因为每个" $W_alpha
    "都是一个子空间, 向量" (@ (LC $c $alpha $beta))
    "在每个" $W_alpha "之中, 于是" (@ (LC $c $alpha $beta))
    "也在" $W "里. 根据定理1, " $W "是" $V "的一个子空间.")
   (P "根据定理2, 若" $S "是" $V "的任意子集, 那么存在一个包含" $S
      "的最小的" $V "的子空间, 最小的意思即这个包含" $S
      "的子空间是其他每个包含" $S "的子空间的子集.")
   ((definition)
    "令" $S "是一个向量的集合, 其来自于一个向量空间" $V ". 由" $S
    "张成的子空间被定义为所有包含" $S "的" $V "的子空间的交" $W
    ". 当" $S "是有限的向量集时, 如"
    (&= $S (en0 $alpha_1 $alpha_2 $..h $alpha_n))
    ", 我们也将" $W "简单地称为由向量"
    (&cm $alpha_1 $alpha_2 $..h $alpha_n)
    "张成的子空间.")
   ((theorem #:n "3")
    "由向量空间" $V "的一个非空子集" $S "张成的子空间是"
    $S "中向量所有的线性组合构成的集合.")
   ((proof)
    "令" $W "是" $S "张成的子空间, 那么" $S "中的向量"
    (&cm $alpha_1 $alpha_2 $..h $alpha_m)
    "的每个线性组合"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_2 $alpha_2 $x_m $alpha_m)))
    "显然在" $W "之中. 因此, " $W "包含集合" $L ", " $L
    "为" $S "中向量的所有线性组合的集合. 另一方面, 集合" $L
    "包含" $S ", 是非空的. 如果" $alpha "和" $beta "属于" $L
    ", 那么" $alpha "是一个线性组合,"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_2 $alpha_2 $x_m $alpha_m)))
    "其中" $alpha_i "在" $S "中, 并且" $beta "是一个线性组合,"
    (MB (&= $beta (LC0 $y_1 $beta_1 $y_2 $beta_2 $y_n $beta_n)))
    "其中" $beta_j "在" $S "中. 对于每个标量" $c ","
    (MB (&= (LC $c $alpha $beta)
            (&+ (sum (&= $i $1) $m
                     (&i* (@ (&i* $c $x_i)) $alpha_i))
                (sum (&= $j $1) $n
                     (&i* $y_j $beta_j)))))
    "因此, " (LC $c $alpha $beta) "属于" $L ", 于是"
    $L "是" $V "的一个子空间." (Br)
    "现在我们已经证明" $L "是包含" $S "的一个" $V "的子空间, 并且任何包含" $S
    "的子空间也包含" $L ", 于是" $L "是所有包含" $S "的子空间之交, 即" $L
    "是由集合" $S "张成的子空间.")
   ((definition)
    "如果" (&cm $S_1 $S_2 $..h $S_k) "是向量空间" $V "的子集, 那么所有形式为"
    (MB (&+ $alpha_1 $alpha_2 $..c $alpha_k))
    "的和 (其中" $alpha_i "在" $S_i "之中) 构成的集合被称为子集"
    (&cm $S_1 $S_2 $..h $S_k) "的和, 用记号"
    (MB (&+ $S_1 $S_2 $..c $S_k)) "表达, 或者"
    (MB (sum (&= $i $1) $k $S_i))
    "如果" (&cm $W_1 $W_2 $..h $W_k) "是" $V "的子空间, 那么和"
    (MB (&= $W (&+ $W_1 $W_2 $..c $W_k)))
    "显然是" $V "的一个子空间, 其包含每个子空间" $W_i ". 从中可以得到, 正如定理3"
    "的证明, " $W "是由" (&cm $W_1 $W_2 $..h $W_k) "之并张成的子空间.")
   ((example #:n "8")
    "令" $F "是复数域" $CC "的一个子域, 设"
    (MB (&cm (&= $alpha_1 (tu0 $1 $2 $0 $3 $0))
             (&= $alpha_2 (tu0 $0 $0 $1 $4 $0))
             (&= $alpha_3 (tu0 $0 $0 $0 $0 $1))))
    "根据定理3, 一个向量" $alpha "在由" (&cm $alpha_1 $alpha_2 $alpha_3)
    "张成的" $F^5 "的子空间" $W "之中当且仅当存在" $F "中的标量"
    (&cm $c_1 $c_2 $c_3) "满足"
    (MB (&= $alpha (LC $c_1 $alpha_1 $c_2 $alpha_2 $c_3 $alpha_3)))
    "因此" $W "由所有形式为"
    (MB (&= $alpha (tu0 $c_1 (&i* $2 $c_1) $c_2
                        (LC $3 $c_1 $4 $c_2) $c_3)))
    "的向量构成, 其中" (&cm $c_1 $c_2 $c_3) "是" $F
    "中任意的标量. 换句话说, " $W "可以被描述为由满足"
    (MB (&cm (&= $x_2 (&i* $2 $x_1))
             (&= $x_4 (LC $3 $x_1 $4 $x_3))))
    "的" $5 "元组"
    (MB (&= $alpha (tu0 $x_1 $x_2 $x_3 $x_4 $x_5)))
    "构成的集合, 其中" $x_i "在" $F "中. 因此, "
    (tu0 $-3 $-6 $1 $-5 $2) "在" $W "中, 而"
    (tu0 $2 $4 $6 $7 $8) "不在.")
   ((example #:n "9")
    "令" $F "是复数域" $CC "的一个子域, 令" $V "是域" $F "上所有" 2*2
    "矩阵的向量空间. 令" $W_1 "是包含所有形式为"
    (MB (Mat ($x $y) ($z $0)))
    "的矩阵的" $V "的子集, 其中" (&cm $x $y $z) "是" $F "中任意的标量. "
    "最后, 令" $W_2 "是包含所有形式为"
    (MB (Mat ($x $0) ($0 $y)))
    "的矩阵的" $V "的子集, 其中" $x "和" $y "是" $F "中任意的标量. "
    "那么, " $W_1 "和" $W_2 "是" $V "的子空间, 并且"
    (MB (&= $V (&+ $W_1 $W_2)))
    "因为"
    (MB (&= (Mat ($a $b) ($c $d))
            (&+ (Mat ($a $b) ($c $0)) (Mat ($0 $0) ($0 $d)))))
    "子空间" (&cap $W_1 $W_2) "包含所有形式为"
    (MB (Mat ($x $0) ($0 $0)))
    "的矩阵.")
   ((example #:n "10")
    "令" $A "是域" $F "上的一个" m*n "矩阵. " $A "的行向量是" $F^n "中的向量, 其由"
    (&cm (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n)))
         (&= $i (&cm $1 $..h $m)))
    "给定. 由" $A "的行向量张成的" $F^n "的子空间被称为" $A "的行空间. "
    "例子8中所考虑的子空间是矩阵"
    (MB (&= $A (Mat ($1 $2 $0 $3 $0)
                    ($0 $0 $1 $4 $0)
                    ($0 $0 $0 $0 $1))))
    "的行空间. 它也是矩阵"
    (MB (&= $B (Mat ($1 $2 $0 $3 $0)
                    ($0 $0 $1 $4 $0)
                    ($0 $0 $0 $0 $1)
                    ($-4 $-8 $1 $-8 $0))))
    "的行空间.")
   ((example #:n "11")
    "令" $V "是所有域" $F "上的多项式函数的空间, 令" $S "是" $V "的一个子集, 包含多项式函数"
    (&cm $f_0 $f_1 $f_2 $..h) ", 其由"
    (MB (&cm (&= (app $f_n $x) $x^n) (&= $n (&cm $0 $1 $2 $..h))))
    "定义, 那么" $V "是由" $S "张成的子空间.")
   ((exercise #:n "1")
    "以下哪些" $RR^n "中的向量" (&= $alpha (tu0 $a_1 $..h $a_n))
    "的集合是" $RR^n "的子空间 (" (&>= $n $3) ")?"
    (Ol #:attr* '((type "a"))
        (Li "所有满足" (&>= $a_1 $0) "的" $alpha ";")
        (Li "所有满足" (&= (&+ $a_1 (&i* $3 $a_2)) $a_3) "的" $alpha ";")
        (Li "所有满足" (&= $a_2 (_^ $a $1 $2)) "的" $alpha ";")
        (Li "所有满足" (&= (&i* $a_1 $a_2) $0) "的" $alpha ";")
        (Li "所有" $a_2 "为有理数的" $alpha ".")))
   ((exercise #:n "2")
    "令" $V "是所有从" $RR "到" $RR "的函数" $f "构成的(实)向量空间, "
    "以下哪些函数的集合是" $V "的子空间?"
    (Ol #:attr* '((type "a"))
        (Li "所有满足" (&= (app $f $x^2) (^ (bra0 (app $f $x)) $2)) "的" $f ";")
        (Li "所有满足" (&= (app $f $0) (app $f $1)) "的" $f ";")
        (Li "所有满足" (&= (app $f $3) (&+ $1 (app $f $-5))) "的" $f ";")
        (Li "所有满足" (&= (app $f $-1) $0) "的" $f ";")
        (Li "所有连续的" $f ".")))
   ((exercise #:n "3")
    "向量" (tu0 $3 $-1 $0 $-1) "在由向量"
    (&cm (tu0 $2 $-1 $3 $2) (tu0 $-1 $1 $1 $-3) (tu0 $1 $1 $9 $-5))
    "张成的" $RR^4 "的子空间之中吗?")
   ((exercise #:n "4")
    "令" $W "是满足"
    (MB (&LE ((&i* $2 $x_1) $- $x_2 $+ (&i* 4/3 $x_3) $- $x_4 $ $ $= $0)
             ($x_1 $ $ $+ (&i* 2/3 $x_3) $ $ $- $x_5 $= $0)
             ((&i* $9 $x_1) $- (&i* $3 $x_2) $+ (&i* $6 $x_3) $-
                            (&i* $3 $x_4) $- (&i* $3 $x_5) $= $0)))
    "的所有" $RR^5 "中的" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5) "的集合. "
    "找出一个张成" $W "的向量的有限集合.")
   ((exercise #:n "5")
    "令" $F "是一个域, " $n "是一个大于等于" $2 "的正整数. "
    "令" $V "是域" $F "上所有" n*n "矩阵的向量空间. "
    "以下哪些" $V "中矩阵" $A "的集合是" $V "的子空间?"
    (Ol #:attr* '((type "a"))
        (Li "所有可逆的" $A ";")
        (Li "所有不可逆的" $A ";")
        (Li "所有满足" (commute* $A $B) "的" $A ", 其中" $B "是" $V
            "中一个固定的矩阵;")
        (Li "所有满足" (&= $A^2 $A) "的" $A ".")))
   ((exercise #:n "6")
    (Ol #:attr* '((type "a"))
        (Li "证明" $RR^1 "的子空间仅有" $RR^1 "和零子空间.")
        (Li "证明" $RR^2 "的子空间是" $RR^2 ", 或是零子空间, 或是由某个" $RR^2
            "中固定的(非零)向量的标量倍数构成. (最后一种类型的子空间, 从直觉上说, "
            "是一条通过原点的直线.)")
        (Li "你能描述" $RR^3 "的子空间吗?")))
   ((exercise #:n "7")
    "令" $W_1 "和" $W_2 "是向量空间" $V "的子空间, 满足" $W_1 "和" $W_2 "之并也是子空间. "
    "证明其中一个空间" $W_i "是另一个的子集.")
   ((exercise #:n "8")
    "令" $V "是所有从" $RR "到" $RR "的函数" $f "的向量空间, 令" $V_e "是偶函数的子集, 即满足"
    (&= (app $f (&- $x)) (app $f $x)) "的函数, 令" $V_o "是奇函数的子集, 即满足"
    (&= (app $f (&- $x)) (&- (app $f $x))) "的函数."
    (Ol #:attr* '((type "a"))
        (Li "证明" $V_e "和" $V_o "是" $V "的子空间.")
        (Li "证明" (&= (&+ $V_e $V_o) $V) ".")
        (Li "证明" (&= (&cap $V_e $V_o) (cur0 $0)) ".")))
   ((exercise #:n "9")
    "令" $W_1 "和" $W_2 "是向量空间" $V "的子空间, 满足"
    (&= (&+ $W_1 $W_2) $V) "且" (&= (&cap $W_1 $W_2) (cur0 $0)) ". "
    "证明对于每个" $V "中的向量" $alpha "存在唯一的" $W_1
    "中的向量" $alpha_1 "和" $W_2 "中的向量" $alpha_2 "满足"
    (&= $alpha (&+ $alpha_1 $alpha_2)) ".")
   (H3 "第2.3节 基和维数")
   (P "现在我们转向为特定的向量空间赋一个维数的任务. 尽管我们通常将&quot;维数"
      "&quot;与某种几何的东西联系起来, 我们必须为向量空间的维数寻找一个合适的"
      "代数定义. 这将通过向量空间的基的概念来完成.")
   ((definition)
    "令" $V "是域" $F "上的一个向量空间. " $V "的一个子集" $S "被称为线性相关的, "
    "如果存在" $S "中不同的向量" (&cm $alpha_1 $alpha_2 $..h $alpha_n) "和"
    $F "中的不全为" $0 "的标量" (&cm $c_1 $c_2 $..h $c_n) "满足"
    (MB (&= (&+ (&i* $c_1 $alpha_1) (&i* $c_2 $alpha_2)
                $..c (&i* $c_n $alpha_n)) $0))
    "不是线性相关的集合被称为线性无关的. 如果集合" $S "仅包含有限多个向量"
    (&cm $alpha_1 $alpha_2 $..h $alpha_n) ", 有时我们称"
    (&cm $alpha_1 $alpha_2 $..h $alpha_n) "是线性相关的 (或线性无关的) 而不是说"
    $S "是线性相关的 (或线性无关的).")
   (P "以下陈述是定义的简单推论."
      (Ol (Li "任何包含线性相关集合的集合是线性相关的.")
          (Li "线性无关集合的任意子集是线性无关的.")
          (Li "任何包含零向量的集合是线性相关的, 因为" (&= (&d* $1 $0) $0) ".")
          (Li "一个集合" $S "是线性无关的当且仅当" $S "的每个有限子集是线性无关的, "
              "即当且仅当对于" $S "的不同向量" alpha_1..n "有"
              (&= (&+ (&i* $c_1 $alpha_1) $..c (&i* $c_n $alpha_n)) $0)
              "可以推出每个" (&= $c_i $0) ".")))
   ((definition)
    "令" $V "是一个向量空间. " $V "的一个基是一个能够张成" $V "的线性无关的"
    "向量集合. " $V "被称为有限维的, 如果它拥有一个有限的基.")
   ((example #:n "12")
    "令" $F "是一个" $CC "的子域. 在" $F^3 "中, 向量"
    (MB (&cm (&= $alpha_1 (tu0 $3 $0 $-3))
             (&= $alpha_2 (tu0 $-1 $1 $2))
             (&= $alpha_3 (tu0 $4 $2 $-2))
             (&= $alpha_4 (tu0 $2 $1 $1))
             ))
    "是线性相关的, 因为"
    (MB (&= (: (&i* $2 $alpha_1) $+ (&i* $2 $alpha_2) $- $alpha_3
               $+ (&d* $0 $alpha_4)) $0))
    "向量"
    (MB (&cm (&= $epsilon_1 (tu0 $1 $0 $0))
             (&= $epsilon_2 (tu0 $0 $1 $0))
             (&= $epsilon_3 (tu0 $0 $0 $1))))
    "是线性无关的."
    )
   ((example #:n "13")
    "令" $F "是一个域, 令" $S "是由" (&cm $epsilon_1 $epsilon_2 $..h $epsilon_n)
    "构成的" $F^n "的子集, 其中"
    (MB (&cm (&= $epsilon_1 (tu0 $1 $0 $0 $..h $0))
             (&= $epsilon_2 (tu0 $0 $1 $0 $..h $0))
             $..h
             (&= $epsilon_n (tu0 $0 $0 $0 $..h $1))))
    "令" (&cm $x_1 $x_2 $..h $x_n) "是" $F "中标量, 置"
    (&= $alpha (&+ (&i* $x_1 $epsilon_1) (&i* $x_2 $epsilon_2)
                   $..c (&i* $x_n $epsilon_n)))
    ", 那么"
    (MB (&= $alpha (tu0 $x_1 $x_2 $..h $x_n)))
    "这表明" (&cm $epsilon_1 $..h $epsilon_n) "可以张成" $F^n ". 因为"
    (&= $alpha $0) "当且仅当" (&= $x_1 $x_2 $..c $x_n $0) ", 所以向量"
    (&cm $epsilon_1 $..h $epsilon_n) "是线性无关的. 因此, "
    (&= $S (setE $epsilon_1 $..h $epsilon_n)) "是" $F^n
    "的一个基, 我们将其称为" $F^n "的标准基.")
   ((example #:n "14")
    "令" $P "是域" $F "上的一个" n*n "的可逆矩阵, 那么" $P "的列"
    (&cm $P_1 $..h $P_n) "构成了列矩阵空间" $F^n*1
    "的一个基, 理由如下. 如果" $X "是一个列矩阵, 那么"
    (MB (&= (&i* $P $X) (&+ (&i* $x_1 $P_1) $..c (&i* $x_n $P_n))))
    "既然" (LE $P $X $0) "仅有平凡解" (&= $X $0) ", 那么"
    (setE $P_1 $..h $P_n) "是一个线性无关的集合. 为什么它能够张成"
    $F^n*1 "呢? 令" $Y "是任意的列矩阵, 如果"
    (&= $X (&i* (inv $P) $Y)) ", 那么" (&= $Y (&i* $P $X)) ", 即"
    (MB (&= $Y (&+ (&i* $x_1 $P_1) $..c (&i* $x_n $P_n))))
    "于是" (setE $P_1 $..h $P_n) "是" $F^n*1
    "的一个基.")
   ((example #:n "15")
    "令" $A "是一个" m*n "矩阵, " $S "是齐次线性方程组" AX=0
    " (例子7) 的解空间. 令" $R "是行等价于" $A
    "的一个行简化阶梯形式, 那么" $S "也是方程组" RX=0
    "的解空间. 如果" $R "具有" $r "个非零行, 那么" RX=0
    "就简单地将未知元" (&cm $x_1 $..h $x_n) "中的" $r
    "个表达为了基于剩余" (&- $n $r) "个未知元" $x_j
    "的线性组合. 设非零行的首非零元出现在第"
    (&cm $k_1 $..h $k_r) "列, 令" $J "是除去" (&cm $k_1 $..h $k_r)
    "剩下的" (&- $n $r) "个索引的集合:"
    (MB (&= $J (&- (setE $1 $..h $n)
                   (setE $k_1 $..h $k_r))))
    "那么方程组" RX=0 "具有如下形式"
    (MB (Choice
         ((_ $x $k_1) $+ (sum $J $ (&i* (_ $c (&cm $1 $j)) $x_j)) $= $0)
         ($..v $ $..v $ $..v)
         ((_ $x $k_r) $+ (sum $J $ (&i* (_ $c (&cm $r $j)) $x_j)) $= $0)))
    "其中" (_ $c (&cm $i $j)) "是特定的标量. 所有的解都可由以下方式获得, "
    "对于每个" $J "中的" $j ", 给" $x_j "赋(任意的)值, 然后计算相应的"
    (&cm (_ $x $k_1) $..h (_ $x $k_r)) "的值. 若对于每个" $J
    "中的" $j ", " $E_j "是令" (&= $x_j $1) ", 其余" (&= $x_i $0)
    " (" $i "是" $J "中异于" $j "的索引) 得到的解, 那么我们断言这"
    (@- $n $r) "个向量" $E_j "构成了解空间的一个基." (Br)
    "因为列矩阵" $E_j "的第" $j "行为" $1 ", 而由" $J "中其余元素索引的行是"
    $0 ", 根据例子13的推理, 这表明这些向量构成的集合是线性无关的. "
    "以下是这些向量能够张成解空间的理由. 如果列矩阵" $T " (其元素依次为"
    (&cm $t_1 $..h $t_n) ") 在解空间之中, 那么矩阵"
    (MB (&= $N (sum $J $ (&i* $t_j $E_j))))
    "同样也在解空间之中, 并且满足对于每个" $J "中的" $j "有"
    (&= $x_j $t_j) ". 具有这样性质的解是唯一的, 因此" (&= $N $T)
    ", 而" $T "就在诸向量" $E_j "张成的空间之中.")
   ((example #:n "16")
    "现在我们将给出一个无穷基的例子. 令" $F "是复数域的一个子域, "
    $V "是" $F "上的多项式函数的空间. 回忆一下, 这些从" $F
    "到" $F "的函数具有如下形式"
    (MB (&= (app $f $x)
            (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
    "令" (&cm (&= (app $f_k $x) $x^k) (&= $k (&cm $0 $1 $2 $..h)))
    ", 那么(无限的)集合" (setE $f_0 $f_1 $f_2 $..h)
    "是" $V "的一个基. 显然, 它能张成" $V ", 因为(上面的)函数" $f "可以表示为"
    (MB (&= $f (&+ (&i* $c_0 $f_0) (&i* $c_1 $f_1) $..c (&i* $c_n $f_n))))
    "读者应该看出来这事实上不过就是重复一遍多项式函数的定义, 即一个从" $F
    "到" $F "的函数" $f "是多项式函数当且仅当存在一个整数" $n "和标量"
    (&cm $c_0 $..h $c_n) "满足" (&+ (&i* $c_0 $f_0) $..c (&i* $c_n $f_n))
    ". 那么为什么这些函数线性无关呢? 为了证明集合" (setE $f_0 $f_1 $f_2 $..h)
    "是线性无关的, 只需要证明其每个有限子集是线性无关的即可, 实际上证明对于每个"
    $n ", 集合" (setE $f_0 $..h $f_n) "是线性无关的就够了. 设"
    (MB (&= (&+ (&i* $c_0 $f_0) $..c (&i* $c_n $f_n)) $0))
    "这等价于说"
    (MB (&= (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)) $0))
    "对于每个" $F "中的" $x "成立. 换句话说, 每个" $F "中的" $x "都是多项式函数"
    (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)))
    "的根. 我们假定读者已经知道一个" $n "阶的复系数多项式不可能拥有多于" $n
    "个的不同的根, 于是就有" (&= $c_0 $c_1 $..c $c_n $0) ". " (Br)
    "我们已经给出了" $V "的一个无限的基, 那么这是否意味着" $V "不是有限维的? "
    "实际上的确如此, 但这不能通过定义直接得到, 因为就目前我们所知, 或许" $V
    "还拥有一个有限的基. 不过, 这种可能性很容易被排除. (我们将于下一个定理中"
    "在一般情况下排除它.) 假设我们拥有一个有限数目的多项式函数"
    (&cm $g_1 $..h $g_r) ", 那么" (&cm (app $g_1 $x) $..h (app $g_r $x))
    "中将出现一个最高的" $x "的幂次. 如果该幂次是" $k ", 那么显然"
    (&= (app (_ $f (&+ $k $1)) $x) (^ $x (&+ $k $1))) "不在"
    (&cm $g_1 $..h $g_r) "的线性扩张之中, 因此" $V "不可能是有限维的. "
    "[译注: 当然, 存在一种极端情况, 即每个多项式函数都是零函数, 那就不存在"
    "最高的幂次, 不过这种情况可以被特殊对待, 论证仍然完全合理.]")
   (P "关于这个例子的最后一条评注就位了. 无限的基同&quot;无限的线性组合&quot;"
      "毫无关系. 若是读者不能抵制将幂级数"
      (MB (sum (&= $k $0) $inf (&i* $c_k $x^k)))
      "注入这个例子之中, 那么他就应该再一次好好琢磨一下这个例子. "
      "如果还是没有疗效的话, 从现在开始他就应该考虑将注意力限制在有限维空间上.")
   ((theorem #:n "4")
    "令" $V "是一个由有限多个向量" (&cm $beta_1 $beta_2 $..h $beta_m)
    "张成的向量空间, 那么" $V "中任意线性无关的集合都是有限的, 并且拥有的元素不超过"
    $m "个.")
   ((proof)
    "为了证明这个定理, 只需要证明" $V "的每个拥有超过" $m "个元素的子集" $S
    "是线性相关的就够了. 令" $S "就是这样一个集合. 在" $S "中, 存在" $n
    "个互异的向量" (&cm $alpha_1 $alpha_2 $..h $alpha_n) ", 其中" (&> $n $m)
    ". 因为" (&cm $beta_1 $..h $beta_m) "能够张成" $V ", 所以存在" $F
    "中的标量" Aij "满足"
    (MB (&= $alpha_j (sum (&= $i $1) $m (&i* Aij $beta_i))))
    "对于" $n "个标量" (&cm $x_1 $x_2 $..h $x_n) ", 我们有"
    (MB (deriv (LC0 $x_1 $alpha_1 $x_n $alpha_n)
               (sum (&= $j $1) $n (&i* $x_j $alpha_j))
               (sum (&= $j $1) $n
                    (&i* $x_j (@sum (&= $i $1) $m (&i* Aij $beta_i))))
               (sum (&= $j $1) $n
                    (sum (&= $i $1) $m
                         (&i* (@i* Aij $x_j) $beta_i)))
               (sum (&= $i $1) $m
                    (&i* (@sum (&= $j $1) $n (&i* Aij $x_j)) $beta_i))))
    "既然" (&> $n $m) ", 那么根据第1章的定理6, 存在不全为零的"
    (&cm $x_1 $x_2 $..h $x_n) "满足"
    (MB (&cm (&= (sum (&= $j $1) $n (&i* Aij $x_j)) $0)
             (&<= $1 $i $m)))
    "因此"
    (&= (&+ (&i* $x_1 $alpha_1) (&i* $x_2 $alpha_2) $..c (&i* $x_n $alpha_n)) $0)
    ", 这表明" $S "是线性相关的集合.")
   ((corollary #:n "1")
    "如果" $V "是一个有限维向量空间, 那么任意两个" $V "的基都具有相同"
    "(有限)数目的元素.")
   ((proof)
    "既然" $V "是有限维的, 它拥有一个有限的基"
    (MB (setE $beta_1 $beta_2 $..h $beta_m))
    "[译注: 这个记号隐含了" (&cm $beta_1 $beta_2 $..h $beta_m) "互异之意, 但请读者注意, "
    "这并非集合论公理的要求, 只是一个常见的默认约定罢了.] 根据定理4, 每个" $V
    "的基都应该是有限的, 并且拥有的元素不超过" $m "个. 因此, 如果"
    (setE $alpha_1 $alpha_2 $..h $alpha_n) "是一个基, 那么" (&<= $n $m)
    ". 根据相同的论证, 有" (&<= $m $n) ", 于是" (&= $m $n) ".")
   (P "这个推论允许我们将有限维向量空间的维数定义为" $V "的一个基的元素个数. "
      "我们将用" (&dim $V) "表示有限维向量空间" $V "的维数. "
      "这允许我们重新表述定理4如下.")
   ((corollary #:n "2")
    "令" $V "是一个有限维向量空间, 令" (&= $n (&dim $V)) ", 那么"
    (Ol #:attr* '((type "a"))
        (Li "任何包含多于" $n "个向量的" $V "的子集是线性相关的;")
        (Li "没有包含少于" $n "个向量的" $V "的子集可以张成" $V ".")))
   ((example #:n "17")
    "如果" $F "是一个域, 那么" $F^n "的维数是" $n ", 因为" $F^n
    "的标准基包含" $n "个向量. 矩阵空间" (^ $F m*n)
    "的维数是" (&i* $m $n) ". 若与" $F^n "的情况进行类比, "
    "这应该是很显然的, 因为" (&i* $m $n) "个矩阵, 其中每个矩阵的第" $i
    "行" $j "列是" $1 ", 其余位置是" $0 ", 构成了" (^ $F m*n)
    "的一个基. 如果" $A "是一个" m*n "的矩阵, 那么" $A "的维数是"
    (&- $n $r) ", 其中" $r "是与" $A "行等价的行简化阶梯矩阵的非零行数, "
    "见例子15." (Br)
    "如果" $V "是" $F "上任意的向量空间, 那么其零子空间可由向量" $0
    "张成, 但是" (setE $0) "是线性相关的集合, 因此不是一个基. "
    "出于这样的原因, 我们将约定零子空间的维数是" $0 ". 另一种做法是, "
    "我们论证空集是零子空间的基, 那么也能够达成相同的结论. "
    "空集可以张成" (setE $0) ", 因为所有包含空集的子空间之交是"
    (setE $0) ". 并且, 空集也是线性无关的, 因为它不包含任何向量.")
   ((lemma)
    "令" $S "是向量空间" $V "的一个线性无关的子集, 设" $beta
    "是" $V "中向量但不在" $S "张成的子空间之中, 那么将" $beta
    "加入" $S "得到的集合仍然是线性无关的.")
   ((proof)
    "设" (&cm $alpha_1 $..h $alpha_m) "是" $S "中互异的向量, 并且"
    (MB (&= (&+ (&i* $c_1 $alpha_1) $..c (&i* $c_m $alpha_m)
                (&i* $b $beta)) $0))
    "那么" (&= $b $0) ", 否则的话"
    (MB (&= $beta (&+ (&i* (pare (&- (~ $c_1 $b))) $alpha_1)
                      $..c
                      (&i* (pare (&- (~ $c_m $b))) $alpha_m))))
    "那么" $beta "就在" $S "张成的子空间之中. 因此, "
    (&= (LC0 $c_1 $alpha_1 $c_m $alpha_m) $0)
    ". 既然" $S "是线性无关的, 那么每个" (&= $c_i $0) ".")
   ((theorem #:n "5")
    "如果" $W "是一个有限维向量空间" $V "的子空间, 那么" $W
    "每个线性无关的子集都是有限的, 并且是" $W "的某个(有限的)基的一部分.")
   ((proof)
    "设" $S_0 "是" $W "的一个线性无关的子集. 如果" $S "是包含" $S_0
    "的" $W "的一个线性无关的子集, 那么" $S "也是" $V
    "的一个线性无关的子集. 因为" $V "是有限维的, 所以" $S
    "包含的元素个数不超过" (&dim $V) "个." (Br)
    "我们按照以下方式将" $S_0 "扩展为" $W "的一个基. 如果" $S_0 "可以张成" $W
    ", 那么" $S_0 "就是" $W "的一个基, 我们的任务就完成了. 如果" $S_0
    "不能张成" $W ", 那么根据前述引理, 我们可以在" $W "中找到一个" $beta_1
    "满足" (&= $S_1 (&union $S_0 (setE $beta_1))) "是线性无关的. "
    "[译注: 显然" $beta_1 "不是" $S_0 "的元素.] "
    "如果" $S_1 "能够张成" $W ", 那就结束了. 否则的话, 再次应用引理以得到一个" $W
    "中的" $beta_2 "满足" (&= $S_2 (&union $S_1 (setE $beta_2)))
    "是线性无关的. 继续实行此法, 那么 (在不超过" (&dim $V) "步的情况下) "
    "我们能够抵达一个集合"
    (MB (&= $S_m (&union $S_0 (setE $beta_1 $..h $beta_m))))
    "其为" $W "的一个基.")
   ((corollary #:n "1")
    "如果" $W "是有限维向量空间" $V "的一个真子空间, 那么" $W
    "也是有限维的, 并且" (&< (&dim $W) (&dim $V)) ".")
   ((proof)
    "我们不妨设" $W "包含一个向量" (&!= $alpha $0) ". 根据定理5及其证明, "
    "存在一个" $W "的基, 其包含" $alpha "且拥有不超过" (&dim $V)
    "个元素. 因此, " $W "是有限维的, 并且" (&<= (&dim $W) (&dim $V))
    ". 既然" $W "是一个真子空间, 那么存在" $V "中的向量" $beta
    ", 但其不在" $W "中. 将" $beta "加入" $W "的任何一个基之中, 我们"
    "都能得到" $V "的一个线性无关的子集, 于是" (&< (&dim $W) (&dim $V)) ". "
    "[译注: 实际上证明不必如此曲折, 从空集开始就好, 即能扩展成为" $W
    "的一个基, 并且这也覆盖了" $W "是零子空间的平凡情况.]")
   ((corollary #:n "2")
    "在有限维向量空间" $V "中每个非空的线性无关集合都是某个基的一部分. "
    "[译注: 平凡的空集情况当然也是某个基的一部分.]")
   ((corollary #:n "3")
    "令" $A "是域" $F "上的一个" n*n "矩阵, 设其行向量构成了" $F^n
    "的一个线性无关的集合, 那么" $A "是可逆的. "
    "[译注: 一般情况下, &quot;构成集合&quot;也就默认了互异, 尽管"
    "这不存在什么确切的道理可言.]")
   ((proof)
    "令" (&cm $alpha_1 $alpha_2 $..h $alpha_n) "是" $A
    "的行向量, 设" $W "是由" (&cm $alpha_1 $alpha_2 $..h $alpha_n)
    "张成的" $F^n "的子空间. 既然" (&cm $alpha_1 $alpha_2 $..h $alpha_n)
    "是线性无关的, 那么" $W "的维数就是" $n ". 推论1现在告诉我们"
    (&= $W $F^n) ", 因此存在" $F "中标量" (mref $B $i $j) "满足"
    (MB (&cm (&= $epsilon_i
                 (sum (&= $j $1) $n (&i* (mref $B $i $j) $alpha_j)))
             (&<= $1 $i $n)))
    "其中" (setE $epsilon_1 $epsilon_2 $..h $epsilon_n)
    "是" $F^n "的标准基, 因此对于以" (mref $B $i $j)
    "为元素的矩阵" $B ", 我们有"
    (MB (&= (&i* $B $A) $I)))
   ((theorem #:n "6")
    "如果" $W_1 "和" $W_2 "是向量空间" $V "的有限维子空间, 那么"
    (&+ $W_1 $W_2) "也是有限维的, 并且有"
    (MB (&= (&+ (&dim $W_1) (&dim $W_2))
            (&+ (&dim0 (&cap $W_1 $W_2))
                (&dim0 (&+ $W_1 $W_2)))))
    ((proof)
     "根据定理5及其推论, " (&cap $W_1 $W_2) "具有一个有限的基"
     (setE $alpha_1 $..h $alpha_k) ", 其为" $W_1 "的基"
     (MB (setE $alpha_1 $..h $alpha_k
               $beta_1 $..h $beta_m))
     "的一部分, 也是" $W_2 "的基"
     (MB (setE $alpha_1 $..h $alpha_k
               $gamma_1 $..h $gamma_n))
     "的一部分. 子空间" (&+ $W_1 $W_2) "可由向量"
     (MB (&cm $alpha_1 $..h $alpha_k
              $beta_1 $..h $beta_m
              $gamma_1 $..h $gamma_n))
     "张成, 并且这些向量也构成了一个线性无关的集合, 因为若设"
     (MB (&= (&+ (sum $ $ (&i* $x_i $alpha_i))
                 (sum $ $ (&i* $y_j $beta_j))
                 (sum $ $ (&i* $z_r $gamma_r)))
             $0))
     "那么"
     (MB (&= (&- (sum $ $ (&i* $z_r $gamma_r)))
             (&+ (sum $ $ (&i* $x_i $alpha_i))
                 (sum $ $ (&i* $y_j $beta_j)))))
     "这表明" (sum $ $ (&i* $z_r $gamma_r)) "属于" $W_1
     ". 因为" (sum $ $ (&i* $z_r $gamma_r)) "也属于" $W_2
     ", 所以"
     (MB (&= (sum $ $ (&i* $z_r $gamma_r))
             (sum $ $ (&i* $c_i $alpha_i))))
     "对于特定的" (&cm $c_1 $..h $c_k) "成立. 鉴于"
     (MB (setE $alpha_1 $..h $alpha_k
               $gamma_1 $..h $gamma_n))
     "是线性无关的, 每个标量" (&= $z_r $0) ", 因此"
     (MB (&= (&+ (sum $ $ (&i* $x_i $alpha_i))
                 (sum $ $ (&i* $y_j $beta_j)))
             $0))
     "既然"
     (MB (setE $alpha_1 $..h $alpha_k
               $beta_1 $..h $beta_m))
     "也是线性无关的, 那么有每个" (&= $x_i $0) "且每个"
     (&= $y_j $0) ". 最终我们得到"
     (MB (setE $alpha_1 $..h $alpha_k
               $beta_1 $..h $beta_m
               $gamma_1 $..h $gamma_n))
     "是" (&+ $W_1 $W_2) "的一个基, 于是"
     (MB (deriv (&+ (&dim $W_1) (&dim $W_2))
                (&+ (@ (&+ $k $m)) (@ (&+ $k $n)))
                (&+ $k (@ (&+ $m $k $n)))
                (&+ (&dim0 (&cap $W_1 $W_2))
                    (&dim0 (&+ $W_1 $W_2)))))))
   (P "让我们以一条关于线性无关和线性相关的注记作结. "
      "我们对于向量的集合定义了这些概念. "
      "对于向量的有限序列 (有序的" $n "元组) "
      alpha_1..n "定义它们也是很有用的. "
      "我们称向量" alpha_1..n
      "是线性相关的, 如果存在不全为零的标量"
      (&cm $c_1 $..h $c_n) "满足"
      (&= (LC0 $c_1 $alpha_1 $c_n $alpha_n) $0)
      ". 这是如此自然的, 以至于读者可能会发现他已经在这样使用术语了. "
      "那么, 有限序列" alpha_1..n "和集合"
      (setE $alpha_1 $..h $alpha_n) "之间有什么区别呢? "
      "存在两种区别, 等同性和顺序." (Br)
      "如果我们讨论集合" (setE $alpha_1 $..h $alpha_n)
      ", 通常已经假定向量" alpha_1..n
      "之中没有两个向量是相同的. 对于序列" alpha_1..n
      "而言, 可能每个" $alpha_i "都是相同的向量. 若对于某" (&!= $i $j)
      "有" (&= $alpha_i $alpha_j) ", 那么序列"
      alpha_1..n "是线性相关的:"
      (MB (&= (&+ $alpha_i (&i* (@ $-1) $alpha_j)) $0))
      "因此, 如果" alpha_1..n "是线性无关的, 那么"
      "它们就是互异的, 并且我们可以讨论集合" (setE $alpha_1 $..h $alpha_n)
      ", 知道其中有" $n "个向量. 显然, 在讨论基和维数的时候, 这"
      "不会引起什么歧义. 有限维向量空间" $V "的维数就是满足存在" $V "中线性无关的"
      $n "元向量组的最大的" $n ", 诸如此类. 若是读者感到本段杂乱无章而"
      "毫无内容可言, 那么他该问问自己向量"
      (MB (&cm (&= $alpha_1 (tu0 (^ $e (&/ $pi $2)) $1))
               (&= $alpha_2 (tu0 (Mroot 110 $3) $1))))
      "在" $RR^2 "中是否线性无关." (Br)
      "一个序列的元素以特定的顺序被枚举出来. 一个集合是对象的合集, 而"
      "没有预先给定的排列或顺序. 当然, 为了描述一个集合, 我们或许会"
      "列出其成员, 而这就需要挑选一个顺序. 但是, 顺序不是集合的一部分. "
      "集合" (setE $1 $2 $3 $4) "和" (setE $4 $3 $2 $1) "是等同的, 而序列"
      (&cm $1 $2 $3 $4) "与" (&cm $4 $3 $2 $1) "相当不同. "
      "序列的顺序方面并不影响线性相关或者无关, 因为线性相关性 (根据定义) "
      "并不受顺序影响. 序列" (&cm $alpha_n $..h $alpha_1)
      "线性相关当且仅当序列" alpha_1..n "线性相关. "
      "在下一节中, 顺序将变得重要起来.")
   ((exercise #:n "1")
    "证明如果两个向量线性相关, 那么其中一个是另一个的标量倍数.")
   ((exercise #:n "2")
    "向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $2 $4))
             (&= $alpha_2 (tu0 $2 $-1 $-5 $2))
             (&= $alpha_3 (tu0 $1 $-1 $-4 $0))
             (&= $alpha_4 (tu0 $2 $1 $1 $6))
             ))
    "在" $RR^4 "中线性无关吗?")
   ((exercise #:n "3")
    "找到由练习2的四个向量张成的" $RR^4 "的子空间的一个基.")
   ((exercise #:n "4")
    "证明向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $2 $1))
             (&= $alpha_3 (tu0 $0 $-3 $2))))
    "构成了" $RR^3 "的一个基. 将每个标准基向量表达为"
    (&cm $alpha_1 $alpha_2 $alpha_3) "的线性组合.")
   ((exercise #:n "5")
    "找出" $RR^3 "中的三个向量, 它们线性相关, 但是两两线性无关.")
   ((exercise #:n "6")
    "令" $V "是域" $F "上的" 2*2 "矩阵的向量空间. "
    "通过给出" $V "的一个具有四个元素的基, 证明" $V "的维数是" $4 ".")
   ((exercise #:n "7")
    "令" $V "是练习6的向量空间, 令" $W_1 "是由形式为"
    (MB (Mat ($x (&- $x))
             ($y $z)))
    "的矩阵构成的集合, 令" $W_2 "是由形式为"
    (MB (Mat ($a $b)
             ((&- $a) $c)))
    "的矩阵构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W_1 "和" $W_2 "是" $V "的子空间.")
        (Li "找出" (&cm $W_1 $W_2 (&+ $W_1 $W_2) (&cap $W_1 $W_2))
            "的维数.")))
   ((exercise #:n "8")
    "又一次令" $V "是域" $F "上的" 2*2 "矩阵的向量空间. "
    "找出" $V "的一个基" (setE $A_1 $A_2 $A_3 $A_4)
    "满足对于每个" $j "有" (&= (_^ $A $j $2) $A_j) ".")
   ((exercise #:n "9")
    "令" $V "是复数域的一个子域" $F "上的一个向量空间. "
    "设" (&cm $alpha $beta $gamma) "是" $V "中线性无关的向量. 证明"
    (&cm (@ (&+ $alpha $beta))
         (@ (&+ $beta $gamma))
         (@ (&+ $gamma $alpha)))
    "是线性无关的.")
   ((exercise #:n "10")
    "令" $V "是域" $F "上的一个向量空间. 设有限数目的向量"
    (&cm $alpha_1 $..h $alpha_r) "能够张成" $V ". 证明"
    $V "是有限维的.")
   ((exercise #:n "11")
    "令" $V "是复数域上所有满足" (&= (&+ (mref $A $1 $1) (mref $A $2 $2)) $0)
    "的" 2*2 "矩阵" $A "构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明在通常的运算下, " $V "是实数域上的向量空间.")
        (Li "找出该向量空间的一个基.")
        (Li "令" $W "为" $V "中满足"
            (&= (mref $A $2 $1) (&- (OverBar (mref $A $1 $2))))
            "的矩阵" $A "的集合, 其中横杠代表复数共轭. 证明"
            $W "是" $V "的子空间并找出" $W "的一个基.")))
   ((exercise #:n "12")
    "通过找出向量空间的一个基, 证明域" $F "上的" m*n
    "矩阵构成的向量空间的维数是" (&i* $m $n) ".")
   ((exercise #:n "13")
    "讨论练习9, 其中" $V "是二元域上的向量空间. 二元域见第1.2节的练习5.")
   ((exercise #:n "14")
    "令" $V "是实数集合. 若将" $V "视为有理数域上的向量空间 (带有通常的运算), "
    "证明该向量空间不是有限维的.")
   (H3 "第2.4节 坐标")
   (P $n "维空间" $V "的基" $BBB "的诸多有用性质之一在于, 它允许人们在" $V
      "中引入与空间" $F^n "中的向量" (&= $alpha (tu0 $x_1 $..h $x_n))
      "的&quot;自然坐标&quot;" $x_i "类似的东西. 沿此进路, " $V
      "中的向量" $alpha "相对于基" $BBB "的坐标将会是用于将" $alpha
      "表达为基中向量的线性组合的标量. 因此, 我们想要将" $F^n
      "中的向量" $alpha "的自然坐标视为由" $alpha "和" $F^n
      "的标准基定义的. 然而, 若是采取此法, 我们必须足够小心. 如果"
      (MB (&= $alpha (tu0 $x_1 $..h $x_n)
              (sum (&= $i $1) $n (&i* $x_i $epsilon_i))))
      "而" $BBB "是" $F^n "的标准基, 那么" $alpha "的坐标是如何由"
      $BBB "和" $alpha "决定的呢? 一种组织回答的方式如下. 给定的"
      $alpha "作为标准基向量的线性组合的表达是唯一的, 并且" $alpha "的第"
      $i "个坐标" $x_i "就是该表达下" $epsilon_i "的系数. 以此观点来看, "
      "我们之所以能够言称何谓第" $i "个坐标, 是因为我们已经为标准基中"
      "的向量安排了&quot;自然&quot;的顺序. 也就是说, 我们拥有一个规则来"
      "确定哪一个是基中&quot;第一&quot;的向量, 哪一个是基中&quot;第二&quot;的向量, "
      "诸如此类. 如果" $BBB "是"$n "维空间" $V "的任意一个基, 那么可能" $BBB "中的"
      "向量并没有什么自然的顺序. 因此, 在我们能够定义&quot;" $alpha "相对于"
      $BBB "的第" $i "个坐标&quot;之前, 就有必要为这些向量施加一个顺序. 换言之, "
      "坐标将相对于向量的序列而不是向量的集合进行定义.")
   ((definition)
    "如果" $V "是一个有限维向量空间, 那么" $V "的一个有序基是一个向量的有限序列, 其"
    "线性无关并可张成" $V ".")
   (P "如果序列" alpha_1..n "是" $V "的一个有序基, 那么集合"
      (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基. 有序基不过就是基的集合, "
      "带上一个指定的顺序. 我们将稍微滥用一下符号, 言称"
      (MB basis:def)
      "是" $V "的一个有序基. 这不仅确定了什么是基的向量, 也刻画了顺序.")
   (P "现在我们设" $V "是域" $F "上的一个有限维向量空间, 并且"
      (MB basis:def)
      "是" $V "的一个有序基. 给定" $V "中的" $alpha ", 存在唯一的一个标量的"
      $n "元组满足"
      (MB (&= $alpha (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
      "之所以这个" $n "元组是唯一的, 是因为若我们同样有"
      (MB (&= $alpha (sum (&= $i $1) $n (&i* $z_i $alpha_i))))
      "那么"
      (MB (&= (sum (&= $i $1) $n (&i* (@ (&- $x_i $z_i)) $alpha_i)) $0))
      "并且" $alpha_i "的线性无关性告诉我们对于每个" $i "有"
      (&= (&- $x_i $z_i) $0) ". 我们称" $x_i "为" $alpha "相对于有序基"
      (MB basis:def) "的第" $i
      "个坐标. 如果"
      (MB (&= $beta (sum (&= $i $1) $n (&i* $y_i $alpha_i))))
      "那么"
      (MB (&= (&+ $alpha $beta)
              (sum (&= $i $1) $n
                   (&i* (@ (&+ $x_i $y_i)) $alpha_i))))
      "于是" (@ (&+ $alpha $beta)) "在此有序基之下的第" $i
      "个坐标是" (@ (&+ $x_i $y_i)) ". 类似地, " (@ (&i* $c $alpha))
      "的第" $i "个坐标是" (&i* $c $x_i) ". 读者也应该注意到每个" $F
      "中的" $n "元组" (tu0 $x_1 $..h $x_n) "也是" $V "中某个向量的坐标的"
      $n "元组, 即"
      (MB (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
   (P "总结一下, 每个" $V "的有序基都确定了一个" $V "的所有向量的集合与"
      $F^n "的所有" $n "元组的集合之间的一一对应"
      (MB (&\|-> $alpha (tu0 $x_1 $..h $x_n)))
      "这个对应拥有以下性质. " (@ (&+ $alpha $beta)) "的像是"
      $F^n "中" $alpha "和" $beta "的像之和, 以及" (@ (&i* $c $alpha))
      "的像是" $F^n "中的标量" $c "与" $alpha "的像之积.")
   (P "有的读者或许想问为什么在此时此刻我们为什么不简单地选取一个" $V
      "的有序基然后将" $V "的每个向量描述为与之对应的坐标" $n
      "元组, 因为若是这样的话, 我们就可以获得只与" $n
      "元组打交道之便. 这违背了我们的目的, 出于两个原因. 首先, "
      "正如我们对于向量空间的公理化定义所暗示的那样, 我们试图研究"
      "如何将向量空间作为抽象的代数系统进行推理. 其次, 即便是在那些我们"
      "使用坐标的场合, 有的重要结果来源于我们能够改变坐标系统的能力, "
      "即改变有序基的能力.")
   (P "往往对于我们而言使用" $alpha "相对于" $BBB "的坐标矩阵"
      (MB (&= $X (Mat ($x_1) ($..v) ($x_n))))
      "而不是坐标" $n "元组" (tu0 $x_1 $..h $x_n) "更加方便. 为了指明"
      "坐标矩阵依赖于哪个基, 我们将使用符号"
      (MB (coordm $alpha))
      "来表示向量" $alpha "相对于有序基" $BBB "的坐标矩阵. "
      "从一个有序基变到另一个有序基时, 这个记号对于描述向量" $alpha
      "的坐标发生了什么变化是特别有用的.")
   (P "接着, 我们设" $V "是" $n "维的, 并且"
      (MB basis:def
          (% "和")
          (&= $BBB^
              (setE (_^ $alpha $1 $prime) $..h
                    (_^ $alpha $n $prime))))
      "是" $V "的两个有序基. "
      "存在唯一的标量" (mref $P $i $j) "满足"
      (MB (&cm
           (&= (_^ $alpha $j $prime)
               (sum (&= $i $1) $n
                    (&i* (mref $P $i $j) $alpha_i)))
           (&<= $1 $j $n)))
      "令" (&cm (_^ $x $1 $prime) $..h (_^ $x $n $prime))
      "是给定的向量" $alpha "相对于有序基" $BBB^
      "的坐标, 那么"
      (MB (deriv $alpha
                 (LC0 (_^ $x $1 $prime) (_^ $alpha $1 $prime)
                      (_^ $x $n $prime) (_^ $alpha $n $prime))
                 (sum (&= $j $1) $n
                      (&i* (_^ $x $j $prime) (_^ $alpha $j $prime)))
                 (sum (&= $j $1) $n
                      (&i* (_^ $x $j $prime)
                           (sum (&= $i $1) $n
                                (&i* (mref $P $i $j) $alpha_i))))
                 (sum (&= $j $1) $n
                      (sum (&= $i $1) $n
                           (&i* (@ (&i* (mref $P $i $j) (_^ $x $j $prime)))
                                $alpha_i)))
                 (sum (&= $i $1) $n
                      (&i* (pare
                            (sum (&= $j $1) $n
                                 (&i* (mref $P $i $j) (_^ $x $j $prime))))
                           $alpha_i))))
      "因此我们就得到关系"
      (MB (&= $alpha
              (sum (&= $i $1) $n
                   (&i* (pare
                         (sum (&= $j $1) $n
                              (&i* (mref $P $i $j) (_^ $x $j $prime))))
                        $alpha_i))))
      "既然" $alpha "在有序基" $BBB "下的坐标" (&cm $x_1 $..h $x_n)
      "是被唯一确定的, 那么"
      (MB (&cm (&= $x_i
                   (sum (&= $j $1) $n
                        (&i* (mref $P $i $j) (_^ $x $j $prime))))
               (&<= $1 $i $n)))
      "令" $P "是一个" n*n "矩阵, 其第" $i "行" $j "列的元素是标量"
      (mref $P $i $j) "并令" $X "和" $X^ "分别是" $alpha "在基"
      $BBB "和" $BBB^ "下的坐标矩阵, 那么我们可以重新表达上述结果为"
      (MB (&= $X (&i* $P $X^)))
      "既然" $BBB "和" $BBB^ "都是线性无关的, 那么" (&= $X $0)
      "当且仅当" (&= $X^ $0) ". 根据第1章的定理7, " $P "是可逆的, 于是"
      (MB (&= $X^ (&i* (inv $P) $X)))
      "若我们使用之前引入的向量相对于某个有序基的坐标矩阵的记号, 那么"
      (MB (&cm (&= (coordm $alpha)
                   (&i* $P (coordm $alpha $BBB^)))
               (&= (coordm $alpha $BBB^)
                   (&i* (inv $P) (coordm $alpha)))))
      "因而之前的讨论可以被总结如下.")
   ((theorem #:n "7")
    "令" $V "是域" $F "上的" $n "维向量空间, 令" $BBB "和" $BBB^
    "是" $V "的两个有序基, 那么存在一个唯一的且必然可逆的域" $F
    "上的" n*n "矩阵" $P "满足"
    (MB (&cm (&= (coordm $alpha)
                 (&i* $P (coordm $alpha $BBB^)))
             (&= (coordm $alpha $BBB^)
                 (&i* (inv $P) (coordm $alpha)))))
    "对于每个" $V "中的向量" $alpha "成立. " $P "的列由"
    (MB (&cm (&= $P_j (coordm (_^ $alpha $j $prime) $BBB))
             (&= $j (&cm $1 $..h $n))))
    "给出.")
   (P "为了使上面的分析完整, 我们还需要证明以下结果.")
   ((theorem #:n "8")
    "设" $P "是域" $F "上的一个" n*n "可逆矩阵. 令" $V
    "是域" $F "上的一个" $n "维向量空间, 令" $BBB
    "是" $V "的一个有序基. 那么, 存在唯一的一个" $V
    "的有序基" $BBB^ "满足"
    (MB (&cm (&= (coordm $alpha)
                 (&i* $P (coordm $alpha $BBB^)))
             (&= (coordm $alpha $BBB^)
                 (&i* (inv $P) (coordm $alpha)))))
    "对于每个" $V "中的向量" $alpha "成立.")
   ((proof)
    "令" $BBB "由向量" alpha_1..n "构成. 如果"
    (&= $BBB^
        (setE (_^ $alpha $1 $prime) $..h
              (_^ $alpha $n $prime)))
    "是满足第一条的" $V "的有序基, 那么显然有"
    (MB (&= (_^ $alpha $j $prime)
            (sum (&= $i $1) $n
                 (&i* (mref $P $i $j) $alpha_i))))
    "因此我们只需要证明由这些等式定义的向量"
    (_^ $alpha $j $prime) "的确构成了一个基. 令"
    (&= $Q (inv $P)) ", 那么"
    (MB (deriv (sum $j $ (&i* (mref $Q $j $k) (_^ $alpha $j $prime)))
               (sum $j $ (&i* (mref $Q $j $k)
                              (sum $i $ (&i* (mref $P $i $j) $alpha_i))))
               (sum $j $
                    (sum $i $
                         (&i* (mref $P $i $j) (mref $Q $j $k) $alpha_i)))
               (sum $i $
                    (&i* (pare (sum $j $ (&i* (mref $P $i $j) (mref $Q $j $k))))
                         $alpha_i))
               $alpha_k))
    "故由集合"
    (MB (&= $BBB^
            (setE (_^ $alpha $1 $prime) $..h
                  (_^ $alpha $n $prime))))
    "张成的子空间包含" $BBB ", 因而等于" $V ". 于是, " $BBB^
    "是一个基. 根据其定义和定理7, 显然第一条是成立的, 第二条也是.")
   ((example #:n "18")
    "令" $F "是一个域, 令"
    (MB (&= $alpha (tu0 $x_1 $x_2 $..h $x_n)))
    "是一个" $F^n "中的向量. 如果" $BBB "是" $F^n "的标准有序基, 即"
    (MB (&= $BBB (setE $epsilon_1 $..h $epsilon_n)))
    "那么向量" $alpha "在基" $BBB "下的坐标矩阵为"
    (MB (&= (coordm $alpha)
            (Mat ($x_1) ($x_2) ($..v) ($x_n)))))
   ((example #:n "19")
    "令" $RR "是实数域, 令" $theta "是一个固定的实数. 矩阵"
    (MB (&= $P (Mat ((&cos $theta) (&- (&sin $theta)))
                    ((&sin $theta) (&cos $theta)))))
    "是可逆的, 其逆为"
    (MB (&= (inv $P)
            (Mat ((&cos $theta) (&sin $theta))
                 ((&- (&sin $theta)) (&cos $theta)))))
    "因此, 对于每个" $theta ", 由向量" (tu0 (&cos $theta) (&sin $theta))
    "和" (tu0 (&- (&sin $theta)) (&cos $theta)) "构成的集合" $BBB^
    "是" $RR^2 "的一个基. 从直觉上说, 这个基可被描述为由标准基旋转角度"
    $theta "得到的. 如果" $alpha "是向量" (tu0 $x_1 $x_2) ", 那么"
    (MB (&= (coordm $alpha $BBB^)
            (&i* (Mat ((&cos $theta) (&sin $theta))
                      ((&- (&sin $theta)) (&cos $theta)))
                 (Mat ($x_1) ($x_2)))))
    "或者"
    (MB (&cm (&= (_^ $x $1 $prime)
                 (&+ (&i* $x_1 (&cos $theta))
                     (&i* $x_2 (&sin $theta))))
             (&= (_^ $x $2 $prime)
                 (&+ (&i* (&- $x_1) (&sin $theta))
                     (&i* $x_2 (&cos $theta)))))
        (% ".")))
   ((example #:n "20")
    "令" $F "是复数域的一个子域. 矩阵"
    (MB (&= $P (Mat ($-1 $4 $5)
                    ($0 $2 $-3)
                    ($0 $0 $8))))
    "是可逆的, 其逆为"
    (MB (&= (inv $P)
            (Mat ($-1 $2 11/8)
                 ($0 $1/2 3/16)
                 ($0 $0 1/8))))
    "因此向量"
    (MB (&cm (&= (_^ $alpha $1 $prime)
                 (tu0 $-1 $0 $0))
             (&= (_^ $alpha $2 $prime)
                 (tu0 $4 $2 $0))
             (&= (_^ $alpha $3 $prime)
                 (tu0 $5 $-3 $8))))
    "构成了" $F^3 "的一个基" $BBB^ ". 向量"
    (&= $alpha (tu0 $x_1 $x_2 $x_3)) "在基" $BBB^
    "下的坐标"
    (&cm (_^ $x $1 $prime)
         (_^ $x $2 $prime)
         (_^ $x $3 $prime))
    "由"
    (MB (&= (Mat ((_^ $x $1 $prime))
                 ((_^ $x $2 $prime))
                 ((_^ $x $3 $prime)))
            (Mat ((&+ (&- $x_1) (&i* $2 $x_2) (&i* 11/8 $x_3)))
                 ((&+ (&i* $1/2 $x_2) (&i* 3/16 $x_3)))
                 ((&i* 1/8 $x_3)))
            (&i* (Mat ($-1 $2 11/8)
                      ($0 $1/2 3/16)
                      ($0 $0 1/8))
                 (Mat ($x_1) ($x_2) ($x_3)))))
    "特别地,"
    (MB (&= (tu0 $3 $2 $-8)
            (&- (&i* -10 (_^ $alpha $1 $prime))
                (&i* $1/2 (_^ $alpha $2 $prime))
                (_^ $alpha $3 $prime)))))
   ((exercise #:n "1")
    "证明向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $0 $0))
             (&= $alpha_2 (tu0 $0 $0 $1 $1))
             (&= $alpha_3 (tu0 $1 $0 $0 $4))
             (&= $alpha_4 (tu0 $0 $0 $0 $2))))
    "构成了" $RR^4 "的一个基. 找出每个标准基向量在有序基"
    (setE $alpha_1 $alpha_2 $alpha_3 $alpha_4)
    "下的坐标.")
   ((exercise #:n "2")
    "找出向量" (tu0 $1 $0 $1) "在" $CC^3 "的有序基"
    (&cm (tu0 (&i* $2 $i) $1 $0) (tu0 $2 $-1 $1) (tu0 $0 (&+ $1 $i) (&- $1 $i)))
    "下的坐标矩阵.")
   ((exercise #:n "3")
    "令" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "是由"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $1 $1))
             (&= $alpha_3 (tu0 $1 $0 $0))))
    "构成的" $RR^3 "的有序基. 那么, 向量" (tu0 $a $b $c)
    "在有序基" $BBB "下的坐标是什么呢?")
   ((exercise #:n "4")
    "令" $W "是由" (&= $alpha_1 (tu0 $1 $0 $i)) "和" (&= $alpha_2 (tu0 (&+ $1 $i) $1 $-1))
    "张成的" $CC^3 "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $alpha_1 "和" $alpha_2 "构成了" $W "的一个基.")
        (Li "证明" (&= $beta_1 (tu0 $1 $1 $0)) "和" (&= $beta_2 (tu0 $1 $i (&+ $1 $i)))
            "也在" $W "中并且构成了" $W "的另一个基.")
        (Li $alpha_1 "和" $alpha_2 "在" $W "的有序基" (setE $beta_1 $beta_2)
            "下的坐标是什么?")))
   ((exercise #:n "5")
    "令" (&= $alpha (tu0 $x_1 $x_2)) "和" (&= $beta (tu0 $y_1 $y_2)) "是" $RR^2 "中满足"
    (MB (&cm (&= (&+ (&i* $x_1 $y_1) (&i* $x_2 $y_2)) $0)
             (&= (&+ (_^ $x $1 $2) (_^ $x $2 $2))
                 (&+ (_^ $y $1 $2) (_^ $y $2 $2))
                 $1)))
    "的向量. 证明" (&= $BBB (setE $alpha $beta)) "是" $RR^2 "的一个基. 找出向量" (tu0 $a $b)
    "在有序基" (&= $BBB (setE $alpha $beta)) "下的坐标. (" $alpha "和" $beta
    "上的条件, 从几何上说, 指的是" $alpha "和" $beta "垂直, 并且每个长度均为" $1 ".)")
   ((exercise #:n "6")
    "令" $V "是一个复数域上的向量空间, 其由所有从" $RR "到" $CC "的函数构成, 即实轴上所有复值函数的空间. 令"
    (&cm (&= (app $f_1 $x) $1) (&= (app $f_2 $x) (^ $e (&i* $i $x)))
         (&= (app $f_3 $x) (^ $e (&- (&i* $i $x)))))
    "."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&cm $f_1 $f_2 $f_3) "是线性无关的.")
        (Li "令" (&cm (&= (app $g_1 $x) $1) (&= (app $g_2 $x) (&cos $x)) (&= (app $g_3 $x) (&sin $x)))
            ", 找出一个" (&c* $3 $3) "的矩阵" $P "满足"
            (MB (&= $g_j (sum (&= $i $1) $3 (&i* (mref $P $i $j) $f_i))) "."))))
   ((exercise #:n "7")
    "令" $V "是所有次数小于等于" $2 "的从" $RR "到" $RR "的多项式函数构成的(实)向量空间, 即由所有形式为"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "的函数" $f "构成的空间. 令" $t "是一个固定的实数, 定义"
    (MB (&cm (&= (app $g_1 $x) $1) (&= (app $g_2 $x) (&+ $x $t)) (&= (app $g_3 $x) (^ (@+ $x $t) $2))))
    "证明" (&= $BBB (setE $g_1 $g_2 $g_3)) "是" $V "的一个基. 如果"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "那么" $f "在此有序基" $BBB "下的坐标是什么呢?")
   (H3 "第2.5节 行等价的总结")
   (P "本节我们将利用一些有限维向量空间基和维数的基本事实来完成我们对于"
      "矩阵的行等价性的讨论. 回忆一下, 如果" $A "是域" $F "上的一个"
      m*n "矩阵, 那么" $A "的行向量是" $F^n "中的向量"
      (&cm $alpha_1 $..h $alpha_m) ", 由"
      (MB (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n))))
      "定义. " $A "的行空间是由这些向量张成的" $F^n "的子空间. " $A
      "的行秩是" $A "的行空间的维数.")
   (P "如果" $P "是域" $F "上的一个" (&c* $k $m) "矩阵, 那么积"
      (&= $B (&i* $P $A)) "是一个" (&c* $k $n) "矩阵, 其行向量"
      (&cm $beta_1 $..h $beta_k) "分别为线性组合"
      (MB (&= $beta_i
              (LC0 (mref $P $i $1) $alpha_1
                   (mref $P $i $m) $alpha_m)))
      "因此, " $B "的行空间是" $A "的行空间的一个子空间. 如果"
      $P "是一个" m*m "的可逆矩阵, 那么" $B "行等价于"
      $A ", 于是根据行等价的对称性, 或者等式" (&= $A (&i* (inv $P) $B))
      ", 可知" $A "的行空间也是" $B "的行空间的一个子空间.")
   ((theorem #:n "9")
    "行等价的矩阵拥有相同的子空间.")
   (P "因而我们发现为了研究" $A "的行空间, 研究与" $A
      "行等价的行简化阶梯矩阵的行空间也是一样的. 接下来我们就要这么做.")
   ((theorem #:n "10")
    "令" $R "是一个非零的行简化阶梯矩阵, 那么" $R "的非零行向量构成了" $R
    "的行空间的一个基.")
   ((proof)
    "令" (&cm $rho_1 $..h $rho_r) "是" $R "的非零行向量, 那么显然这些向量可以张成"
    $R "的行空间, 因此我们只需证明它们线性无关即可. 既然" $R "是一个行简化阶梯矩阵, "
    "那么存在正整数" (&cm $k_1 $..h $k_r) "满足对于" (&<= $i $r) ","
    (Ol #:attr* '((type "a"))
        (Li (&= (appl $R $i $j) $0) "若" (&< $j $k_i) ";")
        (Li (&= (appl $R $i $k_j) δij) ";")
        (Li (&< $k_1 $..c $k_r) "."))
    "设" (&= $beta (tu0 $b_1 $..h $b_n)) "是" $R "的行空间的一个向量:"
    (MB (&= $beta (LC0 $c_1 $rho_1 $c_r $rho_r)))
    "那么我们发现" (&= $c_j (_ $b $k_j)) ", 因为"
    (MB (deriv (_ $b $k_j)
               (sum (&= $i $1) $r
                    (&i* $c_i (appl $R $i $k_j)))
               (sum (&= $i $1) $r
                    (&i* $c_i δij))
               $c_j))
    "特别地, 如果" (&= $beta $0) ", 即如果" (&= (LC0 $c_1 $rho_1 $c_r $rho_r) $0)
    ", 那么" $c_j "必须是零向量的第" $k_j "个分量, 于是"
    (&cm (&= $c_j $0) (&= $j (&cm $1 $..h $r))) ". 因此, " (&cm $rho_1 $..h $rho_r)
    "是线性无关的.")
   ((theorem #:n "11")
    "令" $m "和" $n "是正整数, 令" $F "是一个域. 设" $W "是" $F^n "的一个子空间, 并且"
    (&<= (&dim $W) $m) ". 那么, 存在唯一的一个域" $F "上的" m*n "的行简化阶梯矩阵以"
    $W "作为其行空间.")
   ((proof)
    "至少存在一个以" $W "为行空间的" m*n "的行简化阶梯矩阵, 因为既然" (&<= (&dim $W) $m)
    ", 我们可以挑选出" $W "中的某" $m "个向量" (&seq $alpha #:to $m) "张成" $W ". 令" $A
    "是以" (&seq $alpha #:to $m) "为行向量的" m*n "矩阵, 令" $R "是与" $A "行等价的"
    "行简化阶梯矩阵, 那么" $R "的行空间就是" $W "." (Br)
    "现在令" $R "是任意的以" $W "为行空间的行简化阶梯矩阵, 令" (&seq $rho #:to $r)
    "是" $R "的非零行向量, 设" $rho_i "的首非零元在第" $k_i "列, " (&= $i (&cm $1 $..h $r))
    ". 向量" (&seq $rho #:to $r) "构成了" $W "的一个基. 在定理10的证明中, 我们观察到如果"
    (&= $beta (tu0 $b_1 $..h $b_n)) "在" $W "之中, 那么有"
    (MB (&= $beta (LC0 $c_1 $rho_1 $c_r $rho_r)) ",")
    "并且" (&= $c_i (_ $b $k_i)) ". 换句话说, " $beta "作为" (&seq $rho #:to $r)
    "的线性组合的唯一表示即"
    (MB (&= $beta (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))))
    "因此若读者知道了坐标分量" (&cm (_ $b $k_i) (&= $i (&cm $1 $..h $r))) ", 那么向量"
    $beta "就是确定的了. 例如, " $rho_s "可以被描述为" $W "中唯一的第" $k_s "个坐标为"
    $1 ", 第" $k_i "个坐标为" $0 "的向量, 其中" (&!= $i $s) "." (Br)
    "设" $beta "在" $W "之中而" (&!= $beta $0) ". 我们证明" $beta "的首非零元出现在某第"
    $k_s "列. 既然"
    (MB (&= $beta (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))))
    "且" (&!= $beta $0) ", 我们可以记"
    (MB (&cm (&= $beta (sum (&= $i $s) $r (&i* (_ $b $k_i) $rho_i)))
             (&!= (_ $b $k_s) $0)))
    "[译注: 根据上下文可知, 这个" $s "是满足" (&!= (_ $b $k_s) $0) "的最小的整数.] "
    "根据行简化阶梯矩阵的条件, 我们知道若有" (&> $i $s) "和" (&<= $j $k_s) ", 那么"
    (&= (mref $R $i $j) $0) ", 于是"
    (MB (&cm (&= $beta (tu0 $0 $..h $0 (_ $b $k_s) $..h $b_n))
             (&!= (_ $b $k_s) $0)))
    $beta "的首非零元即出现在第" $k_s "列. 读者也应该注意到, 对于每个"
    (&cm $k_s (&= $s (&cm $1 $..h $r))) ", 存在一个" $W "中的向量, 其第" $k_s
    "个分量不为零, 即" $rho_s "." (Br)
    "现在看来" $R "由" $W "唯一决定是很清晰的了. 基于" $W "对于" $R "的刻画如下. "
    "我们考虑所有" $W "中的向量" $beta ". 如果" (&!= $beta $0) ", 那么" $beta
    "的首非零元必然出现在某第" $t "列之中:"
    (MB (&cm (&= $beta (tu0 $0 $..h $0 $b_t $..h $b_n)) (&!= $b_t $0)))
    "令" (&seq $k #:to $r) "是那些正整数" $t ", 满足存在" $W "中的某个" (&!= $beta $0)
    "其首非零元出现在第" $t "列. 将" (&seq $k #:to $r) "按照"
    (&< $k_1 $k_2 $..c $k_r) "的顺序排列. 对于每个正整数" $k_s "存在唯一的" $W "中的向量"
    $rho_s "满足" $rho_s "的第" $k_s "个分量为" $1 ", 第" $k_i "个分量为" $0 ", 其中"
    (&!= $i $s) ". 那么, " $R "就是以" (&cm $rho_1 $..h $rho_r $0 $..h $0)
    "为行向量的行简化阶梯矩阵.")
   ((corollary)
    "每个" m*n "矩阵" $A "都行等价于唯一的一个行简化阶梯矩阵.")
   ((proof)
    "我们知道" $A "至少行等价于一个行简化阶梯矩阵" $R ". 如果" $A "还行等价于另一个这样的矩阵"
    $R^ ", 那么" $R "行等价于" $R^ ". 因此, " $R "和" $R^ "拥有相同的行空间, 必然是等同的.")
   ((corollary)
    "令" $A "和" $B "是域" $F "上的" m*n "矩阵, 那么" $A "与" $B "行等价当且仅当"
    "它们拥有相同的行空间.")
   ((proof)
    "我们已经知道如果" $A "和" $B "行等价, 那么它们拥有相同的行空间. 于是, 设" $A "和" $B
    "拥有相同的行空间. 现在, " $A "行等价于一个行简化阶梯矩阵" $R ", " $B
    "行等价于一个行简化阶梯矩阵" $R^ ". 既然" $A "和" $B "拥有相同的行空间, 那么" $R
    "和" $R^ "也拥有相同的行空间. 因此" (&= $R $R^) ", " $A "行等价于" $B ".")
   (P "总结一下, 如果" $A "和" $B "是域" $F "上的" m*n "矩阵, 那么以下陈述等价:"
      (Ol (Li $A "和" $B "行等价.")
          (Li $A "和" $B "拥有相同的行空间.")
          (Li (&= $B (&i* $P $A)) ", 其中" $P "是一个" m*m "的可逆矩阵."))
      "第4条等价的陈述其实是齐次线性方程组" AX=0 "和" (LE $B $X $0) "拥有相同的解. "
      "然而, 尽管我们知道" $A "与" $B "的行等价可以推出这两个方程组拥有相同的解, "
      "似乎最好将反方向的证明留到后面再说.")
   (H3 "第2.6节 关于子空间的计算")
   (P "现在我们想要展示初等行变换是如何为回答与" $F^n "的子空间有关的特定问题提供"
      "一种标准化的方法的. 我们已经推导出了所有我们将用到的事实. 为了读者的方便, "
      "它们被总结在这里. 这里的讨论适用于任何域" $F "上的" $n "维向量空间, 只需要"
      "选取一个固定的有序基" $BBB ", 然后每个" $V "中的向量" $alpha "就可由" $n
      "元组" (&cm $x_1 $..h $x_n) "刻画, 其给出了" $alpha "在有序基" $BBB
      "下的坐标.")
   (P "假设给定了" $F^n "中的" $m "个向量" (&seq $alpha #:to $m)
      ", 我们考虑下列问题."
      (Ol (Li "如何判定向量" (&seq $alpha #:to $m) "是否线性相关? "
              "更一般地, 如何找出由这些向量张成的子空间" $W "的维数?")
          (Li "给定" $F^n "中的" $beta ", 如何判定" $beta
              "是否是" (&seq $alpha #:to $m) "的线性组合, 即" $beta
              "是否在子空间" $W "中?")
          (Li "如何给出子空间" $W "的一个显式描述?"))
      "第三个问题有些模糊, 因为它没有说明什么叫做一个&quot;显式描述&quot;. "
      "然而, 我们将给出我们心中所想的这种描述以扫清模糊. 根据这种描述, "
      "问题一和问题二都可以立即回答.")
   (P "令" $A "是一个带有行向量" $alpha_i "的" m*n "矩阵:"
      (MB (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n))) ".")
      "施行一系列初等行变换, 自" $A "始, 终于行简化阶梯矩阵" $R
      ". 之前我们已经说明过这是怎样做的. 此时, " $W " (" $A "的行空间) 的维数是显然易见的, "
      "因为这个维数不过就是" $R "的非零行向量的数目. 如果" (&seq $rho #:to $r)
      "是" $R "的非零行向量, 那么" (&= $BBB (setE $rho_1 $..h $rho_r)) "是" $W
      "的一个基. 如果" $rho_i "的首非零元在第" $k_i "列, 那么对于" (&<= $i $r) "我们有"
      (MB (&= (appl $R $i $j) $0) ", 如果" (&< $j $k_i) ";&nbsp;"
          (&= (appl $R $i $k_j) δij) ";&nbsp;"
          (&< $k_1 $..c $k_r) ".")
      "子空间" $W "由所有具有以下形式的向量构成:"
      (MB (deriv $beta
                 (LC0 $c_1 $rho_1 $c_r $rho_r)
                 (sum (&= $i $1) $r
                      (&i* $c_i (tu0 (mref $R $i $1) $..h (mref $R $i $n))))))
      "这样一个向量" $beta "的坐标" (&seq $b) "因此是"
      (MB (&= $b_j (sum (&= $i $1) $r (&i* $c_i (mref $R $i $j)))))
      "特别地, " (&= (_ $b $k_j) $c_j) ", 于是如果" (&= $beta (@seq $b)) "是" $rho_i
      "的线性组合, 那么它就必须是以下特定的线性组合."
      (MB (&= $beta (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))))
      "将此" $beta "上之条件转换为坐标形式即"
      (MB (&cm (&= $b_j (sum (&= $i $1) $r (&i* (_ $b $k_i) (mref $R $i $j))))
               (&= $j (&cm $1 $..h $n))))
      "这就是由" (&cm $alpha_1 $..h $alpha_m) "张成的子空间" $W "的显式描述, 即这个子空间由所有"
      $F^n "中坐标满足显式描述的向量" $beta "构成. 显式描述是什么样的呢? 首先, 它将" $W
      "描述为某个齐次线性方程组的所有解" (&= $beta (tu0 $b_1 $..h $b_n))
      ". 这个方程组当然具有非常特别的性质, 因为它将" (@- $n $r) "个坐标表示为另外" $r
      "个特别坐标" (&cm (_ $b $k_1) $..h (_ $b $k_r)) "的线性组合. 坐标" (_ $b $k_i)
      "的选择是完全自由的, 也就是说, 如果" (&cm $c_1 $..h $c_r) "是任意的" $r "的标量, 那么"
      $W "中存在唯一的向量" $beta "满足以" $c_i "作为第" $k_i "个坐标.")
   (P "重要的点在于此: 给定向量" $alpha_i ", 行规约是一种确定整数" (&cm $r $k_1 $..h $k_r)
      "和标量" (mref $R $i $j) "的直接方法, 其给出了由" (&cm $alpha_1 $..h $alpha_m)
      "张成的子空间的显式描述. 读者应该注意到定理11表明每个" $F^n "的子空间" $W
      "都具有这样一个显式描述. 我们也应该指出问题2的一些东西. 我们已经在第1.4节陈述了如何"
      "找出一个" m*m "的可逆矩阵" $P "满足" (&= $R (&i* $P $A)) ". " $P
      "的知识允许我们在可能的情况下找出满足"
      (MB (&= $beta (LC0 $x_1 $alpha_1 $x_m $alpha_m)))
      "的标量" (&cm $x_1 $..h $x_m) ". 这是因为" $R "的行向量由"
      (MB (&= $rho_i (sum (&= $j $1) $m (&i* (mref $P $i $j) $alpha_j))))
      "给出, 于是若" $beta "是" $alpha_j "的线性组合, 那么我们有"
      (MB (deriv $beta
                 (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))
                 (sum (&= $i $1) $r
                      (&i* (_ $b $k_i)
                           (sum (&= $j $1) $m (&i* (mref $P $i $j) $alpha_j))))
                 (sum (&= $j $1) $m
                      (sum (&= $i $1) $r
                           (&i* (_ $b $k_i) (mref $P $i $j) $alpha_j)))))
      "因此"
      (MB (&= $x_j (sum (&= $i $1) $r (&i* (_ $b $k_i) (mref $P $i $j)))))
      "是" $x_j "的选择之一 (可能存在许多解).")
   (P "这样一个问题, 即" (&= $beta (tu0 $b_1 $..h $b_n)) "是否是" $alpha_i
      "的线性组合, 以及若是的情况下标量" $x_i "该是什么, 也可以通过问以下线性方程组"
      (MB (&cm (&= (sum (&= $i $1) $m (&i* (mref $A $i $j) $x_i)) $b_j)
               (&= $j (&cm $1 $..h $n))))
      "是否有解, 以及解是什么来得出答案. 这个线性方程组的系数矩阵是" (&c* $n $m)
      "的矩阵" $B ", 其列向量分别为" (&cm $alpha_1 $..h $alpha_m)
      ". 第1章中我们讨论了使用初等行变换来解这样一个线性方程组" (LE $B $X $Y)
      ". 让我们考虑一个例子, 其中我们采取两种观点来回答有关" $F^n "的子空间的问题.")
   ((example #:n "21")
    "让我们提出以下问题. 令" $W "是由向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $2 $2 $1))
             (&= $alpha_2 (tu0 $0 $2 $0 $1))
             (&= $alpha_3 (tu0 $-2 $0 $-4 $3))))
    "张成的" $RR^4 "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&cm $alpha_1 $alpha_2 $alpha_3) "是" $W
            "的一个基, 即这些向量是线性无关的.")
        (Li "令" (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4)) "是" $W "中的一个向量, 那么"
            $beta "相对于有序基" (setE $alpha_1 $alpha_2 $alpha_3)
            "的坐标是什么?")
        (Li "令"
            (MB (&cm (&= (_^ $alpha $1 $prime)
                         (tu0 $1 $0 $2 $0))
                     (&= (_^ $alpha $2 $prime)
                         (tu0 $0 $2 $0 $1))
                     (&= (_^ $alpha $3 $prime)
                         (tu0 $0 $0 $0 $3))))
            "证明" (&cm (_^ $alpha $1 $prime) (_^ $alpha $2 $prime) (_^ $alpha $3 $prime))
            "构成了" $W "的一个基.")
        (Li "如果" $beta "在" $W "中, 令" $X "是" $beta "相对于" $alpha "基的坐标矩阵, "
            $X^ "是相对于" $alpha^ "基的坐标矩阵. 找出" (&c* $3 $3) "的矩阵" $P
            "满足对于每个这样的" $beta "有" (&= $X (&i* $P $X^)) "."))
    "为了用第一种方法回答这些问题, 我们构造以" (&cm $alpha_1 $alpha_2 $alpha_3)
    "为行向量的矩阵" $A ", 并找出行等价于" $A "的行简化阶梯矩阵" $R
    ". 同时, 我们将相同的操作施行于恒等矩阵之上以获得满足" (&= $R (&i* $Q $A))
    "的可逆矩阵" $Q ":"
    (MB (&-> (Mat ($1 $2 $2 $1) ($0 $2 $0 $1) ($-2 $0 $-4 $3))
             (&= $R (Mat ($1 $0 $2 $0) ($0 $1 $0 $0) ($0 $0 $0 $1)))))
    (MB (&-> (Mat ($1 $0 $0) ($0 $1 $0) ($0 $0 $1))
             (&= $Q (&i* 1/6 (Mat ($6 $-6 $0) ($-2 $5 $-1) ($4 $-4 $2))))))
    (Ol #:attr* '((type "a"))
        (Li "显然" $R "的秩为" $3 ", 于是" (&cm $alpha_1 $alpha_2 $alpha_3)
            "是线性无关的.")
        (Li "什么样的向量" (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4))
            "在" $W "之中? 我们有" $W "的基" (&cm $rho_1 $rho_2 $rho_3)
            ", 即" $R "的行向量. 读者只需一眼即可看出" (&cm $rho_1 $rho_2 $rho_3)
            "张成的空间由所有满足" (&= $b_3 (&i* $2 $b_1)) "的向量" $beta
            "构成. 对于这样一个" $beta "我们有"
            (MB (deriv $beta
                       (&+ (&i* $b_1 $rho_1) (&i* $b_2 $rho_2) (&i* $b_3 $rho_3))
                       (&i* (Mat ($b_1 $b_2 $b_4)) $R)
                       (&i* (Mat ($b_1 $b_2 $b_4)) $Q $A)
                       (&+ (&i* $x_1 $alpha_1) (&i* $x_2 $alpha_2)
                           (&i* $x_3 $alpha_3))))
            "其中" (&= $x_i (&i* (Mat ($b_1 $b_2 $b_4)) $Q_i)) ":"
            (MB (set-attr*
                 (&Table
                  ($x_1 $= (: $b_1 $- (&i* $1/3 $b_2) $+ (&i* 2/3 $b_4)))
                  ($x_2 $= (: (&- $b_1) $+ (&i* 5/6 $b_2) $- (&i* 2/3 $b_4)))
                  ($x_3 $= (: (&i* -1/6 $b_2) $+ (&i* $1/3 $b_4))))
                 'columnalign "right")))
        (Li "向量" (&cm (_^ $alpha $1 $prime) (_^ $alpha $2 $prime) (_^ $alpha $3 $prime))
            "都具有" (tu0 $y_1 $y_2 $y_3 $y_4) "的形式, 其中" (&= $y_3 (&i* $2 $y_1))
            ", 因此它们都在" $W "中. 读者一眼就能看出它们是线性无关的.")
        (Li "矩阵" $P "以"
            (MB (&= $P_j (coordm (_^ $alpha $j $prime))))
            "为列, 其中" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3))
            ". 前面b里的结果已经告诉我们该如何找出"
            (&cm (_^ $alpha $1 $prime) (_^ $alpha $2 $prime) (_^ $alpha $3 $prime))
            "的坐标矩阵了. 例如, 若" (&= $beta (_^ $alpha $1 $prime)) "我们有"
            (&cm (&= $b_1 $1) (&= $b_2 $0) (&= $b_3 $2) (&= $b_4 $0)) ", 然后"
            (MB (set-attr*
                 (&Table
                  ($x_1 $= (: $1 $- (&i* $1/3 (@ $0)) $+ (&i* 2/3 (@ $0))) $= $1)
                  ($x_2 $= (: $-1 $+ (&i* 5/6 (@ $0)) $- (&i* 2/3 (@ $0))) $= $-1)
                  ($x_3 $= (: (&i* -1/6 (@ $0)) $+ (&i* $1/3 (@ $0))) $= $0))
                 'columnalign "right"))
            "因此" (&= (_^ $alpha $1 $prime) (&- $alpha_1 $alpha_2)) ". 类似地, 我们可以得到"
            (&= (_^ $alpha $2 $prime) $alpha_2) "和"
            (&= (_^ $alpha $3 $prime) (&+ (&- (&i* $2 $alpha_1) (&i* $2 $alpha_2)) $alpha_3))
            ". 于是,"
            (MB (&= $P (Mat ($1 $0 $2) ($-1 $1 $-2) ($0 $0 $1))))))
    "现在让我们看看如何用我们描述的第二种方法回答这些问题. 我们构造以" (&cm $alpha_1 $alpha_2 $alpha_3)
    "为列向量的" (&c* $4 $3) "矩阵" $B ":"
    (MB (&= $B (Mat ($1 $0 $-2) ($2 $2 $0) ($2 $0 $-4) ($1 $1 $3))))
    "我们问对于什么样的" (&cm $y_1 $y_2 $y_3 $y_4) "方程组" (LE $B $X $Y) "有解."
    (MB (Mat ($1 $0 $-2 $y_1) ($2 $2 $0 $y_2) ($2 $0 $-4 $y_3) ($1 $1 $3 $y_4)) $->
        (Mat ($1 $0 $-2 $y_1) ($0 $2 $4 (&- $y_2 (&i* $2 $y_1)))
             ($0 $0 $0 (&- $y_3 (&i* $2 $y_1))) ($0 $1 $5 (&- $y_4 $y_1))) $->)
    (MB (Mat ($1 $0 $-2 $y_1) ($0 $0 $-6 (&- $y_2 (&i* $2 $y_4)))
             ($0 $1 $5 (&- $y_4 $y_1)) ($0 $0 $0 (&- $y_3 (&i* $2 $y_1))))
        $->
        (Mat ($1 $0 $0 (: $y_1 $- (&i* $1/3 $y_2) $+ (&i* 2/3 $y_4)))
             ($0 $0 $1 (&i* 1/6 (@- (&i* $2 $y_4) $y_2)))
             ($0 $1 $0 (: (&- $y_1) $+ (&i* 5/6 $y_2) $- (&i* 2/3 $y_4)))
             ($0 $0 $0 (&- $y_3 (&i* $2 $y_1)))))
    "因此方程组" (LE $B $X $Y) "有解的条件是" (&= $y_3 (&i* $2 $y_1)) ". 于是, "
    (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4)) "在" $W "中当且仅当" (&= $b_3 (&i* $2 $b_1))
    ". 如果" $beta "在" $W "中, 那么有序基" (setE $alpha_1 $alpha_2 $alpha_3)
    "下的坐标" (tu0 $x_1 $x_2 $x_3) "可以从上面最后一个矩阵读出来. 其实我们就是又一次"
    "得到了第一种方法做出来的结果. 问题c和d可以像之前一样回答.")
   ((example #:n "22")
    "我们考虑" (&c* $5 $5) "矩阵"
    (MB (&= $A (Mat ($1 $2 $0 $3 $0)
                    ($1 $2 $-1 $-1 $0)
                    ($0 $0 $1 $4 $0)
                    ($2 $4 $1 $10 $1)
                    ($0 $0 $0 $0 $1))))
    "以及以下和" $A "有关的问题."
    (Ol #:attr* '((type "a"))
        (Li "找出一个可逆矩阵" $P "满足" (&i* $P $A) "是行简化阶梯矩阵" $R ".")
        (Li "找出" $A "的行空间" $W "的一个基.")
        (Li "说明什么样的向量" (tu0 $b_1 $b_2 $b_3 $b_4 $b_5) "在" $W "中.")
        (Li "找出" $W "中的每个向量" (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)
            "在b选择的有序基下的坐标矩阵.")
        (Li "将" $W "中的每个向量" (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)
            "写成" $A "的行的线性组合的形式.")
        (Li "给出所有满足" (LE $A $X $0) "的" (&c* $5 $1) "的列矩阵" $X
            "构成的向量空间" $V "的显式描述.")
        (Li "找出" $V "的一个基.")
        (Li "对于什么样的" (&c* $5 $1) "的列矩阵" $Y ", 方程组" AX=Y "有解?"))
    "为了解决这些问题, 我们构造方程组" AX=Y "的增广矩阵" $A^ ", 并对其施行一系列合适的行变换."
    (MB (Mat ($1 $2 $0 $3 $0 $y_1)
             ($1 $2 $-1 $-1 $0 $y_2)
             ($0 $0 $1 $4 $0 $y_3)
             ($2 $4 $1 $10 $1 $y_4)
             ($0 $0 $0 $0 $1 $y_5))
        $->
        (Mat ($1 $2 $0 $3 $0 $y_1)
             ($0 $0 $-1 $-4 $0 (&+ (&- $y_1) $y_2))
             ($0 $0 $1 $4 $0 $y_3)
             ($0 $0 $1 $4 $1 (&+ (&i* $-2 $y_1) $y_4))
             ($0 $0 $0 $0 $1 $y_5))
        $->)
    (MB (Mat ($1 $2 $0 $3 $0 $y_1)
             ($0 $0 $1 $4 $0 (&- $y_1 $y_2))
             ($0 $0 $0 $0 $0 (&+ (&- $y_1) $y_2 $y_3))
             ($0 $0 $0 $0 $1 (&+ (&i* $-3 $y_1) $y_2 $y_4))
             ($0 $0 $0 $0 $1 $y_5))
        $->
        (Mat ($1 $2 $0 $3 $0 $y_1)
             ($0 $0 $1 $4 $0 (&- $y_1 $y_2))
             ($0 $0 $0 $0 $1 $y_5)
             ($0 $0 $0 $0 $0 (&+ (&- $y_1) $y_2 $y_3))
             ($0 $0 $0 $0 $0 (&- (&+ (&i* $-3 $y_1) $y_2 $y_4) $y_5))))
    (Ol #:attr* '((type "a"))
        (Li "如果对于所有的" $Y "有"
            (MB (&= (&i* $P $Y)
                    (Mat ($y_1)
                         ((&- $y_1 $y_2))
                         ($y_5)
                         ((&+ (&- $y_1) $y_2 $y_3))
                         ((&- (&+ (&i* $-3 $y_1) $y_2 $y_4) $y_5)))))
            "那么"
            (MB (&= $P (Mat ($1 $0 $0 $0 $0)
                            ($1 $-1 $0 $0 $0)
                            ($0 $0 $0 $0 $1)
                            ($-1 $1 $1 $0 $0)
                            ($-3 $1 $0 $1 $-1))))
            "因此" (&i* $P $A) "是行简化阶梯矩阵"
            (MB (&= $R (Mat ($1 $2 $0 $3 $0)
                            ($0 $0 $1 $4 $0)
                            ($0 $0 $0 $0 $1)
                            ($0 $0 $0 $0 $0)
                            ($0 $0 $0 $0 $0))))
            "必须要强调的是矩阵" $P "不是唯一的, 实际上存在很多种可能的矩阵" $P
            " (来源于规约的不同顺序) 满足" (&= (&i* $P $A) $R) ".")
        (Li "我们可以提取" $R "非零行"
            (MB (&Table
                 ($rho_1 $= (tu0 $1 $2 $0 $3 $0))
                 ($rho_2 $= (tu0 $0 $0 $1 $4 $0))
                 ($rho_3 $= (tu0 $0 $0 $0 $0 $1))))
            "作为" $W "的一个基.")
        (Li "行空间" $W "由所有具有形式"
            (MB (deriv $beta
                       (&+ (&i* $c_1 $rho_1) (&i* $c_2 $rho_2) (&i* $c_3 $rho_3))
                       (tu0 $c_1 (&i* $2 $c_1) $c_2 (&+ (&i* $3 $c_1) (&i* $4 $c_2)) $c_3)))
            "的向量构成, 其中" (&cm $c_1 $c_2 $c_3) "是任意的标量. 因此, "
            (tu0 $b_1 $b_2 $b_3 $b_4 $b_5) "在" $W "中当且仅当"
            (MB (&= (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)
                    (&+ (&i* $b_1 $rho_1) (&i* $b_3 $rho_2) (&i* $b_5 $rho_3))))
            "其为真当且仅当"
            (MB (&cm (&= $b_2 (&i* $2 $b_1))
                     (&= $b_4 (&+ (&i* $3 $b_1) (&i* $4 $b_3)))))
            "这个线性方程组是显式描述的实例, 而通过它我们可以一眼看出一个给定向量是否在" $W
            "之中. 因此, " (tu0 $-5 -10 $1 -11 20)
            "是" $A "的行的线性组合, 而" (tu0 $1 $2 $3 $4 $5) "不是.")
        (Li "向量" (tu0 $b_1 (&i* $2 $b_1) $b_3 (&+ (&i* $3 $b_1) (&i* $4 $b_3)) $b_5)
            "在有序基" (setE $rho_1 $rho_2 $rho_3) "下的坐标矩阵显然是"
            (MB (Mat ($b_1) ($b_3) ($b_5)) "."))
        (Li "许多种方法都可以将" $W "的向量写成" $A "的行的线性组合, 或许最简单的一种是"
            "遵循例子21之前的第一个过程的步骤:"
            (MB (deriv $beta
                       (tu0 $b_1 (&i* $2 $b_1) $b_3 (&+ (&i* $3 $b_1) (&i* $4 $b_3)) $b_5)
                       (&d* (Mat ($b_1 $b_3 $b_5 $0 $0)) $R)
                       (&d* (Mat ($b_1 $b_3 $b_5 $0 $0)) (&i* $P $A))
                       (&d* (&i* (Mat ($b_1 $b_3 $b_5 $0 $0))
                                 (Mat ($1 $0 $0 $0 $0)
                                      ($1 $-1 $0 $0 $0)
                                      ($0 $0 $0 $0 $1)
                                      ($-1 $1 $1 $0 $0)
                                      ($-3 $1 $0 $1 $-1)))
                            $A)
                       (&d* (Mat ((&+ $b_1 $b_3) (&- $b_3) $0 $0 $b_5)) $A)))
            "特别地, 如果" (&= $beta (tu0 $-5 -10 $1 -11 20)) "我们有"
            (MB (&= $beta
                    (&i* (Mat ($-4 $-1 $0 $0 20))
                         (Mat ($1 $2 $0 $3 $0)
                              ($1 $2 $-1 $-1 $0)
                              ($0 $0 $1 $4 $0)
                              ($2 $4 $1 $10 $1)
                              ($0 $0 $0 $0 $1))))))
        (Li "方程组" RX=0 "中的方程是"
            (MB (set-attr*
                 (&Table
                  ((: $x_1 $+ (&i* $2 $x_2) $+ (&i* $3 $x_4)) $= $0)
                  ((: $x_3 $+ (&i* $4 $x_4)) $= $0)
                  ($x_5 $= $0))
                 'columnalign "right"))
            "因此, " $V "由所有具有形式"
            (MB (Mat ((&- (&i* $-2 $x_2) (&i* $3 $x_4)))
                     ($x_2)
                     ((&i* $-4 $x_4))
                     ($x_4)
                     ($0)))
            "的列向量构成, 其中" $x_2 "和" $x_4 "是任意的.")
        (Li "列向量"
            (MB (&cm (Mat ($-2) ($1) ($0) ($0) ($0))
                     (Mat ($-3) ($0) ($-4) ($1) ($0))))
            "构成了" $V "的一个基, 这是例子15所描述的基的一个例子.")
        (Li "方程组" AX=Y "有解当且仅当"
            (MB (set-attr*
                 (&Table
                  ((&+ (&- $y_1) $y_2 $y_3) $= $0)
                  ((&- (&+ (&i* $-3 $y_1) $y_2 $y_4) $y_5) $= $0))
                 'columnalign "right")))))
   ((exercise #:n "1")
    "令" (&< $s $n) "而" $A "是一个域" $F "上的" (&c* $s $n) "矩阵, 使用定理4 (但不是其证明) "
    "证明" $F^n*1 "中存在非零的" $X "满足" AX=0 ".")
   ((exercise #:n "2")
    "令"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $-2 $1))
             (&= $alpha_2 (tu0 $3 $0 $4 $-1))
             (&= $alpha_3 (tu0 $-1 $2 $5 $2))))
    "令"
    (MB (&cm (&= $alpha (tu0 $4 $-5 $9 $-7))
             (&= $beta (tu0 $3 $1 $-4 $4))
             (&= $gamma (tu0 $-1 $1 $0 $1))))
    (Ol #:attr* '((type "a"))
        (Li (&cm $alpha $beta $gamma) "中哪些在" $alpha_i "张成的" $RR^4 "的子空间之中?")
        (Li (&cm $alpha $beta $gamma) "中哪些在" $alpha_i "张成的" $CC^4 "的子空间之中?")
        (Li "这是否暗示了一个定理?")))
   ((exercise #:n "3")
    "考虑以下" $RR^4 "中的向量"
    (MB (&cm (&= $alpha_1 (tu0 $-1 $0 $1 $2))
             (&= $alpha_2 (tu0 $3 $4 $-2 $5))
             (&= $alpha_3 (tu0 $1 $4 $0 $9))))
    "找出一个齐次线性方程组, 其解空间恰是这些向量张成的子空间.")
   ((exercise #:n "4")
    "在" $CC^3 "中, 令"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 (&- $i)))
             (&= $alpha_2 (tu0 (&+ $1 $i) (&- $1 $i) $1))
             (&= $alpha_3 (tu0 $i $i $i))))
    "证明这些向量构成了" $CC^3 "的一个基. 向量" (tu0 $a $b $c)
    "在这个基下的坐标是什么?")
   ((exercise #:n "5")
    "给出" $RR^5 "中的向量"
    (MB (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)))
    "的显式描述, 其为向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $2 $1 $-1))
             (&= $alpha_2 (tu0 $-1 $2 $-4 $2 $0))
             (&= $alpha_3 (tu0 $2 $-1 $5 $2 $1))
             (&= $alpha_4 (tu0 $2 $1 $3 $5 $2))))
    "的线性组合.")
   ((exercise #:n "6")
    "令" $V "是由矩阵"
    (MB (&= $A (Mat ($3 21 $0 $9 $0)
                    ($1 $7 $-1 $-2 $-1)
                    ($2 14 $0 $6 $1)
                    ($6 42 $-1 13 $0))))
    "的行张成的实向量空间."
    (Ol #:attr* '((type "a"))
        (Li "找出" $A "的一个基.")
        (Li "什么样的向量" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5)
            "是" $V "的元素.")
        (Li "如果" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5) "在" $V "中, 那么"
            "它在a选择的基下的坐标是什么?")))
   ((exercise #:n "7")
    "令" $A "是域" $F "上的" m*n "矩阵, 考虑线性方程组" AX=Y
    ". 证明该线性方程组有解当且仅当" $A "的行秩等于其增广矩阵的行秩.")
   ))