#lang racket
(provide hott_intro.html)
(require SMathML)
(define hott_intro.html
  (TnTmPrelude
   #:title "同伦类型论引论"
   #:css "styles.css"
   (H1. "同伦类型论引论")
   (H2 "引论")
   (P "这是一本关于单价数学和同伦类型论的导引性质教科书. "
      "同伦类型论是一种利用了数学定义和构造的结构性质的数学基础. "
      "数学实践普遍将等价对象视为相同的, 例如, 将同构的群视作等同. "
      "在集合论中并不可能形式化这一通常惯例. 例如, "
      "集合论背景下存在多少不同的单元素集合就有多少的平凡群. "
      
      )
   (H2. "依赖类型论")
   (H2. "依赖函数类型")
   (H2. "自然数")
   (H2. "更多的归纳类型")
   (H2. "恒等类型")
   (H2. "宇宙")
   (H2. "藉由Curry-Howard解释的模算术")
   (H2. "初等数论的可判定性")
   (H2. "等价")
   (H2. "可缩类型和可缩映射")
   (H2. "恒等类型的基本定理")
   (H2. "命题, 集合, 以及高阶截断层次")
   (H2. "函数外延性")
   (H2. "命题性截断")
   
   ))