#lang racket
(provide imperative.html)
(require SMathML)
(define (BigO x) (app $O x))
(define $log (Mi "log"))
(define (&log x) (ap $log x))
(define imperative.html
  (TnTmPrelude
   #:title "命令式计算原理"
   #:css "styles.css"
   (H1. "命令式计算原理")
   (P "此为笔记, 但本人未参加过该课程, 全凭材料学习. "
      "该课程材料分为两种, 一种是笔记, 另一种是幻灯片. "
      "笔记内容比较紧凑, 幻灯片内容比较丰富. "
      "然而, 其内容存在诸多差异, 不能只看一种而不看另一种.")
   (P "另外此课程规章制度相当严苛 "
      "(例如原则上即便重修也不能查看自己之前的笔记和作业), "
      "但既然本人并非CMU学生, 所以并不会遵守这些规则. "
      "不过, 本人并不会使用任何基于LLM的AI来学习该课程.")
   (P "个人感觉随着年份渐长, 该课程的琐碎逐渐增多, "
      "不复最初的锐利. 不过, "
      "我们学习的时候完全可以抛开那些无聊的"
      (Q "托勒密化") ".")
   (H2 "概览 (幻灯片)")
   (P "概览只有幻灯片, 没有笔记.")
   (P "课程学习目标:"
      (Ul (Li "计算性思维")
          (Li "编程技巧")
          (Li "算法知识")
          (Li "技术性理解")))
   (H2. "合约")
   (H3. "幻灯片版本")
   (P "此课开头的任务是理解以下代码做了什么:"
      (CodeB "int f(int x, int y) {
  int r = 1;
  while (y > 1) {
    if (y % 2 == 1) {
    r = x * r;
    }
    x = x * x;
    y = y / 2;
  }
  return r * x;
}")
      "当然了, 本质上我们需要先明确我们需要做什么. "
      "对于该课程, 从技术性角度来说, "
      "需要做的有以下三件事情:"
      (Ul (Li "确定前条件,")
          (Li "确定后条件,")
          (Li "证明前条件可以推出后条件, "
              "可能需要添加循环不变量之类的断言以辅助证明."))
      "这也可以笼统地表达为证明程序的正确性.")
   (P "抛开课程故意做作的演进过程, "
      "我们立即可以看出这个函数可以计算输入的幂. "
      "然而, 显然它也没有考虑一些边角情况. "
      "不过, 我们也可以在前条件里就将边角排除. "
      "当然, 绝大多数时候, 我们还是希望尽可能一般.")
   (P "我们的思维方式如下: 设该函数的输入分别是"
      $x_0 "和" $y_0 ", 循环不变量是"
      (&= (&d* $r $x^y) (^ $x_0 $y_0))
      ". 如果" $y_0 "是满足" (&>= $y_0 $1)
      "的整数, 那么在离开while循环时"
      $y "的值应该为" $1 ", 而" (&= $x^1 $x)
      ". 因此, 在离开while循环时, 我们有"
      (&= (&d* $r $x) (^ $x_0 $y_0))
      ". 这个推理几乎是完全正确的, "
      "不过并没有考虑一些边角情形, "
      "尤其是和带符号整数大小限制相关的. "
      "当然了, 按照课程安排, "
      "这个在之后的讲座才会考虑. "
      "不过, 以上我们至少注意到了如果"
      (&= $y_0 $0) ", 那么推理就会被破坏而失效.")
   (P "此课最终给出的版本如下:"
      (CodeB "int f(int x, int y)
//@requires y >= 0;
//@ensures \\result == POW(x,y);
{
  int b = x;
  int e = y;
  int r = 1;
  while (e > 0)
  //@loop_invariant e >= 0;
  //@loop_invariant POW(b,e) * r == POW(x,y);
  {
    if (e % 2 == 1) {
      r = b * r;
    }
    b = b * b;
    e = e / 2;
  }
  //@assert e == 0;
  return r;
}")
      "这实际上是C0语言而非C语言的代码. "
      )
   (H3. "笔记版本")
   (H2. "整数 (整型)")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "数组")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "搜索")
   (P "这次我们考虑的是在数组中搜索特定元素这一问题.")
   (H3. "幻灯片版本")
   
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "无界数组")
   (P "这次讲座是关于无界数组的, "
      "不过更重要的是引入了摊销分析.")
   (H3. "幻灯片版本")
   
   (H3. "笔记版本")
   (H2. "哈希")
   (H3. "幻灯片版本")
   (P "对于数组而言, 一般的用途是作为集合, "
      "或者是作为键值是整数的字典. "
      "当然了, 我们也可以拥有更为一般的字典, "
      "键值并不局限于整数.")
   (P "我们先比较了几种naive的字典实现方法:"
      (MB (&Table
           ($ "未排序数组" "已排序数组" "链表")
           ("查找" (BigO $n) (BigO (&log $n)) (BigO $n))
           ("插入" (: "摊销" (BigO $1)) (BigO $n) (BigO $1)))))
   
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "通用数据结构 (Generic Data Structures)")
   (H3. "函数指针 (幻灯片)")
   
   (H3. "通用哈希字典 (幻灯片)")
   
   (H3. "笔记版本")
   
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   (H2. "")
   (H3. "幻灯片版本")
   (H3. "笔记版本")
   ))