#lang racket
(provide jones.html)
(require SMathML)
(define &card &abs)
(define jones.html
  (TmPrelude
   #:title "可计算性和计算复杂度"
   #:css "styles.css"
   (H1 "可计算性和计算复杂度")
   (P "虽然很多人都知道, 但是第一个将这样的想法写成书籍的恐怕是Neil Jones. "
      "也就是说, Turing机器和G&ouml;del配数其实可以看成是很难用的编程语言, "
      "没有必要局限于此, 我们可以使用真正的编程语言刻画想法, 进行证明.")
   (H2 "前言")
   (P "本书是对于可计算理论和复杂度理论的一般性介绍. 它应该对于想要了解"
      "可计算理论和复杂度理论的编程语言研究者而言是有趣的, 或许反过来也是一样.")
   (H3 "俯瞰主题")
   (P "与绝大多数计算机科学领域都不相同, 可计算理论和复杂度理论既处理综合也处理"
      "分析, 并且与某些显然带有绝对性质的概念打交道. 逻辑学和递归函数论的进展"
      "已经相当精确地刻画了有效过程 (effective procedure) , "
      "可判定问题 (decidable problem) 和半可判定问题 (semi-decidable problem) "
      "的概念和性质, 并且以相对于计算设备和逻辑理论不变的方式建立了它们.")
   
   (H2 "第一部分 迈向理论")
   (H3 "第1章 导引")
   (H3 "第2章 " (Code "WHILE") "语言")
   (P "导引章节的概念 (例如&quot;有效可计算&quot;) 是不精确的, 因为它们依赖于对于"
      "&quot;有效过程&quot;的直觉性理解. 现在我们呈现一个计算模型, 或者说编程语言, "
      "其被称为" (Code "WHILE") ". 之后我们将精确地定义前一章的直觉性概念, 通过将"
      "&quot;有效过程&quot;和&quot;" (Code "WHILE") "程序&quot;等同起来.")
   (H4 "第2.1节 " (Code "WHILE") "数据和程序的句法")
   (H5 "第2.1.1小节 作为数据值的二叉树")
   ((definition #:n "2.1.1")
    "树的集合" $DD "定义如下:"
    (Ol (Li "原子" (Code "nil") "是" $DD "的一个元素;")
        (Li "每当" (Code "d" (Sub "1")) "和" (Code "d" (Sub "2"))
            "是" $DD "的元素, 那么"
            (Code "(d" (Sub "1") ",d" (Sub "2") ")")
            "也是; 并且")
        (Li $DD "是满足前两点的最小集合.")))
   ((definition #:n "2.1.2")
    "函数" 
    )
   (H5 "第2.1.2小节 " (Code "WHILE") "程序的句法")
   
   (H3 "第3章 程序作为数据对象")
   (H2 "第二部分 可计算性导论")
   (H3 "第4章 自解释: " (Code "WHILE") "和" (Code "I") "的通用程序")
   (H3 "第5章 可计算理论基础")
   (H3 "第5.1节 可计算性, 可判定性, 可枚举性")
   ((definition #:n "5.1.1")
    "一个部分函数" (func $f $DD (_ $DD $bottom)) "是" (Code "WHILE")
    "可计算的当且仅当存在一个" (Code "WHILE") "程序" (Code "p")
    "使得" (&= $f (&db0 (Ms "p"))) ", 即对所有" (∈ (Ms "d") (Ms "e") $DD) ":"
    (Ol (Li "如果" (&= (app $f (Ms "d")) $bottom) ", 那么"
            (&= (app (&db0 (Ms "p")) (Ms "d")) $bottom) ".")
        (Li "如果" (&= (app $f (Ms "d")) (&in (Ms "e") $DD)) ", 那么"
            (&= (app (&db0 (Ms "p")) (Ms "d")) (Ms "e")) ".")))
   (P "集合" $A "是可判定的, 如果关于" $A "的成员资格问题可由一个总是终止的程序回答. "
      ""
      )
   (H3 "第6章 元编程, 自解释和编译器生成")
   (H3 "第7章 计算的其他顺序模型")
   
   ))