#lang racket
(provide kailai.html)
(require SMathML)
(define (Seq a)
  (_ (@ (_ a $n)) (&>= $n $1)))
(define $+:compact (set-compact $+))
(define $-:compact (set-compact $-))
(define (Left x) (: x $-:compact))
(define (Right x) (: x $+:compact))
(define (&~ x) (^^ x $~))
(define (∀ x p)
  (: $forall x $. p))
(define kailai.html
  (parameterize ([separate-class? #t])
    (TnTmPrelude
     #:title "概率论教程"
     #:css "styles.css"
     (H1. "概率论教程")
     (P "这是个人阅读钟开莱所著的概率论教程一书的笔记.")
     (H2. "分布函数")
     (H3. "单调函数")
     (P "本书的正负增减均为广义, 即"
        (Q $x "为正") "指的是" (Q (&>= $x $0))
        ". 若要使用传统意义, 则须加"
        (Q "严格") "二字.")
     (P "设" (func $f $RR $RR) "是一个增函数, "
        "则对于任意两个实数" $x_1 "和" $x_2
        ", 我们有"
        (MBL "(1)"
             (&=> (&< $x_1 $x_2)
                  (&<= (app $f $x_1)
                       (app $f $x_2))) ".")
        "当然了, 这也等价于"
        (MB (&=> (&<= $x_1 $x_2)
                 (&<= (app $f $x_1)
                      (app $f $x_2))) "."))
     (P "我们使用" (&uarr $t $x)
        "表示" $t "从左侧趋近于" $x
        ", " (&darr $t $x)
        "表示" $t "从右侧趋近于" $x ".")
     ((Proposition #:id "increasing-unilateral-limits")
      "对于每个" $x ", " $f "在" $x
      "处的左极限和右极限均(严格)存在, 其记号分别为"
      (MBL "(2)"
           (&= (app $f (Left $x))
               (lim (&uarr $t $x)
                    (app $f $t)))
           "和"
           (&= (app $f (Right $x))
               (lim (&darr $t $x)
                    (app $f $t))) ".")
      $f "在无穷远处的极限亦(广义)存在, "
      "其记号分别为"
      (MB (&= (app $f (&- $inf))
              (lim (&darr $t (&- $inf))
                   (app $f $t)))
          "和"
          (&= (app $f (&+ $inf))
              (lim (&uarr $t (&+ $inf))
                   (app $f $t))) ".")
      "前者可能为" (&- $inf)
      ", 后者可能为" (&+ $inf) ".")
     ((proof)
      "对于任意的实数" $x ", 设"
      (MB (&= $a
              (supremum
               (&< $t $x)
               (app $f $t))) ".")
      "根据单调性和确界原理, "
      "这个上确界是良定的. "
      "对于每个" (&> $epsilon $0)
      ", 存在" (&> $delta $0) "满足"
      (MB (&> (app $f (&- $x $delta))
              (&- $a $epsilon)) ".")
      "根据单调性, 对于每个实数" $t "满足"
      (&< (&- $x $delta) $t $x)
      ", 我们有"
      (MB (&> (app $f $t)
              (&- $a $epsilon)) ".")
      "并且, 我们还知道"
      (MB (&<= (app $f $t) $a) ".")
      "因此, 可以推出"
      (MB (&< (&abs (&- (app $f $t) $a))
              $epsilon) ".")
      "这告诉我们" $f "在" $x
      "处的左极限存在, 且"
      (MB (&= (app $f (Left $x))
              (supremum
               (&< $t $x)
               (app $f $t))) ".")
      "如法炮制, 我们可以证明"
      (MB (&= (app $f (Right $x))
              (infimum
               (&> $t $x)
               (app $f $t))) ".")
      "对于趋向无穷远处的极限, 证明也是类似的.")
     ((Proposition #:id "increasing-continuous")
      "对于每个实数" $x ", " $f "在"
      $x "处连续当且仅当"
      (MB (&= (app $f (Left $x))
              (app $f $x)
              (app $f (Right $x))) "."))
     ((proof)
      "函数" $f "在" $x "处连续当且仅当"
      (MB (&= (lim $t $x (app $f $t))
              (app $f $x)) ".")
      "而这又当且仅当"
      (MB (&= (app $f (Left $x))
              (app $f $x))
          "且"
          (&= (app $f (Right $x))
              (app $f $x)) ".")
      "另外, 原书的证明方法给出了"
      (MBL "(3)"
           (&<= (app $f (Left $x))
                (app $f $x)
                (app $f (Right $x))))
      "作为中间步骤.")
     ((tcomment)
      "这个命题对于一般的函数也成立.")
     (P "一般而言, 我们称" $f "在" $x
        "处有一个" (Em "跳跃")
        ", 如果(2)中的两个极限均存在且不相等. "
        $f "在" $x "处的值本身, 即" (app $f $x)
        ", 则可以是任意的. 但对于增函数" $f
        "而言, 关系(3)必然成立. 作为"
        (Ref "increasing-unilateral-limits")
        "和" (Ref "increasing-continuous")
        "的推论, 我们有以下结果.")
     ((Proposition)
      "一个增函数的唯一可能的非连续性种类为跳跃. "
      "{读者还应该自问, 对于一般的函数, "
      "还存在哪些种类的非连续性.}")
     (P "如果" $x "处存在跳跃, 那么我们称" $x
        "是" $f "的一个跳跃点, 而数字"
        (&- (app $f (Right $x))
            (app $f (Left $x)))
        "被称为" $f "在" $x "处"
        (Em "跳跃的大小") ".")
     (P "注意跳跃点的集合不必是一个闭集.")
     ((Example)
      "令" $x_0 "是一个任意的实数, "
      "并定义函数" $f "如下:"
      (MB (&= (app $f $x)
              (Choice0
               ($0 ", 对于" (&< $x (&- $x_0 $1)))
               ((&- $1 (~ $1 $n))
                ", 对于"
                (: (&- $x_0 (~ $1 $n)) $<=
                   $x $<
                   (&- $x_0 (~ $1 (&+ $n $1))))
                ", 其中"
                (&= $n (&cm $1 $2 $..h)))
               ($1 ", 对于" (&>= $x $x_0)))))
      "点" $x_0 "是跳跃点集合"
      (setI (&- $x_0 (&/ $1 $n))
            (&>= $n $2))
      "的一个聚点, 但是" $f
      "在" $x_0 "处连续.")
     ((tcomment)
      "我并不非常确定这里的聚点的确切定义是什么, "
      "但似乎这里的聚点和Baby Rudin里的极限点是同义的. "
      "另外, 原文其实写的是"
      (setI (&- $x_0 (&/ $1 $n))
            (&>= $n $1))
      ", 但我认为这是一个笔误, 因为在"
      (&- $x_0 $1) "处并不存在跳跃.")
     (P "在讨论下一个例子之前, "
        "我们引入一个全书都将使用的记号. "
        "对于任意的实数" $t ", 我们置"
        (MBL "(4)"
             (&= (app $delta_t $x)
                 (Choice0
                  ($0 ", 对于" (&< $x $t))
                  ($1 ", 对于" (&>= $x $t)))))
        "我们称函数" $delta_t "为"
        (Q $t "处的点质量") ".")
     ((Example)
      "令" (Seq $a) "是任意给定的对于有理数集全体的枚举, 令"
      (Seq $b) "是正序列 (即非负序列) 满足"
      (&< (sum (&= $n $1) $inf $b_n) $inf)
      ". 例如, 我们可以取"
      (&= $b_n (^ $2 (&- $n)))
      ". 现在考虑"
      (MBL "(5)"
           (&= (app $f $x)
               (sum (&= $n $1) $inf
                    (&i* $b_n
                         (app (_ $delta $a_n) $x)))) ".")
      "既然对于每个" $n "和" $x "都有"
      (&<= $0 (app (_ $delta $a_n) $x) $1)
      ", 那么(5)中的级数是绝对和一致收敛的. "
      "鉴于每个" (_ $delta $a_n)
      "都是增函数, 可以推出如果"
      (&< $x_1 $x_2) ", 那么"
      (MB (&>= (&= (&- (app $f $x_2) (app $f $x_1))
                   (sum (&= $n $1) $inf
                        (&i* $b_n
                             (bra0
                              (&- (app (_ $delta $a_n) $x_2)
                                  (app (_ $delta $a_n) $x_1))))))
               $0) ".")
      "因此, " $f "是递增的. 感谢一致收敛, "
      "我们可以推出对于每个" $x ", 都有"
      (MBL "(6)"
           (deriv
            (&- (app $f (Right $x))
                (app $f (Left $x)))
            (&- (lim (&darr $t $x)
                     (sum (&= $n $1) $inf
                          (&i* $b_n (app (_ $delta $a_n) $x))))
                (lim (&uarr $t $x)
                     (sum (&= $n $1) $inf
                          (&i* $b_n (app (_ $delta $a_n) $x)))))
            (&- (sum (&= $n $1) $inf
                     (lim (&darr $t $x)
                          (&i* $b_n (app (_ $delta $a_n) $x))))
                (sum (&= $n $1) $inf
                     (lim (&uarr $t $x)
                          (&i* $b_n (app (_ $delta $a_n) $x)))))
            (&- (sum (&= $n $1) $inf
                     (&i* $b_n (app (_ $delta $a_n) (Right $x))))
                (sum (&= $n $1) $inf
                     (&i* $b_n (app (_ $delta $a_n) (Left $x)))))
            (sum (&= $n $1) $inf
                 (&i* $b_n
                      (bra0
                       (&- (app (_ $delta $a_n) (Right $x))
                           (app (_ $delta $a_n) (Left $x))))))))
      "但是对于每个" $n ", 以上方括号里的数字要么是" $0
      "要么是" $1 ", 根据" (&!= $x $a_n) "还是"
      (&= $x $a_n) ". 因此, 如果" $x "不同于所有的" $a_n
      ", 那么(6)的右侧的每个项就都归零了; "
      "另一方面, 如果" (&= $x $a_k)
      ", 那么右侧恰存在一个项没有归零, 也就是"
      (&= $n $k) "的情形, 那么这整个级数产生的值就是"
      $b_k ". 这证明了函数" $f "在所有的有理点处均有跳跃, "
      "而在其他地方均无跳跃. {译注: 当然如果要这样, "
      (Seq $b) "的选取就得保证每一项是严格正的了.}")
     (P "这个例子表明了跳跃点集可能处处稠密; "
        "实际上这个例子里的有理数集可以改成"
        "任意的可数集合而并不改变论证方式. "
        "现在我们要表明可数性的条件是不可避免的. "
        (Q "可数") "总是指" (Q "有限或可数无限")
        ". {译注: 不过, 在这个例子里, 可数仅能是可数无限, "
        "否则的话并不存在枚举. 然而, 在有限的情况下, "
        "我们也可以对于论证进行少许修改.}")
     ((Proposition)
      $f "的不连续点集合是可数的.")
     ((proof)
      "我们将使用具有一般适用性的拓扑方法进行论证. "
      "本节后的练习3将指出基于同样有用的计数方法的另外一种证明. "
      "对于每个跳跃点" $x ", 我们考虑开区间"
      (&= $I_x (tu0 (app $f (Left $x))
                    (app $f (Right $x))))
      ". 如果" $x^ "是另一个跳跃点, 比如说"
      (&< $x $x^) ", 那么存在一个点" (&~ $x)
      "满足" (&< $x (&~ $x) $x^)
      ". 于是, 根据单调性, 我们有"
      (MB (&<= (app $f (Right $x))
               (app $f (&~ $x))
               (app $f (Left $x^))) ".")
      "因此, 两个区间" $I_x "和" (_ $I $x^)
      "互不相交, 虽然如果"
      (&= (app $f (Right $x))
          (app $f (Left $x^)))
      "则会邻接. 于是, " $f
      "的定义域中的跳跃点的集合可与" $f
      "的陪域中的特定的互不相交的开区间类联系起来. "
      "那么, 任何这样的类都是可数的, "
      "因为每个区间都包含一个有理数, "
      "于是这区间类能够一一对应于有理数集的某个特定子集, "
      "而后者必然是可数的. "
      "因此, 不连续点集合也是可数的, "
      "鉴于其与这开区间类是一一对应的.")
     ((Proposition)
      "令" $f_1 "和" $f_2 "是两个增函数, "
      $D "在" (tu0 (&- $inf) (&+ $inf))
      "中(处处)稠密. 设"
      (MB (∀ (∈ $x $D)
             (&= (app $f $x_1) (app $f $x_2))))
      "那么" $f_1 "和" $f_2
      "有着相同的跳跃点集合, "
      "且在每个跳跃点处的大小相等. "
      "并且, 除了在某些跳跃点处可能例外, "
      "这两个函数是重合的.")
     ((proof)
      "为了证明这一论断, 令" $x
      "是一个任意的点, 并令"
      (enum
       (∈ $t_n $D)
       (∈ (_prime $t $n) $D)
       (&uarr $t_n $x)
       (&darr (_prime $t $n) $x))
      ". 鉴于" $D "稠密, 故这样的序列存在. "
      )
     (H3. "分布函数")
     (P "现在设函数" $f "是有界的, 并且也是递增的和非常函数的. "
        "那么, 我们有"
        (MB (∀ $x (: (&- $inf) $<
                     (app $f (&- $inf)) $<=
                     (app $f $x) $<=
                     (app $f (&+ $inf)) $<
                     (&+ $inf))) ".")
        "考虑" (Q "正则化了") "的函数:"
        (MBL "(1)"
             (&= (app (&~ $f) $x)
                 (~ (&- (app $f $x)
                        (app $f (&- $inf)))
                    (&- (app $f (&+ $inf))
                        (app $f (&- $inf))))))
        
        )
     (H3. "绝对连续分布和奇异分布")
     (H2. "测度论")
     (H3. "集类")
   
     (H3. "概率测度及其分布函数")
   
     (H2. "随机变量 期望 独立性")
   
     (H2. "收敛概念")
     (H3. "各种收敛方式")
     (H2. "大数定律 随机级数")
     (H2. "特征函数")
     (H2. "中心极限定理及其分歧")
     (H2. "随机游走")
     (H2. "条件期望 Markov性 鞅")
     )))
