#lang racket
(provide language_cognitive.html)
(require SMathML)
(define language_cognitive.html
  (TnTmPrelude
   #:title "语言作为认知过程"
   #:css "styles.css"
   (H1. "语言作为认知过程")
   (P "本书的作者Winograd也是著名古典AI程序SHRDLU的作者. "
      "虽然说可以将本书视为一本关于认知语言学的著作, "
      "但是因为认知语言学这个术语已经承载了太多不同的含义, "
      "以至于即便这么说也不能提供任何有用的信息.")
   (H2. "将语言视为基于知识的过程")
   (P "本书是关于人类语言的. "
      "其目的在于呈现一个框架, "
      "用于将语言当作交流的过程进行研究. "
      "这种方法收到了以下两个相互交织的问题的启发:"
      (Blockquote
       "一个人需要拥有什么知识才能说和理解语言呢?" (Br)
       "心智是如何组织以在交流之中利用这种知识的呢?")
      "通过将语言视为认知过程, "
      "我们处理了已成为语言学研究多年焦点的议题, "
      "而且本书包括了由这些研究所得到的结果和洞察. "
      "但是, 我们从一种不同的视角来观察语言. "
      "重点更少放在了声音或者句子的结构上, "
      "更多放在了产生和理解声音或者句子的过程的结构上. "
      
      )
   (H2. "词模式和词类")
   (H3. "模式和匹配")
   
   (H3. "词类")

   (H3. "转移网络")
   
   (H2. "上下文无关文法和句法分析")
   (H2. "变换性文法")
   (H2. "增强转移网络文法")
   (H2. "特性和函数文法")
   (H2. "用于自然语言句法分析的计算机系统")
   (H2 "附录A. 一个描述对象和过程的语言")
   (H2 "附录B. 英语句法大纲")
   (H2 "附录C. 变换性文法的当前方向")
   (H2 "附录D. 英语的一个ATN文法")
   ))