#lang racket
(provide lax.html)
(require SMathML)
(define $○
  (set-compact (Mo "○")))
(define $S4 (Mi "S4"))
(define $LΠ (Mi "LΠ"))
(define $impl $sup)
(define &impl &sup)
(define $○R (Mi "○R"))
(define $○M (Mi "○M"))
(define $○S (Mi "○S"))
(define (&○ M) (ap $○ M))
(define lax.html
  (TnTmPrelude
   #:title "命题松弛逻辑"
   #:css "styles.css"
   (H1. "命题松弛逻辑")
   (P "我们研究一种颇为奇特的直觉主义模态逻辑, "
      "称为命题松弛逻辑 (Propositional Lax Logic, PLL), "
      "它在计算机硬件的形式验证方面很有应用前景. "
      "该逻辑源于这样一种尝试: 把"
      (Q "在行为约束意义下的正确性") --
      "硬件验证中的一个核心概念" --
      "表达为一个逻辑模态. 作为一种模态逻辑, "
      "它的特别之处在于只配备了单一的模态算子" $○
      ", 而该算子同时带有可能性与必然性两种意味. "
      "本文给出PLL的研究动机, 并给出若干技术性结果. "
      "我们考察了它的一些证明论性质, "
      "针对该逻辑的标准Gentzen式相继式系统给出了一个切消定理. "
      "随后, 我们为PLL定义了一类新的"
      "可谬 (fallible) 双框架Kripke模型. "
      "这类模型很不寻常, 因为其中出现了带有不一致信息的世界; "
      "此外, 所施加的唯一框架条件是: "
      $○ "-框架是" $impl "-框架的一个子关系. "
      "我们给出了一个自然的翻译, 把这类模型转化为以Goldblatt的"
      $J:script "-空间给出的PLL模型. "
      "针对这类模型的完备性定理给出了PLL到" (tu0 $S4 $S4)
      "型经典双模态理论的一个Gödel式嵌入, "
      "也为有限模型性质的一个简单证明奠定了基础. "
      "我们进而针对若干特殊的模型类, "
      "证明了相应理论的可靠性与完备性. "
      "最后, 我们简要考察了硬件验证中两类具体而相当自然的模型, "
      "在其中模态算子" $○
      "所刻画的正是相对于时序约束的正确性. "
      "对于第一类模型, 我们证明了其逻辑的无" $○
      "片段是可判定的, "
      "而该片段恰好就是Maksimova的中间逻辑"
      $LΠ "的稳定形式.")
   (H2. "引论")
   (P "本文的研究对象是相当奇特的模态算子"
      $○ ", 它由以下公理模式刻画:"
      (eqn*
       ($○R $: (&impl $M (&○ $M)))
       ($○M $: (&impl (&○ (&○ $M)) (&○ $M)))
       ($○S $: (&impl (@conj (&○ $M) (&○ $N))
                      (&○ (@conj $M $N)))))
      "带有Modus Ponens和"
      (Q "由" (&impl $M $N) "推出"
         (&impl (&○ $M) (&○ $N)))
      "这两条推理规则. 从经典的观点看, "
      "这三条公理放在一起并没有太大意义, "
      "尽管单看每一条都显得人畜无害. 事实上, " $○
      "兼具可能性与必然性的意味, 却又不属于其中任何一方. "
      )
   ))