#lang racket
(provide linear_algebra.html)
(require SMathML "linear_algebra_utils.rkt")
(define linear_algebra.html
  (TmPrelude
   #:title "线性代数"
   #:css "styles.css"
   (H1 "线性代数")
   (H2 "第1章 线性方程")
   (H3 "第1.1节 域")
   (P "我们假定读者熟悉实数和复数的初等代数. 对于本书的很大一部分, 数字"
      "的代数性质可从以下所列加法和乘法的性质简单推导出来. 我们令"
      $F "代表实数集或复数集.")
   (Ol (Li "加法是交换的,"
           (MB (commute+ $x $y))
           "对于所有" $F "中的" $x "和" $y "成立.")
       (Li "加法是结合的,"
           (MB (assoc+ $x $y $z))
           "对于所有" $F "中的" $x ", " $y "和" $z "成立.")
       (Li $F "中存在唯一的元素" $0 " (零) 满足"
           (&= (&+ $x $0) $x) "对于每个" $F "中的" $x "成立.")
       (Li "对于每个" $F "中的" $x "存在唯一的" $F
           "中的元素" (@- $x) "满足" (&= (&+ $x (@- $x)) $0) "与之对应.")
       (Li "乘法是交换的,"
           (MB (commute* $x $y))
           "对于所有" $F "中的" $x "和" $y "成立.")
       (Li "乘法是结合的,"
           (MB (assoc* $x $y $z))
           "对于所有" $F "中的" $x ", " $y "和" $z "成立.")
       (Li $F "中存在唯一的非零元素" $1 " (幺) 满足"
           (&= (&i* $x $1) $x) "对于每个" $F "中的" $x "成立.")
       (Li "对于每个" $F "中非零的" $x "存在唯一的" $F
           "中的元素" (inv $x) " (或" (&/ $1 $x)
           ") 满足" (&= (&i* $x (inv $x)) $1) "与之对应.")
       (Li "乘法对于加法分配, 即" (disR $x $y $z)
           "对于所有" $F "中的" $x ", " $y "和" $z "成立."))
   (P "假定我们拥有一个包含对象" (&cm $x $y $z $..h) "的集合" $F
      "和如下两种" $F "上的运算. 第一种运算, 被称为加法, 联系每对"
      $F "中的" $x "和" $y "以" $F "中的元素" (@+ $x $y)
      ". 第二种运算, 被称为乘法, 联系每对" $F "中的" $x "和" $y "以" $F "中的元素"
      (&i* $x $y) ". 若是这两种运算满足如上从1到9的条件, 那么集合"
      $F "以及此两种运算被合称为一个域. 粗略说来, 一个域就是一个集合"
      "带有某些运算, 这些运算表现得就像通常的数字加减乘除一样, 在满足如上九条"
      "代数法则的意义下. 带有通常的加法和乘法运算, 复数集" $CC "是一个域, 实数集"
      $RR "也是一个域.")
   (P "对于本书的大部分内容而言, 我们使用的&quot;数字&quot;可以来源于任意的域. "
      "为了允许这种一般性, 我们将使用术语&quot;标量&quot;而不是&quot;数字&quot;. "
      "如果读者总是认为标量域是一个复数域的子域, 他也不会损失太多. 域" $CC
      "的一个子域是一个复数的集合" $F ", 其在通常的加法和乘法下自身就是一个域. "
      "这意味着" $0 "和" $1 "在" $F "之中, 并且如果" $x "和" $y "是" $F "的元素, 那么"
      (@+ $x $y) ", " (&- $x) ", " (&i* $x $y) "和" (inv $x)
      " (如果" (&!= $x $0) ") 也是" $F "的元素. "
      "[译注: 实际上这给出了子域的判则.] "
      "这样的子域的一个例子是实数域" $RR ", 因为如果我们把实数当作是虚部为"
      $0 "的复数, 复数域的" $0 "和" $1 "是实数, 并且如果"
      $x "和" $y "是实数, 那么" (@+ $x $y) ", " (&- $x) ", " (&i* $x $y) "和" (inv $x)
      " (如果" (&!= $x $0) ") 也是实数. 我们讨论子域的要义如下, "
      "若是我们处理来源于某个特定子域的标量, 那么施行加减乘除不会将我们带出"
      "给定的子域.")
   ((example #:n "1")
    "正整数" (&cm $1 $2 $3 $..h) "的集合不是一个" $CC "的子域, "
    "出于各种原因. 例如, " $0 "不是正整数, 没有正整数" $n "的加法逆元" (&- $n)
    "是正整数. 除了" $1 "之外, 没有正整数" $n "的乘法逆元" (&/ $1 $n) "是正整数.")
   ((example #:n "2")
    "整数" (&cm $..h $-2 $-1 $0 $1 $2 $..h) "的集合不是" $CC "的子域, 因为除了" $0 "和" $1
    ", 没有整数的乘法逆元是一个整数. 整数集在通常的加法和乘法下除了条件8其余都满足.")
   ((example #:n "3")
    "有理数集是复数域的子域. 整数集里并不可能的除法, 在有理数集里是可能的. "
    "有兴趣的读者应该验证一下每个复数域的子域都必须包含所有的有理数.")
   ((example #:n "4")
    "所有具有" (&+ $x (&i* $y (Msqrt $2))) "形式的数字构成的集合, 其中"
    $x "和" $y "是有理数, 是一个" $CC "的子域. "
    "我们将其留给读者进行验证.")
   (P "在本书的例子和练习中, 读者应该将其中的域当成是复数域的某个子域, 除非另有说明"
      "这个域更加一般. 我们不想对于该点多加讨论. 然而, 我们应该指出我们为什么采用"
      "这样的约定. 如果" $F "是一个域, 有限多个单位元" $1 "加起来"
      "有可能得到" $0 " (见第1.2节练习5):"
      (MB (&= (&+ $1 $1 $..c $1) $0))
      "复数域并不会发生这样的事情 (或者在任何复数域的子域). 如果在域" $F
      "中的确发生了这样的事情, 那么使得有限个" $1 "加起来等于" $0
      "所用的" $1 "的最少数目被称为域" $F "的特征. 若是没有这样的"
      "事情, (出于某种奇怪的原因) 我们就称域" $F "的特征为零. 经常的情况是, "
      "我们假定" $F "是" $CC "的子域是希望保证" $F
      "的特征为零. 不过, 在初次接触线性代数的时候, 通常最好还是别太担心关于"
      "域的特征的事情.")
   (H3 "第1.2节 线性方程组")
   (P "设" $F "是一个域. 我们考虑找出满足下列条件的" $n
      "个标量 (即" $F "的元素) " (&cm $x_1 $..h $x_n) "的问题."
      (MB
       (let ((A (lambda (i j) (mref $A i j))))
         (Choice
          ((&i* (A $1 $1) $x_1) $+ (&i* (A $1 $2) $x_2) $+ $..c $+ (&i* (A $1 $n) $x_n) $= $y_1)
          ((&i* (A $2 $1) $x_1) $+ (&i* (A $2 $2) $x_2) $+ $..c $+ (&i* (A $2 $n) $x_n) $= $y_2)
          ($..v $ $..v $ $ $ $..v $ $..v)
          ((&i* (A $m $1) $x_1) $+ (&i* (A $m $2) $x_2) $+ $..c $+ (&i* (A $m $n) $x_n) $= $y_m))))
      "其中" (&cm $y_1 $..h $y_m) "和" (&cm Aij (&<= $1 $i $m) (&<= $1 $j $n))
      "是给定的" $F "的元素. 我们称其为具" $m "个方程" $n "个未知元的线性方程组. 任何满足每个方程的由"
      $F "的元素构成的" $n "元组" (tu0 $x_1 $..h $x_n) "都被称为方程组的一个解. 如果" (&= $y_1 $..c $y_m $0)
      ", 我们称该方程组是齐次的, 或者说每个方程是齐次的.")
   (P "或许寻找线性方程组的解的最根本的技术就是消元法. 我们可以对于以下齐次方程组刻画这种方法."
      (MB (Choice ((&i* $2 $x_1) $- $x_2 $+ $x_3 $= $0)
                  ($x_1 $+ (&i* $3 $x_2) $+ (&i* $4 $x_3) $= $0)))
      "如果我们加" (@ $-2) "倍的第二个方程到第一个方程上去, 就得到了"
      (MB (&Table ((&i* $-7 $x_2) $- (&i* $7 $x_3) $= $0)))
      "或" (&= $x_2 (&- $x_3)) ". 如果加" $3 "倍的第一个方程到第二个方程上去, 就得到了"
      (MB (&Table ((&i* $7 $x_1) $+ (&i* $7 $x_3) $= $0)))
      "或" (&= $x_1 (&- $x_3)) ". 因此, 我们总结道, 如果" (tu0 $x_1 $x_2 $x_3) "是一个解, 那么"
      (&= $x_1 $x_2 (&- $x_3)) ". 反过来, 我们可以验证每个这样的三元组"
      "都是一个解, 于是解集就由所有的三元组" (tu0 (&- $a) (&- $a) $a) "构成.")
   (P "我们通过&quot;消去未知元&quot;找到了方程组的解, 也就是通过给方程乘上标量"
      "再加起来的方式产生有些" $x_j "不存在的方程. "
      "我们希望形式化这个过程一点, 以理解为什么这种方法有效, 并按照秩序井然的"
      "方式来施行解方程组所必要的计算.")
   (P "对于这样的一般性方程组, 假定我们挑选" $m "个标量" (&cm $c_1 $..h $c_m) ", 将第" $j "个方程乘上"
      $c_j "并将它们加起来, 我们就得到了方程"
      (let ((A (lambda (i j) (mref $A i j))))
        (MB (&= (LC0 (@LC0 $c_1 (A $1 $1) $c_m (A $m $1)) $x_1
                     (@LC0 $c_1 (A $1 $n) $c_m (A $m $n)) $x_n)
                (LC0 $c_1 $y_1 $c_m $y_m))))
      "这样的方程被我们称为该线性方程组的线性组合. 显然, 每个方程组的解也是这个新的方程的解. "
      "这就是消元过程的根本想法. 如果我们有了另外一个线性方程组"
      (MB
       (let ((B (lambda (i j) (mref $B i j))))
         (Choice
          ((&i* (B $1 $1) $x_1) $+ (&i* (B $1 $2) $x_2) $+ $..c $+ (&i* (B $1 $n) $x_n) $= $z_1)
          ((&i* (B $2 $1) $x_1) $+ (&i* (B $2 $2) $x_2) $+ $..c $+ (&i* (B $2 $n) $x_n) $= $z_2)
          ($..v $ $..v $ $ $ $..v $ $..v)
          ((&i* (B $k $1) $x_1) $+ (&i* (B $k $2) $x_2) $+ $..c $+ (&i* (B $k $n) $x_n) $= $z_k))))
      "其每个方程都是原本的线性方程组的方程的线性组合, 那么每个原本的线性方程组的解"
      "也是这个新的线性方程组的解. 当然, 新的方程组的解不一定是原本方程组的解. "
      "但要是原本方程组的每个方程都是新的线性方程组的方程的线性组合的话, 这种事情"
      "就不会发生. 我们称两个线性方程组是等价的, 如果它们的每个方程都能表示为另一个"
      "线性方程组的方程的线性组合.")
   ((theorem #:n "1") "等价的线性方程组拥有相同的解.")
   (P "欲使消元过程在线性方程组求解中发挥效用, 人们就必须找出产生更容易求解的"
      "等价线性方程组的手段. 接下来的一节, 我们将讨论其中一种方法.")
   ((exercise #:n "1")
    "验证例子4的集合是" $CC "的子域.")
   ((exercise #:n "2")
    "令" $F "是复数域. 下面两个线性方程组等价吗? 如果是, 就互相表示成线性组合."
    (MB (choice (list (list $x_1 $- $x_2 $= $0)
                      (list (&i* $2 $x_1) $+ $x_2 $= $0)))
        (Mspace #:attr* '((width "16ex")))
        (choice (list (list (&i* $3 $x_1) $+ $x_2 $= $0)
                      (list $x_1 $+ $x_2 $= $0)))))
   ((exercise #:n "3")
    "像练习2一样测试以下的线性方程组."
    (MB (choice
         (list
          (list (&- $x_1) $+ $x_2 $+ (&i* $4 $x_3) $= $0)
          (list $x_1 $+ (&i* $3 $x_2) $+ (&i* $8 $x_3) $= $0)
          (list (&i* $1/2 $x_1) $+ $x_2 $+ (&i* 5/2 $x_3) $= $0)))
        (&space 16)
        (choice
         (list
          (list $x_1 $ $ $- $x_3 $= $0)
          (list $ $ $x_2 $+ (&i* $3 $x_3) $= $0)))))
   ((exercise #:n "4")
    "像练习2一样测试以下的线性方程组."
    (MB
     (choice
      (list
       (list (&i* $2 $x_1) $+ (&i* (@ (&+ $-1 $i)) $x_2) $ $ $+ $x_4 $= $0)
       (list $ $ (&i* $3 $x_2) $- (&i* $2 $i $x_3) $+ (&i* $5 $x_4) $= $0)))
     (&space 8)
     (choice
      (list
       (list (&i* (@ (&+ $1 (~ $i $2))) $x_1) $+ (&i* $8 $x_2)
             $- (&i* $i $x_3) $- $x_4 $= $0)
       (list (&i* 2/3 $x_1) $- (&i* $1/2 $x_2)
             $+ $x_3 $+ (&i* $7 $x_4) $= $0)))))
   ((exercise #:n "5")
    "令" $F "是恰包含两个元素" $0 "和" $1 "的集合. "
    "由以下表格定义加法和乘法:"
    (MB (set-attr*
         (&table `((,$+ ,$0 ,$1)
                   (,$0 ,$0 ,$1)
                   (,$1 ,$1 ,$0)))
         'rowlines "solid" 'columnlines "solid")
        (&space 16)
        (set-attr*
         (&table `((,$d* ,$0 ,$1)
                   (,$0 ,$0 ,$0)
                   (,$1 ,$0 ,$1)))
         'rowlines "solid" 'columnlines "solid"))
    "验证集合" $F "带有这两种运算是一个域.")
   ((exercise #:n "6")
    "证明若两个具二未知元的线性方程组具有相同的解, 那么它们等价.")
   ((exercise #:n "7")
    "证明每个" $CC "的子域都包含所有的有理数.")
   ((exercise #:n "8")
    "证明每个特征为零的域都包含一个有理数域的复制.")
   (H3 "第1.3节 矩阵和初等行变换")
   (P "读者不可能没注意到, 在构造线性方程的线性组合时, 未知元"
      (&cm $x_1 $..h $x_n) "是没有必要写下来的, "
      "因为你实际上只是根据系数" Aij "和常元"
      $y_i "进行计算. 现在我们将线性方程组简写成"
      (MB AX=Y)
      "其中"
      (let ((A (lambda (i j) (mref $A i j))))
        (MB
         (&cm (&= $A (Mat ((A $1 $1) $..c (A $1 $n))
                          ($..v $ $..v)
                          ((A $m $1) $..c (A $m $n))))
              (&= $X (Mat ($x_1) ($..v) ($x_n)))
              (&= $Y (Mat ($y_1) ($..v) ($y_m)))
              )))
      "我们将" $A "称为系数矩阵. 严格说来, 上面显示的矩形阵列不是矩阵, 而是矩阵的表示. 一个域" $F "上的"
      m*n "矩阵是一个从序对" (&cm (tu0 $i $j) (&<= $1 $i $m) (&<= $1 $j $n))
      "的集合到域" $F "的函数. [译注: 或许读者会对于这句话感到迷惑, 这是因为中文将matrix翻译成矩阵.] "
      "矩阵" $A "的元素即标量" (&= (appl $A $i $j) Aij) ", 并且往往描述矩阵的最简单方式是将其元素写成如上"
      $m "行" $n "列的矩形阵列的形式. 因此, 上面的" $X "是 (或者说定义了) 一个" n*1 "的矩阵, 而" $Y "是一个" m*1
      "的矩阵. 暂时, " AX=Y "只是一种简记法. 之后, 我们将定义矩阵乘法, 那么它的意思就是" $Y "是" $A "和" $X "之积.")
   (P "我们现在希望考虑与构造线性方程的线性组合有关的矩阵" $A "的行上的操作. 我们将我们的注意力限制在域" $F "上的"
      m*n "矩阵" $A "的三种初等行变换上:"
      (Ol (Li "给矩阵" $A "的一行乘上一个非零的标量" $c ";")
          (Li "将" $A "的第" $r "行替换以第" $r "行加上" $c "乘上第" $s "行, 其中"
              $c "是任意的标量, 并且" (&!= $r $s) ";")
          (Li "交换" $A "的第" $r "行和第" $s "行."))
      "因此, 一个初等行变换是一个特别的函数" $e "联系每个" m*n "矩阵" $A "以一个" m*n "的矩阵"
      eA ". 我们可以精确地将三种" $e "刻画如下:"
      (Ol (Li (&= (mref eA $i $j) Aij) "如果" (&!= $i $r) ", "
              (&= (mref eA $r $j) (&i* $c (mref $A $r $j))) ".")
          (Li (&= (mref eA $i $j) Aij) "如果" (&!= $i $r) ", "
              (&= (mref eA $r $j)
                  (&+ (mref $A $r $j) (&i* $c (mref $A $s $j)))) ".")
          (Li (&= (mref eA $i $j) Aij)
              "如果" $i "异于" $r "和" $s ", "
              (&= (mref eA $r $j) (mref $A $s $j)) ", "
              (&= (mref eA $s $j) (mref $A $r $j)) "."))
      "在定义" eA "时, " $A "的列数并不重要, 但" $A "的行数是关键的. 例如, 我们不得不担心能否交换一个" (&c* $5 $5)
      "矩阵的第" $5 "行和第" $6 "行. 为了避免这种复杂性, 我们约定一个初等行变换" $e "定义在由所有域" $F "的" m*n
      "矩阵构成的类之上, 其中" $m "是固定的而" $n "是任意的. 换句话说, 一个特定的" $e "定义在由所有域" $F "上的"
      $m "行矩阵构成的类之上.")
   (P "之所以我们将我们自己限制于这三种简单的行变换上, 是因为既已施行这样的" $e
      "于" $A "之上后, 我们能够通过在" eA "上施行一个类似的操作来恢复" $A ".")
   ((theorem #:n "2")
    "对于每个初等行变换" $e ", 存在一个与之对应的具有相同类型的初等行变换"
    $e_1 "满足" (&= (app $e_1 eA) (app $e (app $e_1 $A)) $A) ". "
    "换言之, 初等行变换的逆变换存在, 并与之具有相同的类型. "
    "[译注: 显然不仅存在, 也是唯一的.]")
   ((proof)
    (Ol (Li "设" $e "是给第" $r "行乘上非零标量" $c "的变换, 令" $e_1
            "为给第" $r "行乘上" (inv $c) "的变换.")
        (Li "设" $e "是将第" $r "行替换以第" $r "行加上" $c "乘上第" $s "行的变换, 其中" (&!= $r $s)
            ", 令" $e_1 "为将第" $r "行替换以第" $r "行加上" (@- $c) "乘上第" $s "行的变换.")
        (Li "设" $e "是交换第" $r "行和第" $s "行的变换, 令" (&= $e_1 $e) "."))
    "每种情形之下, 显然有" (&= (app $e_1 (app $e $A)) (app $e (app $e_1 $A)) $A)
    "对于每个" $A "成立.")
   ((definition)
    "如果" $A "和" $B "是域" $F "上的" m*n "矩阵, 我们称" $B "行等价于" $A ", 如果" $B "可由" $A
    "通过 (有限的) 一系列初等行变换得到. [译注: 原则上包含0步, 尽管包不包含均不影响结果, "
    "因为本身初等行变换就包含恒等变换.]")
   (P "使用定理2, 容易验证以下事实. 每个矩阵都行等价于自身. 如果" $B "行等价于" $A ", 那么" $A
      "行等价于" $B ". 如果" $B "行等价于" $A "而" $C "行等价于" $B ", 那么" $C "行等价于" $A
      ". 换句话说, 行等价是等价关系 (见附录).")
   ((theorem #:n "3")
    "如果" $A "和" $B "是域" $F "上行等价的" m*n "矩阵, 那么齐次线性方程组" AX=0 "和"
    (&= (&i* $B $X) $0) "拥有相同的解.")
   ((proof)
    "设经过一系列变换我们从" $A "得到了" $B ":"
    (MB (&= $A (&-> $A_0 $A_1 $..c $A_k) $B) ".")
    "只需要证明线性方程组" (LE $A_j $X $0) "和" (LE (_ $A (&+ $j $1)) $X $0)
    "拥有相同的解就够了, 即一次初等行变换不改变解集." (Br)
    "因此, 设" $B "是由" $A "通过一次初等行变换得到的, 不论它是三种变换的哪一种, 线性方程组" (&= (&i* $B $X) $0)
    "的每个方程都是线性方程组" AX=0 "的方程的线性组合. 鉴于初等行变换的逆也是初等行变换, 每个线性方程组"
    AX=0 "的方程也是线性方程组" (&= (&i* $B $X) $0) "的方程的线性组合. 于是, 两个线性方程组是等价的. "
    "根据定理1, 它们拥有相同的解.")
   ((example #:n "5")
    "设" $F "是有理数域, 并且"
    (MB (&= $A (mat `((,$2 ,$-1 ,$3 ,$2)
                      (,$1 ,$4 ,$0 ,$-1)
                      (,$2 ,$6 ,$-1 ,$5))))
        ".")
    "我们将施行一系列初等行变换于" $A ", 并在箭头上标示出变换的类型."
    (MB (mat `((,$2 ,$-1 ,$3 ,$2)
               (,$1 ,$4 ,$0 ,$-1)
               (,$2 ,$6 ,$-1 ,$5)))
        (Mover $-> $2)
        (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$4 ,$0 ,$-1)
               (,$2 ,$6 ,$-1 ,$5)))
        (Mover $-> $2)
        (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$4 ,$0 ,$-1)
               (,$0 ,$-2 ,$-1 ,$7)))
        (Mover $-> $1))
    (MB (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$4 ,$0 ,$-1)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,(&- $9) ,$3 ,$4)
               (,$1 ,$0 ,$-2 ,13)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,$0 ,15/2 ,-55/2)
               (,$1 ,$0 ,$-2 ,13)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $1))
    (MB (mat `((,$0 ,$0 ,$1 ,-11/3)
               (,$1 ,$0 ,$-2 ,13)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,$0 ,$1 ,-11/3)
               (,$1 ,$0 ,$0 ,17/3)
               (,$0 ,$1 ,$1/2 ,-7/2)))
        (Mover $-> $2)
        (mat `((,$0 ,$0 ,$1 ,-11/3)
               (,$1 ,$0 ,$0 ,17/3)
               (,$0 ,$1 ,$0 ,(&- 5/3)))))
    "上面的一系列初等行变换告诉我们"
    (MB
     (choice
      (list
       (list (&i* $2 $x_1) $- $x_2 $+ (&i* $3 $x_3) $+ (&i* $2 $x_4) $= $0)
       (list $x_1 $+ (&i* $4 $x_2) $ $ $- $x_4 $= $0)
       (list (&i* $2 $x_1) $+ (&i* $6 $x_2) $- $x_3 $+ (&i* $5 $x_4) $= $0)
       )))
    "和"
    (MB
     (choice
      (list (list $ $ $ $ $x_3 $- (&i* 11/3 $x_4) $= $0)
            (list $x_1 $ $ $ $ $+ (&i* 17/3 $x_4) $= $0)
            (list $ $ $x_2 $ $ $- (&i* 5/3 $x_4) $= $0))))
    "拥有相同的解. 对于第二个线性方程组, 显然如果我们赋任意的有理数值"
    $c "给" $x_4 "就得到了一个解"
    (tu0 (&i* -17/3 $c)
         (&i* 5/3 $c)
         (&i* 11/3 $c)
         $c)
    ", 并且每个解都具有这样的形式.")
   ((example #:n "6")
    "设" $F "是复数域并且"
    (MB (&= $A (mat (list (list $-1 $i)
                          (list (&- $i) $3)
                          (list $1 $2)))))
    "施行行变换的时候通常把几个类型2的变换组合起来是方便的. 把这点记在心中,"
    (MB (mat (list (list $-1 $i)
                   (list (&- $i) $3)
                   (list $1 $2)))
        (Mover $-> $2)
        (mat (list (list $0 (&+ $2 $i))
                   (list $0 (&+ $3 (&i* $2 $i)))
                   (list $1 $2)))
        (Mover $-> $1)
        (mat (list (list $0 $1)
                   (list $0 (&+ $3 (&i* $2 $i)))
                   (list $1 $2)))
        (Mover $-> $2)
        (mat (list (list $0 $1)
                   (list $0 $0)
                   (list $1 $0))))
    "因此线性方程组"
    (MB
     (choice
      (list
       (list (&- $x_1) $+ (&i* $i $x_2) $= $0)
       (list (&i* (&- $i) $x_1) $+ (&i* $3 $x_2) $= $0)
       (list $x_1 $+ (&i* $2 $x_2) $= $0))))
    "只有平凡解" (&= $x_1 $x_2 $0) ".")
   (P "例子5和例子6里我们显然不是在随意施行行变换. 我们对于行变换的选择是由"
      "想要像消去未知元解线性方程组一样化简系数矩阵的欲望驱使的. 现在让我们"
      "给出一个形式化的定义, 对于我们想要抵达什么类型的矩阵.")
   ((definition)
    "一个" m*n "矩阵" $R "被称为行简化的, 如果"
    (Ol #:attr* '((type "a"))
        (Li "每个" $R "的非零行的第一个非零元素是" $1 ";")
        (Li "每个包含首非零元的列, 其余的元素均为" $0 ".")))
   ((example #:n "7")
    "一个行简化矩阵的例子是" n*n "的恒等矩阵" $I ". "
    "这是由"
    (MB
     (&= (_ $I (&cm $i $j)) δij
         (choice
          (list
           (list $1 (: $cm "如果" (&= $i $j)))
           (list $0 (: $cm "如果" (&!= $i $j)))))))
    "定义的矩阵. 目前是我们第一次使用Kronecker delta, 之后也将经常用到.")
   (P "例子5和例子6最终呈现的矩阵都是行简化矩阵. 以下是两个不是行简化矩阵的例子:"
      (MB (mat (list (list $1 $0 $0 $0)
                     (list $0 $1 $-1 $0)
                     (list $0 $0 $1 $0)))
          (&space 16)
          (mat (list (list $0 $2 $1)
                     (list $1 $0 $-3)
                     (list $0 $0 $0))))
      "第二个矩阵没有满足条件a, 因为第一行的首非零元不是" $1 ". "
      "第一个矩阵满足了条件a, 但是第三列没有满足条件b.")
   (P "现在我们将证明我们可以从任意的矩阵出发, 通过有限数目的初等行变换, "
      "得到一个行简化矩阵. 结合定理3, 这给我们提供了一个解决线性方程组的"
      "有效工具.")
   ((theorem #:n "4")
    "每个域" $F "上的" m*n "矩阵都行等价于一个"
    "行简化矩阵.")
   ((proof)
    "令" $A "是一个域" $F "上的" m*n "矩阵. 如果" $A "的第一行的每个元素都是" $0 ", 那么只考虑第一行"
    "条件a就是成立的. 如果第一行有非零的元素, 令" $k "是满足" (&!= (_ $A (&cm $1 $j)) $0) "的正整数"
    $j "中最小的. 给第一行乘上" (_^ $A (&cm $1 $k) $-1) ", 那么第一行就满足条件a了. "
    "现在对于每个" (&>= $i $2) ", 将第一行乘上" (@- (mref $A $i $k)) "加到第" $i "行. 现在第一行的"
    "首非零元出现在第" $k "列, 其值为" $1 ", 并且第" $k "列的每个其他元素都是" $0 "." (Br)
    "现在考虑上面得到的矩阵. 如果第二行的每个元素都是" $0 ", 我们就什么也不做. "
    "如果第二行有异于零的元素, 就给第二行乘上一个标量使其首非零元为" $1 ". "
    "在第一行首非零元位于第" $k "列的情况下, 第二行的首非零元不可能出现在第"
    $k "列, 设其出现在第" $k^ "列. 通过给第二行乘上合适的标量"
    "加到其他行上去, 就能使得第" $k^ "列除了第二行之外都是" $0 ". "
    "重要的是注意到以下这点, 在施行这些操作的时候, 我们不会改变第一行处于第"
    (&cm $1 $..h $k) "列的元素, 也不会改变第" $k "列的元素. "
    "当然, 如果第一行全是零, 那么这些操作就不会影响第一行." (Br)
    "以如上方式逐行操作, 显然在有限步内我们能够抵达一个行简化矩阵.")
   ((exercise #:n "1")
    "找出下列线性方程组的所有解."
    (MB
     (choice
      (list (list (&i* (@- $1 $i) $x_1) $- (&i* $i $x_2) $= $0)
            (list (&i* $2 $x_1) $+ (&i* (@- $1 $i) $x_2) $= $0)))))
   ((exercise #:n "2")
    "如果"
    (MB (&= $A (Mat ($3 $-1 $2)
                    ($2 $1 $1)
                    ($1 $-3 $0))))
    "通过行简化" $A "以找出" AX=0
    "的所有解.")
   ((exercise #:n "3")
    "如果"
    (MB (&= $A (mat (list (list $6 $-4 $0)
                          (list $4 $-2 $0)
                          (list $-1 $0 $3)))))
    "找出" (&= (&i* $A $X) (&i* $2 $X)) "和"
    (&= (&i* $A $X) (&i* $3 $X)) "的解. "
    "(符号" (&i* $c $X) "表示一个矩阵, 其每个元素都是"
    $c "乘上相对应的" $X "的元素.)")
   ((exercise #:n "4")
    "找出一个与下列矩阵行等价的行简化矩阵."
    (MB (&= $A (mat (list (list $i (&- (@+ $1 $i)) $0)
                          (list $1 $-2 $1)
                          (list $1 (&i* $2 $i) $-1))))))
   ((exercise #:n "5")
    "证明下列两个矩阵不是行等价的."
    (MB (mat (list (list $2 $0 $0)
                   (list $a $-1 $0)
                   (list $b $c $3)))
        (Mspace #:attr* '((width "16ex")))
        (mat (list (list $1 $1 $2)
                   (list $-2 $0 $-1)
                   (list $1 $3 $5)))))
   ((exercise #:n "6")
    "令"
    (MB (&= $A (mat (list (list $a $b)
                          (list $c $d)))))
    "是一个复数域上的" 2*2 "矩阵. 设" $A
    "是行简化的, 并且" (&= (&+ $a $b $c $d) $0) ". "
    "证明恰存在三个这样的矩阵.")
   ((exercise #:n "7")
    "证明交换矩阵两行的操作可由其他两种操作达成.")
   ((exercise #:n "8")
    "考虑线性方程组" AX=0 ", 其中"
    (MB (&= $A (mat (list (list $a $b)
                          (list $c $d)))))
    "是一个域" $F "上的" 2*2 "矩阵. "
    "[译注: 意即线性方程组就是域" $F "上的.] "
    "证明以下陈述."
    (Ol #:attr* '((type "a"))
        (Li "如果" $A "的每个元素都是" $0 ", 那么"
            "每个序对" (tu0 $x_1 $x_2) "都是"
            AX=0 "的解.")
        (Li "如果" (&!= (&- (&i* $a $d) (&i* $b $c)) $0)
            ", 那么线性方程组" AX=0
            "仅有平凡解" (&= $x_1 $x_2 $0) ".")
        (Li "如果" (&= (&- (&i* $a $d) (&i* $b $c)) $0)
            "并且某个" $A "的元素异于" $0 ", 那么"
            "存在一个解" (tu0 (_^ $x $1 $0) (_^ $x $2 $0))
            "满足, " (tu0 $x_1 $x_2) "是一个解当且仅当"
            "存在标量" $y "满足"
            (&cm (&= $x_1 (&i* $y (_^ $x $1 $0)))
                 (&= $x_2 (&i* $y (_^ $x $2 $0))))
            ".")))
   (H3 "第1.4节 行简化阶梯矩阵")
   (P "到目前为止, 我们对于线性方程组的处理是由找出方程组的解的尝试"
      "推动的. 在第1.3节, 我们建立了找出这些解的一种标准化技术. "
      "现在我们希望获得一些稍微理论一点的信息, 出于这样的目的, "
      "走得比行简化矩阵更远一点是方便的.")
   ((definition)
    "一个" m*n "的矩阵" $R "被称为一个行简化阶梯矩阵, 如果"
    (Ol #:attr* '((type "a"))
        (Li $R "是行简化的;")
        (Li $R "的每个元素全为" $0
            "的行在具有非零元素的行的下方;")
        (Li "如果第" (&cm $1 $..h $r) "行是" $R
            "的非零行, 并且如果第" $i "行的首非零元出现在第"
            $k_i "列, " (&= $i (&cm $1 $..h $r))
            ", 那么" (&< $k_1 $k_2 $..c $k_r) ".")))
   (P "人们也可以按照以下方式刻画" m*n "的行简化阶梯矩阵" $R ". "
      "要么" $R "的每个元素都是" $0 ", 要么存在一个正整数"
      (&cm $r (&<= $1 $r $m)) ", 以及" $r "个正整数"
      (&cm (&cm $k_1 $..h $k_r) (&<= $1 $k_i $n)) "满足"
      (Ol #:attr* '((type "a"))
          (Li "对于" (&> $i $r) ", " (&= (mref $R $i $j) $0)
              ", 并且" (&= (mref $R $i $j) $0) "如果"
              (&< $j $k_i) ".")
          (Li (&cm (&= (mref $R $i $k_j) δij)
                   (&<= $1 $i $r) (&<= $1 $j $r)) ".")
          (Li (&< $k_1 $..c $k_r) ".")))
   ((example #:n "8")
    "两个行简化阶梯矩阵的例子分别是" n*n "的恒等矩阵和"
    m*n "的零矩阵" (^ $0 (&cm $m $n)) ", 其每个元素都是零. "
    "当然读者构造出其他例子也没有困难, 不过这里我们给出一个非平凡的例子."
    (MB (mat (list (list $0 $1 $-3 $0 $1/2)
                   (list $0 $0 $0 $1 $2)
                   (list $0 $0 $0 $0 $0)))))
   ((theorem #:n "5")
    "每个" m*n "的矩阵" $A "都行等价于一个行简化阶梯矩阵.")
   ((proof)
    "我们知道" $A "行等价于一个行简化矩阵, 所有我们需要做的只是观察到"
    "通过有限次的行交换我们可以将行简化矩阵变成行简化阶梯矩阵.")
   (P "在例子5和例子6中我们看到了在求解齐次线性方程组时行简化矩阵的重要性. "
      "现在让我们来简要讨论方程组" RX=0 ", 其中" $R
      "是一个行简化阶梯矩阵. 令第" (&cm $1 $..h $r) "行是" $R
      "的非零行, 并设第" $i "行的首非零元出现在第" $k_i "列. "
      "于是, 方程组" RX=0 "包含" $r "个非平凡方程. "
      "并且, 未知元" (_ $x $k_i) "仅会出现在第" $i "行. "
      "如果我们用" (&cm $u_1 $..h (_ $u (&- $n $r))) "代表异于"
      (&cm (_ $x $k_1) $..h (_ $x $k_r)) "的" (@- $n $r)
      "个未知元, 那么" RX=0 "的" $r "个非平凡方程"
      "具有如下的形式."
      (MB (choice
           (list
            (list (_ $x $k_1) $+
                  (sum (&= $j $1) (&- $n $r)
                       (&i* (mref $C $1 $j) $u_j))
                  $= $0)
            (list $ $..v $ $ $..v)
            (list (_ $x $k_r) $+
                  (sum (&= $j $1) (&- $n $r)
                       (&i* (mref $C $r $j) $u_j))
                  $= $0))))
      "线性方程组" RX=0 "的所有解都可以由给"
      (&cm $u_1 $..h (_ $u (&- $n $r))) "赋任意的值然后计算"
      "相对应的" (&cm (_ $x $k_1) $..h (_ $x $k_r))
      "的值获得. 例如, 如果" $R "是例子8展示的那个矩阵, 那么"
      (&cm (&= $r $2) (&= $k_1 $2) (&= $k_2 $4))
      ", 并且" RX=0 "的两个非平凡方程是"
      (MB (choice
           (list
            (list $x_2 $- (&i* $3 $x_3) $ $ $+ (&i* $1/2 $x_5) $= $0)
            (list $ $ $ $ $x_4 $+ (&i* $2 $x_5) $= $0)))
          "或者写成"
          (choice
           (list
            (list $x_2 $= (&- (&i* $3 $x_3) (&i* $1/2 $x_5)))
            (list $x_4 $= (&i* $-2 $x_5)))))
      "于是我们可以给" $x_1 ", " $x_3 "和" $x_5
      "赋任意的值, 比如" (&cm (&= $x_1 $a) (&= $x_3 $b) (&= $x_5 $c))
      ", 然后就得到了解"
      (tu0 $a (&- (&i* $3 $b) (&i* $1/2 $c)) $b
           (&i* $-2 $c) $c) ".")
   (P "让我们再观察到与线性方程组" RX=0 "有关的另一个事实. "
      "如果" $R "的非零行数" (Math $r) "小于" $n ", 那么方程组"
      RX=0 "具有一个非平凡的解, 即一个解" (tu0 $x_1 $..h $x_n) ", 其中"
      "不是每个" $x_j "都是" $0 ". 这是因为, 既然" (&< $r $n)
      ", 我们可以挑选一个" $x_j ", 其异于"
      (&cm (_ $x $k_1) $..h (_ $x $k_r)) ", 那么我们可以按照如上方式"
      "构造出一个解, 其中令" (&= $x_j $1) ". 这个观察将我们引导至"
      "和齐次线性方程组有关的最根本性的事实之一.")
   ((theorem #:n "6")
    "如果" $A "是一个" m*n "的矩阵并且" (&< $m $n) ", 那么齐次线性方程组" AX=0 "具有非平凡解.")
   ((proof)
    "令" $R "是一个行等价于" $A "的行简化阶梯矩阵, 那么根据定理3, 方程组" AX=0 "和" RX=0 "具有相同的解. 令"
    $r "是" $R "的非零行数, 那么肯定" (&<= $r $m) ". 既然" (&< $m $n) ", 就有"
    (&< $r $n) ". 立刻从我们以上的观察中就得知" AX=0 "具有非平凡解.")
   ((theorem #:n "7")
    "如果" $A "是一个" n*n "的矩阵, 那么" $A "行等价于" n*n "的恒等矩阵当且仅当线性方程组" AX=0 "仅有平凡解.")
   ((proof)
    "如果" $A "行等价于" $I ", 那么" AX=0 "和" (LE $I $X $0) "具有相同的解. 反过来, 设" AX=0
    "仅有平凡解" (&= $X $0) ". 令" $R "是一个与" $A "行等价的" n*n "的行简化阶梯矩阵, 并令" $r "是" $R
    "的非零行数. 既然" RX=0 "没有非平凡的解, 那么" (&>= $r $n) ". 又因为" $R "只有" $n "行, 所以当然"
    (&<= $r $n) ", 于是" (&= $r $n) ". 这意味着" $R "的每一行都具有首非零元" $1
    ", 而且因为它们分布于不同的" $n "列里, " $R "只可能是"
    n*n "的恒等矩阵.")
   (P "现在让我们来探究如何使用初等行变换求解非齐次的线性方程组" AX=Y ". "
      "首先, 读者应该注意到它与齐次情形的一个基本区别, 即尽管齐次线性方程组总有"
      "平凡的解" (&= $x_1 $..c $x_n $0) ", 非齐次的情况压根不一定有解.")
   (P "我们来构造线性方程组" AX=Y "的增广矩阵" $A^ ". 这是一个" (&c* $m (@+ $n $1)) "的矩阵, 其中前" $n "列是"
      $A "的列, 最后一列是" $Y ". 更精确地,"
      (MB (&cm (: (&= (_^ $A (&cm $i $j) $prime) Aij) "如果" (&<= $j $n))
               (&= (_^ $A (&cm $i (&+ $n $1)) $prime) $y_i))
          ".")
      "设我们施行了一系列初等行变换于" $A ", 得到了一个行简化阶梯矩阵"
      $R ". 如果我们施行相同的初等行变换于" $A^ ", 就会得到一个矩阵" $R^ ", 其前" $n "列是" $R "的列, "
      "而最后一列包含特定的标量" (&cm $z_1 $..h $z_m) ". 标量" $z_i "是" m*1 "矩阵"
      (MB (&= $Z (Mat ($z_1) ($..v) ($z_m))))
      "的元素, 它是由施行相同的初等行变换于" $Y "得到的. 显然读者应该认识到, 正如定理3的证明一样, 线性方程组"
      AX=Y "和" RX=Z "是等价的, 因而拥有相同的解. 很容易确定" RX=Z "是否有解"
      "并在有解的情况下确定所有的解. 这是因为, 如果" $R "具有" $r "个非零行, "
      "并且其第" $i "行的首非零元出现在第" $k_i "列, 其中" (&= $i (&cm $1 $..h $r)) ", 那么" RX=Z "的前"
      $r "行有效地表达了" (&cm (_ $x $k_1) $..h (_ $x $k_r)) ", 基于"
      (@- $n $r) "个剩余的" $x_j "和标量" (&cm $z_1 $..h $z_r) ". 最后的" (@- $m $r) "个方程是"
      (MB (&table (list (list $0 $= (_ $z (&+ $r $1)))
                        (list $..v $ $..v)
                        (list $0 $= $z_m))))
      "据此, 方程组拥有解的条件是" (&> $i $r) "时" (&= $z_i $0) ". "
      "如果这个条件被满足, 所有线性方程组的解就可以像齐次的情况一样被找到, 即给"
      (@- $n $r) "个" $x_j "赋任意的值, 然后根据第" $i "个方程计算" (_ $x $k_i) "的值.")
   ((example #:n "9")
    "令" $F "是有理数域, 并且"
    (MB (&= $A (mat (list (list $1 $-2 $1)
                          (list $2 $1 $1)
                          (list $0 $5 $-1)))))
    "设我们希望求解线性方程组" AX=Y ", 对于某些" $y_1 ", " $y_2 "和" $y_3 ". 让我们将行规约"
    $A "的一系列初等行变换施行于" $A^ "之上:"
    (MB (mat (list (list $1 $-2 $1 $y_1)
                   (list $2 $1 $1 $y_2)
                   (list $0 $5 $-1 $y_3)))
        (Mover $-> $2)
        (mat (list (list $1 $-2 $1 $y_1)
                   (list $0 $5 $-1 (@ (&- $y_2 (&i* $2 $y_1))))
                   (list $0 $5 $-1 $y_3)))
        (Mover $-> $2)
        (mat (list (list $1 $-2 $1 $y_1)
                   (list $0 $5 $-1 (@ (&- $y_2 (&i* $2 $y_1))))
                   (list $0 $0 $0 (@ (&+ (&- $y_3 $y_2) (&i* $2 $y_1))))))
        (Mover $-> $1))
    (MB (mat (list (list $1 $-2 $1 $y_1)
                   (list $0 $1 -1/5
                         (&i* 1/5 (@ (&- $y_2 (&i* $2 $y_1)))))
                   (list $0 $0 $0 (@ (&+ (&- $y_3 $y_2) (&i* $2 $y_1))))))
        (Mover $-> $2)
        (mat (list (list $1 $0 3/5
                         (&i* 1/5 (@ (&+ $y_1 (&i* $2 $y_2)))))
                   (list $0 $1 -1/5
                         (&i* 1/5 (@ (&- $y_2 (&i* $2 $y_1)))))
                   (list $0 $0 $0 (@ (&+ (&- $y_3 $y_2) (&i* $2 $y_1)))))))
    "那么线性方程组" AX=Y "有解的条件就是"
    (MB (&= (&+ (&- (&i* $2 $y_1) $y_2) $y_3) $0))
    "并且如果给定的标量" $y_i "满足这个条件, 所有的解都可以由以下方式获得, 赋一个值" $c "给" $x_3 ", 然后计算"
    (MB (&table
         (list
          (list $x_1 $= (LC -3/5 $c 1/5 (@+ $y_1 (&i* $2 $y_2))))
          (list $x_2 $= (LC 1/5 $c 1/5 (@- $y_2 (&i* $2 $y_1))))))))
   (P "让我们再做关于线性方程组" AX=Y "的最后一个观察. 设矩阵" $A "的元素和标量" (&cm $y_1 $..h $y_m)
      "恰好落入域" $F "的一个子域" $F_1 "中. 如果线性方程组" AX=Y "拥有在域" $F "中的解, 那么它也拥有在域"
      $F_1 "中的解, 因为不论对于哪一个域而言, 线性方程组有解的条件都是域" $F_1 "中" (&cm $y_1 $..h $y_m)
      "之间的特定关系成立 (也就是上面的关系" (&= $z_i $0) "对于" (&> $i $r) "成立). 举个例子, 如果"
      AX=Y "是一个线性方程组, 其标量" $y_k "和" Aij "都是实数, 若其有复数的解, 那么它也有实数的解.")
   ((exercise #:n "1")
    "通过行规约系数矩阵来找出下列线性方程组的所有解."
    (MB (Choice
         ((&i* $1/3 $x_1) $+ (&i* $2 $x_2) $- (&i* $6 $x_3) $= $0)
         ((&i* $-4 $x_1) $ $ $+ (&i* $5 $x_3) $= $0)
         ((&i* $-3 $x_1) $+ (&i* $6 $x_2) $- (&i* 13 $x_3) $= $0)
         ((&i* -7/3 $x_1) $+ (&i* $2 $x_2) $- (&i* 8/3 $x_3) $= $0))))
   ((exercise #:n "2")
    "找出与下列矩阵行等价的一个行简化阶梯矩阵."
    (MB (&= $A (mat (list (list $1 (&- $i))
                          (list $2 $2)
                          (list $i (&+ $1 $i))))))
    AX=0 "的解是什么?")
   ((exercise #:n "3")
    "显式描述所有" 2*2 "的行简化阶梯矩阵.")
   ((exercise #:n "4")
    "考虑以下线性方程组."
    (MB (choice
         (list
          (list $x_1 $- $x_2 $+ (&i* $2 $x_3) $= $1)
          (list (&i* $2 $x_1) $ $ $+ (&i* $2 $x_3) $= $1)
          (list $x_1 $- (&i* $3 $x_2) $+ (&i* $4 $x_3) $= $2))))
    "这个方程组有解吗? 如果有的话, 显式描述所有的解.")
   ((exercise #:n "5")
    "给出一个无解的具有两个方程和两个未知元的线性方程组的例子.")
   ((exercise #:n "6")
    "证明线性方程组"
    (MB (choice
         (list
          (list $x_1 $- (&i* $2 $x_2) $+ $x_3 $+ (&i* $2 $x_4) $= $1)
          (list $x_1 $+ $x_2 $- $x_3 $+ $x_4 $= $2)
          (list $x_1 $+ (&i* $7 $x_2) $- (&i* $5 $x_3) $- $x_4 $= $3))))
    "没有解.")
   ((exercise #:n "7")
    "找出下列线性方程组的所有解."
    (MB
     (choice
      (list
       (list (&i* $2 $x_1) $- (&i* $3 $x_2) $- (&i* $7 $x_3) $+
             (&i* $5 $x_4) $+ (&i* $2 $x_5) $= $-2)
       (list $x_1 $- (&i* $2 $x_2) $- (&i* $4 $x_3) $+
             (&i* $3 $x_4) $+ $x_5 $= $-2)
       (list (&i* $2 $x_1) $ $ $- (&i* $4 $x_3) $+
             (&i* $2 $x_4) $+ $x_5 $= $3)
       (list $x_1 $- (&i* $5 $x_2) $- (&i* $7 $x_3) $+
             (&i* $6 $x_4) $+ (&i* $2 $x_5) $= $-7)))))
   ((exercise #:n "8")
    "令"
    (MB (&= $A (mat (list (list $3 $-1 $2)
                          (list $2 $1 $1)
                          (list $1 $-3 $0)))))
    "对于什么样的三元组" (tu0 $y_1 $y_2 $y_3) "线性方程组"
    AX=Y "有解?")
   ((exercise #:n "9")
    "令"
    (MB (&= $A (mat (list (list $3 $-6 $2 $-1)
                          (list $-2 $4 $1 $3)
                          (list $0 $0 $1 $1)
                          (list $1 $-2 $1 $0)))))
    "对于什么样的四元组" (tu0 $y_1 $y_2 $y_3 $y_4) "线性方程组" AX=Y "有解?")
   ((exercise #:n "10")
    "设" $R "和" $R^ "是" (&c* $2 $3) "的行简化阶梯矩阵并且线性方程组" RX=0 "和" (LE $R^ $X $0)
    "具有相同的解, 证明" (&= $R $R^) ".")
   (H3 "第1.5节 矩阵乘法")
   (P "显然构造矩阵的行的线性组合的过程是一种根本性的运算. 出于这样的理由, 引入指示何种"
      "操作将被施行的系统记号是很有好处的. 更细致地说, 设" $B "是域" $F "上的"
      n*p "矩阵, 其行分别为" (&cm $beta_1 $..h $beta_n) ". 从" $B "我们构造出" $C ", 其行分别为"
      (&cm $gamma_1 $..h $gamma_m) "而"
      (MB (&= $gamma_i (LC0 (mref $A $i $1) $beta_1 (mref $A $i $2) $beta_2 (mref $A $i $n) $beta_n)) ".")
      $C "的行是由" (&i* $m $n) "个标量" Aij "决定的, 而它们本身是一个" m*n "矩阵" $A "的元素. 将"
      $gamma_i "展开来看,"
      (MB (&= (tu0 (_ $C (&cm $i $1)) $..h (_ $C (&cm $i $p)))
              (sum (&= $r $1) $n
                   (tu0 (&i* (mref $A $i $r) (mref $B $r $1))
                        $..h
                        (&i* (mref $A $i $r) (mref $B $r $p))))))
      "我们发现" $C "的元素由"
      (MB (&= (_ $C (&cm $i $j))
              (sum (&= $r $1) $n
                   (&i* (mref $A $i $r) (mref $B $r $j)))))
      "给出.")
   ((definition)
    "令" $A "是一个域" $F "上的" m*n "矩阵, 令" $B "是一个域" $F "上的"
    n*p "矩阵. 积" AB "是一个" (&c* $m $p) "矩阵" $C
    ", 其第" $i "行" $j "列的元素为"
    (MB (&= (mref $C $i $j)
            (sum (&= $r $1) $n
                 (&i* (mref $A $i $r) (mref $B $r $j))))
        "."))
   ((example #:n "10")
    "这里给出一些有理数域上的矩阵之积."
    (Ol #:attr* '((type "a"))
        (Li (MB (&= (mat (list (list $5 $-1 $2)
                               (list $0 $7 $2)))
                    (&i* (mat (list (list $1 $0)
                                    (list $-3 $1)))
                         (mat (list
                               (list $5 $-1 $2)
                               (list 15 $4 $8))))))
            "其中"
            (MB (&table
                 (list
                  (list $gamma_1 $= (tu0 $5 $-1 $2)
                        $= (&d* $1 (tu0 $5 $-1 $2)) $+
                        (&d* $0 (tu0 15 $4 $8)))
                  (list $gamma_2 $= (tu0 $0 $7 $2)
                        $= (&i* $-3 (tu0 $5 $-1 $2)) $+
                        (&d* $1 (tu0 15 $4 $8)))))))
        (Li (MB (&= (mat (list
                          (list $0 $6 $1)
                          (list $9 12 $-8)
                          (list 12 62 $-3)
                          (list $3 $8 $-2)))
                    (&i* (mat
                          (list
                           (list $1 $0)
                           (list $-2 $3)
                           (list $5 $4)
                           (list $0 $1)))
                         (mat
                          (list
                           (list $0 $6 $1)
                           (list $3 $8 $-2))))))
            "其中"
            (MB (&table
                 (list
                  (list $gamma_2 $= (tu0 $9 12 $-8)
                        $= (&+ (&i* $-2 (tu0 $0 $6 $1))
                               (&i* $3 (tu0 $3 $8 $-2))))
                  (list $gamma_3 $= (tu0 12 62 $-3)
                        $= (&+ (&i* $5 (tu0 $0 $6 $1))
                               (&i* $4 (tu0 $3 $8 $-2))))))))
        (Li (MB (&= (Mat ($8) (29))
                    (&i* (mat (list (list $2 $1)
                                    (list $5 $4)))
                         (mat (list (list $1)
                                    (list $6)))))))
        (Li (MB (&= (mat (list (list $-2 $-4)
                               (list $6 12)))
                    (&i* (mat (list (list $-1)
                                    (list $3)))
                         (mat (list (list $2 $4))))))
            "其中"
            (MB (&= $gamma_2 (tu0 $6 12)
                    (&i* $3 (tu0 $2 $4)))))
        (Li (MB (&= (&i* (mat (list (list $2 $4)))
                         (mat (list (list $-1)
                                    (list $3))))
                    (mat (list (list $10))))))
        (Li (MB (&= (&i* (mat (list (list $0 $1 $0)
                                    (list $0 $0 $0)
                                    (list $0 $0 $0)))
                         (mat (list (list $1 (&- $5) $2)
                                    (list $2 $3 $4)
                                    (list $9 $-1 $3))))
                    (mat (list (list $2 $3 $4)
                               (list $0 $0 $0)
                               (list $0 $0 $0))))))
        (Li (MB (&= (&i* (mat (list (list $1 (&- $5) $2)
                                    (list $2 $3 $4)
                                    (list $9 $-1 $3)))
                         (mat (list (list $0 $1 $0)
                                    (list $0 $0 $0)
                                    (list $0 $0 $0))))
                    (mat (list (list $0 $1 $0)
                               (list $0 $2 $0)
                               (list $0 $9 $0))))))))
   (P "注意到两个矩阵之积不必有定义是重要的. 积有定义当且仅当第一个矩阵的列数与"
      "第二个矩阵的行数相合. 因此, 交换以上a, b, c中因子的顺序是没有意义的. "
      "往往我们写下如" AB "一样的积时并不显式提及因子的尺寸, 在这种情况下, "
      "应该理解为积是有定义的. 从d, e, f, g中我们发现, 即便" AB "和"
      (&i* $B $A) "都有定义, 也不一定有" (&= AB (&i* $B $A)) ". "
      "换句话说, 矩阵乘法不是交换的.")
   ((example #:n "11")
    (Ol #:attr* '((type "a"))
        (Li "如果" $I "是" m*m "的恒等矩阵, 而" $A "是一个" m*n "的矩阵, 那么"
            (&= (&i* $I $A) $A) ".")
        (Li "如果" $I "是" n*n "的恒等矩阵, 而" $A "是一个" m*n "的矩阵, 那么"
            (&= (&i* $A $I) $A) ".")
        (Li "如果" (^ $0 (&cm $k $m)) "是" (&c* $k $m) "的零矩阵, 那么"
            (&= (^ $0 (&cm $k $n)) (&i* (^ $0 (&cm $k $m)) $A)) ". 类似地, "
            (&= (&i* $A (^ $0 (&cm $n $p))) (^ $0 (&cm $m $p))) ".")))
   ((example #:n "12")
    "令" $A "是域" $F "上的一个" m*n "矩阵. 我们之前对于线性方程组的简记法" AX=Y
    "和我们对于矩阵乘法的定义是一致的, 因为如果"
    (MB (&= $X (mat (map list (list $x_1 $x_2 $..v $x_n)))))
    "其中" $x_i "在" $F "中, 那么" (&i* $A $X) "是" m*1 "矩阵"
    (MB (&= $Y (mat (map list (list $y_1 $y_2 $..v $y_m)))))
    "满足" (&= $y_i (LC0 (mref $A $i $1) $x_1 (mref $A $i $2) $x_2 (mref $A $i $n) $x_n)) ".")
   (P "列矩阵的使用提示了一种往往有用的记号. 如果" $B "是一个" n*p "的矩阵, 那么"
      $B "的列是" n*1 "矩阵" (&cm $B_1 $..h $B_p) ", 由"
      (MB (&cm (&= $B_j (Mat ((mref $B $1 $j)) ($..v) ((mref $B $n $j)))) (&<= $1 $j $p)))
      "定义. 矩阵" $B "是由这些列相继构成的:"
      (MB (&= $B (li0 $B_1 $..h $B_p)))
      "积矩阵" AB "的第" $i "行" $j "列元素是由" $A "的第" $i "行和" $B
      "的第" $j "列构造出来的. 读者应该验证" AB "的第" $j "列就是"
      (&i* $A $B_j) ":"
      (MB (&= AB (li0 (&i* $A $B_1) $..h (&i* $A $B_p)))))
   (P "尽管矩阵之积依赖于因子的顺序, 但是它独立于结合的方式, 这正是下一个定理表明的.")
   ((theorem #:n "8")
    "如果" $A ", " $B ", " $C "是域" $F "上的矩阵, 满足乘积" (&i* $B $C) "和"
    (&i* $A (@ (&i* $B $C))) "有定义, 那么乘积" AB "和"
    (&i* @AB $C) "也有定义, 并且"
    (MB (&= (&i* $A (@ (&i* $B $C))) (&i* @AB $C))))
   ((proof)
    "设" $B "是一个" n*p "矩阵. 既然" (&i* $B $C) "是有定义的, 那么" $C "就是一个有"
    $p "行的矩阵, 而" (&i* $B $C) "有" $n "行. 因为" (&i* $A (@ (&i* $B $C)))
    "是有定义的, 我们可以假定" $A "是一个" m*n "矩阵. 因此, 积" AB
    "存在, 是一个" (&c* $m $p) "矩阵, 从中又可以知道"
    (&i* @AB $C) "存在. 为了证明"
    (&= (&i* $A (@ (&i* $B $C))) (&i* @AB $C))
    "其实也就是要证明"
    (MB (&= (_ (bra0 (&i* $A (@ (&i* $B $C)))) (&cm $i $j))
            (_ (bra0 (&i* @AB $C)) (&cm $i $j))))
    "对于每个" $i "和" $j "成立. 根据定义,"
    (MB (deriv (_ (bra0 (&i* $A (@ (&i* $B $C)))) (&cm $i $j))
               (sum $r $
                    (&i* (mref $A $i $r)
                         (_ (@ (&i* $B $C)) (&cm $r $j))))
               (sum $r $
                    (&i* (mref $A $i $r)
                         (sum $s $
                              (&i* (mref $B $r $s)
                                   (mref $C $s $j)))))
               (sum $r $
                    (sum $s $
                         (&i* (mref $A $i $r)
                              (mref $B $r $s)
                              (mref $C $s $j))))
               (sum $s $
                    (sum $r $
                         (&i* (mref $A $i $r)
                              (mref $B $r $s)
                              (mref $C $s $j))))
               (sum $s $
                    (&i* (@ (sum $r $
                                 (&i* (mref $A $i $r)
                                      (mref $B $r $s))))
                         (mref $C $s $j)))
               (sum $s $
                    (&i* (_ @AB (&cm $i $s))
                         (mref $C $s $j)))
               (_ (bra0 (&i* @AB $C)) (&cm $i $j)))))
   (P "当" $A "是一个" n*n "矩阵时, 积" (&i* $A $A) "是有定义的. "
      "我们用" $A^2 "表示这个矩阵. 根据定理8, "
      (&= (&i* (@ (&i* $A $A)) $A) (&i* $A (@ (&i* $A $A)))) "或者说"
      (&= (&i* $A^2 $A) (&i* $A $A^2)) ", 于是积" (&i* $A $A $A)
      "是良定的. 我们用" $A^3 "表示这个积. 一般地, 积"
      (&i* $A $A $..c $A) " (" $k "次) 是良定的, 我们将其记作" $A^k ".")
   (P "注意到" (assoc* $A $B $C) "可以推出" $C "的行的线性组合的线性组合也是" $C "的行的线性组合.")
   (P "如果" $B "是一个给定的矩阵而" $C "是由" $B "通过一次初等行变换得到的, 那么"
      $C "的每一行都是" $B "的行的线性组合, 因此存在一个矩阵" $A "满足"
      (&= AB $C) ". 一般而言, 这样的" $A "不止一个, 而从诸多这样的矩阵中"
      "挑选出一个具有许多特别性质的矩阵是可能的也是方便的. 在讨论这个之前我们需要"
      "先引入一类矩阵.")
   ((definition)
    "一个" m*m "矩阵被称为是一个初等矩阵, 如果它是可由" m*m
    "的恒等矩阵通过一次初等行变换得到.")
   ((example #:n "13")
    "一个" 2*2 "的初等矩阵只可能是以下几种之一:"
    (MB (&cm (Mat ($0 $1)
                  ($1 $0))
             (Mat ($1 $c)
                  ($0 $1))
             (Mat ($1 $0)
                  ($c $1))))
    (MB (&cm (Mat ($c $0)
                  ($0 $1))
             (&!= $c $0)
             (Mat ($1 $0)
                  ($0 $c))
             (&!= $c $0))))
   ((theorem #:n "9")
    "令" $e "是一个初等行变换, 令" m*m "矩阵" (&= $E (app $e $I)) ". "
    "那么, 对于每一个" m*n "矩阵" $A ","
    (MB (&= eA (&i* $E $A))))
   ((proof)
    "证明的要点在于积矩阵" (&i* $E $A) "第" $i "行" $j "列的元素是由" $E
    "的第" $i "行和" $A "的第" $j "列得到的. 三种初等行变换应该分开看待. "
    "我们将给出对于类型2的变换的详细证明. 其他两种情况更加简单, 留给读者作为练习. "
    "设" (&!= $r $s) "而" $e "是将第" $r "行替换为第" $r "行加上" $c "乘上第" $s
    "行的变换, 那么"
    (MB (&= (_ $E (&cm $i $k))
            (Choice
             ((_ $delta (&cm $i $k)) (: $cm (&!= $i $r)))
             ((&+ (_ $delta (&cm $r $k))
                  (&i* $c (_ $delta (&cm $s $k))))
              (: $cm (&= $i $r))))))
    "因此,"
    (MB (&= (mref (@i* $E $A) $i $j)
            (sum (&= $k $1) $m
                 (&i* (mref $E $i $k)
                      (mref $A $k $j)))
            (Choice
             (Aij (: $cm (&!= $i $r)))
             ((&+ (mref $A $r $j)
                  (&i* $c (mref $A $s $j)))
              (: $cm (&= $i $r))))))
    "换句话说, " (&= (&i* $E $A) eA) ".")
   ((corollary)
    "令" $A "和" $B "是域" $F "上的" m*n "矩阵, 那么" $B "行等价于" $A "当且仅当"
    (&= $B (&i* $P $A)) ", 其中" $P "是一系列" m*m "的初等矩阵之积.")
   ((proof)
    "设" (&= $B (&i* $P $A)) ", 其中" (&= $P (&i* $E_s $..c $E_2 $E_1)) "而"
    $E_i "是" m*m "的初等矩阵, 那么" (&i* $E_1 $A) "行等价于" $A ", 并且"
    (&i* $E_2 (@ (&i* $E_1 $A))) "行等价于" (&i* $E_1 $A) ", 于是" (&i* $E_2 $E_1 $A)
    "行等价于" $A ". 如法炮制我们可以看到" (&i* (@i* $E_s $..c $E_1) $A)
    "行等价于" $A "." (Br)
    "现在设" $B "行等价于" $A ". 令" (&cm $E_1 $E_2 $..h $E_s) "为与将" $A
    "变为" $B "的一系列初等行变换相对应的初等矩阵, 那么"
    (&= $B (&i* (@i* $E_s $..c $E_1) $A)) ".")
   ((exercise #:n "1")
    "令"
    (MB (&cm (&= $A (Mat ($2 $-1 $1)
                         ($1 $2 $1)))
             (&= $B (Mat ($3)
                         ($1)
                         ($-1)))
             (&= $C (Mat ($1 $-1)))))
    "计算" (&i* $A $B $C) "和" (&i* $C $A $B) ".")
   ((exercise #:n "2")
    "令"
    (MB (&cm (&= $A (Mat ($1 $-1 $1)
                         ($2 $0 $1)
                         ($3 $0 $1)))
             (&= $B (Mat ($2 $-2)
                         ($1 $3)
                         ($4 $4)))))
    "验证" (&= (&i* $A @AB) (&i* $A^2 $B)) ".")
   ((exercise #:n "3")
    "找出两个不同的" 2*2 "矩阵" $A "满足" (&= $A^2 $0) "但是" (&!= $A $0) ".")
   ((exercise #:n "4")
    "对于练习2的矩阵" $A ", 找出初等矩阵" (&cm $E_1 $E_2 $..h (_ $E $k)) "满足"
    (MB (&= (&i* (_ $E $k) $..c $E_2 $E_1 $A) $I)))
   ((exercise #:n "5")
    "令"
    (MB (&cm (&= $A (Mat ($1 $-1)
                         ($2 $2)
                         ($1 $0)))
             (&= $B (Mat ($3 $1)
                         ($-4 $4)))))
    "存在矩阵" $C "满足" (LE $C $A $B) "吗?")
   ((exercise #:n "6")
    "令" $A "是一个" m*n "矩阵而" $B "是一个" (&c* $n $k) "矩阵. 证明"
    (&= $C AB) "的列是" $A "的列的线性组合, 并且如果"
    alpha_1..n "是" $A "的列, 而"
    (&cm $gamma_1 $..h $gamma_k) "是" $C "的列, 那么"
    (MB (&= $gamma_j
            (sum (&= $r $1) $n
                 (&i* (mref $B $r $j) $alpha_r)))))
   ((exercise #:n "7")
    "令" $A "和" $B "是" 2*2 "的矩阵满足" (LE $A $B $I) ", 证明"
    (LE $B $A $I) ".")
   ((exercise #:n "8")
    "令"
    (MB (&= $C (Mat ((_ $C (&cm $1 $1)) (_ $C (&cm $1 $2)))
                    ((_ $C (&cm $2 $1)) (_ $C (&cm $2 $2))))))
    "是一个" 2*2 "的矩阵. 我们想问什么情况下有可能找到两个"
    2*2 "的矩阵" $A "和" $B "满足"
    (&= $C (&- AB (&i* $B $A))) ". 证明这样的矩阵可以被找到当且仅当"
    (&= (&+ (_ $C (&cm $1 $1)) (_ $C (&cm $2 $2))) $0) ".")
   (H3 "第1.6节 可逆矩阵")
   (P "设" m*m "矩阵" $P "是初等矩阵之积. 对于每个" m*n "矩阵" $A ", 矩阵"
      (&= $B (&i* $P $A)) "行等价于" $A ", 因此" $A "行等价于" $B ", 存在一个初等矩阵之积"
      $Q "满足" (&= $A (&i* $Q $B)) ". 特别地, 当" $A "是" m*m "的恒等矩阵时"
      "亦成立. 换言之, 存在一个" m*m "矩阵" $Q ", 其自身是初等矩阵之积, 满足"
      (LE $Q $P $I) ". 正如我们将看到的, 存在" $Q "满足" (LE $Q $P $I) "等价于"
      $P "是初等矩阵之积.")
   ((definition)
    "令" $A "是域" $F "上的一个" n*n "矩阵. 一个" n*n "矩阵" $B "若是满足"
    (LE $B $A $I) ", 则被称为" $A "的一个左逆. 一个" n*n "矩阵" $B "若是满足"
    (LE $A $B $I) ", 则被称为" $A "的一个右逆. 如果" (&= AB (&i* $B $A) $I)
    ", 则" $B "被称为" $A "的双端逆, 而" $A "被称为可逆的.")
   ((lemma)
    "如果" $A "有一个左逆" $B "和一个右逆" $C ", 那么" (&= $B $C) ".")
   ((proof)
    "设" (LE $B $A $I) "且" (LE $A $C $I) ", 那么"
    (MB (&= $B (&i* $B $I) (&i* $B (@ (&i* $A $C)))
            (&i* (@ (&i* $B $A)) $C) (&i* $I $C) $C)))
   (P "因此, 如果" $A "有一个左逆和一个右逆, " $A "就是可逆的, 并且拥有一个唯一的双端逆, "
      "我们将其表示为" (^ $A $-1) "并简单地称其为" $A "的逆.")
   ((theorem #:n "10")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵."
    (Ol #:attr* '((type "i"))
        (Li "如果" $A "可逆, 那么" (inv $A) "也可逆, 并且"
            (&= (inv (@ (inv $A))) $A) ".")
        (Li "如果" $A "和" $B "都可逆, 那么" AB "也可逆, 并且"
            (&= (inv @AB) (&i* (inv $B) (inv $A))) ".")))
   ((proof)
    "第一条陈述从定义的对称性来看是显然的. 第二条陈述由验证以下关系自然得到."
    (MB (&= (&i* @AB (@ (&i* (inv $B) (inv $A))))
            (&i* (@ (&i* (inv $B) (inv $A))) @AB)
            $I)))
   ((corollary)
    "一系列可逆矩阵之积是可逆的.")
   ((theorem #:n "11")
    "初等矩阵是可逆的. [译注: 并且逆也是初等矩阵.]")
   ((proof)
    "令" $E "是与初等行变换" $e "相对应的初等矩阵. 如果" $e_1 "是" $e "的逆变换 (见定理2) "
    "而" (&= $E_1 (app $e_1 $I)) ", 那么有"
    (MB (&= (&i* $E $E_1) (app $e $E_1) (app $e (app $e_1 $I)) $I))
    "和"
    (MB (&= (&i* $E_1 $E) (app $e_1 $E) (app $e_1 (app $e $I)) $I))
    "于是" $E "是可逆的且" (&= $E_1 (inv $E)) ".")
   ((example #:n "14")
    (Ol #:attr* '((type "a"))
        (Li (MB (&= (inv (Mat ($0 $1)
                              ($1 $0)))
                    (Mat ($0 $1)
                         ($1 $0)))))
        (Li (MB (&= (inv (Mat ($1 $c)
                              ($0 $1)))
                    (Mat ($1 (&- $c))
                         ($0 $1)))))
        (Li (MB (&= (inv (Mat ($1 $0)
                              ($c $1)))
                    (Mat ($1 $0)
                         ((&- $c) $1)))))
        (Li "当" (&!= $c $0) ","
            (MB (&= (inv (Mat ($c $0)
                              ($0 $1)))
                    (Mat ((inv $c) $0)
                         ($0 $1)))
                "且"
                (&= (inv (Mat ($1 $0)
                              ($0 $c)))
                    (Mat ($1 $0)
                         ($0 (inv $c))))))))
   ((theorem #:n "12")
    "如果" $A "是一个" n*n "的矩阵, 那么以下命题等价."
    (Ol #:attr* '((type "i"))
        (Li $A "可逆.")
        (Li $A "行等价于" n*n "的恒等矩阵.")
        (Li $A "是一系列初等矩阵之积.")))
   ((proof)
    "令" $R "是行等价于" $A "的一个行简化阶梯矩阵. 根据定理9 (或其推论),"
    (MB (&= $R (&i* (_ $E $k) $..c $E_2 $E_1 $A)))
    "其中" (&cm $E_1 $..h (_ $E $k)) "是初等矩阵. 每个" $E_j "都是可逆的, 于是"
    (MB (&= $A (&i* (_^ $E $1 $-1) $..c (_^ $E $k $-1) $R)))
    "既然可逆矩阵之积是可逆的, 我们看到" $A "可逆当且仅当" $R "可逆. 因为" $R
    "是一个 (方的) 行简化阶梯矩阵, " $R "可逆当且仅当" $R "的每一行都包含非零元, 即"
    "当且仅当" (&= $R $I) ". 现在我们已经证明了" $A "可逆当且仅当" (&= $R $I) ", "
    "并且如果" (&= $R $I) ", 那么" (&= $A (&i* (_^ $E $1 $-1) $..c (_^ $E $k $-1)))
    ". 现在i, ii, iii是关于" $A "的等价陈述应该是显然的了.")
   ((corollary)
    "如果" $A "是一个" n*n "的可逆矩阵, 并且一系列初等行变换将" $A "规约为" $I ", "
    "那么相同的初等行变换应用于" $I "就得到" (inv $A) ".")
   ((corollary)
    "令" $A "和" $B "是" m*n "的矩阵, 那么" $B "行等价于" $A "当且仅当"
    (&= $B (&i* $P $A)) ", 其中" $P "是一个" m*m "的可逆矩阵.")
   ((theorem #:n "13")
    "对于" n*n "矩阵" $A ", 以下命题等价."
    (Ol #:attr* '((type "i"))
        (Li $A "可逆.")
        (Li "齐次线性方程组" AX=0 "仅有平凡解.")
        (Li "线性方程组" AX=Y "对于每个" n*1 "的" $Y "都有一个解" $X ".")))
   ((proof)
    "根据定理7, 条件ii等价于" $A "行等价于恒等矩阵. 根据定理12, i和ii因此是等价的. "
    "如果" $A "可逆, " AX=Y "的解是" (&= $X (&i* (inv $A) $Y)) ". "
    "反过来, 设" AX=Y "对于每个给定的" $Y "都有一个解. 令" $R "是行等价于" $A
    "的一个行简化阶梯矩阵. 我们想要证明" (&= $R $I) ". 这只需要证明" $R
    "的最后一行不都是零即可. 令"
    (MB (&= $E (Mat ($0) ($0) ($..v) ($0) ($1))))
    "若" (LE $R $X $E) "有解, 那么" $R "的最后一行就不可能都是零. "
    "我们知道" (&= $R (&i* $P $A)) ", 其中" $P "可逆, 因而" (LE $R $X $E) "和"
    (LE $A $X (&i* (inv $P) $E)) "拥有相同的解. 根据条件iii, 后一个线性方程组有解, 故"
    $A "可逆.")
   ((corollary)
    "一个有左逆或右逆的方阵是可逆的.")
   ((proof)
    "令" $A "是一个" n*n "矩阵. 设" $A "有一个左逆, 即一个矩阵" $B "满足"
    (LE $B $A $I) ", 那么" AX=0 "仅有平凡解, 因为"
    (&= $X (&i* $I $X) (&i* $B (@ (&i* $A $X)))) ", 故" $A "可逆. "
    "另一方面, 设" $A "有一个右逆, 即一个矩阵" $C "满足" (LE $A $C $I) ", 那么"
    $C "有一个左逆, 故是可逆的, 于是就有" (&= $A (inv $C)) ", 那么" $A "可逆, 其逆为"
    $C ".")
   ((corollary)
    "令" (&= $A (&i* $A_1 $A_2 $..c $A_k)) ", 其中" (&cm $A_1 $..h $A_k)
    "是" n*n "的方阵, 那么" $A "可逆当且仅当每个" $A_j "可逆.")
   ((proof)
    "我们已经证明了两个可逆矩阵之积是可逆的, 从中读者可以简单地看出来若是每个" $A_j
    "可逆, 则" $A "可逆. [译注: 实际上之前有一个推论陈述了这个事实.]" (Br)
    "现在设" $A "可逆. 我们先来证明" $A_k "是可逆的. 设" $X "是一个" n*1
    "的矩阵并且" (LE $A_k $X $0) ", 那么"
    (&= (&i* $A $X) (&i* (@ (&i* $A_1 $..c (_ $A (&- $k $1)))) $A_k $X) $0)
    ". 既然" $A "是可逆的, 那么" $X "就必须是" $0 ". 因此, " (LE $A_k $X $0)
    "没有非平凡的解, 于是" $A_k "可逆. 现在, "
    (&= (&i* $A_1 $..c (_ $A (&- $k $1))) (&i* $A (_^ $A $k $-1)))
    "也是可逆的了. 施行前述论证, 可知" (_ $A (&- $k $1)) "是可逆的. "
    "续行此法, 可得每个" $A_j "都是可逆的.")
   (P "我们想要作出关于求解线性方程组的最后一个注记. 设" $A "是一个" m*n "的矩阵, 并且"
      "我们想要求解线性方程组" AX=Y ". 如果" $R "是行等价于" $A "的一个行简化阶梯矩阵, "
      "那么" (&= $R (&i* $P $A)) ", 其中" $P "是一个" m*m "的可逆矩阵. "
      "方程组" AX=Y "的解恰好就和" (: (LE $R $X (&i* $P $Y)) (@ $= $Z)) "相同. "
      "在实践中, 找到矩阵" $P "并不比行规约" $A "至" $R "困难. "
      "这是因为, 设我们构造了方程组" AX=Y "的增广矩阵" $A^ ", 其最后一行是任意的标量"
      (&cm $y_1 $..h $y_m) ", 然后我们施行将" $A "变为" $R "的初等行变换于"
      (&prime $A) ", 那么矩阵" $P "是什么就很清楚了. (读者应该参考例子9, 那里我们基本上"
      "执行了这套过程.) [译注: 这段话并不十分清楚, 但实际上它的意思就是将"
      (&cm $y_1 $..h $y_m) "当作符号带入计算.] "
      "特别地, 如果" $A "是一个方阵, 那么这个过程将会表明" $A "是否可逆, "
      "以及若可逆, 逆" $P "是什么. 既然我们已经给出这样的计算的一个例子的核心了, 那么现在"
      "我们举一个" 2*2 "的例子就心满意足了.")
   ((example #:n "15")
    "设" $F "是有理数域, 而"
    (MB (&= $A (Mat ($2 $-1)
                    ($1 $3))))
    "那么"
    (MB (deriv0 (Mat ($2 $-1 $y_1)
                     ($1 $3 $y_2))
                (Mover $-> $3)
                (Mat ($1 $3 $y_2)
                     ($2 $-1 $y_1))
                (Mover $-> $2)
                (Mat ($1 $3 $y_2)
                     ($0 $-7 (&- $y_1 (&i* $2 $y_2))))
                (Mover $-> $1)
                (Mat ($1 $3 $y_2)
                     ($0 $1 (&i* 1/7 (@ (&- (&i* $2 $y_2) $y_1)))))
                (Mover $-> $2)
                (Mat ($1 $0 (&i* 1/7 (@ (&+ $y_2 (&i* $3 $y_1)))))
                     ($0 $1 (&i* 1/7 (@ (&- (&i* $2 $y_2) $y_1)))))
                ))
    "从中可以清楚地看出来" $A "可逆, 并且"
    (MB (&= (inv $A) (Mat (3/7 1/7)
                          (-1/7 2/7)))))
   (P "或许看上去一直把任意的标量" (&cm $y_1 $y_2 $..h) "写下来太过繁琐. "
      "有的人觉得同时操作两列矩阵不那么尴尬一点, 一列描述了从" $A "到恒等矩阵的规约过程, "
      "另一列记录了相同的操作对于恒等矩阵的影响. "
      "读者或许应该自行决定哪一种对于他而言是更加利落的簿记格式.")
   ((example #:n "16")
    "让我们找出"
    (MB (&= $A (Mat ($1 $1/2 $1/3)
                    ($1/2 $1/3 1/4)
                    ($1/3 1/4 1/5))))
    "的逆."
    (MB (&Table
         ((Mat ($1 $1/2 $1/3)
               ($1/2 $1/3 1/4)
               ($1/3 1/4 1/5))
          (Mat ($1 $0 $0)
               ($0 $1 $0)
               ($0 $0 $1)))
         ((Mat ($1 $1/2 $1/3)
               ($0 1/12 1/12)
               ($0 1/12 4/45))
          (Mat ($1 $0 $0)
               (-1/2 $1 $0)
               ((&- $1/3) $0 $1)))
         ((Mat ($1 $1/2 $1/3)
               ($0 1/12 1/12)
               ($0 $0 1/180))
          (Mat ($1 $0 $0)
               (-1/2 $1 $0)
               (1/6 $-1 $1)))
         ((Mat ($1 $1/2 $1/3)
               ($0 $1 $1)
               ($0 $0 $1))
          (Mat ($1 $0 $0)
               ((&- $6) 12 $0)
               (30 -180 180)))
         ((Mat ($1 $1/2 $0)
               ($0 $1 $0)
               ($0 $0 $1))
          (Mat ((&- $9) 60 -60)
               (-36 192 -180)
               (30 -180 180)))
         ((Mat ($1 $0 $0)
               ($0 $1 $0)
               ($0 $0 $1))
          (Mat ($9 -36 30)
               (-36 192 -180)
               (30 -180 180))))))
   (P "读者肯定想过我们详细地讨论了矩阵的行但很少涉及列. "
      "我们专注于行是因为从线性方程的角度来看这似乎更加自然. "
      "既然行没有什么神圣的地方, 后几节的讨论当然本可用列来展开而不是行. "
      "如果有人仿照初等行变换和行等价定义了初等列变换和列等价, 那么显然每个"
      m*n "的矩阵都列等价于一个&quot;列简化阶梯&quot;矩阵. "
      "另外, 每个初等列变换将拥有" (&\|-> $A (&i* $A $E))
      "的形式, 其中" $E "是一个" n*n "的初等矩阵. 诸如此类, 留给读者自行思考.")
   ((exercise #:n "1")
    "令"
    (MB (&= $A (Mat ($1 $2 $1 $0)
                    ($-1 $0 $3 $5)
                    ($1 $-2 $1 $1))))
    "找出一个行等价于" $A "的行简化阶梯矩阵" $R "以及一个可逆的" (&c* $3 $3)
    "矩阵" $P "满足" (&= $R (&i* $P $A)) ".")
   ((exercise #:n "2")
    "做练习1, 但是"
    (MB (&= $A (Mat ($2 $0 $i)
                    ($1 $-3 (&- $i))
                    ($i $1 $1)))))
   ((exercise #:n "3")
    "对于以下两个矩阵的每一个"
    (MB (&cm (Mat ($2 $5 $-1)
                  ($4 $-1 $2)
                  ($6 $4 $1))
             (Mat ($1 $-1 $2)
                  ($3 $2 $4)
                  ($0 $1 $-2))))
    "使用初等行变换来判断其是否可逆, 并且在可逆的情况下找出其逆.")
   ((exercise #:n "4")
    "令"
    (MB (&= $A (Mat ($5 $0 $0)
                    ($1 $5 $0)
                    ($0 $1 $5))))
    "对于什么样的" $X "存在标量" $c "满足" (LE $A $X (&i* $c $X)) "?")
   ((exercise #:n "5")
    "判断"
    (MB (&= $A (Mat ($1 $2 $3 $4)
                    ($0 $2 $3 $4)
                    ($0 $0 $3 $4)
                    ($0 $0 $0 $4))))
    "是否可逆, 并且在" (inv $A) "存在的情况下找到它.")
   ((exercise #:n "6")
    "设" $A "是一个" (&c* $2 $1) "矩阵而" $B "是一个" (&c* $1 $2) "矩阵, "
    "证明" (&= $C AB) "不可逆.")
   ((exercise #:n "7")
    "令" $A "是一个" n*n "的方阵. 证明以下两个陈述:"
    (Ol #:attr* '((type "a"))
        (Li "如果" $A "可逆而对于某个" n*n "的矩阵" $B "有" (LE $A $B $0)
            ", 那么" (&= $B $0) ".")
        (Li "如果" $A "不可逆, 那么存在一个" n*n "的矩阵" $B "满足"
            (LE $A $B $0) "但是" (&!= $B $0) ".")))
   ((exercise #:n "8")
    "令"
    (MB (&= $A (Mat ($a $b)
                    ($c $d))))
    "使用初等行变换证明, " $A "可逆当且仅当"
    (&!= (@ (&- (&i* $a $d) (&i* $b $c))) $0) ".")
   ((exercise #:n "9")
    "一个" n*n "矩阵" $A "被称为是上三角的, 如果" (&> $i $j) "时"
    (&= Aij $0) ", 即主对角线以下的元素均为零. "
    "证明一个上三角矩阵可逆当且仅当其每个主对角线上的元素均不为零.")
   ((exercise #:n "10")
    "证明以下练习6的一般化版本. 若" $A "是一个" m*n "矩阵而" $B "是一个"
    (&c* $n $m) "矩阵, 并且" (&< $n $m) ", 那么" AB "不可逆.")
   ((exercise #:n "11")
    "令" $A "是一个" m*n "矩阵. 证明通过一系列初等行变换和初等列变换可以从"
    $A "得到一个矩阵" $R ", 其既是行简化阶梯矩阵, 也是列简化阶梯矩阵. 也就是说, 如果"
    (&!= $i $j) ", 那么" (&= (mref $R $i $j) $0) "; 如果" (&<= $1 $i $r) ", 那么"
    (&= (mref $R $i $i) $1) "; 如果" (&> $i $r) ", 那么"
    (&= (mref $R $i $i) $0) ". 证明" (&= $R (&i* $P $A $Q)) ", 其中" $P
    "是一个" m*m "的可逆矩阵, 而" $Q "是一个" n*n "的可逆矩阵.")
   ((exercise #:n "12")
    "例子16的结果暗示或许矩阵"
    (MB (&= $A (Mat ($1 $1/2 $..c (~ $1 $n))
                    ($1/2 $1/3 $..c (~ $1 (&+ $n $1)))
                    ($..v $..v $ $..v)
                    ((~ $1 $n) (~ $1 (&+ $n $1)) $..c (~ $1 (&- (&i* $2 $n) $1))))))
    "可逆并且" (inv $A) "的元素都是整数. 你能证明吗?")
   (H2 "第2章 向量空间")
   (H3 "第2.1节 向量空间")
   (P "在数学的许多部分中, 人们经常会遇到这样的集合, 其中处理对象的线性组合是有趣的. "
      "例如, 我们发现在对于线性方程的研究中, 考虑矩阵的行的线性组合是相当自然的. "
      "很有可能读者学过微积分, 那里处理函数的线性组合, 特别是学习微分方程的时候. "
      "或许读者有些与三维Euclid空间打交道的经历, 特别是处理其中向量的线性组合.")
   (P "不严格地说, 线性代数是这样的数学分支, 它讨论其中线性组合是有意义的代数系统的共同性质. "
      "本节我们将定义一种数学对象, 经验表明它是此类代数系统最有用的抽象.")
   ((definition)
    "一个向量空间 (或者说线性空间) 包含以下资料:"
    (Ol (Li "一个标量域" $F ";")
        (Li "一个对象的集合" $V ", 这些对象被称为向量;")
        (Li "一个法则 (或者说运算), 被称为向量加法, 联系每对" $V
            "中向量" $alpha "和" $beta "以一个" $V
            "中向量" (&+ $alpha $beta) ", 其被称为" $alpha "和" $beta
            "之和, 并且该运算满足"
            (Ol #:attr* '((type "a"))
                (Li "加法是交换的, " (commute+ $alpha $beta) ";")
                (Li "加法是结合的, " (assoc+ $alpha $beta $gamma) ";")
                (Li $V "中存在唯一的向量" $0 ", 被称为零向量, 满足"
                    (&= (&+ $alpha $0) $alpha) "对于" $V "中所有向量"
                    $alpha "成立;")
                (Li "对于每个" $V "中向量" $alpha ", 存在唯一的"
                    $V "中向量" (&- $alpha) "满足"
                    (&= (&+ $alpha (@- $alpha)) $0) ";")))
        (Li "一种法则 (或者说运算), 被称为标量乘法, 联系每个" $F
            "中标量" $c "和" $V "中向量" $alpha
            "以一个" $V "中向量" (&i* $c $alpha) ", 其被称为"
            $c "和" $alpha "之积, 并且该运算满足"
            (Ol #:attr* '((type "a"))
                (Li (&= (&i* $1 $alpha) $alpha) "对于每个"
                    $V "中的" $alpha "成立;")
                (Li (assoc* $c_1 $c_2 $alpha) ";")
                (Li (disR $c $alpha $beta) ";")
                (Li (disL $c_1 $c_2 $alpha) ".")))))
   (P "注意到, 正如定义所言, 一个向量空间是一个复合对象, 包含一个域, "
      "一集&quot;向量&quot;, 和两个带有特别性质的运算. 相同的向量集合可能是其他不同向量空间的"
      "组成部分 (见以下的例子5). 当没有歧义的时候, 我们就简单地以" $V "引用这个向量空间, 或者"
      "当我们想要刻画域的时候, 我们就说" $V "是一个域" $F "上的向量空间. &quot;向量&quot;"
      "这个名字应用于集合" $V "的元素很大程度上只是为了方便起见. 这个名字的由来可以从以下的"
      "例子1中找到, 但读者不应该给这个名字附加太多的重要性, 因为作为向量出现的各种对象可能"
      "与读者对于向量预先赋予的概念并无类似之处. 我们将在下面的一连串例子中尽力传达这点. "
      "随着我们开始研究向量空间, 例子也会丰富起来.")
   ((example #:n "1")
    (B $n "元组空间, " $F^n ".") " 令" $F "是任意的域, 令" $V "是所有" $n "元组"
    (&= $alpha (tu0 $x_1 $x_2 $..h $x_n)) "构成的集合, 其中" $x_i "是" $F
    "中的标量. 如果" (&= $beta (tu0 $y_1 $y_2 $..h $y_n)) ", 其中" $y_i "是" $F
    "中的标量, 那么" $alpha "和" $beta "的和由"
    (MB (&= (&+ $alpha $beta)
            (tu0 (&+ $x_1 $y_1) (&+ $x_2 $y_2) $..h (&+ $x_n $y_n))))
    "定义. 标量" $c "和向量" $alpha "的积由"
    (MB (&= (&i* $c $alpha) (tu0 (&i* $c $x_1) (&i* $c $x_2) $..h (&i* $c $x_n))))
    "定义. 这向量加法和标量乘法满足条件3和4是容易验证的, 运用" $F "的元素的加法和乘法"
    "的类似性质即可.")
   ((example #:n "2")
    (B m*n "矩阵的空间, " (^ $F m*n) ".") " 令" $F "是任意的域, 并令" $m "和"
    $n "是正整数. 令" (^ $F m*n) "是域" $F "上所有" m*n "矩阵构成的集合. "
    (^ $F m*n) "中的两个向量" $A "和" $B "的和由"
    (MB (&= (_ (@ (&+ $A $B)) (&cm $i $j))
            (&+ Aij
                (mref $B $i $j))))
    "定义. 标量" $c "和矩阵" $A "的积由"
    (MB (&= (_ (@ (&i* $c $A)) (&cm $i $j)) (&i* $c Aij)))
    "定义. 注意到" (&= (^ $F (&c* $1 $n)) $F^n) ". "
    "[译注: 在同构的意义上.]")
   ((example #:n "3")
    (B "从一个集合到一个域的函数的空间.") " 令" $F "是任意的域, 令" $S "是一个非空集合. "
    "令" $V "是所有从集合" $S "到域" $F "的函数构成的集合. " $V "中两个向量" $f "和" $g
    "之和是向量" (&+ $f $g) ", 即一个从" $S "到" $F "的函数, 由"
    (MB (&= (app (@ (&+ $f $g)) $s) (&+ (app $f $s) (app $g $s))))
    "定义. 标量" $c "和函数" $f "的积是函数" (&i* $c $f) ", 由"
    (MB (&= (app (@ (&i* $c $f)) $s) (&i* $c (app $f $s))))
    "定义. 前述例子不过就是这个的特殊情形. 对于" $F "的元素的" $n "元组而言, 其或可被视为"
    "从整数" (&cm $1 $..h $n) "的集合" $S "到" $F "的一个函数. 类似地, 一个域" $F
    "上的" m*n "矩阵是一个从整数序对"
    (&cm (tu0 $i $j) (&<= $1 $i $m) (&<= $1 $j $n)) "的集合" $S "到域" $F "的函数. "
    "对于这第三个例子, 我们将指明读者该如何验证条件3和4. 对于向量加法:"
    (Ol #:attr* '((type "a"))
        (Li "既然" $F "中的加法是交换的,"
            (MB (commute+ (app $f $s) (app $g $s)))
            "对于每个" $S "中的" $s "成立, 于是函数" (&+ $f $g) "和"
            (&+ $g $f) "是等同的.")
        (Li "既然" $F "中的加法是结合的,"
            (MB (&= (&+ (app $f $s) (bra0 (&+ (app $g $s) (app $h $s))))
                    (&+ (bra0 (&+ (app $f $s) (app $g $s)))
                        (app $h $s))))
            "对于每个" $s "成立, 于是" (&+ $f (@ (&+ $g $h))) "和"
            (&+ (@ (&+ $f $g)) $h) "是相同的函数.")
        (Li "唯一的零向量就是零函数, 其赋" $S "的每个元素以" $F "中的标量" $0 ".")
        (Li "对于每个" $V "中的" $f ", " (@ (&- $f)) "是由"
            (MB (&= (app (@ (&- $f)) $s) (&- (app $f $s))))
            "给定的函数.")
        )
    "读者应当发现验证标量乘法满足条件4是容易的, 通过施行类似于我们上面对于向量加法的论证."
    )
   ((example #:n "4")
    (B "域" $F "上的多项式函数的空间.") " 令" $F "是一个域, 令" $V "是所有具有如下形式的从"
    $F "到" $F "的函数"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
    "构成的集合, 其中" (&cm $c_0 $c_1 $..h $c_n) "是" $F "中固定的标量 (独立于" $x "). "
    "一个这种类型的函数被称为" $F "上的一个多项式函数. 令加法和标量乘法如例子3所定义的那样. "
    "读者必须观察到如果" $f "和" $g "是多项式函数而" $c "在" $F "中, 那么" (&+ $f $g) "和"
    (&i* $c $f) "也是多项式函数.")
   ((example #:n "5")
    "复数域" $CC "可以被当作实数域" $RR "上的向量空间. 更一般地, 令" $F "实数域, 而令" $V
    "是" $n "元组" (tu0 $x_1 $..h $x_n) "的集合, 其中" (&cm $x_1 $..h $x_n) "是复数. "
    "如例子1一样定义向量的加法和标量乘法, 这般我们就得到了一个实数域" $RR "上的向量空间, 其与"
    $CC^n "和" $RR^n "相当不同.")
   (P "从向量空间的定义中我们几乎立刻就能推出一些简单的事实, 接下来我们将推导它们. "
      "如果" $c "是一个标量而" $0 "是零向量, 那么根据3c和4c"
      (MB (&= (&i* $c $0) (&i* $c (@ (&+ $0 $0))) (&+ (&i* $c $0) (&i* $c $0))))
      "加上" (&- (@ (&i* $c $0))) "并使用3d, 我们就得到了"
      (MB (&= (&i* $c $0) $0))
      "类似地, 对于标量" $0 "和任意的向量" $alpha "我们发现"
      (MB (&= (&i* $0 $alpha) $0))
      "如果" $c "是一个非零标量而" $alpha "是一个向量满足" (&= (&i* $c $alpha) $0)
      "那么根据" (&= (&i* $c $0) $0) ", 我们有"
      (&= (&i* (inv $c) (@ (&i* $c $0))) $0) ", 但是又因为"
      (MB (&= (&i* (inv $c) (@ (&i* $c $0)))
              (&i* (@ (&i* (inv $c) $c)) $alpha)
              (&i* $1 $alpha) $alpha))
      "于是" (&= $alpha $0) ". 因此, 我们看到如果" $c "是一个标量而" $alpha
      "是一个向量, 并且" (&= (&i* $c $alpha) $0) ", 那么要么" $c "标量零, 要么"
      $alpha "是零向量." (Br)
      "如果" $alpha "是" $V "中任意的向量, 那么"
      (MB (&= $0 (&i* $0 $alpha) (&i* (@ (&- $1 $1)) $alpha)
              (&+ (&i* $1 $alpha) (&i* (@ $-1) $alpha))
              (&+ $alpha (&i* (@ $-1) $alpha))))
      "从中就推出"
      (MB (&= (&i* (@ $-1) $alpha) (&- $alpha)))
      "最后, 向量加法的结合和交换性质可以推出牵扯到数个向量的和独立于这些向量组合和结合的方式. "
      "例如, 如果" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "是" $V "中向量, 那么"
      (MB (&= (&+ (@ (&+ $alpha_1 $alpha_2)) (@ (&+ $alpha_3 $alpha_4)))
              (&+ (bra0 (&+ $alpha_2 (@ (&+ $alpha_1 $alpha_3)))) $alpha_4)))
      "并且这样一个和可以无歧义地被写成"
      (MB (&+ $alpha_1 $alpha_2 $alpha_3 $alpha_4)))
   ((definition)
    $V "中一个向量" $beta "被称为" $V "中向量" alpha_1..n
    "的线性组合, 只要存在" $F "中的标量" (&cm $c_1 $..h $c_n) "满足"
    (MB (&= $beta (LC0 $c_1 $alpha_1 $c_n $alpha_n) (sum (&= $i $1) $n (&i* $c_i $alpha_i)))))
   (P "对于向量加法的结合性质以及标量乘法的分配性质4c和4d的其他扩展"
      "可以施行于线性组合之上:"
      (MB (&Table
           ((&+ (sum (&= $i $1) $n (&i* $c_i $alpha_i))
                (sum (&= $i $1) $n (&i* $d_i $alpha_i)))
            $=
            (sum (&= $i $1) $n (&i* (@ (&+ $c_i $d_i)) $alpha_i)))
           ((&i* $c (sum (&= $i $1) $n (&i* $c_i $alpha_i)))
            $=
            (sum (&= $i $1) $n (&i* (@ (&i* $c $c_i)) $alpha_i)))
           )))
   (P "线性代数的特定部分与几何紧密关联. &quot;空间&quot;暗示了某种几何的东西, "
      "&quot;向量&quot;对于大多数人也是如此. 当我们进一步研究向量空间时, "
      "读者将会发现许多术语的确拥有几何的内涵. 在结束介绍向量空间的本节之前, "
      "我们将在某种程度上讨论向量空间和几何之间的关系, 至少能够指明&quot;向量空间&quot;"
      "这个名字的由来. 这将会是简要的直觉性的讨论.")
   (P "让我们考虑向量空间" $RR^3 ". 在解析几何中, 人们将实数三元组" (tu0 $x_1 $x_2 $x_3)
      "和三维Euclid空间中的点视为等同的. 在这样的上下文之中, 一个向量经常被定义成一个有向线段"
      (: $P $Q) ", 从点" $P "的位置到点" $Q ". 这相当于对从" $P "到" $Q "的&quot;箭头&quot;"
      "的想法进行小心的形式化. 当向量被使用时, 意图在于它们应该由它们的长度和方向所决定. "
      "因此, 当两个有向线段具有相同的长度和相同的方向时, 人们必须将其视为等同的.")
   (P "从" (&= $P (tu0 $x_1 $x_2 $x_3)) "到" (&= $Q (tu0 $y_1 $y_2 $y_3))
      "的有向线段" (: $P $Q) "与从原点" (&= $O (tu0 $0 $0 $0)) "到点"
      (tu0 (&- $y_1 $x_1) (&- $y_2 $x_2) (&- $y_3 $x_3)) "的有向线段具有相同的长度和方向. "
      "并且, 这是自原点出发而与" (: $P $Q) "具有相同长度和方向的唯一一条有向线段. "
      "因此, 如果读者同意仅处理从原点出发的向量, 那么与每个给定的长度和方向相关联着的"
      "仅恰有一个向量.")
   (P "从原点至" (&= $P (tu0 $x_1 $x_2 $x_3)) "的向量" (: $O $P) "完全由" $P
      "决定, 因此将这个向量与点" $P "视为等同是可能的. 在我们对于向量空间" $RR^3
      "的定义中, 那些向量就简单地被定义成三元组" (tu0 $x_1 $x_2 $x_3) ".")
   (P "给定点" (&= $P (tu0 $x_1 $x_2 $x_3)) "和" (&= $Q (tu0 $y_1 $y_2 $y_3)) ", 向量"
      (: $O $P) "和" (: $O $Q) "之和的定义可以被几何地给出. 如果这两个向量不是平行的, 那么线段"
      (: $O $P) "和" (: $O $Q) "确定了一个平面, 并且这两条线段是该平面中的一个平行四边形的两条边"
      " (见图1). 该平行四边形的一条对角线自" $O "延伸至点" $S ", 而" (: $O $P) "和" (: $O $Q)
      "之和就被定义成向量" (: $O $S) ". 点" $S "的坐标为"
      (tu0 (&+ $x_1 $y_1) (&+ $x_2 $y_2) (&+ $x_3 $y_3)) ", 因此这向量加法的几何定义"
      "就等价于例子1的代数定义.")
   ;dirty, to be improved
   (let* ((x1 0.3)
          (x2 0.6)
          (x3 0.4)
          (P (make-pt3 x1 x2 x3))
          (y1 0.2)
          (y2 -0.1)
          (y3 0.3)
          (Q (make-pt3 y1 y2 y3))
          (z1 (+ x1 y1))
          (z2 (+ x2 y2))
          (z3 (+ x3 y3))
          (S (make-pt3 z1 z2 z3))
          (draw-vec (&vec3 frame0))
          (draw-line (&line:pt3 frame0)))
     (&label
      (Svg
       #:attr* '((width "480") (height "270") (stroke "black"))
       (Defs marker0)
       (&frame frame0)
       (draw-vec (make-vec3 x1 x2 x3))
       (draw-line (make-pt3 0 x2 0) (make-pt3 x1 x2 0))
       (draw-line (make-pt3 x1 x2 0) P)
       (draw-vec (make-vec3 y1 y2 y3))
       (draw-line (make-pt3 0 0 0) (make-pt3 0 y2 0))
       (draw-line (make-pt3 0 y2 0) (make-pt3 y1 y2 0))
       (draw-line (make-pt3 y1 y2 0) Q)
       (draw-vec (make-vec3 z1 z2 z3))
       (draw-line (make-pt3 0 z2 0) (make-pt3 z1 z2 0))
       (draw-line (make-pt3 z1 z2 0) S)
       (set-attr* (draw-line P S) 'stroke-dasharray "8 4")
       (set-attr* (draw-line Q S) 'stroke-dasharray "8 4")
       (let* ((c ((pt3->2 frame0) P))
              (x (n2s (pt2-x c))) (y (n2s (- (pt2-y c) 10))))
         (ForeignObject
          #:attr* `((x ,x) (y ,y) (width "100") (height "30"))
          (: $P (tu0 $x_1 $x_2 $x_3))))
       (let* ((c ((pt3->2 frame0) Q))
              (x (n2s (- (pt2-x c) 100))) (y (n2s (- (pt2-y c) 10))))
         (ForeignObject
          #:attr* `((x ,x) (y ,y) (width "100") (height "30"))
          (: $Q (tu0 $y_1 $y_2 $y_3))))
       (let* ((c ((pt3->2 frame0) S))
              (x (n2s (- (pt2-x c) 60))) (y (n2s (- (pt2-y c) 25))))
         (ForeignObject
          #:attr* `((x ,x) (y ,y) (width "200") (height "30"))
          (: $S (tu0 (&+ $x_1 $y_1) (&+ $x_2 $y_2) (&+ $x_3 $y_3))))))
      "图1"))
   (P "标量乘法拥有一个简单的几何解释. 如果" $c "是一个实数, 那么" $c "与向量" (: $O $P)
      "之积是一个向量, 其自原点出发, 长度为" (&abs $c) "乘以" (: $O $P) "的长度, 方向在"
      (&> $c $0) "时与" (: $O $P) "相同, " (&< $c $0) "时与" (: $O $P) "相反. "
      "这标量乘法就产生向量" (: $O $T) ", 其中"
      (&= $T (tu0 (&i* $c $x_1) (&i* $c $x_2) (&i* $c $x_3)))
      ", 因此也与为" $RR^3 "给出的代数定义一致.")
   (P "时不时地, 读者可能会发现&quot;几何地思考&quot;向量空间很有助益. 也就是说, "
      "出于自身的需要, 通过绘图来刻画和启发一些想法. "
      "的确, 读者应该这么做. 然而, 在绘制这样的图形时, 读者必须记住, 由于我们是把向量空间"
      "作为代数系统进行处理的, 所有我们给出的证明在性质上都是代数的.")
   ((exercise #:n "1")
    "如果" $F "是一个域, 验证" $F^n " (在例子1中被定义) 是一个域" $F "上的向量空间.")
   ((exercise #:n "2")
    "如果" $V "是一个域" $F "上的向量空间, 验证"
    (MB (&= (&+ (@ (&+ $alpha_1 $alpha_2))
                (@ (&+ $alpha_3 $alpha_4)))
            (&+ (bra0 (&+ $alpha_2 (@ (&+ $alpha_3 $alpha_1))))
                $alpha_4)))
    "对于" $V "中所有向量" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "成立.")
   ((exercise #:n "3")
    "如果" $CC "是复数域, 那么" $CC^3 "中哪些向量是"
    (&cm (tu0 $1 $0 $-1) (tu0 $0 $1 $1) (tu0 $1 $1 $1)) "的线性组合?")
   ((exercise #:n "4")
    "令" $V "是所有实数序对" (tu0 $x $y) "的集合, 令" $F "是实数域, 定义"
    (MB (&cm (&= (&+ (tu0 $x $y) (tu0 $x_1 $y_1))
                 (tu0 (&+ $x $x_1) (&+ $y $y_1)))
             (&= (&i* $c (tu0 $x $y))
                 (tu0 (&i* $c $x) (&i* $c $y)))))
    $V "在这些运算下是一个实数域上的向量空间吗?")
   ((exercise #:n "5")
    "在" $RR^n "上定义两个运算"
    (MB (&cm (&= (&oplus $alpha $beta) (&- $alpha $beta))
             (&= (&d* $c $alpha) (&- (&i* $c $alpha)))))
    "右侧的运算即通常的运算, 那么" (tu0 $RR^n $oplus $d*)
    "满足哪些向量空间的公理?")
   ((exercise #:n "6")
    "令" $V "是所有满足"
    (MB (&= (app $f (&- $t)) (OverBar (app $f $t))))
    "的实数轴上的复值函数" $f "的集合. 横杠代表复共轭. 证明" $V
    ", 对于运算"
    (MB (&cm (&= (app (@ (&+ $f $g)) $t)
                 (&+ (app $f $t) (app $g $t)))
             (&= (app (@ (&i* $c $f)) $t)
                 (&i* $c (app $f $t)))))
    "是一个实数域上的向量空间. 给出" $V "中一个不是实值函数的例子.")
   ((exercise #:n "7")
    "令" $V "是实数序对" (tu0 $x $y) "的集合, 令" $F "是实数域, 定义"
    (MB (&cm (&= (&+ (tu0 $x $y) (tu0 $x_1 $y_1))
                 (tu0 (&+ $x $x_1) $0))
             (&= (&i* $c (tu0 $x $y))
                 (tu0 (&i* $c $x) $0))))
    $V "在这些运算下是一个向量空间吗?")
   (H3 "第2.2节 子空间")
   (P "本节我们引入一些研究向量空间的基本概念.")
   ((definition)
    "令" $V "是域" $F "上的向量空间. " $V "的子空间"
    "是" $V "的子集" $W ", 其在" $V "的加法和数乘之下是域"
    $F "上的向量空间.")
   (P "对于向量空间的公理的直接检视表明, " $V "的子集" $W "是一个子空间, 如果对于每个" $W "中的"
      $alpha "和" $beta ", 向量" (&+ $alpha $beta) "也在" $W "中; 零向量" $0 "在" $W "之中; "
      "对于每个" $W "中的" $alpha ", 向量" (@ (&- $alpha)) "在" $W "之中; 对于每个" $W "中的"
      $alpha "和每个标量" $c ", 向量" (&i* $c $alpha) "在" $W "之中. 向量加法的交换律和结合律, "
      "以及标量乘法的性质4a, 4b, 4c, 4d并不需要验证, 因为这些是" $V "上的运算所固有的性质. "
      "判断的标准还可以进一步得到简化.")
   ((theorem #:n "1")
    $V "的非空子集" $W "是" $V "的一个子空间当且仅当对于" $W "中的每对向量" $alpha "和" $beta
    "以及" $F "中的每个标量" $c ", 向量" (LC $c $alpha $beta) "仍然在" $W
    "之中. [译注: 空集显然不是子空间, 因为向量空间至少包含零向量.]")
   ((proof)
    "设" $W "是" $V "是一个非空子集, 其满足对于" $W "中所有的向量" $alpha "和" $beta
    "以及" $F "中所有的标量" $c "有" (LC $c $alpha $beta) "属于" $W ". 既然"
    $W "是非空的, " $W "中存在一个向量" $rho ", 因此" (&= (LC (@ $-1) $rho $rho) $0)
    "也在" $W "中. 然后, 如果" $alpha "是" $W "中的任意向量, " $c "是任意的标量, 那么向量"
    (&= (&i* $c $alpha) (LC $c $alpha $0)) "在" $W "中. 特别地, "
    (&= (&i* (@ $-1) $alpha) (&- $alpha)) "在" $W "中. 最后, 如果" $alpha "和"
    $beta "在" $W "中, 那么" (&= (&+ $alpha $beta) (LC $1 $alpha $beta))
    "在" $W "中. 因此, " $W "是" $V "的一个子空间." (Br)
    "反过来, 如果" $W "是" $V "的一个子空间, " $alpha "和" $beta "在" $W "中, "
    $c "是一个标量, 当然有" (LC $c $alpha $beta) "在" $W "中.")
   (P "有些人倾向于使用定理中的" (LC $c $alpha $beta) "性质作为子空间的定义. "
      "这没有什么区别. 重要的是, 如果" $W "是一个" $V "的非空子集满足对于" $W "中的"
      $alpha "和" $beta "以及" $F "中的" $c "有" (LC $c $alpha $beta)
      "在" $V "之中, 那么" $W " (在继承自" $V "的运算下) 是一个向量空间. "
      "这给我们提供了许多向量空间的新例子.")
   ((example #:n "6")
    (Ol #:attr* '((type "a"))
        (Li "如果" $V "是任意的向量空间, 那么" $V "是" $V "的一个子空间; "
            "仅包含零向量的子集也是" $V "的子空间, 被称为" $V "的零子空间.")
        (Li "在" $F^n "中, 满足" (&= $x_1 $0) "的" $n "元组"
            (tu0 $x_1 $..h $x_n) "的集合是一个子空间; 然而, 满足"
            (&= $x_1 (&+ $1 $x_2)) "的" $n
            "元组的集合不是一个子空间 (" (&>= $n $2) ").")
        (Li "域" $F "上的多项式函数的空间是从" $F "到" $F "的所有函数的空间的子空间.")
        (Li "域" $F "上的一个" n*n "矩阵" $A "是对称的, 如果对于每个" $i "和" $j "有"
            (&= Aij (mref $A $j $i)) ". 对称矩阵形成了一个域" $F
            "上的" n*n "矩阵的空间的子空间.")
        (Li "域" $CC "上的一个" n*n "矩阵" $A "是Hermite的 (或者说自伴的), 如果"
            (MB (&= (mref $A $j $k) (OverBar (mref $A $k $j))))
            "对于每个" $j "和" $k "成立, 其中横杠代表复共轭. 一个" 2*2
            "矩阵是Hermite的当且仅当其具有如下形式"
            (MB (Mat ($z (&+ $x (&i* $i $y)))
                     ((&- $x (&i* $i $y)) $w)))
            "其中" (&cm $x $y $z $w) "是实数. 所有Hermite矩阵的集合不是" $CC
            "上的" n*n "矩阵空间的子空间, 因为如果" $A "是Hermite的, 那么它的"
            "对角线元素" (&cm (mref $A $1 $1) (mref $A $2 $2) $..h)
            "都是实数, 但是" (&i* $i $A) "的对角线元素不总是实数. 另一方面, 很容易验证"
            n*n "的复Hermite矩阵的集合是一个域" $RR "上的向量空间 (在通常的运算下).")))
   ((example #:n "7")
    (B "齐次线性方程组的解空间.") " 令" $A "是域" $F "上的一个" m*n "矩阵, 那么满足"
    AX=0 "的所有" n*1 "矩阵" $X "构成的集合是域" $F "上的" n*1
    "矩阵空间的一个子空间. 为了证明这个事实, 我们必须证明当" AX=0 ", "
    (LE $A $Y $0) "以及" $c "是" $F "中任意标量时有" (LE $A (@LC $c $X $Y) $0)
    ", 而这可由以下的一般性事实立即得到.")
   ((lemma)
    "如果" $A "是域" $F "上的一个" m*n "矩阵而" $B "和" $C "是域" $F "上的"
    n*p "矩阵, 那么"
    (MB (&= (&i* $A (@LC $d $B $C))
            (LC $d @AB $A $C)))
    "对于每个" $F "中的标量" $d "成立. ")
   ((proof)
    (MB
     (deriv (mref (bra0 (&i* $A (@ (LC $d $B $C)))) $i $j)
            (sum $k $ (&i* (mref $A $i $k)
                           (mref (@ (LC $d $B $C)) $k $j)))
            (sum $k $
                 (@ (&+ (&i* $d (mref $A $i $k) (mref $B $k $j))
                        (&i* (mref $A $i $k) (mref $C $k $j)))))
            (LC $d (sum $k $ (&i* (mref $A $i $k) (mref $B $k $j)))
                (sum $k $ (&i* (mref $A $i $k) (mref $C $k $j))))
            (LC $d (mref @AB $i $j)
                (mref (&i* $A $C) $i $j))
            (mref (bra0 (LC $d @AB $A $C)) $i $j))))
   (P "类似地, 还可以证明"
      (&= (&i* (@ (LC $d $B $C)) $A) (LC $d (@i* $B $A) $C $A))
      ", 若矩阵的和与积确有定义.")
   ((theorem #:n "2")
    "令" $V "是域" $F "上的一个向量空间, 那么" $V "的任何子空间族的交是"
    $V "的子空间.")
   ((proof)
    "令" (cur0 $W_alpha) "是" $V "的一个子空间族, 令"
    (&= $W (: (Munder $Cap $alpha) $W_alpha)) "是其交. 回忆一下, "
    $W "被定义成属于每个" $W_alpha "的所有元素的集合 (见附录). "
    "既然每个" $W_alpha "都是子空间, 那么每个都包含零向量, 于是其交" $W
    "也包含零向量, " $W "非空. 令" $alpha "和" $beta "是" $W
    "中的向量, 令" $c "是一个标量. 根据" $W "的定义, " $alpha "和"
    $beta "都属于每个" $W_alpha ", 并且因为每个" $W_alpha
    "都是一个子空间, 向量" (@ (LC $c $alpha $beta))
    "在每个" $W_alpha "之中, 于是" (@ (LC $c $alpha $beta))
    "也在" $W "里. 根据定理1, " $W "是" $V "的一个子空间.")
   (P "根据定理2, 若" $S "是" $V "的任意子集, 那么存在一个包含" $S
      "的最小的" $V "的子空间, 最小的意思即这个包含" $S
      "的子空间是其他每个包含" $S "的子空间的子集.")
   ((definition)
    "令" $S "是一个向量的集合, 其来自于一个向量空间" $V ". 由" $S
    "张成的子空间被定义为所有包含" $S "的" $V "的子空间的交" $W
    ". 当" $S "是有限的向量集时, 如"
    (&= $S (en0 $alpha_1 $alpha_2 $..h $alpha_n))
    ", 我们也将" $W "简单地称为由向量"
    (&cm $alpha_1 $alpha_2 $..h $alpha_n)
    "张成的子空间.")
   ((theorem #:n "3")
    "由向量空间" $V "的一个非空子集" $S "张成的子空间是"
    $S "中向量所有的线性组合构成的集合.")
   ((proof)
    "令" $W "是" $S "张成的子空间, 那么" $S "中的向量"
    (&cm $alpha_1 $alpha_2 $..h $alpha_m)
    "的每个线性组合"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_2 $alpha_2 $x_m $alpha_m)))
    "显然在" $W "之中. 因此, " $W "包含集合" $L ", " $L
    "为" $S "中向量的所有线性组合的集合. 另一方面, 集合" $L
    "包含" $S ", 是非空的. 如果" $alpha "和" $beta "属于" $L
    ", 那么" $alpha "是一个线性组合,"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_2 $alpha_2 $x_m $alpha_m)))
    "其中" $alpha_i "在" $S "中, 并且" $beta "是一个线性组合,"
    (MB (&= $beta (LC0 $y_1 $beta_1 $y_2 $beta_2 $y_n $beta_n)))
    "其中" $beta_j "在" $S "中. 对于每个标量" $c ","
    (MB (&= (LC $c $alpha $beta)
            (&+ (sum (&= $i $1) $m
                     (&i* (@ (&i* $c $x_i)) $alpha_i))
                (sum (&= $j $1) $n
                     (&i* $y_j $beta_j)))))
    "因此, " (LC $c $alpha $beta) "属于" $L ", 于是"
    $L "是" $V "的一个子空间." (Br)
    "现在我们已经证明" $L "是包含" $S "的一个" $V "的子空间, 并且任何包含" $S
    "的子空间也包含" $L ", 于是" $L "是所有包含" $S "的子空间之交, 即" $L
    "是由集合" $S "张成的子空间.")
   ((definition)
    "如果" (&cm $S_1 $S_2 $..h $S_k) "是向量空间" $V "的子集, 那么所有形式为"
    (MB (&+ $alpha_1 $alpha_2 $..c $alpha_k))
    "的和 (其中" $alpha_i "在" $S_i "之中) 构成的集合被称为子集"
    (&cm $S_1 $S_2 $..h $S_k) "的和, 用记号"
    (MB (&+ $S_1 $S_2 $..c $S_k)) "表达, 或者"
    (MB (sum (&= $i $1) $k $S_i))
    "如果" (&cm $W_1 $W_2 $..h $W_k) "是" $V "的子空间, 那么和"
    (MB (&= $W (&+ $W_1 $W_2 $..c $W_k)))
    "显然是" $V "的一个子空间, 其包含每个子空间" $W_i ". 从中可以得到, 正如定理3"
    "的证明, " $W "是由" (&cm $W_1 $W_2 $..h $W_k) "之并张成的子空间.")
   ((example #:n "8")
    "令" $F "是复数域" $CC "的一个子域, 设"
    (MB (&cm (&= $alpha_1 (tu0 $1 $2 $0 $3 $0))
             (&= $alpha_2 (tu0 $0 $0 $1 $4 $0))
             (&= $alpha_3 (tu0 $0 $0 $0 $0 $1))))
    "根据定理3, 一个向量" $alpha "在由" (&cm $alpha_1 $alpha_2 $alpha_3)
    "张成的" $F^5 "的子空间" $W "之中当且仅当存在" $F "中的标量"
    (&cm $c_1 $c_2 $c_3) "满足"
    (MB (&= $alpha (LC $c_1 $alpha_1 $c_2 $alpha_2 $c_3 $alpha_3)))
    "因此" $W "由所有形式为"
    (MB (&= $alpha (tu0 $c_1 (&i* $2 $c_1) $c_2
                        (LC $3 $c_1 $4 $c_2) $c_3)))
    "的向量构成, 其中" (&cm $c_1 $c_2 $c_3) "是" $F
    "中任意的标量. 换句话说, " $W "可以被描述为由满足"
    (MB (&cm (&= $x_2 (&i* $2 $x_1))
             (&= $x_4 (LC $3 $x_1 $4 $x_3))))
    "的" $5 "元组"
    (MB (&= $alpha (tu0 $x_1 $x_2 $x_3 $x_4 $x_5)))
    "构成的集合, 其中" $x_i "在" $F "中. 因此, "
    (tu0 $-3 $-6 $1 $-5 $2) "在" $W "中, 而"
    (tu0 $2 $4 $6 $7 $8) "不在.")
   ((example #:n "9")
    "令" $F "是复数域" $CC "的一个子域, 令" $V "是域" $F "上所有" 2*2
    "矩阵的向量空间. 令" $W_1 "是包含所有形式为"
    (MB (Mat ($x $y) ($z $0)))
    "的矩阵的" $V "的子集, 其中" (&cm $x $y $z) "是" $F "中任意的标量. "
    "最后, 令" $W_2 "是包含所有形式为"
    (MB (Mat ($x $0) ($0 $y)))
    "的矩阵的" $V "的子集, 其中" $x "和" $y "是" $F "中任意的标量. "
    "那么, " $W_1 "和" $W_2 "是" $V "的子空间, 并且"
    (MB (&= $V (&+ $W_1 $W_2)))
    "因为"
    (MB (&= (Mat ($a $b) ($c $d))
            (&+ (Mat ($a $b) ($c $0)) (Mat ($0 $0) ($0 $d)))))
    "子空间" (&cap $W_1 $W_2) "包含所有形式为"
    (MB (Mat ($x $0) ($0 $0)))
    "的矩阵.")
   ((example #:n "10")
    "令" $A "是域" $F "上的一个" m*n "矩阵. " $A "的行向量是" $F^n "中的向量, 其由"
    (&cm (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n)))
         (&= $i (&cm $1 $..h $m)))
    "给定. 由" $A "的行向量张成的" $F^n "的子空间被称为" $A "的行空间. "
    "例子8中所考虑的子空间是矩阵"
    (MB (&= $A (Mat ($1 $2 $0 $3 $0)
                    ($0 $0 $1 $4 $0)
                    ($0 $0 $0 $0 $1))))
    "的行空间. 它也是矩阵"
    (MB (&= $B (Mat ($1 $2 $0 $3 $0)
                    ($0 $0 $1 $4 $0)
                    ($0 $0 $0 $0 $1)
                    ($-4 $-8 $1 $-8 $0))))
    "的行空间.")
   ((example #:n "11")
    "令" $V "是所有域" $F "上的多项式函数的空间, 令" $S "是" $V "的一个子集, 包含多项式函数"
    (&cm $f_0 $f_1 $f_2 $..h) ", 其由"
    (MB (&cm (&= (app $f_n $x) $x^n) (&= $n (&cm $0 $1 $2 $..h))))
    "定义, 那么" $V "是由" $S "张成的子空间.")
   ((exercise #:n "1")
    "以下哪些" $RR^n "中的向量" (&= $alpha (tu0 $a_1 $..h $a_n))
    "的集合是" $RR^n "的子空间 (" (&>= $n $3) ")?"
    (Ol #:attr* '((type "a"))
        (Li "所有满足" (&>= $a_1 $0) "的" $alpha ";")
        (Li "所有满足" (&= (&+ $a_1 (&i* $3 $a_2)) $a_3) "的" $alpha ";")
        (Li "所有满足" (&= $a_2 (_^ $a $1 $2)) "的" $alpha ";")
        (Li "所有满足" (&= (&i* $a_1 $a_2) $0) "的" $alpha ";")
        (Li "所有" $a_2 "为有理数的" $alpha ".")))
   ((exercise #:n "2")
    "令" $V "是所有从" $RR "到" $RR "的函数" $f "构成的(实)向量空间, "
    "以下哪些函数的集合是" $V "的子空间?"
    (Ol #:attr* '((type "a"))
        (Li "所有满足" (&= (app $f $x^2) (^ (bra0 (app $f $x)) $2)) "的" $f ";")
        (Li "所有满足" (&= (app $f $0) (app $f $1)) "的" $f ";")
        (Li "所有满足" (&= (app $f $3) (&+ $1 (app $f $-5))) "的" $f ";")
        (Li "所有满足" (&= (app $f $-1) $0) "的" $f ";")
        (Li "所有连续的" $f ".")))
   ((exercise #:n "3")
    "向量" (tu0 $3 $-1 $0 $-1) "在由向量"
    (&cm (tu0 $2 $-1 $3 $2) (tu0 $-1 $1 $1 $-3) (tu0 $1 $1 $9 $-5))
    "张成的" $RR^4 "的子空间之中吗?")
   ((exercise #:n "4")
    "令" $W "是满足"
    (MB (&LE ((&i* $2 $x_1) $- $x_2 $+ (&i* 4/3 $x_3) $- $x_4 $ $ $= $0)
             ($x_1 $ $ $+ (&i* 2/3 $x_3) $ $ $- $x_5 $= $0)
             ((&i* $9 $x_1) $- (&i* $3 $x_2) $+ (&i* $6 $x_3) $-
                            (&i* $3 $x_4) $- (&i* $3 $x_5) $= $0)))
    "的所有" $RR^5 "中的" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5) "的集合. "
    "找出一个张成" $W "的向量的有限集合.")
   ((exercise #:n "5")
    "令" $F "是一个域, " $n "是一个大于等于" $2 "的正整数. "
    "令" $V "是域" $F "上所有" n*n "矩阵的向量空间. "
    "以下哪些" $V "中矩阵" $A "的集合是" $V "的子空间?"
    (Ol #:attr* '((type "a"))
        (Li "所有可逆的" $A ";")
        (Li "所有不可逆的" $A ";")
        (Li "所有满足" (commute* $A $B) "的" $A ", 其中" $B "是" $V
            "中一个固定的矩阵;")
        (Li "所有满足" (&= $A^2 $A) "的" $A ".")))
   ((exercise #:n "6")
    (Ol #:attr* '((type "a"))
        (Li "证明" $RR^1 "的子空间仅有" $RR^1 "和零子空间.")
        (Li "证明" $RR^2 "的子空间是" $RR^2 ", 或是零子空间, 或是由某个" $RR^2
            "中固定的(非零)向量的标量倍数构成. (最后一种类型的子空间, 从直觉上说, "
            "是一条通过原点的直线.)")
        (Li "你能描述" $RR^3 "的子空间吗?")))
   ((exercise #:n "7")
    "令" $W_1 "和" $W_2 "是向量空间" $V "的子空间, 满足" $W_1 "和" $W_2 "之并也是子空间. "
    "证明其中一个空间" $W_i "是另一个的子集.")
   ((exercise #:n "8")
    "令" $V "是所有从" $RR "到" $RR "的函数" $f "的向量空间, 令" $V_e "是偶函数的子集, 即满足"
    (&= (app $f (&- $x)) (app $f $x)) "的函数, 令" $V_o "是奇函数的子集, 即满足"
    (&= (app $f (&- $x)) (&- (app $f $x))) "的函数."
    (Ol #:attr* '((type "a"))
        (Li "证明" $V_e "和" $V_o "是" $V "的子空间.")
        (Li "证明" (&= (&+ $V_e $V_o) $V) ".")
        (Li "证明" (&= (&cap $V_e $V_o) (cur0 $0)) ".")))
   ((exercise #:n "9")
    "令" $W_1 "和" $W_2 "是向量空间" $V "的子空间, 满足"
    (&= (&+ $W_1 $W_2) $V) "且" (&= (&cap $W_1 $W_2) (cur0 $0)) ". "
    "证明对于每个" $V "中的向量" $alpha "存在唯一的" $W_1
    "中的向量" $alpha_1 "和" $W_2 "中的向量" $alpha_2 "满足"
    (&= $alpha (&+ $alpha_1 $alpha_2)) ".")
   (H3 "第2.3节 基和维数")
   (P "现在我们转向为特定的向量空间赋一个维数的任务. 尽管我们通常将&quot;维数"
      "&quot;与某种几何的东西联系起来, 我们必须为向量空间的维数寻找一个合适的"
      "代数定义. 这将通过向量空间的基的概念来完成.")
   ((definition)
    "令" $V "是域" $F "上的一个向量空间. " $V "的一个子集" $S "被称为线性相关的, "
    "如果存在" $S "中不同的向量" (&cm $alpha_1 $alpha_2 $..h $alpha_n) "和"
    $F "中的不全为" $0 "的标量" (&cm $c_1 $c_2 $..h $c_n) "满足"
    (MB (&= (&+ (&i* $c_1 $alpha_1) (&i* $c_2 $alpha_2)
                $..c (&i* $c_n $alpha_n)) $0))
    "不是线性相关的集合被称为线性无关的. 如果集合" $S "仅包含有限多个向量"
    (&cm $alpha_1 $alpha_2 $..h $alpha_n) ", 有时我们称"
    (&cm $alpha_1 $alpha_2 $..h $alpha_n) "是线性相关的 (或线性无关的) 而不是说"
    $S "是线性相关的 (或线性无关的).")
   (P "以下陈述是定义的简单推论."
      (Ol (Li "任何包含线性相关集合的集合是线性相关的.")
          (Li "线性无关集合的任意子集是线性无关的.")
          (Li "任何包含零向量的集合是线性相关的, 因为" (&= (&d* $1 $0) $0) ".")
          (Li "一个集合" $S "是线性无关的当且仅当" $S "的每个有限子集是线性无关的, "
              "即当且仅当对于" $S "的不同向量" alpha_1..n "有"
              (&= (&+ (&i* $c_1 $alpha_1) $..c (&i* $c_n $alpha_n)) $0)
              "可以推出每个" (&= $c_i $0) ".")))
   ((definition)
    "令" $V "是一个向量空间. " $V "的一个基是一个能够张成" $V "的线性无关的"
    "向量集合. " $V "被称为有限维的, 如果它拥有一个有限的基.")
   ((example #:n "12")
    "令" $F "是一个" $CC "的子域. 在" $F^3 "中, 向量"
    (MB (&cm (&= $alpha_1 (tu0 $3 $0 $-3))
             (&= $alpha_2 (tu0 $-1 $1 $2))
             (&= $alpha_3 (tu0 $4 $2 $-2))
             (&= $alpha_4 (tu0 $2 $1 $1))
             ))
    "是线性相关的, 因为"
    (MB (&= (: (&i* $2 $alpha_1) $+ (&i* $2 $alpha_2) $- $alpha_3
               $+ (&d* $0 $alpha_4)) $0))
    "向量"
    (MB (&cm (&= $epsilon_1 (tu0 $1 $0 $0))
             (&= $epsilon_2 (tu0 $0 $1 $0))
             (&= $epsilon_3 (tu0 $0 $0 $1))))
    "是线性无关的."
    )
   ((example #:n "13")
    "令" $F "是一个域, 令" $S "是由" (&cm $epsilon_1 $epsilon_2 $..h $epsilon_n)
    "构成的" $F^n "的子集, 其中"
    (MB (&cm (&= $epsilon_1 (tu0 $1 $0 $0 $..h $0))
             (&= $epsilon_2 (tu0 $0 $1 $0 $..h $0))
             $..h
             (&= $epsilon_n (tu0 $0 $0 $0 $..h $1))))
    "令" (&cm $x_1 $x_2 $..h $x_n) "是" $F "中标量, 置"
    (&= $alpha (&+ (&i* $x_1 $epsilon_1) (&i* $x_2 $epsilon_2)
                   $..c (&i* $x_n $epsilon_n)))
    ", 那么"
    (MB (&= $alpha (tu0 $x_1 $x_2 $..h $x_n)))
    "这表明" (&cm $epsilon_1 $..h $epsilon_n) "可以张成" $F^n ". 因为"
    (&= $alpha $0) "当且仅当" (&= $x_1 $x_2 $..c $x_n $0) ", 所以向量"
    (&cm $epsilon_1 $..h $epsilon_n) "是线性无关的. 因此, "
    (&= $S (setE $epsilon_1 $..h $epsilon_n)) "是" $F^n
    "的一个基, 我们将其称为" $F^n "的标准基.")
   ((example #:n "14")
    "令" $P "是域" $F "上的一个" n*n "的可逆矩阵, 那么" $P "的列"
    (&cm $P_1 $..h $P_n) "构成了列矩阵空间" $F^n*1
    "的一个基, 理由如下. 如果" $X "是一个列矩阵, 那么"
    (MB (&= (&i* $P $X) (&+ (&i* $x_1 $P_1) $..c (&i* $x_n $P_n))))
    "既然" (LE $P $X $0) "仅有平凡解" (&= $X $0) ", 那么"
    (setE $P_1 $..h $P_n) "是一个线性无关的集合. 为什么它能够张成"
    $F^n*1 "呢? 令" $Y "是任意的列矩阵, 如果"
    (&= $X (&i* (inv $P) $Y)) ", 那么" (&= $Y (&i* $P $X)) ", 即"
    (MB (&= $Y (&+ (&i* $x_1 $P_1) $..c (&i* $x_n $P_n))))
    "于是" (setE $P_1 $..h $P_n) "是" $F^n*1
    "的一个基.")
   ((example #:n "15")
    "令" $A "是一个" m*n "矩阵, " $S "是齐次线性方程组" AX=0
    " (例子7) 的解空间. 令" $R "是行等价于" $A
    "的一个行简化阶梯形式, 那么" $S "也是方程组" RX=0
    "的解空间. 如果" $R "具有" $r "个非零行, 那么" RX=0
    "就简单地将未知元" (&cm $x_1 $..h $x_n) "中的" $r
    "个表达为了基于剩余" (&- $n $r) "个未知元" $x_j
    "的线性组合. 设非零行的首非零元出现在第"
    (&cm $k_1 $..h $k_r) "列, 令" $J "是除去" (&cm $k_1 $..h $k_r)
    "剩下的" (&- $n $r) "个索引的集合:"
    (MB (&= $J (&- (setE $1 $..h $n)
                   (setE $k_1 $..h $k_r))))
    "那么方程组" RX=0 "具有如下形式"
    (MB (Choice
         ((_ $x $k_1) $+ (sum $J $ (&i* (_ $c (&cm $1 $j)) $x_j)) $= $0)
         ($..v $ $..v $ $..v)
         ((_ $x $k_r) $+ (sum $J $ (&i* (_ $c (&cm $r $j)) $x_j)) $= $0)))
    "其中" (_ $c (&cm $i $j)) "是特定的标量. 所有的解都可由以下方式获得, "
    "对于每个" $J "中的" $j ", 给" $x_j "赋(任意的)值, 然后计算相应的"
    (&cm (_ $x $k_1) $..h (_ $x $k_r)) "的值. 若对于每个" $J
    "中的" $j ", " $E_j "是令" (&= $x_j $1) ", 其余" (&= $x_i $0)
    " (" $i "是" $J "中异于" $j "的索引) 得到的解, 那么我们断言这"
    (@- $n $r) "个向量" $E_j "构成了解空间的一个基." (Br)
    "因为列矩阵" $E_j "的第" $j "行为" $1 ", 而由" $J "中其余元素索引的行是"
    $0 ", 根据例子13的推理, 这表明这些向量构成的集合是线性无关的. "
    "以下是这些向量能够张成解空间的理由. 如果列矩阵" $T " (其元素依次为"
    (&cm $t_1 $..h $t_n) ") 在解空间之中, 那么矩阵"
    (MB (&= $N (sum $J $ (&i* $t_j $E_j))))
    "同样也在解空间之中, 并且满足对于每个" $J "中的" $j "有"
    (&= $x_j $t_j) ". 具有这样性质的解是唯一的, 因此" (&= $N $T)
    ", 而" $T "就在诸向量" $E_j "张成的空间之中.")
   ((example #:n "16")
    "现在我们将给出一个无穷基的例子. 令" $F "是复数域的一个子域, "
    $V "是" $F "上的多项式函数的空间. 回忆一下, 这些从" $F
    "到" $F "的函数具有如下形式"
    (MB (&= (app $f $x)
            (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
    "令" (&cm (&= (app $f_k $x) $x^k) (&= $k (&cm $0 $1 $2 $..h)))
    ", 那么(无限的)集合" (setE $f_0 $f_1 $f_2 $..h)
    "是" $V "的一个基. 显然, 它能张成" $V ", 因为(上面的)函数" $f "可以表示为"
    (MB (&= $f (&+ (&i* $c_0 $f_0) (&i* $c_1 $f_1) $..c (&i* $c_n $f_n))))
    "读者应该看出来这事实上不过就是重复一遍多项式函数的定义, 即一个从" $F
    "到" $F "的函数" $f "是多项式函数当且仅当存在一个整数" $n "和标量"
    (&cm $c_0 $..h $c_n) "满足" (&+ (&i* $c_0 $f_0) $..c (&i* $c_n $f_n))
    ". 那么为什么这些函数线性无关呢? 为了证明集合" (setE $f_0 $f_1 $f_2 $..h)
    "是线性无关的, 只需要证明其每个有限子集是线性无关的即可, 实际上证明对于每个"
    $n ", 集合" (setE $f_0 $..h $f_n) "是线性无关的就够了. 设"
    (MB (&= (&+ (&i* $c_0 $f_0) $..c (&i* $c_n $f_n)) $0))
    "这等价于说"
    (MB (&= (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)) $0))
    "对于每个" $F "中的" $x "成立. 换句话说, 每个" $F "中的" $x "都是多项式函数"
    (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)))
    "的根. 我们假定读者已经知道一个" $n "阶的复系数多项式不可能拥有多于" $n
    "个的不同的根, 于是就有" (&= $c_0 $c_1 $..c $c_n $0) ". " (Br)
    "我们已经给出了" $V "的一个无限的基, 那么这是否意味着" $V "不是有限维的? "
    "实际上的确如此, 但这不能通过定义直接得到, 因为就目前我们所知, 或许" $V
    "还拥有一个有限的基. 不过, 这种可能性很容易被排除. (我们将于下一个定理中"
    "在一般情况下排除它.) 假设我们拥有一个有限数目的多项式函数"
    (&cm $g_1 $..h $g_r) ", 那么" (&cm (app $g_1 $x) $..h (app $g_r $x))
    "中将出现一个最高的" $x "的幂次. 如果该幂次是" $k ", 那么显然"
    (&= (app (_ $f (&+ $k $1)) $x) (^ $x (&+ $k $1))) "不在"
    (&cm $g_1 $..h $g_r) "的线性扩张之中, 因此" $V "不可能是有限维的. "
    "[译注: 当然, 存在一种极端情况, 即每个多项式函数都是零函数, 那就不存在"
    "最高的幂次, 不过这种情况可以被特殊对待, 论证仍然完全合理.]")
   (P "关于这个例子的最后一条评注就位了. 无限的基同&quot;无限的线性组合&quot;"
      "毫无关系. 若是读者不能抵制将幂级数"
      (MB (sum (&= $k $0) $inf (&i* $c_k $x^k)))
      "注入这个例子之中, 那么他就应该再一次好好琢磨一下这个例子. "
      "如果还是没有疗效的话, 从现在开始他就应该考虑将注意力限制在有限维空间上.")
   ((theorem #:n "4")
    "令" $V "是一个由有限多个向量" (&cm $beta_1 $beta_2 $..h $beta_m)
    "张成的向量空间, 那么" $V "中任意线性无关的集合都是有限的, 并且拥有的元素不超过"
    $m "个.")
   ((proof)
    "为了证明这个定理, 只需要证明" $V "的每个拥有超过" $m "个元素的子集" $S
    "是线性相关的就够了. 令" $S "就是这样一个集合. 在" $S "中, 存在" $n
    "个互异的向量" (&cm $alpha_1 $alpha_2 $..h $alpha_n) ", 其中" (&> $n $m)
    ". 因为" (&cm $beta_1 $..h $beta_m) "能够张成" $V ", 所以存在" $F
    "中的标量" Aij "满足"
    (MB (&= $alpha_j (sum (&= $i $1) $m (&i* Aij $beta_i))))
    "对于" $n "个标量" (&cm $x_1 $x_2 $..h $x_n) ", 我们有"
    (MB (deriv (LC0 $x_1 $alpha_1 $x_n $alpha_n)
               (sum (&= $j $1) $n (&i* $x_j $alpha_j))
               (sum (&= $j $1) $n
                    (&i* $x_j (@sum (&= $i $1) $m (&i* Aij $beta_i))))
               (sum (&= $j $1) $n
                    (sum (&= $i $1) $m
                         (&i* (@i* Aij $x_j) $beta_i)))
               (sum (&= $i $1) $m
                    (&i* (@sum (&= $j $1) $n (&i* Aij $x_j)) $beta_i))))
    "既然" (&> $n $m) ", 那么根据第1章的定理6, 存在不全为零的"
    (&cm $x_1 $x_2 $..h $x_n) "满足"
    (MB (&cm (&= (sum (&= $j $1) $n (&i* Aij $x_j)) $0)
             (&<= $1 $i $m)))
    "因此"
    (&= (&+ (&i* $x_1 $alpha_1) (&i* $x_2 $alpha_2) $..c (&i* $x_n $alpha_n)) $0)
    ", 这表明" $S "是线性相关的集合.")
   ((corollary #:n "1")
    "如果" $V "是一个有限维向量空间, 那么任意两个" $V "的基都具有相同"
    "(有限)数目的元素.")
   ((proof)
    "既然" $V "是有限维的, 它拥有一个有限的基"
    (MB (setE $beta_1 $beta_2 $..h $beta_m))
    "[译注: 这个记号隐含了" (&cm $beta_1 $beta_2 $..h $beta_m) "互异之意, 但请读者注意, "
    "这并非集合论公理的要求, 只是一个常见的默认约定罢了.] 根据定理4, 每个" $V
    "的基都应该是有限的, 并且拥有的元素不超过" $m "个. 因此, 如果"
    (setE $alpha_1 $alpha_2 $..h $alpha_n) "是一个基, 那么" (&<= $n $m)
    ". 根据相同的论证, 有" (&<= $m $n) ", 于是" (&= $m $n) ".")
   (P "这个推论允许我们将有限维向量空间的维数定义为" $V "的一个基的元素个数. "
      "我们将用" (&dim $V) "表示有限维向量空间" $V "的维数. "
      "这允许我们重新表述定理4如下.")
   ((corollary #:n "2")
    "令" $V "是一个有限维向量空间, 令" (&= $n (&dim $V)) ", 那么"
    (Ol #:attr* '((type "a"))
        (Li "任何包含多于" $n "个向量的" $V "的子集是线性相关的;")
        (Li "没有包含少于" $n "个向量的" $V "的子集可以张成" $V ".")))
   ((example #:n "17")
    "如果" $F "是一个域, 那么" $F^n "的维数是" $n ", 因为" $F^n
    "的标准基包含" $n "个向量. 矩阵空间" (^ $F m*n)
    "的维数是" (&i* $m $n) ". 若与" $F^n "的情况进行类比, "
    "这应该是很显然的, 因为" (&i* $m $n) "个矩阵, 其中每个矩阵的第" $i
    "行" $j "列是" $1 ", 其余位置是" $0 ", 构成了" (^ $F m*n)
    "的一个基. 如果" $A "是一个" m*n "的矩阵, 那么" $A "的维数是"
    (&- $n $r) ", 其中" $r "是与" $A "行等价的行简化阶梯矩阵的非零行数, "
    "见例子15." (Br)
    "如果" $V "是" $F "上任意的向量空间, 那么其零子空间可由向量" $0
    "张成, 但是" (setE $0) "是线性相关的集合, 因此不是一个基. "
    "出于这样的原因, 我们将约定零子空间的维数是" $0 ". 另一种做法是, "
    "我们论证空集是零子空间的基, 那么也能够达成相同的结论. "
    "空集可以张成" (setE $0) ", 因为所有包含空集的子空间之交是"
    (setE $0) ". 并且, 空集也是线性无关的, 因为它不包含任何向量.")
   ((lemma)
    "令" $S "是向量空间" $V "的一个线性无关的子集, 设" $beta
    "是" $V "中向量但不在" $S "张成的子空间之中, 那么将" $beta
    "加入" $S "得到的集合仍然是线性无关的.")
   ((proof)
    "设" (&cm $alpha_1 $..h $alpha_m) "是" $S "中互异的向量, 并且"
    (MB (&= (&+ (&i* $c_1 $alpha_1) $..c (&i* $c_m $alpha_m)
                (&i* $b $beta)) $0))
    "那么" (&= $b $0) ", 否则的话"
    (MB (&= $beta (&+ (&i* (pare (&- (~ $c_1 $b))) $alpha_1)
                      $..c
                      (&i* (pare (&- (~ $c_m $b))) $alpha_m))))
    "那么" $beta "就在" $S "张成的子空间之中. 因此, "
    (&= (LC0 $c_1 $alpha_1 $c_m $alpha_m) $0)
    ". 既然" $S "是线性无关的, 那么每个" (&= $c_i $0) ".")
   ((theorem #:n "5")
    "如果" $W "是一个有限维向量空间" $V "的子空间, 那么" $W
    "每个线性无关的子集都是有限的, 并且是" $W "的某个(有限的)基的一部分.")
   ((proof)
    "设" $S_0 "是" $W "的一个线性无关的子集. 如果" $S "是包含" $S_0
    "的" $W "的一个线性无关的子集, 那么" $S "也是" $V
    "的一个线性无关的子集. 因为" $V "是有限维的, 所以" $S
    "包含的元素个数不超过" (&dim $V) "个." (Br)
    "我们按照以下方式将" $S_0 "扩展为" $W "的一个基. 如果" $S_0 "可以张成" $W
    ", 那么" $S_0 "就是" $W "的一个基, 我们的任务就完成了. 如果" $S_0
    "不能张成" $W ", 那么根据前述引理, 我们可以在" $W "中找到一个" $beta_1
    "满足" (&= $S_1 (&union $S_0 (setE $beta_1))) "是线性无关的. "
    "[译注: 显然" $beta_1 "不是" $S_0 "的元素.] "
    "如果" $S_1 "能够张成" $W ", 那就结束了. 否则的话, 再次应用引理以得到一个" $W
    "中的" $beta_2 "满足" (&= $S_2 (&union $S_1 (setE $beta_2)))
    "是线性无关的. 继续实行此法, 那么 (在不超过" (&dim $V) "步的情况下) "
    "我们能够抵达一个集合"
    (MB (&= $S_m (&union $S_0 (setE $beta_1 $..h $beta_m))))
    "其为" $W "的一个基.")
   ((corollary #:n "1")
    "如果" $W "是有限维向量空间" $V "的一个真子空间, 那么" $W
    "也是有限维的, 并且" (&< (&dim $W) (&dim $V)) ".")
   ((proof)
    "我们不妨设" $W "包含一个向量" (&!= $alpha $0) ". 根据定理5及其证明, "
    "存在一个" $W "的基, 其包含" $alpha "且拥有不超过" (&dim $V)
    "个元素. 因此, " $W "是有限维的, 并且" (&<= (&dim $W) (&dim $V))
    ". 既然" $W "是一个真子空间, 那么存在" $V "中的向量" $beta
    ", 但其不在" $W "中. 将" $beta "加入" $W "的任何一个基之中, 我们"
    "都能得到" $V "的一个线性无关的子集, 于是" (&< (&dim $W) (&dim $V)) ". "
    "[译注: 实际上证明不必如此曲折, 从空集开始就好, 即能扩展成为" $W
    "的一个基, 并且这也覆盖了" $W "是零子空间的平凡情况.]")
   ((corollary #:n "2")
    "在有限维向量空间" $V "中每个非空的线性无关集合都是某个基的一部分. "
    "[译注: 平凡的空集情况当然也是某个基的一部分.]")
   ((corollary #:n "3")
    "令" $A "是域" $F "上的一个" n*n "矩阵, 设其行向量构成了" $F^n
    "的一个线性无关的集合, 那么" $A "是可逆的. "
    "[译注: 一般情况下, &quot;构成集合&quot;也就默认了互异, 尽管"
    "这不存在什么确切的道理可言.]")
   ((proof)
    "令" (&cm $alpha_1 $alpha_2 $..h $alpha_n) "是" $A
    "的行向量, 设" $W "是由" (&cm $alpha_1 $alpha_2 $..h $alpha_n)
    "张成的" $F^n "的子空间. 既然" (&cm $alpha_1 $alpha_2 $..h $alpha_n)
    "是线性无关的, 那么" $W "的维数就是" $n ". 推论1现在告诉我们"
    (&= $W $F^n) ", 因此存在" $F "中标量" (mref $B $i $j) "满足"
    (MB (&cm (&= $epsilon_i
                 (sum (&= $j $1) $n (&i* (mref $B $i $j) $alpha_j)))
             (&<= $1 $i $n)))
    "其中" (setE $epsilon_1 $epsilon_2 $..h $epsilon_n)
    "是" $F^n "的标准基, 因此对于以" (mref $B $i $j)
    "为元素的矩阵" $B ", 我们有"
    (MB (&= (&i* $B $A) $I)))
   ((theorem #:n "6")
    "如果" $W_1 "和" $W_2 "是向量空间" $V "的有限维子空间, 那么"
    (&+ $W_1 $W_2) "也是有限维的, 并且有"
    (MB (&= (&+ (&dim $W_1) (&dim $W_2))
            (&+ (&dim0 (&cap $W_1 $W_2))
                (&dim0 (&+ $W_1 $W_2)))))
    ((proof)
     "根据定理5及其推论, " (&cap $W_1 $W_2) "具有一个有限的基"
     (setE $alpha_1 $..h $alpha_k) ", 其为" $W_1 "的基"
     (MB (setE $alpha_1 $..h $alpha_k
               $beta_1 $..h $beta_m))
     "的一部分, 也是" $W_2 "的基"
     (MB (setE $alpha_1 $..h $alpha_k
               $gamma_1 $..h $gamma_n))
     "的一部分. 子空间" (&+ $W_1 $W_2) "可由向量"
     (MB (&cm $alpha_1 $..h $alpha_k
              $beta_1 $..h $beta_m
              $gamma_1 $..h $gamma_n))
     "张成, 并且这些向量也构成了一个线性无关的集合, 因为若设"
     (MB (&= (&+ (sum $ $ (&i* $x_i $alpha_i))
                 (sum $ $ (&i* $y_j $beta_j))
                 (sum $ $ (&i* $z_r $gamma_r)))
             $0))
     "那么"
     (MB (&= (&- (sum $ $ (&i* $z_r $gamma_r)))
             (&+ (sum $ $ (&i* $x_i $alpha_i))
                 (sum $ $ (&i* $y_j $beta_j)))))
     "这表明" (sum $ $ (&i* $z_r $gamma_r)) "属于" $W_1
     ". 因为" (sum $ $ (&i* $z_r $gamma_r)) "也属于" $W_2
     ", 所以"
     (MB (&= (sum $ $ (&i* $z_r $gamma_r))
             (sum $ $ (&i* $c_i $alpha_i))))
     "对于特定的" (&cm $c_1 $..h $c_k) "成立. 鉴于"
     (MB (setE $alpha_1 $..h $alpha_k
               $gamma_1 $..h $gamma_n))
     "是线性无关的, 每个标量" (&= $z_r $0) ", 因此"
     (MB (&= (&+ (sum $ $ (&i* $x_i $alpha_i))
                 (sum $ $ (&i* $y_j $beta_j)))
             $0))
     "既然"
     (MB (setE $alpha_1 $..h $alpha_k
               $beta_1 $..h $beta_m))
     "也是线性无关的, 那么有每个" (&= $x_i $0) "且每个"
     (&= $y_j $0) ". 最终我们得到"
     (MB (setE $alpha_1 $..h $alpha_k
               $beta_1 $..h $beta_m
               $gamma_1 $..h $gamma_n))
     "是" (&+ $W_1 $W_2) "的一个基, 于是"
     (MB (deriv (&+ (&dim $W_1) (&dim $W_2))
                (&+ (@ (&+ $k $m)) (@ (&+ $k $n)))
                (&+ $k (@ (&+ $m $k $n)))
                (&+ (&dim0 (&cap $W_1 $W_2))
                    (&dim0 (&+ $W_1 $W_2)))))))
   (P "让我们以一条关于线性无关和线性相关的注记作结. "
      "我们对于向量的集合定义了这些概念. "
      "对于向量的有限序列 (有序的" $n "元组) "
      alpha_1..n "定义它们也是很有用的. "
      "我们称向量" alpha_1..n
      "是线性相关的, 如果存在不全为零的标量"
      (&cm $c_1 $..h $c_n) "满足"
      (&= (LC0 $c_1 $alpha_1 $c_n $alpha_n) $0)
      ". 这是如此自然的, 以至于读者可能会发现他已经在这样使用术语了. "
      "那么, 有限序列" alpha_1..n "和集合"
      (setE $alpha_1 $..h $alpha_n) "之间有什么区别呢? "
      "存在两种区别, 等同性和顺序." (Br)
      "如果我们讨论集合" (setE $alpha_1 $..h $alpha_n)
      ", 通常已经假定向量" alpha_1..n
      "之中没有两个向量是相同的. 对于序列" alpha_1..n
      "而言, 可能每个" $alpha_i "都是相同的向量. 若对于某" (&!= $i $j)
      "有" (&= $alpha_i $alpha_j) ", 那么序列"
      alpha_1..n "是线性相关的:"
      (MB (&= (&+ $alpha_i (&i* (@ $-1) $alpha_j)) $0))
      "因此, 如果" alpha_1..n "是线性无关的, 那么"
      "它们就是互异的, 并且我们可以讨论集合" (setE $alpha_1 $..h $alpha_n)
      ", 知道其中有" $n "个向量. 显然, 在讨论基和维数的时候, 这"
      "不会引起什么歧义. 有限维向量空间" $V "的维数就是满足存在" $V "中线性无关的"
      $n "元向量组的最大的" $n ", 诸如此类. 若是读者感到本段杂乱无章而"
      "毫无内容可言, 那么他该问问自己向量"
      (MB (&cm (&= $alpha_1 (tu0 (^ $e (&/ $pi $2)) $1))
               (&= $alpha_2 (tu0 (Mroot 110 $3) $1))))
      "在" $RR^2 "中是否线性无关." (Br)
      "一个序列的元素以特定的顺序被枚举出来. 一个集合是对象的合集, 而"
      "没有预先给定的排列或顺序. 当然, 为了描述一个集合, 我们或许会"
      "列出其成员, 而这就需要挑选一个顺序. 但是, 顺序不是集合的一部分. "
      "集合" (setE $1 $2 $3 $4) "和" (setE $4 $3 $2 $1) "是等同的, 而序列"
      (&cm $1 $2 $3 $4) "与" (&cm $4 $3 $2 $1) "相当不同. "
      "序列的顺序方面并不影响线性相关或者无关, 因为线性相关性 (根据定义) "
      "并不受顺序影响. 序列" (&cm $alpha_n $..h $alpha_1)
      "线性相关当且仅当序列" alpha_1..n "线性相关. "
      "在下一节中, 顺序将变得重要起来.")
   ((exercise #:n "1")
    "证明如果两个向量线性相关, 那么其中一个是另一个的标量倍数.")
   ((exercise #:n "2")
    "向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $2 $4))
             (&= $alpha_2 (tu0 $2 $-1 $-5 $2))
             (&= $alpha_3 (tu0 $1 $-1 $-4 $0))
             (&= $alpha_4 (tu0 $2 $1 $1 $6))
             ))
    "在" $RR^4 "中线性无关吗?")
   ((exercise #:n "3")
    "找到由练习2的四个向量张成的" $RR^4 "的子空间的一个基.")
   ((exercise #:n "4")
    "证明向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $2 $1))
             (&= $alpha_3 (tu0 $0 $-3 $2))))
    "构成了" $RR^3 "的一个基. 将每个标准基向量表达为"
    (&cm $alpha_1 $alpha_2 $alpha_3) "的线性组合.")
   ((exercise #:n "5")
    "找出" $RR^3 "中的三个向量, 它们线性相关, 但是两两线性无关.")
   ((exercise #:n "6")
    "令" $V "是域" $F "上的" 2*2 "矩阵的向量空间. "
    "通过给出" $V "的一个具有四个元素的基, 证明" $V "的维数是" $4 ".")
   ((exercise #:n "7")
    "令" $V "是练习6的向量空间, 令" $W_1 "是由形式为"
    (MB (Mat ($x (&- $x))
             ($y $z)))
    "的矩阵构成的集合, 令" $W_2 "是由形式为"
    (MB (Mat ($a $b)
             ((&- $a) $c)))
    "的矩阵构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W_1 "和" $W_2 "是" $V "的子空间.")
        (Li "找出" (&cm $W_1 $W_2 (&+ $W_1 $W_2) (&cap $W_1 $W_2))
            "的维数.")))
   ((exercise #:n "8")
    "又一次令" $V "是域" $F "上的" 2*2 "矩阵的向量空间. "
    "找出" $V "的一个基" (setE $A_1 $A_2 $A_3 $A_4)
    "满足对于每个" $j "有" (&= (_^ $A $j $2) $A_j) ".")
   ((exercise #:n "9")
    "令" $V "是复数域的一个子域" $F "上的一个向量空间. "
    "设" (&cm $alpha $beta $gamma) "是" $V "中线性无关的向量. 证明"
    (&cm (@ (&+ $alpha $beta))
         (@ (&+ $beta $gamma))
         (@ (&+ $gamma $alpha)))
    "是线性无关的.")
   ((exercise #:n "10")
    "令" $V "是域" $F "上的一个向量空间. 设有限数目的向量"
    (&cm $alpha_1 $..h $alpha_r) "能够张成" $V ". 证明"
    $V "是有限维的.")
   ((exercise #:n "11")
    "令" $V "是复数域上所有满足" (&= (&+ (mref $A $1 $1) (mref $A $2 $2)) $0)
    "的" 2*2 "矩阵" $A "构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明在通常的运算下, " $V "是实数域上的向量空间.")
        (Li "找出该向量空间的一个基.")
        (Li "令" $W "为" $V "中满足"
            (&= (mref $A $2 $1) (&- (OverBar (mref $A $1 $2))))
            "的矩阵" $A "的集合, 其中横杠代表复数共轭. 证明"
            $W "是" $V "的子空间并找出" $W "的一个基.")))
   ((exercise #:n "12")
    "通过找出向量空间的一个基, 证明域" $F "上的" m*n
    "矩阵构成的向量空间的维数是" (&i* $m $n) ".")
   ((exercise #:n "13")
    "讨论练习9, 其中" $V "是二元域上的向量空间. 二元域见第1.2节的练习5.")
   ((exercise #:n "14")
    "令" $V "是实数集合. 若将" $V "视为有理数域上的向量空间 (带有通常的运算), "
    "证明该向量空间不是有限维的.")
   (H3 "第2.4节 坐标")
   (P $n "维空间" $V "的基" $BBB "的诸多有用性质之一在于, 它允许人们在" $V
      "中引入与空间" $F^n "中的向量" (&= $alpha (tu0 $x_1 $..h $x_n))
      "的&quot;自然坐标&quot;" $x_i "类似的东西. 沿此进路, " $V
      "中的向量" $alpha "相对于基" $BBB "的坐标将会是用于将" $alpha
      "表达为基中向量的线性组合的标量. 因此, 我们想要将" $F^n
      "中的向量" $alpha "的自然坐标视为由" $alpha "和" $F^n
      "的标准基定义的. 然而, 若是采取此法, 我们必须足够小心. 如果"
      (MB (&= $alpha (tu0 $x_1 $..h $x_n)
              (sum (&= $i $1) $n (&i* $x_i $epsilon_i))))
      "而" $BBB "是" $F^n "的标准基, 那么" $alpha "的坐标是如何由"
      $BBB "和" $alpha "决定的呢? 一种组织回答的方式如下. 给定的"
      $alpha "作为标准基向量的线性组合的表达是唯一的, 并且" $alpha "的第"
      $i "个坐标" $x_i "就是该表达下" $epsilon_i "的系数. 以此观点来看, "
      "我们之所以能够言称何谓第" $i "个坐标, 是因为我们已经为标准基中"
      "的向量安排了&quot;自然&quot;的顺序. 也就是说, 我们拥有一个规则来"
      "确定哪一个是基中&quot;第一&quot;的向量, 哪一个是基中&quot;第二&quot;的向量, "
      "诸如此类. 如果" $BBB "是"$n "维空间" $V "的任意一个基, 那么可能" $BBB "中的"
      "向量并没有什么自然的顺序. 因此, 在我们能够定义&quot;" $alpha "相对于"
      $BBB "的第" $i "个坐标&quot;之前, 就有必要为这些向量施加一个顺序. 换言之, "
      "坐标将相对于向量的序列而不是向量的集合进行定义.")
   ((definition)
    "如果" $V "是一个有限维向量空间, 那么" $V "的一个有序基是一个向量的有限序列, 其"
    "线性无关并可张成" $V ".")
   (P "如果序列" alpha_1..n "是" $V "的一个有序基, 那么集合"
      (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基. 有序基不过就是基的集合, "
      "带上一个指定的顺序. 我们将稍微滥用一下符号, 言称"
      (MB basis:def)
      "是" $V "的一个有序基. 这不仅确定了什么是基的向量, 也刻画了顺序.")
   (P "现在我们设" $V "是域" $F "上的一个有限维向量空间, 并且"
      (MB basis:def)
      "是" $V "的一个有序基. 给定" $V "中的" $alpha ", 存在唯一的一个标量的"
      $n "元组满足"
      (MB (&= $alpha (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
      "之所以这个" $n "元组是唯一的, 是因为若我们同样有"
      (MB (&= $alpha (sum (&= $i $1) $n (&i* $z_i $alpha_i))))
      "那么"
      (MB (&= (sum (&= $i $1) $n (&i* (@ (&- $x_i $z_i)) $alpha_i)) $0))
      "并且" $alpha_i "的线性无关性告诉我们对于每个" $i "有"
      (&= (&- $x_i $z_i) $0) ". 我们称" $x_i "为" $alpha "相对于有序基"
      (MB basis:def) "的第" $i
      "个坐标. 如果"
      (MB (&= $beta (sum (&= $i $1) $n (&i* $y_i $alpha_i))))
      "那么"
      (MB (&= (&+ $alpha $beta)
              (sum (&= $i $1) $n
                   (&i* (@ (&+ $x_i $y_i)) $alpha_i))))
      "于是" (@ (&+ $alpha $beta)) "在此有序基之下的第" $i
      "个坐标是" (@ (&+ $x_i $y_i)) ". 类似地, " (@ (&i* $c $alpha))
      "的第" $i "个坐标是" (&i* $c $x_i) ". 读者也应该注意到每个" $F
      "中的" $n "元组" (tu0 $x_1 $..h $x_n) "也是" $V "中某个向量的坐标的"
      $n "元组, 即"
      (MB (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
   (P "总结一下, 每个" $V "的有序基都确定了一个" $V "的所有向量的集合与"
      $F^n "的所有" $n "元组的集合之间的一一对应"
      (MB (&\|-> $alpha (tu0 $x_1 $..h $x_n)))
      "这个对应拥有以下性质. " (@ (&+ $alpha $beta)) "的像是"
      $F^n "中" $alpha "和" $beta "的像之和, 以及" (@ (&i* $c $alpha))
      "的像是" $F^n "中的标量" $c "与" $alpha "的像之积.")
   (P "有的读者或许想问为什么在此时此刻我们为什么不简单地选取一个" $V
      "的有序基然后将" $V "的每个向量描述为与之对应的坐标" $n
      "元组, 因为若是这样的话, 我们就可以获得只与" $n
      "元组打交道之便. 这违背了我们的目的, 出于两个原因. 首先, "
      "正如我们对于向量空间的公理化定义所暗示的那样, 我们试图研究"
      "如何将向量空间作为抽象的代数系统进行推理. 其次, 即便是在那些我们"
      "使用坐标的场合, 有的重要结果来源于我们能够改变坐标系统的能力, "
      "即改变有序基的能力.")
   (P "往往对于我们而言使用" $alpha "相对于" $BBB "的坐标矩阵"
      (MB (&= $X (Mat ($x_1) ($..v) ($x_n))))
      "而不是坐标" $n "元组" (tu0 $x_1 $..h $x_n) "更加方便. 为了指明"
      "坐标矩阵依赖于哪个基, 我们将使用符号"
      (MB (coordm $alpha))
      "来表示向量" $alpha "相对于有序基" $BBB "的坐标矩阵. "
      "从一个有序基变到另一个有序基时, 这个记号对于描述向量" $alpha
      "的坐标发生了什么变化是特别有用的.")
   (P "接着, 我们设" $V "是" $n "维的, 并且"
      (MB basis:def
          (% "和")
          (&= $BBB^
              (setE (_^ $alpha $1 $prime) $..h
                    (_^ $alpha $n $prime))))
      "是" $V "的两个有序基. "
      "存在唯一的标量" (mref $P $i $j) "满足"
      (MB (&cm
           (&= (_^ $alpha $j $prime)
               (sum (&= $i $1) $n
                    (&i* (mref $P $i $j) $alpha_i)))
           (&<= $1 $j $n)))
      "令" (&cm (_^ $x $1 $prime) $..h (_^ $x $n $prime))
      "是给定的向量" $alpha "相对于有序基" $BBB^
      "的坐标, 那么"
      (MB (deriv $alpha
                 (LC0 (_^ $x $1 $prime) (_^ $alpha $1 $prime)
                      (_^ $x $n $prime) (_^ $alpha $n $prime))
                 (sum (&= $j $1) $n
                      (&i* (_^ $x $j $prime) (_^ $alpha $j $prime)))
                 (sum (&= $j $1) $n
                      (&i* (_^ $x $j $prime)
                           (sum (&= $i $1) $n
                                (&i* (mref $P $i $j) $alpha_i))))
                 (sum (&= $j $1) $n
                      (sum (&= $i $1) $n
                           (&i* (@ (&i* (mref $P $i $j) (_^ $x $j $prime)))
                                $alpha_i)))
                 (sum (&= $i $1) $n
                      (&i* (pare
                            (sum (&= $j $1) $n
                                 (&i* (mref $P $i $j) (_^ $x $j $prime))))
                           $alpha_i))))
      "因此我们就得到关系"
      (MB (&= $alpha
              (sum (&= $i $1) $n
                   (&i* (pare
                         (sum (&= $j $1) $n
                              (&i* (mref $P $i $j) (_^ $x $j $prime))))
                        $alpha_i))))
      "既然" $alpha "在有序基" $BBB "下的坐标" (&cm $x_1 $..h $x_n)
      "是被唯一确定的, 那么"
      (MB (&cm (&= $x_i
                   (sum (&= $j $1) $n
                        (&i* (mref $P $i $j) (_^ $x $j $prime))))
               (&<= $1 $i $n)))
      "令" $P "是一个" n*n "矩阵, 其第" $i "行" $j "列的元素是标量"
      (mref $P $i $j) "并令" $X "和" $X^ "分别是" $alpha "在基"
      $BBB "和" $BBB^ "下的坐标矩阵, 那么我们可以重新表达上述结果为"
      (MB (&= $X (&i* $P $X^)))
      "既然" $BBB "和" $BBB^ "都是线性无关的, 那么" (&= $X $0)
      "当且仅当" (&= $X^ $0) ". 根据第1章的定理7, " $P "是可逆的, 于是"
      (MB (&= $X^ (&i* (inv $P) $X)))
      "若我们使用之前引入的向量相对于某个有序基的坐标矩阵的记号, 那么"
      (MB (&cm (&= (coordm $alpha)
                   (&i* $P (coordm $alpha $BBB^)))
               (&= (coordm $alpha $BBB^)
                   (&i* (inv $P) (coordm $alpha)))))
      "因而之前的讨论可以被总结如下.")
   ((theorem #:n "7")
    "令" $V "是域" $F "上的" $n "维向量空间, 令" $BBB "和" $BBB^
    "是" $V "的两个有序基, 那么存在一个唯一的且必然可逆的域" $F
    "上的" n*n "矩阵" $P "满足"
    (MB (&cm (&= (coordm $alpha)
                 (&i* $P (coordm $alpha $BBB^)))
             (&= (coordm $alpha $BBB^)
                 (&i* (inv $P) (coordm $alpha)))))
    "对于每个" $V "中的向量" $alpha "成立. " $P "的列由"
    (MB (&cm (&= $P_j (coordm (_^ $alpha $j $prime) $BBB))
             (&= $j (&cm $1 $..h $n))))
    "给出.")
   (P "为了使上面的分析完整, 我们还需要证明以下结果.")
   ((theorem #:n "8")
    "设" $P "是域" $F "上的一个" n*n "可逆矩阵. 令" $V
    "是域" $F "上的一个" $n "维向量空间, 令" $BBB
    "是" $V "的一个有序基. 那么, 存在唯一的一个" $V
    "的有序基" $BBB^ "满足"
    (MB (&cm (&= (coordm $alpha)
                 (&i* $P (coordm $alpha $BBB^)))
             (&= (coordm $alpha $BBB^)
                 (&i* (inv $P) (coordm $alpha)))))
    "对于每个" $V "中的向量" $alpha "成立.")
   ((proof)
    "令" $BBB "由向量" alpha_1..n "构成. 如果"
    (&= $BBB^
        (setE (_^ $alpha $1 $prime) $..h
              (_^ $alpha $n $prime)))
    "是满足第一条的" $V "的有序基, 那么显然有"
    (MB (&= (_^ $alpha $j $prime)
            (sum (&= $i $1) $n
                 (&i* (mref $P $i $j) $alpha_i))))
    "因此我们只需要证明由这些等式定义的向量"
    (_^ $alpha $j $prime) "的确构成了一个基. 令"
    (&= $Q (inv $P)) ", 那么"
    (MB (deriv (sum $j $ (&i* (mref $Q $j $k) (_^ $alpha $j $prime)))
               (sum $j $ (&i* (mref $Q $j $k)
                              (sum $i $ (&i* (mref $P $i $j) $alpha_i))))
               (sum $j $
                    (sum $i $
                         (&i* (mref $P $i $j) (mref $Q $j $k) $alpha_i)))
               (sum $i $
                    (&i* (pare (sum $j $ (&i* (mref $P $i $j) (mref $Q $j $k))))
                         $alpha_i))
               $alpha_k))
    "故由集合"
    (MB (&= $BBB^
            (setE (_^ $alpha $1 $prime) $..h
                  (_^ $alpha $n $prime))))
    "张成的子空间包含" $BBB ", 因而等于" $V ". 于是, " $BBB^
    "是一个基. 根据其定义和定理7, 显然第一条是成立的, 第二条也是.")
   ((example #:n "18")
    "令" $F "是一个域, 令"
    (MB (&= $alpha (tu0 $x_1 $x_2 $..h $x_n)))
    "是一个" $F^n "中的向量. 如果" $BBB "是" $F^n "的标准有序基, 即"
    (MB (&= $BBB (setE $epsilon_1 $..h $epsilon_n)))
    "那么向量" $alpha "在基" $BBB "下的坐标矩阵为"
    (MB (&= (coordm $alpha)
            (Mat ($x_1) ($x_2) ($..v) ($x_n)))))
   ((example #:n "19")
    "令" $RR "是实数域, 令" $theta "是一个固定的实数. 矩阵"
    (MB (&= $P (Mat ((&cos $theta) (&- (&sin $theta)))
                    ((&sin $theta) (&cos $theta)))))
    "是可逆的, 其逆为"
    (MB (&= (inv $P)
            (Mat ((&cos $theta) (&sin $theta))
                 ((&- (&sin $theta)) (&cos $theta)))))
    "因此, 对于每个" $theta ", 由向量" (tu0 (&cos $theta) (&sin $theta))
    "和" (tu0 (&- (&sin $theta)) (&cos $theta)) "构成的集合" $BBB^
    "是" $RR^2 "的一个基. 从直觉上说, 这个基可被描述为由标准基旋转角度"
    $theta "得到的. 如果" $alpha "是向量" (tu0 $x_1 $x_2) ", 那么"
    (MB (&= (coordm $alpha $BBB^)
            (&i* (Mat ((&cos $theta) (&sin $theta))
                      ((&- (&sin $theta)) (&cos $theta)))
                 (Mat ($x_1) ($x_2)))))
    "或者"
    (MB (&cm (&= (_^ $x $1 $prime)
                 (&+ (&i* $x_1 (&cos $theta))
                     (&i* $x_2 (&sin $theta))))
             (&= (_^ $x $2 $prime)
                 (&+ (&i* (&- $x_1) (&sin $theta))
                     (&i* $x_2 (&cos $theta)))))
        (% ".")))
   ((example #:n "20")
    "令" $F "是复数域的一个子域. 矩阵"
    (MB (&= $P (Mat ($-1 $4 $5)
                    ($0 $2 $-3)
                    ($0 $0 $8))))
    "是可逆的, 其逆为"
    (MB (&= (inv $P)
            (Mat ($-1 $2 11/8)
                 ($0 $1/2 3/16)
                 ($0 $0 1/8))))
    "因此向量"
    (MB (&cm (&= (_^ $alpha $1 $prime)
                 (tu0 $-1 $0 $0))
             (&= (_^ $alpha $2 $prime)
                 (tu0 $4 $2 $0))
             (&= (_^ $alpha $3 $prime)
                 (tu0 $5 $-3 $8))))
    "构成了" $F^3 "的一个基" $BBB^ ". 向量"
    (&= $alpha (tu0 $x_1 $x_2 $x_3)) "在基" $BBB^
    "下的坐标"
    (&cm (_^ $x $1 $prime)
         (_^ $x $2 $prime)
         (_^ $x $3 $prime))
    "由"
    (MB (&= (Mat ((_^ $x $1 $prime))
                 ((_^ $x $2 $prime))
                 ((_^ $x $3 $prime)))
            (Mat ((&+ (&- $x_1) (&i* $2 $x_2) (&i* 11/8 $x_3)))
                 ((&+ (&i* $1/2 $x_2) (&i* 3/16 $x_3)))
                 ((&i* 1/8 $x_3)))
            (&i* (Mat ($-1 $2 11/8)
                      ($0 $1/2 3/16)
                      ($0 $0 1/8))
                 (Mat ($x_1) ($x_2) ($x_3)))))
    "特别地,"
    (MB (&= (tu0 $3 $2 $-8)
            (&- (&i* -10 (_^ $alpha $1 $prime))
                (&i* $1/2 (_^ $alpha $2 $prime))
                (_^ $alpha $3 $prime)))))
   ((exercise #:n "1")
    "证明向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $0 $0))
             (&= $alpha_2 (tu0 $0 $0 $1 $1))
             (&= $alpha_3 (tu0 $1 $0 $0 $4))
             (&= $alpha_4 (tu0 $0 $0 $0 $2))))
    "构成了" $RR^4 "的一个基. 找出每个标准基向量在有序基"
    (setE $alpha_1 $alpha_2 $alpha_3 $alpha_4)
    "下的坐标.")
   ((exercise #:n "2")
    "找出向量" (tu0 $1 $0 $1) "在" $CC^3 "的有序基"
    (&cm (tu0 (&i* $2 $i) $1 $0) (tu0 $2 $-1 $1) (tu0 $0 (&+ $1 $i) (&- $1 $i)))
    "下的坐标矩阵.")
   ((exercise #:n "3")
    "令" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "是由"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $1 $1))
             (&= $alpha_3 (tu0 $1 $0 $0))))
    "构成的" $RR^3 "的有序基. 那么, 向量" (tu0 $a $b $c)
    "在有序基" $BBB "下的坐标是什么呢?")
   ((exercise #:n "4")
    "令" $W "是由" (&= $alpha_1 (tu0 $1 $0 $i)) "和" (&= $alpha_2 (tu0 (&+ $1 $i) $1 $-1))
    "张成的" $CC^3 "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $alpha_1 "和" $alpha_2 "构成了" $W "的一个基.")
        (Li "证明" (&= $beta_1 (tu0 $1 $1 $0)) "和" (&= $beta_2 (tu0 $1 $i (&+ $1 $i)))
            "也在" $W "中并且构成了" $W "的另一个基.")
        (Li $alpha_1 "和" $alpha_2 "在" $W "的有序基" (setE $beta_1 $beta_2)
            "下的坐标是什么?")))
   ((exercise #:n "5")
    "令" (&= $alpha (tu0 $x_1 $x_2)) "和" (&= $beta (tu0 $y_1 $y_2)) "是" $RR^2 "中满足"
    (MB (&cm (&= (&+ (&i* $x_1 $y_1) (&i* $x_2 $y_2)) $0)
             (&= (&+ (_^ $x $1 $2) (_^ $x $2 $2))
                 (&+ (_^ $y $1 $2) (_^ $y $2 $2))
                 $1)))
    "的向量. 证明" (&= $BBB (setE $alpha $beta)) "是" $RR^2 "的一个基. 找出向量" (tu0 $a $b)
    "在有序基" (&= $BBB (setE $alpha $beta)) "下的坐标. (" $alpha "和" $beta
    "上的条件, 从几何上说, 指的是" $alpha "和" $beta "垂直, 并且每个长度均为" $1 ".)")
   ((exercise #:n "6")
    "令" $V "是一个复数域上的向量空间, 其由所有从" $RR "到" $CC "的函数构成, 即实轴上所有复值函数的空间. 令"
    (&cm (&= (app $f_1 $x) $1) (&= (app $f_2 $x) (^ $e (&i* $i $x)))
         (&= (app $f_3 $x) (^ $e (&- (&i* $i $x)))))
    "."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&cm $f_1 $f_2 $f_3) "是线性无关的.")
        (Li "令" (&cm (&= (app $g_1 $x) $1) (&= (app $g_2 $x) (&cos $x)) (&= (app $g_3 $x) (&sin $x)))
            ", 找出一个" (&c* $3 $3) "的矩阵" $P "满足"
            (MB (&= $g_j (sum (&= $i $1) $3 (&i* (mref $P $i $j) $f_i))) "."))))
   ((exercise #:n "7")
    "令" $V "是所有阶数小于等于" $2 "的从" $RR "到" $RR "的多项式函数构成的(实)向量空间, 即由所有形式为"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "的函数" $f "构成的空间. 令" $t "是一个固定的实数, 定义"
    (MB (&cm (&= (app $g_1 $x) $1) (&= (app $g_2 $x) (&+ $x $t)) (&= (app $g_3 $x) (^ (@+ $x $t) $2))))
    "证明" (&= $BBB (setE $g_1 $g_2 $g_3)) "是" $V "的一个基. 如果"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "那么" $f "在此有序基" $BBB "下的坐标是什么呢?")
   (H3 "第2.5节 行等价的总结")
   (P "本节我们将利用一些有限维向量空间基和维数的基本事实来完成我们对于"
      "矩阵的行等价性的讨论. 回忆一下, 如果" $A "是域" $F "上的一个"
      m*n "矩阵, 那么" $A "的行向量是" $F^n "中的向量"
      (&cm $alpha_1 $..h $alpha_m) ", 由"
      (MB (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n))))
      "定义. " $A "的行空间是由这些向量张成的" $F^n "的子空间. " $A
      "的行秩是" $A "的行空间的维数.")
   (P "如果" $P "是域" $F "上的一个" (&c* $k $m) "矩阵, 那么积"
      (&= $B (&i* $P $A)) "是一个" (&c* $k $n) "矩阵, 其行向量"
      (&cm $beta_1 $..h $beta_k) "分别为线性组合"
      (MB (&= $beta_i
              (LC0 (mref $P $i $1) $alpha_1
                   (mref $P $i $m) $alpha_m)))
      "因此, " $B "的行空间是" $A "的行空间的一个子空间. 如果"
      $P "是一个" m*m "的可逆矩阵, 那么" $B "行等价于"
      $A ", 于是根据行等价的对称性, 或者等式" (&= $A (&i* (inv $P) $B))
      ", 可知" $A "的行空间也是" $B "的行空间的一个子空间.")
   ((theorem #:n "9")
    "行等价的矩阵拥有相同的子空间.")
   (P "因而我们发现为了研究" $A "的行空间, 研究与" $A
      "行等价的行简化阶梯矩阵的行空间也是一样的. 接下来我们就要这么做.")
   ((theorem #:n "10")
    "令" $R "是一个非零的行简化阶梯矩阵, 那么" $R "的非零行向量构成了" $R
    "的行空间的一个基.")
   ((proof)
    "令" (&cm $rho_1 $..h $rho_r) "是" $R "的非零行向量, 那么显然这些向量可以张成"
    $R "的行空间, 因此我们只需证明它们线性无关即可. 既然" $R "是一个行简化阶梯矩阵, "
    "那么存在正整数" (&cm $k_1 $..h $k_r) "满足对于" (&<= $i $r) ","
    (Ol #:attr* '((type "a"))
        (Li (&= (appl $R $i $j) $0) "若" (&< $j $k_i) ";")
        (Li (&= (appl $R $i $k_j) δij) ";")
        (Li (&< $k_1 $..c $k_r) "."))
    "设" (&= $beta (tu0 $b_1 $..h $b_n)) "是" $R "的行空间的一个向量:"
    (MB (&= $beta (LC0 $c_1 $rho_1 $c_r $rho_r)))
    "那么我们发现" (&= $c_j (_ $b $k_j)) ", 因为"
    (MB (deriv (_ $b $k_j)
               (sum (&= $i $1) $r
                    (&i* $c_i (appl $R $i $k_j)))
               (sum (&= $i $1) $r
                    (&i* $c_i δij))
               $c_j))
    "特别地, 如果" (&= $beta $0) ", 即如果" (&= (LC0 $c_1 $rho_1 $c_r $rho_r) $0)
    ", 那么" $c_j "必须是零向量的第" $k_j "个分量, 于是"
    (&cm (&= $c_j $0) (&= $j (&cm $1 $..h $r))) ". 因此, " (&cm $rho_1 $..h $rho_r)
    "是线性无关的.")
   ((theorem #:n "11")
    "令" $m "和" $n "是正整数, 令" $F "是一个域. 设" $W "是" $F^n "的一个子空间, 并且"
    (&<= (&dim $W) $m) ". 那么, 存在唯一的一个域" $F "上的" m*n "的行简化阶梯矩阵以"
    $W "作为其行空间.")
   ((proof)
    "至少存在一个以" $W "为行空间的" m*n "的行简化阶梯矩阵, 因为既然" (&<= (&dim $W) $m)
    ", 我们可以挑选出" $W "中的某" $m "个向量" (&seq $alpha #:to $m) "张成" $W ". 令" $A
    "是以" (&seq $alpha #:to $m) "为行向量的" m*n "矩阵, 令" $R "是与" $A "行等价的"
    "行简化阶梯矩阵, 那么" $R "的行空间就是" $W "." (Br)
    "现在令" $R "是任意的以" $W "为行空间的行简化阶梯矩阵, 令" (&seq $rho #:to $r)
    "是" $R "的非零行向量, 设" $rho_i "的首非零元在第" $k_i "列, " (&= $i (&cm $1 $..h $r))
    ". 向量" (&seq $rho #:to $r) "构成了" $W "的一个基. 在定理10的证明中, 我们观察到如果"
    (&= $beta (tu0 $b_1 $..h $b_n)) "在" $W "之中, 那么有"
    (MB (&= $beta (LC0 $c_1 $rho_1 $c_r $rho_r)) ",")
    "并且" (&= $c_i (_ $b $k_i)) ". 换句话说, " $beta "作为" (&seq $rho #:to $r)
    "的线性组合的唯一表示即"
    (MB (&= $beta (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))))
    "因此若读者知道了坐标分量" (&cm (_ $b $k_i) (&= $i (&cm $1 $..h $r))) ", 那么向量"
    $beta "就是确定的了. 例如, " $rho_s "可以被描述为" $W "中唯一的第" $k_s "个坐标为"
    $1 ", 第" $k_i "个坐标为" $0 "的向量, 其中" (&!= $i $s) "." (Br)
    "设" $beta "在" $W "之中而" (&!= $beta $0) ". 我们证明" $beta "的首非零元出现在某第"
    $k_s "列. 既然"
    (MB (&= $beta (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))))
    "且" (&!= $beta $0) ", 我们可以记"
    (MB (&cm (&= $beta (sum (&= $i $s) $r (&i* (_ $b $k_i) $rho_i)))
             (&!= (_ $b $k_s) $0)))
    "[译注: 根据上下文可知, 这个" $s "是满足" (&!= (_ $b $k_s) $0) "的最小的整数.] "
    "根据行简化阶梯矩阵的条件, 我们知道若有" (&> $i $s) "和" (&<= $j $k_s) ", 那么"
    (&= (mref $R $i $j) $0) ", 于是"
    (MB (&cm (&= $beta (tu0 $0 $..h $0 (_ $b $k_s) $..h $b_n))
             (&!= (_ $b $k_s) $0)))
    $beta "的首非零元即出现在第" $k_s "列. 读者也应该注意到, 对于每个"
    (&cm $k_s (&= $s (&cm $1 $..h $r))) ", 存在一个" $W "中的向量, 其第" $k_s
    "个分量不为零, 即" $rho_s "." (Br)
    "现在看来" $R "由" $W "唯一决定是很清晰的了. 基于" $W "对于" $R "的刻画如下. "
    "我们考虑所有" $W "中的向量" $beta ". 如果" (&!= $beta $0) ", 那么" $beta
    "的首非零元必然出现在某第" $t "列之中:"
    (MB (&cm (&= $beta (tu0 $0 $..h $0 $b_t $..h $b_n)) (&!= $b_t $0)))
    "令" (&seq $k #:to $r) "是那些正整数" $t ", 满足存在" $W "中的某个" (&!= $beta $0)
    "其首非零元出现在第" $t "列. 将" (&seq $k #:to $r) "按照"
    (&< $k_1 $k_2 $..c $k_r) "的顺序排列. 对于每个正整数" $k_s "存在唯一的" $W "中的向量"
    $rho_s "满足" $rho_s "的第" $k_s "个分量为" $1 ", 第" $k_i "个分量为" $0 ", 其中"
    (&!= $i $s) ". 那么, " $R "就是以" (&cm $rho_1 $..h $rho_r $0 $..h $0)
    "为行向量的行简化阶梯矩阵.")
   ((corollary)
    "每个" m*n "矩阵" $A "都行等价于唯一的一个行简化阶梯矩阵.")
   ((proof)
    "我们知道" $A "至少行等价于一个行简化阶梯矩阵" $R ". 如果" $A "还行等价于另一个这样的矩阵"
    $R^ ", 那么" $R "行等价于" $R^ ". 因此, " $R "和" $R^ "拥有相同的行空间, 必然是等同的.")
   ((corollary)
    "令" $A "和" $B "是域" $F "上的" m*n "矩阵, 那么" $A "与" $B "行等价当且仅当"
    "它们拥有相同的行空间.")
   ((proof)
    "我们已经知道如果" $A "和" $B "行等价, 那么它们拥有相同的行空间. 于是, 设" $A "和" $B
    "拥有相同的行空间. 现在, " $A "行等价于一个行简化阶梯矩阵" $R ", " $B
    "行等价于一个行简化阶梯矩阵" $R^ ". 既然" $A "和" $B "拥有相同的行空间, 那么" $R
    "和" $R^ "也拥有相同的行空间. 因此" (&= $R $R^) ", " $A "行等价于" $B ".")
   (P "总结一下, 如果" $A "和" $B "是域" $F "上的" m*n "矩阵, 那么以下陈述等价:"
      (Ol (Li $A "和" $B "行等价.")
          (Li $A "和" $B "拥有相同的行空间.")
          (Li (&= $B (&i* $P $A)) ", 其中" $P "是一个" m*m "的可逆矩阵."))
      "第4条等价的陈述其实是齐次线性方程组" AX=0 "和" (LE $B $X $0) "拥有相同的解. "
      "然而, 尽管我们知道" $A "与" $B "的行等价可以推出这两个方程组拥有相同的解, "
      "似乎最好将反方向的证明留到后面再说.")
   (H3 "第2.6节 关于子空间的计算")
   (P "现在我们想要展示初等行变换是如何为回答与" $F^n "的子空间有关的特定问题提供"
      "一种标准化的方法的. 我们已经推导出了所有我们将用到的事实. 为了读者的方便, "
      "它们被总结在这里. 这里的讨论适用于任何域" $F "上的" $n "维向量空间, 只需要"
      "选取一个固定的有序基" $BBB ", 然后每个" $V "中的向量" $alpha "就可由" $n
      "元组" (&cm $x_1 $..h $x_n) "刻画, 其给出了" $alpha "在有序基" $BBB
      "下的坐标.")
   (P "假设给定了" $F^n "中的" $m "个向量" (&seq $alpha #:to $m)
      ", 我们考虑下列问题."
      (Ol (Li "如何判定向量" (&seq $alpha #:to $m) "是否线性相关? "
              "更一般地, 如何找出由这些向量张成的子空间" $W "的维数?")
          (Li "给定" $F^n "中的" $beta ", 如何判定" $beta
              "是否是" (&seq $alpha #:to $m) "的线性组合, 即" $beta
              "是否在子空间" $W "中?")
          (Li "如何给出子空间" $W "的一个显式描述?"))
      "第三个问题有些模糊, 因为它没有说明什么叫做一个&quot;显式描述&quot;. "
      "然而, 我们将给出我们心中所想的这种描述以扫清模糊. 根据这种描述, "
      "问题一和问题二都可以立即回答.")
   (P "令" $A "是一个带有行向量" $alpha_i "的" m*n "矩阵:"
      (MB (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n))) ".")
      "施行一系列初等行变换, 自" $A "始, 终于行简化阶梯矩阵" $R
      ". 之前我们已经说明过这是怎样做的. 此时, " $W " (" $A "的行空间) 的维数是显然易见的, "
      "因为这个维数不过就是" $R "的非零行向量的数目. 如果" (&seq $rho #:to $r)
      "是" $R "的非零行向量, 那么" (&= $BBB (setE $rho_1 $..h $rho_r)) "是" $W
      "的一个基. 如果" $rho_i "的首非零元在第" $k_i "列, 那么对于" (&<= $i $r) "我们有"
      (MB (&= (appl $R $i $j) $0) ", 如果" (&< $j $k_i) ";&nbsp;"
          (&= (appl $R $i $k_j) δij) ";&nbsp;"
          (&< $k_1 $..c $k_r) ".")
      "子空间" $W "由所有具有以下形式的向量构成:"
      (MB (deriv $beta
                 (LC0 $c_1 $rho_1 $c_r $rho_r)
                 (sum (&= $i $1) $r
                      (&i* $c_i (tu0 (mref $R $i $1) $..h (mref $R $i $n))))))
      "这样一个向量" $beta "的坐标" (&seq $b) "因此是"
      (MB (&= $b_j (sum (&= $i $1) $r (&i* $c_i (mref $R $i $j)))))
      "特别地, " (&= (_ $b $k_j) $c_j) ", 于是如果" (&= $beta (@seq $b)) "是" $rho_i
      "的线性组合, 那么它就必须是以下特定的线性组合."
      (MB (&= $beta (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))))
      "将此" $beta "上之条件转换为坐标形式即"
      (MB (&cm (&= $b_j (sum (&= $i $1) $r (&i* (_ $b $k_i) (mref $R $i $j))))
               (&= $j (&cm $1 $..h $n))))
      "这就是由" (&cm $alpha_1 $..h $alpha_m) "张成的子空间" $W "的显式描述, 即这个子空间由所有"
      $F^n "中坐标满足显式描述的向量" $beta "构成. 显式描述是什么样的呢? 首先, 它将" $W
      "描述为某个齐次线性方程组的所有解" (&= $beta (tu0 $b_1 $..h $b_n))
      ". 这个方程组当然具有非常特别的性质, 因为它将" (@- $n $r) "个坐标表示为另外" $r
      "个特别坐标" (&cm (_ $b $k_1) $..h (_ $b $k_r)) "的线性组合. 坐标" (_ $b $k_i)
      "的选择是完全自由的, 也就是说, 如果" (&cm $c_1 $..h $c_r) "是任意的" $r "的标量, 那么"
      $W "中存在唯一的向量" $beta "满足以" $c_i "作为第" $k_i "个坐标.")
   (P "重要的点在于此: 给定向量" $alpha_i ", 行规约是一种确定整数" (&cm $r $k_1 $..h $k_r)
      "和标量" (mref $R $i $j) "的直接方法, 其给出了由" (&cm $alpha_1 $..h $alpha_m)
      "张成的子空间的显式描述. 读者应该注意到定理11表明每个" $F^n "的子空间" $W
      "都具有这样一个显式描述. 我们也应该指出问题2的一些东西. 我们已经在第1.4节陈述了如何"
      "找出一个" m*m "的可逆矩阵" $P "满足" (&= $R (&i* $P $A)) ". " $P
      "的知识允许我们在可能的情况下找出满足"
      (MB (&= $beta (LC0 $x_1 $alpha_1 $x_m $alpha_m)))
      "的标量" (&cm $x_1 $..h $x_m) ". 这是因为" $R "的行向量由"
      (MB (&= $rho_i (sum (&= $j $1) $m (&i* (mref $P $i $j) $alpha_j))))
      "给出, 于是若" $beta "是" $alpha_j "的线性组合, 那么我们有"
      (MB (deriv $beta
                 (sum (&= $i $1) $r (&i* (_ $b $k_i) $rho_i))
                 (sum (&= $i $1) $r
                      (&i* (_ $b $k_i)
                           (sum (&= $j $1) $m (&i* (mref $P $i $j) $alpha_j))))
                 (sum (&= $j $1) $m
                      (sum (&= $i $1) $r
                           (&i* (_ $b $k_i) (mref $P $i $j) $alpha_j)))))
      "因此"
      (MB (&= $x_j (sum (&= $i $1) $r (&i* (_ $b $k_i) (mref $P $i $j)))))
      "是" $x_j "的选择之一 (可能存在许多解).")
   (P "这样一个问题, 即" (&= $beta (tu0 $b_1 $..h $b_n)) "是否是" $alpha_i
      "的线性组合, 以及若是的情况下标量" $x_i "该是什么, 也可以通过问以下线性方程组"
      (MB (&cm (&= (sum (&= $i $1) $m (&i* (mref $A $i $j) $x_i)) $b_j)
               (&= $j (&cm $1 $..h $n))))
      "是否有解, 以及解是什么来得出答案. 这个线性方程组的系数矩阵是" (&c* $n $m)
      "的矩阵" $B ", 其列向量分别为" (&cm $alpha_1 $..h $alpha_m)
      ". 第1章中我们讨论了使用初等行变换来解这样一个线性方程组" (LE $B $X $Y)
      ". 让我们考虑一个例子, 其中我们采取两种观点来回答有关" $F^n "的子空间的问题.")
   ((example #:n "21")
    "让我们提出以下问题. 令" $W "是由向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $2 $2 $1))
             (&= $alpha_2 (tu0 $0 $2 $0 $1))
             (&= $alpha_3 (tu0 $-2 $0 $-4 $3))))
    "张成的" $RR^4 "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&cm $alpha_1 $alpha_2 $alpha_3) "是" $W
            "的一个基, 即这些向量是线性无关的.")
        (Li "令" (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4)) "是" $W "中的一个向量, 那么"
            $beta "相对于有序基" (setE $alpha_1 $alpha_2 $alpha_3)
            "的坐标是什么?")
        (Li "令"
            (MB (&cm (&= (_^ $alpha $1 $prime)
                         (tu0 $1 $0 $2 $0))
                     (&= (_^ $alpha $2 $prime)
                         (tu0 $0 $2 $0 $1))
                     (&= (_^ $alpha $3 $prime)
                         (tu0 $0 $0 $0 $3))))
            "证明" (&cm (_^ $alpha $1 $prime) (_^ $alpha $2 $prime) (_^ $alpha $3 $prime))
            "构成了" $W "的一个基.")
        (Li "如果" $beta "在" $W "中, 令" $X "是" $beta "相对于" $alpha "基的坐标矩阵, "
            $X^ "是相对于" $alpha^ "基的坐标矩阵. 找出" (&c* $3 $3) "的矩阵" $P
            "满足对于每个这样的" $beta "有" (&= $X (&i* $P $X^)) "."))
    "为了用第一种方法回答这些问题, 我们构造以" (&cm $alpha_1 $alpha_2 $alpha_3)
    "为行向量的矩阵" $A ", 并找出行等价于" $A "的行简化阶梯矩阵" $R
    ". 同时, 我们将相同的操作施行于恒等矩阵之上以获得满足" (&= $R (&i* $Q $A))
    "的可逆矩阵" $Q ":"
    (MB (&-> (Mat ($1 $2 $2 $1) ($0 $2 $0 $1) ($-2 $0 $-4 $3))
             (&= $R (Mat ($1 $0 $2 $0) ($0 $1 $0 $0) ($0 $0 $0 $1)))))
    (MB (&-> (Mat ($1 $0 $0) ($0 $1 $0) ($0 $0 $1))
             (&= $Q (&i* 1/6 (Mat ($6 $-6 $0) ($-2 $5 $-1) ($4 $-4 $2))))))
    (Ol #:attr* '((type "a"))
        (Li "显然" $R "的秩为" $3 ", 于是" (&cm $alpha_1 $alpha_2 $alpha_3)
            "是线性无关的.")
        (Li "什么样的向量" (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4))
            "在" $W "之中? 我们有" $W "的基" (&cm $rho_1 $rho_2 $rho_3)
            ", 即" $R "的行向量. 读者只需一眼即可看出" (&cm $rho_1 $rho_2 $rho_3)
            "张成的空间由所有满足" (&= $b_3 (&i* $2 $b_1)) "的向量" $beta
            "构成. 对于这样一个" $beta "我们有"
            (MB (deriv $beta
                       (&+ (&i* $b_1 $rho_1) (&i* $b_2 $rho_2) (&i* $b_3 $rho_3))
                       (&i* (Mat ($b_1 $b_2 $b_4)) $R)
                       (&i* (Mat ($b_1 $b_2 $b_4)) $Q $A)
                       (&+ (&i* $x_1 $alpha_1) (&i* $x_2 $alpha_2)
                           (&i* $x_3 $alpha_3))))
            "其中" (&= $x_i (&i* (Mat ($b_1 $b_2 $b_4)) $Q_i)) ":"
            (MB (set-attr*
                 (&Table
                  ($x_1 $= (: $b_1 $- (&i* $1/3 $b_2) $+ (&i* 2/3 $b_4)))
                  ($x_2 $= (: (&- $b_1) $+ (&i* 5/6 $b_2) $- (&i* 2/3 $b_4)))
                  ($x_3 $= (: (&i* -1/6 $b_2) $+ (&i* $1/3 $b_4))))
                 'columnalign "right")))
        (Li "向量" (&cm (_^ $alpha $1 $prime) (_^ $alpha $2 $prime) (_^ $alpha $3 $prime))
            "都具有" (tu0 $y_1 $y_2 $y_3 $y_4) "的形式, 其中" (&= $y_3 (&i* $2 $y_1))
            ", 因此它们都在" $W "中. 读者一眼就能看出它们是线性无关的.")
        (Li "矩阵" $P "以"
            (MB (&= $P_j (coordm (_^ $alpha $j $prime))))
            "为列, 其中" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3))
            ". 前面b里的结果已经告诉我们该如何找出"
            (&cm (_^ $alpha $1 $prime) (_^ $alpha $2 $prime) (_^ $alpha $3 $prime))
            "的坐标矩阵了. 例如, 若" (&= $beta (_^ $alpha $1 $prime)) "我们有"
            (&cm (&= $b_1 $1) (&= $b_2 $0) (&= $b_3 $2) (&= $b_4 $0)) ", 然后"
            (MB (set-attr*
                 (&Table
                  ($x_1 $= (: $1 $- (&i* $1/3 (@ $0)) $+ (&i* 2/3 (@ $0))) $= $1)
                  ($x_2 $= (: $-1 $+ (&i* 5/6 (@ $0)) $- (&i* 2/3 (@ $0))) $= $-1)
                  ($x_3 $= (: (&i* -1/6 (@ $0)) $+ (&i* $1/3 (@ $0))) $= $0))
                 'columnalign "right"))
            "因此" (&= (_^ $alpha $1 $prime) (&- $alpha_1 $alpha_2)) ". 类似地, 我们可以得到"
            (&= (_^ $alpha $2 $prime) $alpha_2) "和"
            (&= (_^ $alpha $3 $prime) (&+ (&- (&i* $2 $alpha_1) (&i* $2 $alpha_2)) $alpha_3))
            ". 于是,"
            (MB (&= $P (Mat ($1 $0 $2) ($-1 $1 $-2) ($0 $0 $1))))))
    "现在让我们看看如何用我们描述的第二种方法回答这些问题. 我们构造以" (&cm $alpha_1 $alpha_2 $alpha_3)
    "为列向量的" (&c* $4 $3) "矩阵" $B ":"
    (MB (&= $B (Mat ($1 $0 $-2) ($2 $2 $0) ($2 $0 $-4) ($1 $1 $3))))
    "我们问对于什么样的" (&cm $y_1 $y_2 $y_3 $y_4) "方程组" (LE $B $X $Y) "有解."
    (MB (Mat ($1 $0 $-2 $y_1) ($2 $2 $0 $y_2) ($2 $0 $-4 $y_3) ($1 $1 $3 $y_4)) $->
        (Mat ($1 $0 $-2 $y_1) ($0 $2 $4 (&- $y_2 (&i* $2 $y_1)))
             ($0 $0 $0 (&- $y_3 (&i* $2 $y_1))) ($0 $1 $5 (&- $y_4 $y_1))) $->)
    (MB (Mat ($1 $0 $-2 $y_1) ($0 $0 $-6 (&- $y_2 (&i* $2 $y_4)))
             ($0 $1 $5 (&- $y_4 $y_1)) ($0 $0 $0 (&- $y_3 (&i* $2 $y_1))))
        $->
        (Mat ($1 $0 $0 (: $y_1 $- (&i* $1/3 $y_2) $+ (&i* 2/3 $y_4)))
             ($0 $0 $1 (&i* 1/6 (@- (&i* $2 $y_4) $y_2)))
             ($0 $1 $0 (: (&- $y_1) $+ (&i* 5/6 $y_2) $- (&i* 2/3 $y_4)))
             ($0 $0 $0 (&- $y_3 (&i* $2 $y_1)))))
    "因此方程组" (LE $B $X $Y) "有解的条件是" (&= $y_3 (&i* $2 $y_1)) ". 于是, "
    (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4)) "在" $W "中当且仅当" (&= $b_3 (&i* $2 $b_1))
    ". 如果" $beta "在" $W "中, 那么有序基" (setE $alpha_1 $alpha_2 $alpha_3)
    "下的坐标" (tu0 $x_1 $x_2 $x_3) "可以从上面最后一个矩阵读出来. 其实我们就是又一次"
    "得到了第一种方法做出来的结果. 问题c和d可以像之前一样回答.")
   ((example #:n "22")
    "我们考虑" (&c* $5 $5) "矩阵"
    (MB (&= $A (Mat ($1 $2 $0 $3 $0)
                    ($1 $2 $-1 $-1 $0)
                    ($0 $0 $1 $4 $0)
                    ($2 $4 $1 $10 $1)
                    ($0 $0 $0 $0 $1))))
    "以及以下和" $A "有关的问题."
    (Ol #:attr* '((type "a"))
        (Li "找出一个可逆矩阵" $P "满足" (&i* $P $A) "是行简化阶梯矩阵" $R ".")
        (Li "找出" $A "的行空间" $W "的一个基.")
        (Li "说明什么样的向量" (tu0 $b_1 $b_2 $b_3 $b_4 $b_5) "在" $W "中.")
        (Li "找出" $W "中的每个向量" (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)
            "在b选择的有序基下的坐标矩阵.")
        (Li "将" $W "中的每个向量" (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)
            "写成" $A "的行的线性组合的形式.")
        (Li "给出所有满足" (LE $A $X $0) "的" (&c* $5 $1) "的列矩阵" $X
            "构成的向量空间" $V "的显式描述.")
        (Li "找出" $V "的一个基.")
        (Li "对于什么样的" (&c* $5 $1) "的列矩阵" $Y ", 方程组" AX=Y "有解?"))
    "为了解决这些问题, 我们构造方程组" AX=Y "的增广矩阵" $A^ ", 并对其施行一系列合适的行变换."
    (MB (Mat ($1 $2 $0 $3 $0 $y_1)
             ($1 $2 $-1 $-1 $0 $y_2)
             ($0 $0 $1 $4 $0 $y_3)
             ($2 $4 $1 $10 $1 $y_4)
             ($0 $0 $0 $0 $1 $y_5))
        $->
        (Mat ($1 $2 $0 $3 $0 $y_1)
             ($0 $0 $-1 $-4 $0 (&+ (&- $y_1) $y_2))
             ($0 $0 $1 $4 $0 $y_3)
             ($0 $0 $1 $4 $1 (&+ (&i* $-2 $y_1) $y_4))
             ($0 $0 $0 $0 $1 $y_5))
        $->)
    (MB (Mat ($1 $2 $0 $3 $0 $y_1)
             ($0 $0 $1 $4 $0 (&- $y_1 $y_2))
             ($0 $0 $0 $0 $0 (&+ (&- $y_1) $y_2 $y_3))
             ($0 $0 $0 $0 $1 (&+ (&i* $-3 $y_1) $y_2 $y_4))
             ($0 $0 $0 $0 $1 $y_5))
        $->
        (Mat ($1 $2 $0 $3 $0 $y_1)
             ($0 $0 $1 $4 $0 (&- $y_1 $y_2))
             ($0 $0 $0 $0 $1 $y_5)
             ($0 $0 $0 $0 $0 (&+ (&- $y_1) $y_2 $y_3))
             ($0 $0 $0 $0 $0 (&- (&+ (&i* $-3 $y_1) $y_2 $y_4) $y_5))))
    (Ol #:attr* '((type "a"))
        (Li "如果对于所有的" $Y "有"
            (MB (&= (&i* $P $Y)
                    (Mat ($y_1)
                         ((&- $y_1 $y_2))
                         ($y_5)
                         ((&+ (&- $y_1) $y_2 $y_3))
                         ((&- (&+ (&i* $-3 $y_1) $y_2 $y_4) $y_5)))))
            "那么"
            (MB (&= $P (Mat ($1 $0 $0 $0 $0)
                            ($1 $-1 $0 $0 $0)
                            ($0 $0 $0 $0 $1)
                            ($-1 $1 $1 $0 $0)
                            ($-3 $1 $0 $1 $-1))))
            "因此" (&i* $P $A) "是行简化阶梯矩阵"
            (MB (&= $R (Mat ($1 $2 $0 $3 $0)
                            ($0 $0 $1 $4 $0)
                            ($0 $0 $0 $0 $1)
                            ($0 $0 $0 $0 $0)
                            ($0 $0 $0 $0 $0))))
            "必须要强调的是矩阵" $P "不是唯一的, 实际上存在很多种可能的矩阵" $P
            " (来源于规约的不同顺序) 满足" (&= (&i* $P $A) $R) ".")
        (Li "我们可以提取" $R "非零行"
            (MB (&Table
                 ($rho_1 $= (tu0 $1 $2 $0 $3 $0))
                 ($rho_2 $= (tu0 $0 $0 $1 $4 $0))
                 ($rho_3 $= (tu0 $0 $0 $0 $0 $1))))
            "作为" $W "的一个基.")
        (Li "行空间" $W "由所有具有形式"
            (MB (deriv $beta
                       (&+ (&i* $c_1 $rho_1) (&i* $c_2 $rho_2) (&i* $c_3 $rho_3))
                       (tu0 $c_1 (&i* $2 $c_1) $c_2 (&+ (&i* $3 $c_1) (&i* $4 $c_2)) $c_3)))
            "的向量构成, 其中" (&cm $c_1 $c_2 $c_3) "是任意的标量. 因此, "
            (tu0 $b_1 $b_2 $b_3 $b_4 $b_5) "在" $W "中当且仅当"
            (MB (&= (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)
                    (&+ (&i* $b_1 $rho_1) (&i* $b_3 $rho_2) (&i* $b_5 $rho_3))))
            "其为真当且仅当"
            (MB (&cm (&= $b_2 (&i* $2 $b_1))
                     (&= $b_4 (&+ (&i* $3 $b_1) (&i* $4 $b_3)))))
            "这个线性方程组是显式描述的实例, 而通过它我们可以一眼看出一个给定向量是否在" $W
            "之中. 因此, " (tu0 $-5 -10 $1 -11 20)
            "是" $A "的行的线性组合, 而" (tu0 $1 $2 $3 $4 $5) "不是.")
        (Li "向量" (tu0 $b_1 (&i* $2 $b_1) $b_3 (&+ (&i* $3 $b_1) (&i* $4 $b_3)) $b_5)
            "在有序基" (setE $rho_1 $rho_2 $rho_3) "下的坐标矩阵显然是"
            (MB (Mat ($b_1) ($b_3) ($b_5)) "."))
        (Li "许多种方法都可以将" $W "的向量写成" $A "的行的线性组合, 或许最简单的一种是"
            "遵循例子21之前的第一个过程的步骤:"
            (MB (deriv $beta
                       (tu0 $b_1 (&i* $2 $b_1) $b_3 (&+ (&i* $3 $b_1) (&i* $4 $b_3)) $b_5)
                       (&d* (Mat ($b_1 $b_3 $b_5 $0 $0)) $R)
                       (&d* (Mat ($b_1 $b_3 $b_5 $0 $0)) (&i* $P $A))
                       (&d* (&i* (Mat ($b_1 $b_3 $b_5 $0 $0))
                                 (Mat ($1 $0 $0 $0 $0)
                                      ($1 $-1 $0 $0 $0)
                                      ($0 $0 $0 $0 $1)
                                      ($-1 $1 $1 $0 $0)
                                      ($-3 $1 $0 $1 $-1)))
                            $A)
                       (&d* (Mat ((&+ $b_1 $b_3) (&- $b_3) $0 $0 $b_5)) $A)))
            "特别地, 如果" (&= $beta (tu0 $-5 -10 $1 -11 20)) "我们有"
            (MB (&= $beta
                    (&i* (Mat ($-4 $-1 $0 $0 20))
                         (Mat ($1 $2 $0 $3 $0)
                              ($1 $2 $-1 $-1 $0)
                              ($0 $0 $1 $4 $0)
                              ($2 $4 $1 $10 $1)
                              ($0 $0 $0 $0 $1))))))
        (Li "方程组" RX=0 "中的方程是"
            (MB (set-attr*
                 (&Table
                  ((: $x_1 $+ (&i* $2 $x_2) $+ (&i* $3 $x_4)) $= $0)
                  ((: $x_3 $+ (&i* $4 $x_4)) $= $0)
                  ($x_5 $= $0))
                 'columnalign "right"))
            "因此, " $V "由所有具有形式"
            (MB (Mat ((&- (&i* $-2 $x_2) (&i* $3 $x_4)))
                     ($x_2)
                     ((&i* $-4 $x_4))
                     ($x_4)
                     ($0)))
            "的列向量构成, 其中" $x_2 "和" $x_4 "是任意的.")
        (Li "列向量"
            (MB (&cm (Mat ($-2) ($1) ($0) ($0) ($0))
                     (Mat ($-3) ($0) ($-4) ($1) ($0))))
            "构成了" $V "的一个基, 这是例子15所描述的基的一个例子.")
        (Li "方程组" AX=Y "有解当且仅当"
            (MB (set-attr*
                 (&Table
                  ((&+ (&- $y_1) $y_2 $y_3) $= $0)
                  ((&- (&+ (&i* $-3 $y_1) $y_2 $y_4) $y_5) $= $0))
                 'columnalign "right")))))
   ((exercise #:n "1")
    "令" (&< $s $n) "而" $A "是一个域" $F "上的" (&c* $s $n) "矩阵, 使用定理4 (但不是其证明) "
    "证明" $F^n*1 "中存在非零的" $X "满足" AX=0 ".")
   ((exercise #:n "2")
    "令"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $-2 $1))
             (&= $alpha_2 (tu0 $3 $0 $4 $-1))
             (&= $alpha_3 (tu0 $-1 $2 $5 $2))))
    "令"
    (MB (&cm (&= $alpha (tu0 $4 $-5 $9 $-7))
             (&= $beta (tu0 $3 $1 $-4 $4))
             (&= $gamma (tu0 $-1 $1 $0 $1))))
    (Ol #:attr* '((type "a"))
        (Li (&cm $alpha $beta $gamma) "中哪些在" $alpha_i "张成的" $RR^4 "的子空间之中?")
        (Li (&cm $alpha $beta $gamma) "中哪些在" $alpha_i "张成的" $CC^4 "的子空间之中?")
        (Li "这是否暗示了一个定理?")))
   ((exercise #:n "3")
    "考虑以下" $RR^4 "中的向量"
    (MB (&cm (&= $alpha_1 (tu0 $-1 $0 $1 $2))
             (&= $alpha_2 (tu0 $3 $4 $-2 $5))
             (&= $alpha_3 (tu0 $1 $4 $0 $9))))
    "找出一个齐次线性方程组, 其解空间恰是这些向量张成的子空间.")
   ((exercise #:n "4")
    "在" $CC^3 "中, 令"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 (&- $i)))
             (&= $alpha_2 (tu0 (&+ $1 $i) (&- $1 $i) $1))
             (&= $alpha_3 (tu0 $i $i $i))))
    "证明这些向量构成了" $CC^3 "的一个基. 向量" (tu0 $a $b $c)
    "在这个基下的坐标是什么?")
   ((exercise #:n "5")
    "给出" $RR^5 "中的向量"
    (MB (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)))
    "的显式描述, 其为向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $2 $1 $-1))
             (&= $alpha_2 (tu0 $-1 $2 $-4 $2 $0))
             (&= $alpha_3 (tu0 $2 $-1 $5 $2 $1))
             (&= $alpha_4 (tu0 $2 $1 $3 $5 $2))))
    "的线性组合.")
   ((exercise #:n "6")
    "令" $V "是由矩阵"
    (MB (&= $A (Mat ($3 21 $0 $9 $0)
                    ($1 $7 $-1 $-2 $-1)
                    ($2 14 $0 $6 $1)
                    ($6 42 $-1 13 $0))))
    "的行张成的实向量空间."
    (Ol #:attr* '((type "a"))
        (Li "找出" $A "的一个基.")
        (Li "什么样的向量" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5)
            "是" $V "的元素.")
        (Li "如果" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5) "在" $V "中, 那么"
            "它在a选择的基下的坐标是什么?")))
   ((exercise #:n "7")
    "令" $A "是域" $F "上的" m*n "矩阵, 考虑线性方程组" AX=Y
    ". 证明该线性方程组有解当且仅当" $A "的行秩等于其增广矩阵的行秩.")
   (H2 "第3章 线性变换")
   (H3 "第3.1节 线性变换")
   (P "我们将引入线性变换, 本书的剩余部分我们将研究的对象. 读者或许会发现阅读 (或重读) "
      "附录里关于函数的部分是有用的, 因为我们将自由地使用其中的术语.")
   ((definition)
    "令" $V "和" $W "是域" $F "上的向量空间. 一个从" $V "到" $W
    "的线性变换是一个从" $V "到" $W "的函数" $T "满足"
    (MB (&= (app $T (LC $c $alpha $beta))
            (LC $c (@ap $T $alpha) (ap $T $beta))))
    "对于所有" $V "中" $alpha "和" $beta "以及所有" $F "中标量" $c "成立.")
   ((example #:n "1")
    "如果" $V "是任意的向量空间, 恒等变换" $I ", 由"
    (&= (ap $I $alpha) $alpha) "定义, 是一个从" $V "到"
    $V "的线性变换. 零变换, 由" (&= (ap $0 $alpha) $0)
    "定义, 也是一个从" $V "到" $V "的线性变换.")
   ((example #:n "2")
    "令" $F "是一个域, " $V "是从" $F "到" $F "的多项式函数"
    $f "构成的空间, " $f "由"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* (_ $c $k) (^ $x $k)))))
    "给定. 令"
    (MB (&= (app (@ (ap $D $f)) $x)
            (&+ $c_1 (&i* $2 $c_1 $x) $..c
                (&i* $k (_ $c $k) (^ $x (&- $k $1)))))
        ".")
    "那么" $D "是一个从" $V "到" $V "的线性变换, 即微分变换.")
   ((example #:n "3")
    "令" $A "是域" $F "上一个固定的" m*n "矩阵, "
    "由" (&= (app $T $X) (&i* $A $X)) "定义的函数" $T "是一个从"
    $F^n*1 "到" $F^m*1 "的线性变换. "
    "由" (&= (app $U $alpha) (&i* $alpha $A)) "定义的函数" $U
    "是一个从" $F^m "到" $F^n "的线性变换.")
   ((example #:n "4")
    "令" $P "是域" $F "上一个固定的" m*m "矩阵, 令" $Q "是域" $F "上一个固定的" n*n "矩阵. "
    "定义一个从" (^ $F m*n) "到自身的函数" $T ", " (&= (app $T $A) (&i* $P $A $Q)) ". 那么"
    $T "是一个线性变换, 因为"
    (MB (deriv (app $T (&+ (&i* $c $A) $B))
               (&i* $P (@ (&+ (&i* $c $A) $B)) $Q)
               (&i* (@ (&+ (&i* $c $P $A) (&i* $P $B))) $Q)
               (&+ (&i* $c $P $A $Q) (&i* $P $B $Q))
               (&+ (&i* $c (app $T $A)) (app $T $B)))))
   ((example #:n "5")
    "令" $V "是所有从" $RR "到" $RR "的连续函数构成的空间, 由"
    (MB (&= (app (@ (ap $T $f)) $x) (integral $0 $x (app $f $t) $t)))
    "定义" $T ", 那么" $T "是一个从" $V "到" $V "的线性变换. 函数" (ap $T $f)
    "不仅是连续的, 还拥有连续的一阶导数. 积分的线性性质是其根本性质之一.")
   (P "读者验证例子1, 2, 3, 5是线性变换是没有难度的. 当我们了解更多关于线性变换的东西时, "
      "例子也会随之得到扩展.")
   (P "注意到以下事实是重要的. 如果" $T "是一个从" $V "到" $W
      "的线性变换, 那么" (&= (app $T $0) $0) ". 人们可以从定义中看出来, 因为"
      (MB (&= (app $T $0) (app $T (&+ $0 $0)) (&+ (app $T $0) (app $T $0))) ".")
      "这点对于线性代数的初学者而言有时令人迷惑, 因为他可能已经接触过术语&quot;线性函数&quot;"
      "一个稍微有点不同的用法. 扼要的注记应该能够扫清这种迷惑. 设" $V "是向量空间"
      $RR^1 ", 那么一个从" $V "到" $V "的线性变换是一种特定的实数轴" $RR
      "上的实值函数. 在一个微积分课程中, 人们可能会将图像是直线的函数称为线性的. 一个从"
      $RR^1 "到" $RR^1 "的线性变换, 根据我们的定义, 将会是一个从" $RR "到" $RR
      "的函数, 其图像是经过原点的直线.")
   (P "不仅是" (&= (app $T $0) $0) ", 让我们指出一般的线性变换" $T "的另一个性质. "
      "这样的线性变换&quot;保持&quot;线性组合, 也就是说, 如果"
      alpha_1..n "是" $V "中的向量, " (&cm $c_1 $..h $c_n)
      "是标量, 那么"
      (MB (&= (app $T (LC0 $c_1 $alpha_1 $c_n $alpha_n))
              (&+ (&i* $c_1 (@ (ap $T $alpha_1))) $..c
                  (&i* $c_n (@ (ap $T $alpha_n))))))
      "这可由定义直接推得, 例如"
      (MB (deriv (app $T (LC $c_1 $alpha_1 $c_2 $alpha_2))
                 (LC $c_1 (@ap $T $alpha_1)
                     (app $T (&i* $c_2 $alpha_2)))
                 (LC $c_1 (@ap $T $alpha_1)
                     $c_2 (@ap $T $alpha_2)))))
   ((theorem #:n "1")
    "令" $V "是一个域" $F "上的有限维向量空间, 令"
    (setE $alpha_1 $..h $alpha_n) "是" $V "的一个有序基. 令" $W
    "也是域" $F "上的一个向量空间, 并且令" (&cm $beta_1 $..h $beta_n)
    "是" $W "中任意的向量. 那么, 恰存在唯一的从" $V "到" $W
    "的线性映射" $T "满足"
    (MB (&cm (&= (ap $T $alpha_j) $beta_j)
             (&= $j (&cm $1 $..h $n)))))
   ((proof)
    "为了证明存在某个线性变换" $T "满足" (&= (ap $T $alpha_j) $beta_j)
    "我们按照以下方式推进. 给定" $V "中的" $alpha ", 存在唯一的" $n
    "元组" (tu0 $x_1 $..h $x_n) "满足"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)) ".")
    "对于这个向量" $alpha "我们定义"
    (MB (&= (ap $T $alpha) (LC0 $x_1 $beta_1 $x_n $beta_n)) ".")
    "那么" $T "是一个将每个" $V "中的向量" $alpha "与一个" $W
    "中的向量" (ap $T $alpha) "联系起来的良定义的规则. "
    "从此定义中显然可以看出对于每个" $j "有" (&= (ap $T $alpha_j) $beta_j)
    ". 为了说明" $T "是线性的, 令"
    (MB (&= $beta (LC0 $y_1 $alpha_1 $y_n $alpha_n)))
    "是" $V "中的向量, 令" $c "是任意的标量. 现在"
    (MB (&= (LC $c $alpha $beta)
            (LC0 (@ (LC $c $x_1 $y_1)) $alpha_1
                 (@ (LC $c $x_n $y_n)) $alpha_n)))
    "于是根据定义"
    (MB (&= (app $T (LC $c $alpha $beta))
            (LC0 (@ (LC $c $x_1 $y_1)) $beta_1
                 (@ (LC $c $x_n $y_n)) $beta_n)))
    "另一方面"
    (MB (deriv (LC $c (@ap $T $alpha) (ap $T $beta))
               (LC $c (sum (&= $i $1) $n (&i* $x_i $beta_i))
                   (sum (&= $i $1) $n (&i* $y_i $beta_i)))
               (sum (&= $i $1) $n
                    (&i* (@ (LC $c $x_i $y_i)) $beta_i))))
    "因此"
    (MB (&= (app $T (LC $c $alpha $beta))
            (LC $c (@ap $T $alpha) (ap $T $beta))) ".")
    "如果" $U "也是一个满足"
    (&cm (&= (ap $U $alpha_j) $beta_j)
         (&= $j (&cm $1 $..h $n)))
    "的从" $V "到" $W "的线性变换, 那么对于向量"
    (&= $alpha (sum (&= $i $1) $n (&i* $x_i $alpha_i)))
    "我们有"
    (MB (deriv (ap $U $alpha)
               (ap $U (pare (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
               (sum (&= $i $1) $n
                    (&i* $x_i (@ap $U $alpha_i)))
               (sum (&= $i $1) $n (&i* $x_i $beta_i))))
    "因此" $U "恰是我们之前所定义的规则" $T ". 这表明满足"
    (&= (ap $T $alpha_j) $beta_j) "的线性变换" $T "是唯一的.")
   (P "定理1是相当初等的. 然而, 它是如此基本以至于我们形式化地陈述了该定理. "
      "函数的概念是非常一般的. 如果" $V "和" $W "是(非零的)向量空间, "
      "那么从" $V "到" $W "的函数存在相当多样的可能性. 定理1强调了"
      "线性函数是极其特殊的.")
   ((example #:n "6")
    "向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $2))
             (&= $alpha_2 (tu0 $3 $4))))
    "是线性无关的, 因此构成了" $RR^2 "的一个基. 根据定理1, 存在唯一的一个从"
    $RR^2 "到" $RR^3 "的线性变换满足"
    (MB (&cm (&= (ap $T $alpha_1) (tu0 $3 $2 $1))
             (&= (ap $T $alpha_2) (tu0 $6 $5 $4))))
    "如果是这样的话, 我们必须能够找出" (app $T $epsilon_1)
    ". 我们先找到满足" (&= $epsilon_1 (&+ (&i* $c_1 $alpha_1) (&i* $c_2 $alpha_2)))
    "的标量" $c_1 "和" $c_2 ", 然后我们就知道"
    (&= (ap $T $epsilon_1) (&+ (&i* $c_1 (ap $T $alpha_1)) (&i* $c_2 (ap $T $alpha_2))))
    ". 如果" (&= (tu0 $1 $0) (&+ (&i* $c_1 (tu0 $1 $2)) (&i* $c_2 (tu0 $3 $4))))
    ", 那么" (&= $c_1 $-2) "且" (&= $c_2 $1) ", 因此"
    (MB (deriv (ap $T (tu0 $1 $0))
               (LC $-2 (tu0 $3 $2 $1) (tu0 $6 $5 $4))
               (tu0 $0 $1 $2))))
   ((example #:n "7")
    "令" $T "是一个从" $m "元组空间" $F^m "到" $n "元组空间" $F^n "的线性变换. 定理1告诉我们"
    $T "由向量的序列" (&cm $beta_1 $..h $beta_m) "唯一地确定, 其中"
    (MB (&cm (&= $beta_i (ap $T $epsilon_i)) (&= $i (&cm $1 $..h $m))) ".")
    "简而言之, " $T "由其在标准基向量下的像唯一地确定, 而这个确定就是"
    (MB (&cm (&= $alpha (tu0 $x_1 $..h $x_m))
             (&= (ap $T $alpha) (LC0 $x_1 $beta_1 $x_m $beta_m))) ".")
    "如果" $B "是一个以" (&cm $beta_1 $..h $beta_m) "为行向量的" m*n
    "矩阵, 那么上面就是在说"
    (MB (&= (ap $T $alpha) (&i* $alpha $B)) ".")
    "换言之, 如果" (&= $beta_i (tu0 (mref $B $i $1) $..h (mref $B $i $n))) ", 那么"
    (MB (&= (ap $T (tu0 $x_1 $..h $x_m))
            (&i* (Mat ($x_1 $..c $x_m))
                 (Mat ((mref $B $1 $1) $..c (mref $B $1 $n))
                      ($..v $ $..v)
                      ((mref $B $m $1) $..c (mref $B $m $n))))) ".")
    "这是一种对于线性变换相当显式的刻画. 在第3.4节我们将严肃地研究线性变换和矩阵之间的关系. "
    "之后我们并不会追求" (&= (ap $T $alpha) (&i* $alpha $B)) "这种特定的描述, 因为它将矩阵"
    $B "置于向量" $alpha "的右边, 而这可能会引起一些困惑. 这个例子的要点在于展现了我们对于所有从"
    $F^m "到" $F^n "的线性变换可以给出显式且相当简单的描述.")
   (P "如果" $T "是一个从" $V "到" $W "的线性变换, 那么" $T "的像不仅是" $W "的子集, 而且是"
      $W "的子空间. 令" $R_T "是" $T "的像, 即满足存在某个" $V "中" $alpha "使得"
      (&= $beta (ap $T $alpha)) "的所有" $W "中向量" $beta "构成的集合. 令" $beta_1 "和"
      $beta_2 "是" $R_T "的元素, 令" $c "是一个标量. 存在" $V "中向量" $alpha_1 "和" $alpha_2
      "满足" (&= (ap $T $alpha_1) $beta_1) "和" (&= (ap $T $alpha_2) $beta_2)
      ". 既然" $T "是线性的, 那么"
      (MB (deriv (app $T (LC $c $alpha_1 $alpha_2))
                 (LC $c (ap $T $alpha_1) (ap $T $alpha_2))
                 (LC $c $beta_1 $beta_2)))
      "这表明" (LC $c $beta_1 $beta_2) "也在" $R_T "之中.")
   (P "另一个与线性变换" $T "相关的有趣子空间是由所有满足" (&= (ap $T $alpha) $0)
      "的" $V "中的向量" $alpha "构成的集合" $N ". 它是" $V "的一个子空间, 因为"
      (Ol #:attr* '((type "a"))
          (Li (&= (app $T $0) $0) ", 于是" $N "非空;")
          (Li "如果" (&= (ap $T $alpha_1) (ap $T $alpha_2) $0) ", 那么"
              (MB (deriv (app $T (LC $c $alpha_1 $alpha_2))
                         (LC $c (ap $T $alpha_1) (ap $T $alpha_2))
                         (LC $c $0 $0)
                         $0))
              "于是" (LC $c $beta_1 $beta_2) "也在" $N "之中.")))
   ((definition)
    "令" $V "和" $W "是域" $F "上的向量空间, 令" $T "是一个从" $V "到" $W
    "的线性变换. " $T "的零空间是所有满足" (&= (ap $T $alpha) $0)
    "的" $V "中向量" $alpha "构成的集合. 如果" $V "是有限维的, 那么称" $T
    "的像的维数为" $T "的秩, " $T "的零空间的维数为" $T "的零化度.")
   (P "以下是线性代数中最重要的结果之一.")
   ((theorem #:n "2")
    "令" $V "和" $W "是域" $F "上的向量空间, 令" $T "是一个从" $V "到" $W
    "的线性变换, 设" $V "是有限维的, 那么"
    (MB (&= (&+ (&rank $T) (&nullity $T)) (&dim $V)) "."))
   ((proof)
    "令" (setE $alpha_1 $..h $alpha_k) "是" $N "的一个基, " $N "即" $T "的零空间. 存在"
    $V "中向量" (&cm (_ $alpha (&+ $k $1)) $..h $alpha_n) "满足"
    (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基. 我们将证明"
    (setE (ap $T (_ $alpha (&+ $k $1))) $..h (ap $T $alpha_n))
    "是" $T "的像的一个基. 向量" (&cm (ap $T $alpha_1) $..h (ap $T $alpha_n))
    "当然能够张成" $T "的像, 并且既然对于" (&<= $j $k) "有" (&= (ap $T $alpha_j) $0)
    ", 我们可以看出" (&cm (ap $T (_ $alpha (&+ $k $1))) $..h (ap $T $alpha_n))
    "能够张成像. 为了看出这些像是线性无关的, 设我们有标量" $c_i "满足"
    (MB (&= (sum (&= $i (&+ $k $1)) $n (&i* $c_i (@ap $T $alpha_i))) $0) ".")
    "这说明"
    (MB (&= (ap $T (pare (sum (&= $i (&+ $k $1)) $n (&i* $c_i $alpha_i)))) $0))
    "并且可知" (&= $alpha (sum (&= $i (&+ $k $1)) $n (&i* $c_i $alpha_i)))
    "在" $T "的零空间中. 既然" (&cm $alpha_1 $..h $alpha_k) "构成了" $N
    "的一个基, 那么必须存在标量" (&cm $b_1 $..h $b_k) "满足"
    (MB (&= $alpha (sum (&= $i $1) $k (&i* $b_i $alpha_i))) ".")
    "因此"
    (MB (&= (&- (sum (&= $i $1) $k (&i* $b_i $alpha_i))
                (sum (&= $j (&+ $k $1)) $n (&i* $c_j $alpha_j)))
            $0))
    "并且既然" (&cm $alpha_1 $..h $alpha_n) "是线性无关的, 我们必须有"
    (MB (&= $b_1 $..c $b_k (_ $c (&+ $k $1)) $..c $c_n $0) ".")
    "如果" $r "是" $T "的秩, 那么" (&cm (ap $T (_ $alpha (&+ $k $1))) $..h (ap $T $alpha_n))
    "构成了" $T "的像的基的事实告诉我们" (&= $r (&- $n $k)) ". 既然" $k "是" $T
    "的零化度而" $n "是" $V "的维数, 证明结束了.")
   ((theorem #:n "3")
    "如果" $A "是域" $F "上的一个" m*n "矩阵, 那么"
    (MB (&= (&row-rank $A) (&column-rank $A)) "."))
   ((proof)
    "令" $T "是由" (&= (app $T $X) (&i* $A $X)) "定义的从" $F^n*1 "到"
    $F^m*1 "的线性变换. " $T "的零空间是线性方程组" AX=0
    "的解空间, 即由所有满足" AX=0 "的列矩阵" $X "构成的集合. " $T "的像是由所有满足线性方程组"
    AX=Y "有解的" m*1 "的列矩阵" $Y "构成的集合. 如果" (&cm $A_1 $..h $A_n)
    "是" $A "的列, 那么"
    (MB (&= (&i* $A $X) (LC0 $x_1 $A_1 $x_n $A_n)))
    "于是" $T "的像是由" $A "的列张成的子空间. 换句话说, " $T "的像就是" $A "的列空间, 因此"
    (MB (&= (&rank $T) (&column-rank $A)) ".")
    "定理2告诉我们如果" $S "是线性方程组" AX=0 "的解空间, 那么"
    (MB (&= (&+ (&dim $S) (&column-rank $A)) $n) ".")
    "我们现在引用第2章的例子15. 我们的意图在于, 如果" $r "是" $A "的行空间的维数, 那么解空间"
    $S "拥有一个由" (&- $n $r) "个向量构成的基:"
    (MB (&= (&dim $S) (&- $n (&row-rank $A))) ".")
    "现在显然有"
    (MB (&= (&row-rank $A) (&column-rank $A)) "."))
   (P "刚刚我们给出的对于定理3的证明依赖于和线性方程组有关的显式计算. 实际上存在一个不依赖于这样的计算的"
      "概念性证明. 我们将在第3.7节给出这个证明.")
   ((exercise #:n "1")
    "以下哪些函数" $T "是从" $RR^2 "到" $RR^2 "的线性变换呢?"
    (let ((Tdef (lambda (v1 v2)
                  (&= (ap $T (tu0 $x_1 $x_2)) (tu0 v1 v2)))))
      (Ol #:attr* '((type "a"))
          (Li (Tdef (&+ $1 $x_1) $x_2) ";")
          (Li (Tdef $x_2 $x_1) ";")
          (Li (Tdef (_^ $x $1 $2) $x_2) ";")
          (Li (Tdef (&sin $x_1) $x_2) ";")
          (Li (Tdef (&- $x_1 $x_2) $0) "."))))
   ((exercise #:n "2")
    "找出有限维向量空间" $V "上的零变换和恒等变换的像, 秩, 零空间, 零化度.")
   ((exercise #:n "3")
    "描述例子2的微分变换和例子5的积分变换的像和零空间.")
   ((exercise #:n "4")
    "存在从" $RR^3 "到" $RR^2 "的线性变换满足" (&= (ap $T (tu0 $1 $-1 $1)) (tu0 $1 $0))
    "且" (&= (ap $T (tu0 $1 $1 $1)) (tu0 $0 $1)) "吗?")
   ((exercise #:n "5")
    "如果"
    (MB (&cm (&= $alpha_1 (tu0 $1 $-1)) (&= $beta_1 (tu0 $1 $0))
             (&= $alpha_2 (tu0 $2 $-1)) (&= $beta_2 (tu0 $0 $1))
             (&= $alpha_3 (tu0 $-3 $2)) (&= $beta_3 (tu0 $1 $1))))
    "存在从" $RR^2 "到" $RR^2 "的线性变换" $T "满足" (&= (ap $T $alpha_i) $beta_i)
    "对于" (&= $i (&cm $1 $2 $3)) "成立吗?")
   ((exercise #:n "6")
    "显式描述 (如练习1和2) 满足"
    (&cm (&= (ap $T $epsilon_1) (tu0 $a $b))
         (&= (ap $T $epsilon_2) (tu0 $c $d)))
    "的从" $F^2 "到" $F^2 "的线性变换" $T ".")
   ((exercise #:n "7")
    "令" $F "是一个复数域的子域, 令" $T "是由"
    (MB (&= (ap $T (tu0 $x_1 $x_2 $x_3))
            (tu0 (&+ (&- $x_1 $x_2) (&i* $2 $x_3))
                 (&+ (&i* $2 $x_1) $x_2)
                 (&+ (&- (&- $x_1) (&i* $2 $x_2)) (&i* $2 $x_3)))))
    "定义的从" $F^3 "到" $F^3 "的函数."
    (Ol #:attr* '((type "a"))
        (Li "验证" $T "是一个线性变换.")
        (Li "如果" (tu0 $a $b $c) "是" $F^3 "中向量, 那么" (&cm $a $b $c)
            "满足什么条件时向量在" $T "的像中? " $T "的秩是多少?")
        (Li (&cm $a $b $c) "满足什么条件时" (tu0 $a $b $c) "在" $T
            "的零空间中? " $T "的零化度是多少?")))
   ((exercise #:n "8")
    "显式描述一个从" $RR^3 "到" $RR^3 "的线性变换, 其像是由"
    (tu0 $1 $0 $-1) "和" (tu0 $1 $2 $2) "张成的子空间.")
   ((exercise #:n "9")
    "令" $V "是域" $F "上的所有" n*n "矩阵构成的向量空间, 令" $B
    "是一个固定的" n*n "矩阵. 如果"
    (MB (&= (app $T $A) (&- AB (&i* $B $A))))
    "验证" $T "是一个从" $V "到" $V "的线性变换.")
   ((exercise #:n "10")
    "令" $V "是所有复数的集合, 其被当作实数域上的向量空间 (在通常的运算下). 找出一个从"
    $V "到" $V "的线性变换, 但不是" $CC^1 "上的线性变换, 即不是复线性的.")
   ((exercise #:n "11")
    "令" $V "是" $F "上的" n*1 "矩阵的空间, 令" $W "是" $F "上的" m*1 "矩阵的空间. 令"
    $A "是" $F "上的一个固定的" m*n "矩阵, 令" $T "是由" (&= (app $T $X) (&i* $A $X))
    "定义的从" $V "到" $W "的线性变换. 证明" $T "是零变换当且仅当" $A "是零矩阵.")
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个" $n "维向量空间, 令" $T "是一个从" $V "到" $V
    "的线性变换, 并且" $T "的像和零空间是相等的. 证明" $n "是偶数. (你能给出这样的线性变换"
    $T "的例子吗?)")
   ((exercise #:n "13")
    "令" $V "是一个向量空间, 令" $T "是一个从" $V "到" $V "的线性变换. 证明以下两个关于"
    $T "的陈述是等价的."
    (Ol #:attr* '((type "a"))
        (Li $T "的像与零空间之交是" $V "的零子空间.")
        (Li "如果" (&= (app $T (ap $T $alpha)) $0) ", 那么" (&= (ap $T $alpha) $0) ".")))
   (H3 "第3.2节 线性变换的代数")
   (P "在研究从" $V "到" $W "的线性变换时, 这些变换的集合继承了自然的向量空间结构"
      "具有根本的重要性. 从空间" $V "到自身的线性变换的集合甚至有着更多的代数结构, "
      "因为通常的函数复合提供了这样的变换的&quot;乘法&quot;. 我们将在本节探索这些想法.")
   ((theorem #:n "4")
    "令" $V "和" $W "是域" $F "上的向量空间. 令" $T "和" $U "是从" $V "到" $W "的线性变换. 由"
    (MB (&= (app (@+ $T $U) $alpha) (&+ (ap $T $alpha) (ap $U $alpha))))
    "定义的函数" (@+ $T $U) "是一个从" $V "到" $W "的线性变换. 如果" $c "是" $F
    "任意的元素, 那么由"
    (MB (&= (app (@i* $c $T) $alpha) (&i* $c (@ap $T $alpha))))
    "定义的函数" (@i* $c $T) "是一个从" $V "到" $W "的线性变换. 所有从" $V "到" $W
    "的线性变换的集合, 与其上定义的加法和标量乘法一起, 构成了一个域" $F "上的向量空间.")
   ((proof)
    "设" $T "和" $U "是从" $V "到" $W "的线性变换, 而" (@+ $T $U) "定义如上, 那么"
    (MB (deriv (app (@+ $T $U) (LC $c $alpha $beta))
               (&+ (app $T (LC $c $alpha $beta))
                   (app $U (LC $c $alpha $beta)))
               (&+ (LC $c (@ap $T $alpha) (ap $T $beta))
                   (LC $c (@ap $U $alpha) (ap $U $beta)))
               (LC $c (@+ (ap $T $alpha) (ap $U $alpha))
                   (@+ (ap $T $beta) (ap $U $beta)))
               (LC $c (app (@+ $T $U) $alpha)
                   (app (@+ $T $U) $beta))))
    "这表明" (@+ $T $U) "是一个线性变换. 类似地,"
    (MB (deriv (app (@i* $c $T) (LC $d $alpha $beta))
               (&i* $c (bra0 (app $T (LC $d $alpha $beta))))
               (&i* $c (bra0 (LC $d (@ap $T $alpha) (ap $T $beta))))
               (&+ (&i* $c $d (@ap $T $alpha))
                   (&i* $c (@ap $T $beta)))
               (LC $d (bra0 (&i* $c (@ap $T $alpha)))
                   $c (@ap $T $beta))
               (LC $d (bra0 (ap (@i* $c $T) $alpha))
                   (ap (@i* $c $T) $beta))))
    "这表明" (@i* $c $T) "是一个线性变换." (Br)
    "为了验证从" $V "到" $W "的线性变换的集合 (以及这些运算) 是一个向量空间, 我们还必须直接检验每个"
    "向量加法和数乘上的条件是否满足. 我们将这些工作留给读者, 并满足于以下的评论: 这个空间里的零向量"
    "是零变换, 其将每个" $V "的向量送至" $W "的零向量; 这两个运算的每个性质都对应于空间" $W
    "的运算的相应性质.")
   (P "或许我们应该提及另一种看待这个定理的方式. 如果我们如果上面那样定义和与标量积, 那么所有从"
      $V "到" $W "的函数构成了一个域" $F "上的向量空间. 这与" $V "是向量空间无关, " $V
      "是一个非空集合足矣. 当" $V "是向量空间的时候我们可以定义从" $V "到" $W "的线性变换, 那么"
      "定理4告诉我们这些变换构成了从" $V "到" $W "的所有函数构成的空间的一个子空间.")
   (P "我们将从" $V "到" $W "的线性变换的空间记作" (&L $V $W) ". 我们提醒读者只有当" $V
      "和" $W "是定义于同一个域上的向量空间时" (&L $V $W) "才有定义.")
   ((theorem #:n "5")
    "令" $V "是域" $F "上的" $n "维向量空间而" $W "是域" $F "上的" $m "维向量空间, 那么"
    (&L $V $W) "是有限维的, 并且维数是" (&i* $m $n) ".")
   ((proof)
    "令"
    (MB basis:def
        "和" (&= $BBB^ (setE $beta_1 $..h $beta_m)))
    "分别是" $V "和" $W "的有序基. 对于每个满足" (&<= $1 $p $m) "和" (&<= $1 $q $n)
    "的整数序对" (tu0 $p $q) ", 我们定义从" $V "到" $W "的线性变换" (^ $E (&cm $p $q)) "如下."
    (MB (deriv (app (^ $E (&cm $p $q)) $alpha_i)
               (Choice0
                ($0 ", 如果" (&!= $i $q))
                ($beta_p ", 如果" (&= $i $q)))
               (&i* (&delta $i $q) $beta_p)))
    "根据定理1, 存在唯一的从" $V "到" $W "的线性变换满足这些条件. 我们要证明的是这"
    (&i* $m $n) "个线性变换构成了" (&L $V $W) "的一个基." (Br)
    "令" $T "是从" $V "到" $W "的线性变换. 对于每个" (&cm $j (&<= $1 $j $n))
    ", 令" (&cm (mref $A $1 $j) $..h (mref $A $m $j)) "是向量" (ap $T $alpha_j)
    "相对于有序基" $BBB^ "的坐标, 即"
    (MB (&= (ap $T $alpha_j) (sum (&= $p $1) $m (&i* (mref $A $p $j) $beta_p))) ".")
    "我们想要表明"
    (MB (&= $T (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (^ $E (&cm $p $q)))))) ".")
    "令" $U "是上面这个式子右侧的线性变换, 那么对于每个" $j ","
    (MB (deriv (ap $U $alpha_j)
               (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q)
                              (app (^ $E (&cm $p $q)) $alpha_j))))
               (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (&delta $j $q) $beta_p)))
               (sum (&= $p $1) $m (&i* (mref $A $p $j) $beta_p))
               (ap $T $alpha_j)))
    "因此" (&= $U $T) ". 目前我们已经证明了" (^ $E (&cm $p $q)) "可以张成" (&L $V $W)
    ", 我们必须还要证明它们是线性无关的, 然而从我们上面写下的东西来看这是显然的, 因为如果变换"
    (MB (&= $U (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (^ $E (&cm $p $q)))))))
    "是零变换, 那么对于每个" $j "有" (&= (ap $U $alpha_j) $0) ", 于是"
    (MB (&= (sum (&= $p $1) $m (&i* (mref $A $p $j) $beta_p)) $0))
    "而" $beta_p "的线性无关性质又可推出对于每个" $p "和" $j "我们有" (&= (mref $A $p $j) $0) ".")
   ((theorem #:n "6")
    "令" (&cm $V $W $Z) "是域" $F "上的向量空间, 令" $T "是从" $V "到" $W "的线性变换, 令" $U
    "是从" $W "到" $Z "的线性变换, 那么由" (&= (app (@i* $U $T) $alpha) (app $U (app $T $alpha)))
    "定义的复合函数" (&i* $U $T) "是一个从" $V "到" $Z "的线性变换.")
   ((proof)
    (MB (deriv (app (&i* $U $T) (LC $c $alpha $beta))
               (ap $U (bra0 (app $T (LC $c $alpha $beta))))
               (app $U (LC $c (ap $T $alpha) (ap $T $beta)))
               (LC $c (bra0 (app $U (ap $T $alpha))) (app $U (ap $T $beta)))
               (LC $c (app (@i* $U $T) $alpha) (app (@i* $U $T) $beta)))))
   (P "接下来, 我们将主要关注从一个向量空间到自身的线性变换. 鉴于我们经常得说&quot;" $T
      "是一个从" $V "到" $V "的线性变换&quot;, 以后我们将说&quot;" $T "是" $V
      "上的一个线性算子&quot;.")
   ((definition)
    "如果" $V "是域" $F "上的一个向量空间, 那么一个" $V "上的线性算子就是一个从" $V
    "到" $V "的线性变换.")
   (P "在定理6的情况下, 当" (&= $V $W $Z) "时, 以至于" $U "和" $T "都是空间" $V
      "上的线性算子, 那么其复合" (&i* $U $T) "也是一个" $V "上的线性算子. 因此, 空间"
      (&L $V $V) "有一个乘法定义于其上, 即复合. 当然算子" (&i* $T $U) "也是有定义的, 不过"
      "读者应该注意一般" (&!= (&i* $U $T) (&i* $T $U)) ", 即" (&!= (&- (&i* $U $T) (&i* $T $U)) $0)
      ". 我们还应该特别注意如果" $T "是一个" $V "上的线性算子, 那么我们可以将" $T "和"
      $T "复合. 我们将使用记号" (&= $T^2 (&i* $T $T)) ", 而一般地, 对于" (&= $n (&cm $1 $2 $3 $..h))
      ", " (&= $T^n (&i* $T $..c $T)) "(" $n "个" $T "相乘). 我们定义" (&= $T^0 $I)
      ", 如果" (&!= $T $0) ". [译注: " (&= $T $0) "时定义" (&= $T^0 $I) "也是合理且必要的.]")
   ((lemma)
    "令" $V "是域" $F "上的向量空间, 令" (&cm $U $T_1 $T_2) "是" $V "上的线性算子, 令"
    $c "是" $F "的元素."
    (Ol #:attr* '((type "a"))
        (Li (&= (&i* $I $U) (&i* $U $I) $U) ";")
        (Li (disR $U $T_1 $T_2) "; " (disL $T_1 $T_2 $U) ";")
        (Li (&= (&i* $c (@i* $U $T_1)) (&i* (@i* $c $U) $T_1) (&i* $U (@i* $c $T_1))) ".")))
   ((proof)
    (Ol #:attr* '((type "a"))
        (Li "这个关于恒等函数的性质是显然的, 我们列在这里仅是为了强调一下.")
        (Li (MB (deriv (app (bra0 (&i* $U (@+ $T_1 $T_2))) $alpha)
                       (ap $U (bra0 (app (@+ $T_1 $T_2) $alpha)))
                       (app $U (&+ (ap $T_1 $alpha) (ap $T_2 $alpha)))
                       (&+ (app $U (ap $T_1 $alpha)) (app $U (ap $T_2 $alpha)))
                       (&+ (app (@i* $U $T_1) $alpha) (app (@i* $U $T_2) $alpha))))
            "于是" (disR $U $T_1 $T_2) ". 另外,"
            (MB (deriv (app (bra0 (&i* (@+ $T_1 $T_2) $U)) $alpha)
                       (app (@+ $T_1 $T_2) (ap $U $alpha))
                       (&+ (app $T_1 (ap $U $alpha)) (app $T_2 (ap $U $alpha)))
                       (&+ (app (@i* $T_1 $U) $alpha) (app (@i* $T_2 $U) $alpha))))
            "于是" (disL $T_1 $T_2 $U) ". (读者或许注意到了这两个分配律的证明并没有用到"
            $T_1 "和" $T_2 "是线性的这个事实, 而且第二个证明也没有用到" $U "是线性的.)")
        (Li "我们将c的证明留给读者.")))
   (P "这个引理的内容和定理5的一部分告诉我们向量空间" (&L $V $V) "和复合运算构成了一个叫做"
      "含幺元的线性代数的结构. 我们将在第4章讨论这个东西. [译注: 其实在一般的代数学书籍里"
      "这种结构就叫代数.]")
   ((example #:n "8")
    "如果" $A "是一个元素来源于" $F "的" m*n "矩阵, 我们可以由" (&= (app $T $X) (&i* $A $X))
    "定义一个从" (^ $F n*1) "到" (^ $F m*1) "的线性变换" $T ". 如果" $B "是一个" (&c* $p $m)
    "的矩阵, 那么我们可以通过" (&= (app $U $Y) (&i* $B $Y)) "定义一个从" (^ $F m*1) "到"
    (^ $F (&c* $p $1)) "的线性变换" $U ". 它们的复合" (&i* $U $T) "是很容易描述的:"
    (MB (deriv (app (@i* $U $T) $X)
               (app $U (app $T $X))
               (app $U (&i* $A $X))
               (&i* $B (@i* $A $X))
               (&i* (@i* $B $A) $X)))
    "因此" (&i* $U $T) "即&quot;左乘积矩阵" (&i* $B $A) "&quot;.")
   ((example #:n "9")
    "令" $F "是一个域而" $V "是所有从" $F "到" $F "的多项式函数构成的向量空间. 令" $D
    "是例子2所定义的微分算子, 令" $T "是&quot;乘上" $x "&quot;的线性算子:"
    (MB (&= (app (@ap $T $f) $x) (&i* $x (app $f $x))) ".")
    "那么" (&!= (&i* $D $T) (&i* $T $D)) ". 实际上, 读者应该很容易验证"
    (&= (&- (&i* $D $T) (&i* $T $D)) $I) ", 即恒等算子.")
   (P "即便我们定义的" (&L $V $V) "上的乘法并不交换, 其与" (&L $V $V)
      "的向量空间运算有着很好的联系.")
   ((example #:n "10")
    "令" basis:def "是向量空间" $V "的一个有序基. "
    "考虑定理5的证明中出现的线性算子" (^ $E (&cm $p $q)) ":"
    (MB (&= (app (^ $E (&cm $p $q)) $alpha_i) (&i* (&delta $i $q) $alpha_p)) ".")
    "这" $n^2 "个线性算子构成了" $V "上的线性算子空间的一个基. " (&i* (&E $p $q) (&E $r $s))
    "是什么呢? 我们有"
    (MB (deriv (app (@i* (&E $p $q) (&E $r $s)) $alpha_i)
               (app (&E $p $q) (&i* (&delta $i $s) $alpha_r))
               (&i* (&delta $i $s) (app (&E $p $q) $alpha_r))
               (&i* (&delta $i $s) (&delta $r $q) $alpha_p)))
    "因此"
    (MB (&= (&i* (&E $p $q) (&E $r $s))
            (Choice0
             ($0 ", 如果" (&!= $r $q))
             ((&E $p $s) ", 如果" (&= $q $r)))))
    "令" $T "是一个" $V "上的线性算子, 我们在定理5的证明中表明如果"
    (MB (&cm (&= $A_j (coordm (ap $T $alpha_j)))
             (&= $A (li0 $A_1 $..h $A_n))))
    "那么"
    (MB (&= $T (sum (&= $p $1) $n
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (&E $p $q))))) ".")
    "如果"
    (MB (&= $U (sum (&= $r $1) $n
                    (sum (&= $s $1) $n
                         (&i* (mref $B $r $s) (&E $r $s))))))
    "是" $V "上另一个线性算子, 那么上一条引理告诉我们"
    (MB (deriv (&i* $T $U)
               (&i* (@sum (&= $p $1) $n
                          (sum (&= $q $1) $n
                               (&i* (mref $A $p $q) (&E $p $q))))
                    (@sum (&= $r $1) $n
                          (sum (&= $s $1) $n
                               (&i* (mref $B $r $s) (&E $r $s)))))
               (sum (&= $p $1) $n
                    (sum (&= $q $1) $n
                         (sum (&= $r $1) $n
                              (sum (&= $s $1) $n
                                   (&i* (mref $A $p $q) (mref $B $r $s)
                                        (&E $p $q) (&E $r $s))))))))
    "我们注意到, 这巨大的求和之中只有满足" (&= $q $r) "的项才能活下来, 又因为"
    (&= (&i* (&E $p $r) (&E $r $s)) (&E $p $s)) ", 我们有"
    (MB (deriv (&i* $T $U)
               (sum (&= $p $1) $n
                    (sum (&= $s $1) $n
                         (&i* (@sum (&= $r $1) $n
                                    (&i* (mref $A $p $r) (mref $B $r $s)))
                              (&E $p $s))))
               (sum (&= $p $1) $n
                    (sum (&= $s $1) $n
                         (&i* (mref (@i* $A $B) $p $s)
                              (&E $p $s))))))
    "因此, 复合" $T "和" $U "的效用相当于矩阵" $A "和" $B "相乘.")
   (P "在我们对于线性变换的代数运算的讨论中, 我们还没有说任何与可逆性相关的东西. "
      "我们所特别关心的问题之一是, 对于向量空间" $V "上什么样的线性算子" $T
      "存在线性算子" (inv $T) "满足" (&= (&i* $T (inv $T)) (&i* (inv $T) $T) $I) "? "
      "[译注: 读者应该将这里的" (inv $T) "当作一个整体, 而不是" $T "的逆, 因为还没有定义逆运算.]")
   (P "从" $V "到" $W "的函数称为可逆的, 如果存在一个从" $W "到" $V "的函数" $U
      "满足" (&i* $U $T) "是" $V "上的恒等函数而" (&i* $T $U) "是" $W "上的恒等函数. 如果"
      $T "是可逆的, 那么函数" $U "是唯一的, 我们将其记作" (inv $T) ". (见附录.) 而且, " $T
      "可逆当且仅当"
      (Ol (Li $T "是一一的, 即" (&= (ap $T $alpha) (ap $T $beta)) "可以推出" (&= $alpha $beta) ";")
          (Li $T "是映上的, 即" $T "的像是(整个的)" $W "."))
      "[译注: 一一和映上是过时的术语, 之后我们将用单射和满射.]")
   ((theorem #:n "7")
    "令" $V "和" $W "是域" $F "上的向量空间, 令" $T "是从" $V "到" $W "的线性变换. 如果" $T
    "是可逆的, 那么逆函数是一个从" $W "到" $V "的线性变换. [译注: 这里说的可逆是函数的可逆.]")
   ((proof)
    "这里我们重复以强调一个点. 当" $T "是单射且是满射, 那么存在唯一决定的从" $W "到" $V"的逆函数"
    (inv $T) "满足" (&i* (inv $T) $T) "是" $V "上的恒等函数而" (&i* $T (inv $T)) "是" $W
    "上的恒等函数. 现在我们要证明的是, 如果线性函数" $T "是可逆的, 那么其逆" (inv $T)
    "也是线性的." (Br)
    "令" $beta_1 "和" $beta_2 "是" $W "的向量而" $c "是一个标量, 我们想要证明"
    (MB (&= (app (inv $T) (LC $c $beta_1 $beta_2))
            (LC $c (ap (inv $T) $beta_1) (ap (inv $T) $beta_2))) ".")
    "令" (&cm (&= $alpha_i (ap (inv $T) $beta_i)) (&= $i (&cm $1 $2))) ", 即令" $alpha_i
    "是" $V "中唯一满足" (&= (ap $T $alpha_i) $beta_i) "的向量. 既然" $T "是线性的, 那么"
    (MB (deriv (app $T (LC $c $alpha_1 $alpha_2))
               (LC $c (ap $T $alpha_1) (ap $T $alpha_2))
               (LC $c $beta_1 $beta_2)))
    "因此" (LC $c $alpha_1 $alpha_2) "是" $V "中唯一的由" $T "送至" (LC $c $beta_1 $beta_2)
    "的向量, 于是"
    (MB (deriv (app (inv $T) (LC $c $beta_1 $beta_2))
               (LC $c $alpha_1 $alpha_2)
               (LC $c (@ap (inv $T) $beta_1) (ap (inv $T) $beta_2)))))
   (P "设我们有一个从" $V "到" $W "的可逆的线性变换" $T "和一个从" $W "到" $Z "的可逆的线性变换"
      $U ", 那么" (&i* $U $T) "是可逆的并且" (&= (inv (@i* $U $T)) (&i* (inv $T) (inv $U)))
      ". 这个结论并不需要线性性质, 也不需要分开检验" (&i* $U $T) "是单射和满射. 所有需要做的事情"
      "只是验证" (&i* (inv $T) (inv $U)) "既是" (&i* $U $T) "的左逆也是" (&i* $U $T) "的右逆.")
   (P "如果" $T "是线性的, 那么" (&= (app $T (&- $alpha $beta)) (&- (ap $T $alpha) (ap $T $beta)))
      ". 因此, " (&= (ap $T $alpha) (ap $T $beta)) "当且仅当" (&= (app $T (&- $alpha $beta)) $0)
      ". 这极大地简化了对于" $T "是否为单射的验证. 让我们称一个线性变换是非奇异的, 如果"
      (&= (ap $T $gamma) $0) "可以推出" (&= $gamma $0) ", 即" $T "的零空间是" (setE $0)
      ". 显然, " $T "是单射当且仅当" $T "非奇异. 这个评注的一个扩展是非奇异的线性变换就是那些"
      "保持线性无关的线性变换.")
   ((theorem #:n "8")
    "令" $T "是一个从" $V "到" $W "的线性变换, 那么" $T "是非奇异的当且仅当" $V
    "的每个线性无关子集在" $T "下的像是" $W "的线性无关子集.")
   ((proof)
    "首先设" $T "是非奇异的. 令" $S "是" $V "的一个线性无关子集. 如果" (&cm $alpha_1 $..h $alpha_k)
    "是" $S "中的向量 [译注: 不同的向量], 那么" (&cm (ap $T $alpha_1) $..h (ap $T $alpha_k))
    "是线性无关的, 因为如果"
    (MB (&= (LC0 $c_1 (@ap $T $alpha_1) $c_k (@ap $T $alpha_k)) $0))
    "那么"
    (MB (&= (app $T (LC0 $c_1 $alpha_1 $c_k $alpha_k)) $0))
    "既然" $T "是非奇异的, 那么"
    (MB (&= (LC0 $c_1 $alpha_1 $c_k $alpha_k) $0))
    "从中我们可以得出每个" (&= $c_i $0) ", 因为" $S "是一个线性无关的集合. 这个论证表明" $S
    "在" $T "下的像是线性无关的." (Br)
    "设" $T "将线性无关的子集映射至线性无关的子集. 令" $alpha "是" $V "的一个非零向量, 那么仅包含"
    $alpha "的集合" $S "是线性无关的. " $S "的像是仅包含向量" (ap $T $alpha) "的集合, 而这个集合"
    "是线性无关的. 因而" (&!= (ap $T $alpha) $0) ", 否则的话就是线性相关的了. 这表明" $T
    "的零空间是零子空间, 即" $T "是非奇异的.")
   ((example #:n "11")
    "令" $F "是一个复数域的子域 (或者特征为零的域), 令" $V "是域" $F "上的多项式函数的空间. "
    "考虑例子9的微分算子" $D "和&quot;乘上" $x "&quot;的算子" $T ". 既然" $D "将每个常函数送至"
    $0 ", " $D "是奇异的. 然而, 因为" $V "不是有限维的, " $D "的像是整个" $V ", 于是定义一个"
    $D "的右逆是有可能的. 例如, 如果" $E "是不定积分算子:"
    (MB (&= (app $E (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)))
            (&+ (&i* $c_0 $x) (&i* 1/2 $c_1 $x^2) $..c
                (&i* (~ $1 (&+ $n $1)) $c_n (^ $x (&+ $n $1))))))
    "那么" $E "是" $V "上的线性算子并且" (&= (&i* $D $E) $I) ". 另一方面, "
    (&!= (&i* $E $D) $I) ", 因为" (&i* $E $D) "将每个常函数都送至" $0 ". 与之相对地, 算子" $T
    "是非奇异的, 因为如果对于每个" $x "有" (&= (&i* $x (app $f $x)) $0) ", 那么" (&= $f $0)
    ". 因此, 可以找到" $T "的一个左逆. 例如, 如果" $U "是&quot;移除常数项并除以" $x "&quot;的操作:"
    (MB (&= (app $U (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n)))
            (&+ $c_1 (&i* $c_2 $x) $..c (&i* $c_n (^ $x (&- $n $1))))))
    "那么" $U "是一个" $V "上的线性算子并且" (&= (&i* $U $T) $I) ". 但是" (&!= (&i* $T $U) $I)
    ", 因为每个" (&i* $T $U) "的像中的函数自然也在" $T "的像中, 而" $T "的像是所有满足"
    (&= (app $f $0) $0) "的函数" $f "构成的空间. [译注: 而不是整个" $V ".]")
   ((example #:n "12")
    "令" $F "是一个域而" $T "是一个" $F^2 "上的线性算子, 其由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 (&+ $x_1 $x_2) $x_1)))
    "定义. 那么, " $T "是非奇异的, 因为如果" (&= (appl $T $x_1 $x_2) $0) ", 我们有"
    (MB (Choice ($x_1 $+ $x_2 $= $0)
                ($    $  $x_1 $= $0)))
    "于是" (&= $x_1 $x_2 $0) ". 我们也看出" $T "是满射, 因为如果令" (tu0 $z_1 $z_2)
    "是" $F^2 "中任意的向量, 为了证明" (tu0 $z_1 $z_2) "在" $T "的像中, 我们必须找出满足"
    (MB (Choice ($x_1 $+ $x_2 $= $z_1)
                ($    $  $x_1 $= $z_2)))
    "的标量" $x_1 "和" $x_2 ", 而" (&cm (&= $x_1 $z_2) (&= $x_2 (&- $z_1 $z_2)))
    "就是显而易见的解. 这个计算为我们提供了" (inv $T) "的显式公式, 即"
    (MB (&= (appl (inv $T) $z_1 $z_2) (tu0 $z_2 (&- $z_1 $z_2))) "."))
   (P "在例子11之中我们看到一个线性变换可能是非奇异的但不是满射, 或者可能是满射但不是非奇异的. "
      "然而, 上面这个例子为我们刻画了一种情形, 其中例子11的这种事情不可能发生.")
   ((theorem #:n "9")
    "令" $V "和" $W "是域" $F "上的有限维向量空间, 并且" (&= (&dim $V) (&dim $W))
    ". 如果" $T "是一个从" $V "到" $W "的线性变换, 那么以下陈述是等价的:"
    (Ol #:attr* '((type "i"))
        (Li $T "是可逆的.")
        (Li $T "是非奇异的.")
        (Li $T "是满射, 即" $T "的像是" $W ".")))
   ((proof)
    "令" (&= $n (&dim $V) (&dim $W)) ", 从定理2我们知道"
    (MB (&= (&+ (&rank $T) (&nullity $T)) $n) ".")
    "既然" $T "是非奇异的当且仅当" (&= (&nullity $T) $0) ", " $T "的像是" $W
    "当且仅当" (&= (&rank $T) $n) " (因为" (&= $n (&dim $W)) "), 而且零化度是" $0
    "当且仅当秩为" $n ", 那么" $T "是非奇异的当且仅当" (&= (app $T $V) $W) ". 于是, 只要"
    "ii或iii其中之一成立, 那么另一条也成立, 那么" $T "就是可逆的了.")
   (P "我们提醒读者一下, 除非有限维和" (&= (&dim $V) (&dim $W)) "的条件都满足, 否则"
      "就不要应用定理9. 在定理9的假设下, 条件i, ii, iii还等价于以下陈述."
      (Ol #:attr* '((type "i") (start "4"))
          (Li "如果" (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基, 那么"
              (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "是" $W "的一个基.")
          (Li "存在" $V "的某个基" (setE $alpha_1 $..h $alpha_n) "使得"
              (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "是" $W "的一个基."))
      "我们将给出一个这五个条件等价的证明, 它不同于之前给出的三个条件等价的证明.")
   (P "i推出ii. 如果" $T "是可逆的, " $T "当然是非奇异的. ii推出iii. 设" $T
      "是非奇异的. 令" (setE $alpha_1 $..h $alpha_n) "是" $V "的一个基, 那么根据定理8, "
      (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "是" $W "的一个线性无关集合. 而且, 因为"
      $W "的维数也是" $n ", 所以这个集合也构成了" $W "的一个基. 现在令" $beta "是" $W
      "任意的向量, 那么存在标量" (&cm $c_1 $..h $c_n) "满足"
      (MB (deriv $beta
                 (LC0 $c_1 (@ap $T $alpha_1) $c_n (@ap $T $alpha_n))
                 (app $T (LC0 $c_1 $alpha_1 $c_n $alpha_n))))
      "这表明" $beta "在" $T "的像之中. iii推出iv. 现在我们假定" $T "是满射. 如果"
      (setE $alpha_1 $..h $alpha_n) "是" $V "任意的基, 那么"
      (setE (ap $T $alpha_1) $..h (ap $T $alpha_n)) "可以张成" $T
      "的像, 根据假设也就是整个" $W ". 既然" $W "的维数是" $n ", 那么这" $n
      "个向量必然是线性无关的, 也就是说构成了" $W "的一个基. iv推出v. 这不需要证明. "
      "v推出i. 设存在" $V "的某个基满足" (setE (ap $T $alpha_1) $..h (ap $T $alpha_n))
      "是" $W "的一个基. 既然" (ap $T $alpha_i) "可以张成" $W ", 那么显然" $T
      "的像是整个" $W ". 如果" (&= $alpha (LC0 $c_1 $alpha_1 $c_n $alpha_n))
      "在" $T "的零空间之中, 那么"
      (MB (&= (app $T (LC0 $c_1 $alpha_1 $c_n $alpha_n)) $0))
      "或者"
      (MB (&= (LC0 $c_1 (@ap $T $alpha_1) $c_n (@ap $T $alpha_n)) $0))
      "既然" (ap $T $alpha_i) "是线性无关的, 那么每个" (&= $c_i $0) ", 因此"
      (&= $alpha $0) ". 我们已经证明了" $T "的像是" $W "和" $T "是非奇异的, 所以"
      $T "是可逆的.")
   (P "一个空间" $V "上的可逆线性算子, 连带着复合运算, 提供了一个代数中被称为&quot;群"
      "&quot;的例子. 尽管我们没有时间细致地讨论群, 但是我们至少可以给出群的定义.")
   ((definition)
    "一个群由以下资料构成."
    (Ol (Li "一个集合" $G ";")
        (Li "一个法则 (或者说一个运算), 其联系" $G "中每对元素" $x "和" $y "以一个" $G
            "中元素" (&i* $x $y) ", 并且满足"
            (Ol #:attr* '((type "a"))
                (Li "对于所以" $G "中" (&cm $x $y $z) ", " (assoc* $x $y $z) ";")
                (Li "存在一个" $G "中的元素" $e "满足对于每个" $G "中的" $x
                    "有" (&= (&i* $e $x) (&i* $x $e) $x) ";")
                (Li "对于每个" $G "的元素" $x "存在一个" $G "中元素" (inv $x)
                    "与之对应, 满足" (&= (&i* $x (inv $x)) (&i* (inv $x) $x) $e) ".")))))
   (P "我们已经证明了复合" (&\|-> (tu0 $U $T) (&i* $U $T)) "联系空间" $V "上的每对可逆线性算子以另一个"
      $V "上的可逆线性算子. 复合是一个结合运算. 恒等算子" $I "对于每个" $T "有"
      (&= (&i* $I $T) (&i* $T $I) $T) ". 对于可逆的" $T ", (根据定理7)存在一个可逆的线性算子"
      (inv $T) "满足" (&= (&i* $T (inv $T)) (&i* (inv $T) $T) $I) ". 因此, " $V "上的可逆线性算子"
      "的集合, 连带着复合运算, 构成了一个群. 以矩阵乘法作为运算的" n*n "可逆矩阵的集合是另一个群的"
      "例子. 一个群是交换的, 如果它满足对于每个" $x "和" $y "有" (commute* $x $y) ". 以上两个我们"
      "给出的例子一般不是交换群. 人们经常将交换群的运算写成" (&\|-> (tu0 $x $y) (&+ $x $y))
      "而不是" (&\|-> (tu0 $x $y) (&i* $x $y)) ", 并用符号" $0 "表示&quot;恒元&quot;" $e
      ". 向量空间的向量的集合, 连带着向量加法, 是一个交换群. 一个域可以被描述为一个带有加法和乘法"
      "运算的集合, 其在加法下是一个交换群, 而非零元素在乘法下也构成了一个交换群, 并且分配律"
      (disR $x $y $z) "成立.")
   ((exercise #:n "1")
    "令" $T "和" $U "是" $RR^2 "上由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 $x_2 $x_1))
        "和" (&= (appl $U $x_1 $x_2) (tu0 $x_1 $0)))
    "定义的线性算子."
    (Ol #:attr* '((type "a"))
        (Li "如何几何地描述" $T "和" $U "?")
        (Li "像定义" $T "和" $U "一样给出刻画" (&cm (@+ $U $T) (&i* $U $T) (&i* $T $U) $T^2 $U^2)
            "的规则.")))
   ((exercise #:n "2")
    "令" $T "是" $CC^3 "上满足"
    (MB (&cm (&= (ap $T $epsilon_1) (tu0 $1 $0 $i))
             (&= (ap $T $epsilon_2) (tu0 $0 $1 $1))
             (&= (ap $T $epsilon_3) (tu0 $i $1 $0))))
    "的(唯一的)线性算子. " $T "可逆吗?")
   ((exercise #:n "3")
    "令" $T "是" $RR^3 "上由"
    (MB (&= (appl $T $x_1 $x_2 $x_3)
            (tu0 (&i* $3 $x_1) (&- $x_1 $x_2) (&+ (&i* $2 $x_1) $x_2 $x_3))))
    "定义的线性算子. " $T "可逆吗? 如果可逆的话, 像定义" $T "一样给出" (inv $T) "的规则.")
   ((exercise #:n "4")
    "对于练习3的线性算子" $T ", 证明"
    (MB (&= (&i* (@- $T^2 $I) (@- $T (&i* $3 $I))) $0) "."))
   ((exercise #:n "5")
    "令"
    (MB (&= $B (Mat ($1 $-1) ($-4 $4))))
    "令" $T "是由" (&= (app $T $A) (&i* $B $A)) "定义的" (^ $CC (&c* $2 $2))
    "上的线性算子. " $T "的秩是多少? 你能描述" $T^2 "吗?")
   ((exercise #:n "6")
    "令" $T "是从" $RR^3 "到" $RR^2 "的线性变换, 令" $U "是从" $RR^2 "到" $RR^3 "的线性变换. 证明变换"
    (&i* $U $T) "是不可逆的. 给出这个定理的一般化版本.")
   ((exercise #:n "7")
    "找出" $RR^2 "上两个线性算子" $T "和" $U "满足" (&= (&i* $T $U) $0) "但是" (&!= (&i* $U $T) $0) ".")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的向量空间, 令" $T "是" $V "上的一个线性算子. 如果" (&= $T^2 $0)
    ", 关于" $T "的像和零空间的关系你有什么可说的? 给出一个" $RR^2 "上的线性算子" $T
    "的例子, 其满足" (&= $T^2 $0) "但" (&!= $T $0) ".")
   ((exercise #:n "9")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 设存在一个" $V "上的线性算子" $U "满足"
    (&= (&i* $T $U) $I) ". 证明" $T "是可逆的, 并且" (&= $U (inv $T)) ". 给出一个例子表明在"
    $V "不是有限维的情况下这是错的. (提示: 令" (&= $T $D) ", 多项式函数空间上的微分算子.)")
   ((exercise #:n "10")
    "令" $A "是域" $F "上的一个" m*n "矩阵, 令" $T "是由" (&= (app $T $X) (&i* $A $X))
    "定义的从" (^ $F n*1) "到" (^ $F m*1) "的线性变换. 说明在" (&< $m $n) "的情况下" $T
    "可以是满射但不是非奇异的. 类似地, 说明在" (&> $m $n) "的情况下" $T "可以是非奇异的但不是满射.")
   ((exercise #:n "11")
    "令" $V "是一个有限维向量空间, 令" $T "是" $V "上的一个线性算子. 设" (&= (&rank $T^2) (&rank $T))
    ". 证明" $T "的像和零空间是不相交的 (disjoint), 即只有零向量作为共同元素.")
   ((exercise #:n "12")
    "令" (&cm $p $m $n) "是正整数而" $F "是一个域. 令" $V "是域" $F "上的" m*n "矩阵的空间, " $W
    "是域" $F "上的" (&c* $p $n) "矩阵的空间. 令" $B "是一个固定的" (&c* $p $m) "矩阵而" $T
    "是一个由" (&= (app $T $A) (&i* $B $A)) "定义的从" $V "到" $W "的线性变换. 证明" $T
    "可逆当且仅当" (&= $p $m) "且" $B "是一个可逆的" m*m "矩阵.")
   (H3 "第3.3节 同构")
   (P "如果" $V "和" $W "是域" $F "上的向量空间, 那么任何从" $V "到" $W "的双射的"
      "线性变换" $T "都被称为从" $V "到" $W "的同构. 如果存在从" $V "到" $W
      "的同构, 那么就称" $V "同构于" $W ". [译注: 更直接和正确的说法其实是可逆而不是双射, "
      "不过在向量空间的情况下这二者是等价的.]")
   (P "注意到" $V "平凡地同构于" $V ", 恒等算子是一个从" $V "到" $V "的同构. 并且, 如果"
      $V "通过" $T "同构于" $W ", 那么" $W "也同构于" $V ", 因为" (inv $T) "是一个从"
      $W "到" $V "的同构. 读者应该很容易验证如果" $V "同构于" $W "且" $W "同构于" $Z
      ", 那么" $V "同构于" $Z ". 简而言之, 同构是向量空间的类上的等价关系. [译注: 这里"
      "的用词是class而不是set, 因为所有的向量空间的确不构成一个集合.] 当存在一个从" $V
      "到" $W "的同构时, 我们有时也说" $V "和" $W "是同构的, 而不说" $V "同构于" $W
      ". 鉴于" $V "同构于" $W "当且仅当" $W "同构于" $V ", 这不会引起歧义.")
   ((theorem #:n "10")
    "每个域" $F "上的" $n "维向量空间都同构于空间" $F^n ".")
   ((proof)
    "令" $V "是域" $F "上的" $n "维向量空间, 令" basis:def
    "是" $V "的一个有序基. 我们按照以下方式定义从" $V "到" $F^n "的函数" $T ": 如果"
    $alpha "在" $V "中, 令" (ap $T $alpha) "是" $alpha "相对于有序基" $BBB
    "的坐标" $n "元组" (tu0 $x_1 $..h $x_n) ", 即满足"
    (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)))
    "的" $n "元组. 根据我们第2章对于坐标的讨论, 我们验证这个" $T "是线性的且是双射的.")
   (P "出于许多目的我们可以将同构的向量空间视为&quot;相同的&quot;, 尽管空间中的向量和"
      "运算可能是相当不同的. 我们目前不会详细讨论这个想法, 但将在我们对于向量空间的研究"
      "中积累对于同构的理解以及同构空间是&quot;相同的&quot;这个感觉.")
   (P "我们将作出一些简要的评注. 设" $T "是一个从" $V "到" $W "的同构. 如果" $S
      "是" $V "的一个子集, 那么定理8告诉我们" $S "是线性无关的当且仅当集合" (app $T $S)
      "在" $W "中是线性无关的. 因此, 在判断" $S "是否线性无关时, 检视" $S "还是" (app $T $S)
      "是无关紧要的. 从中我们可以看出, 同构是&quot;维数保持的&quot;, 也就是说对于" $V
      "任意的有限维子空间, 其在" $T "下的像有着相同的维数. 现在我们给出这个想法的一个非常"
      "简单的刻画. 设" $A "是域" $F "上的一个" m*n "矩阵, 实际上我们给过两种对于矩阵" $A
      "的解空间的定义. 第一种是" $F^n "中所有满足线性方程组" AX=0 "的每个方程的" $n "元组"
      (tu0 $x_1 $..h $x_n) "构成的集合. 第二种是所有满足" AX=0 "的" n*1 "列矩阵" $X
      "构成的集合. 第一种解空间是" $F^n "的子空间, 第二种解空间是" (^ $F n*1) "的子空间. "
      "实际上" $F^n "和" (^ $F n*1) "之间有一个显见的同构, 即"
      (MB (&\|-> (tu0 $x_1 $..h $x_n) (Mat ($x_1) ($..v) ($x_n))) ".")
      "在这个同构下, " $A "的第一种解空间被映射至第二种解空间. 这两个空间有着相同的维数, "
      "于是在证明关于解空间的维数的定理时, 选择那个空间来讨论是无关紧要的. 实际上, 读者"
      "或许并不会产生一点犹豫, 如果我们选择将" $F^n "和" (^ $F n*1) "视为等同的. "
      "当方便的时候, 我们就会这么做, 而不方便的时候, 我们就不这么做.")
   ((exercise #:n "1")
    "令" $V "是复数集, 令" $F "是实数域. 在通常的运算下, " $V "是" $F
    "上的一个向量空间. 显式描述一个从该空间到" $RR^2 "的同构.")
   ((exercise #:n "2")
    "令" $V "是复数域上的向量空间, 并设存在一个从" $V "到" $CC^3 "的同构" $T
    ". 令" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "是" $V "中向量, 满足"
    (MB (&cm (&= (ap $T $alpha_1) (tu0 $1 $0 $i))
             (&= (ap $T $alpha_2) (tu0 $-2 (&+ $1 $i) $0))
             (&= (ap $T $alpha_3) (tu0 $-1 $1 $1))
             (&= (ap $T $alpha_4) (tu0 (Msqrt $2) $i $3))) ".")
    (Ol #:attr* '((type "a"))
        (Li $alpha_1 "在" $alpha_2 "和" $alpha_3 "张成的子空间中吗?")
        (Li "令" $W_1 "是" $alpha_1 "和" $alpha_2 "张成的子空间, 令" $W_2 "是" $alpha_3
            "和" $alpha_4 "张成的子空间, 那么" $W_1 "和" $W_2 "的交是什么呢?")
        (Li "找出一个这四个向量" $alpha_j "张成的" $V "的子空间的基.")))
   ((exercise #:n "3")
    "令" $W "是所有" 2*2 "的复Hermite矩阵构成的集合. 正如我们在第2章的例子6中所指出的, 在通常的运算下, "
    $W "是一个实数域上的向量空间. 验证"
    (MB (&\|-> (tu0 $x $y $z $t)
               (Mat ((&+ $t $x) (&+ $y (&i* $i $z)))
                    ((&- $y (&i* $i $z)) (&- $t $x)))))
    "是一个从" $RR^4 "到" $W "的同构.")
   ((exercise #:n "4")
    "表明" (^ $F m*n) "同构于" (^ $F (&i* $m $n)) ".")
   ((exercise #:n "5")
    "令" $V "是复数集, 其可以被视为实数域上的向量空间 (练习1). 我们按照以下方式定义一个从"
    $V "到" 2*2 "实矩阵空间的函数" $T ". 如果" (&= $z (&+ $x (&i* $i $y))) ", 其中"
    $x "和" $y "是实数, 那么"
    (MB (&= (app $T $z) (Mat ((&+ $x (&i* $7 $y)) (&i* $5 $y))
                             ((&- (&i* $10 $y)) (&- $x (&i* $7 $y))))) ".")
    (Ol #:attr* '((type "a"))
        (Li "验证" $T "是一个单射的(实)线性变换.")
        (Li "验证" (preserve* $T $z_1 $z_2) ".")
        (Li "你如何描述" $T "的像?")))
   ((exercise #:n "6")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 证明" $V "和" $W "同构当且仅当"
    (&= (&dim $V) (&dim $W)) ".")
   ((exercise #:n "7")
    "令" $V "和" $W "是域" $F "上的向量空间, " $U "是一个从" $V "到" $W
    "的同构. 证明" (&\|-> $T (&i* $U $T (inv $U))) "是一个从" (&L $V $V) "到"
    (&L $W $W) "的同构.")
   (H3 "第3.4节 通过矩阵表示变换")
   (P "令" $V "是域" $F "上的" $n "维向量空间, 令" $W "是域" $F "上的" $m
      "维向量空间. 令" basis:def
      "是" $V "的一个有序基, 令" (&= $BBB^ (setE $beta_1 $..h $beta_m))
      "是" $W "的一个有序基. 如果" $T "是任意的从" $V "到" $W "的线性变换, 那么" $T
      "由其施加于向量" $alpha_j "的作用决定. 每个向量" (ap $T $alpha_j)
      "皆可唯一地表示为" $beta_i "的线性组合"
      (MB (&= (ap $T $alpha_j)
              (sum (&= $i $1) $m
                   (&i* (mref $A $i $j) $beta_i))))
      "其中" (&cm (mref $A $1 $j) $..h (mref $A $m $j)) "是" (ap $T $alpha_j)
      "在有序基" $BBB^ "下的坐标. 于是, 变换" $T "可由" (&i* $m $n) "个标量"
      (mref $A $i $j) "决定. 由" (&= (appl $A $i $j) (mref $A $i $j))
      "定义的" m*n "矩阵" $A "被称为" $T "相对于有序基" $BBB "和" $BBB^
      "的矩阵. 我们即时的任务在于显式地理解矩阵" $A "是如何决定线性变换" $T "的.")
   (P "如果" (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)) "是" $V "中的一个向量, 那么"
      (MB (deriv (ap $T $alpha)
                 (ap $T (@sum (&= $j $1) $n (&i* $x_j $alpha_j)))
                 (sum (&= $j $1) $n (&i* $x_j (@ap $T $alpha_j)))
                 (sum (&= $j $1) $n
                      (&i* $x_j (sum (&= $i $1) $m
                                     (&i* (mref $A $i $j) $beta_i))))
                 (sum (&= $i $1) $m
                      (&i* (@sum (&= $j $1) $n
                                 (&i* (mref $A $i $j) $x_j))
                           $beta_i))))
      "如果" $X "是" $alpha "在有序基" $BBB "下的坐标矩阵, 那么以上的计算表明"
      (&i* $A $X) "是向量" (ap $T $alpha) "在有序基" $BBB^ "下的坐标矩阵, 因为标量"
      (MB (sum (&= $j $1) $n (&i* (mref $A $i $j) $x_j)))
      "是列矩阵" (&i* $A $X) "第" $i "行的元素. 让我们也观察到如果" $A "是域" $F
      "上任意的" m*n "矩阵, 那么"
      (MB (&= (ap $T (@sum (&= $j $1) $n (&i* $x_j $alpha_j)))
              (sum (&= $i $1) $m
                   (&i* (@sum (&= $j $1) $n
                              (&i* (mref $A $i $j) $x_j))
                        $beta_i))))
      "定义了一个从" $V "到" $W "的线性变换" $T ", 并且其相对于" $BBB "和" $BBB^
      "的矩阵是" $A ". 我们形式地总结如下:")
   ((theorem #:n "11")
    "令" $V "是域" $F "上的" $n "维向量空间, 令" $W "是域" $F "上的" $m
    "维向量空间. 令" basis:def
    "是" $V "的一个有序基, 令" (&= $BBB^ (setE $beta_1 $..h $beta_m))
    "是" $W "的一个有序基. 对于每个从" $V "到" $W "的线性变换" $T
    ", 存在一个域" $F "上的" m*n "矩阵" $A "满足"
    (MB (&= (coordm (ap $T $alpha) $BBB^)
            (&i* $A (coordm $alpha $BBB))))
    "对于每个" $V "中向量" $alpha "成立. 并且, " (&\|-> $T $A)
    "是一个从所有从" $V "到" $W "的线性变换构成的集合到所有域" $F
    "上的" m*n "矩阵构成的集合的一一对应.")
   (P "定理11中与" $T "相关联着的矩阵" $A "被称为" $T "相对于有序基" $BBB "和"
      $BBB^ "的矩阵. 注意到式子"
      (&= (ap $T $alpha_j)
          (sum (&= $i $1) $m
               (&i* (mref $A $i $j) $beta_i)))
      "是说矩阵" $A "的列" (&cm $A_1 $..h $A_n) "由"
      (MB (&cm (&= $A_j (coordm (ap $T $alpha_j) $BBB^))
               (&= $j (&cm $1 $..h $n))))
      "给出. 如果" $U "是另一个从" $V "到" $W "的线性变换, 并且" (&= $B (li0 $B_1 $..h $B_n))
      "是" $U "相对于有序基" $BBB "和" $BBB^ "的矩阵, 那么" (LC $c $A $B) "是" (LC $c $T $U)
      "相对于有序基" $BBB "和" $BBB^ "矩阵. 这是显然的, 因为"
      (let ((cm (lambda (T) (coordm T $BBB^))))
        (MB (deriv (LC $c $A_j $B_j)
                   (LC $c (cm (ap $T $alpha_j)) (cm (ap $U $alpha_j)))
                   (cm (LC $c (ap $T $alpha_j) (ap $U $alpha_j)))
                   (cm (ap (@LC $c $T $U) $alpha_j))))))
   ((theorem #:n "12")
    "令" $V "是域" $F "上的" $n "维向量空间, 令" $W "是域" $F "上的" $m
    "维向量空间. 对于" $V "和" $W "相应的每对有序基" $BBB "和" $BBB^ ", 为线性变换" $T
    "赋予其相对于" $BBB "和" $BBB^ "的矩阵的函数是一个空间" (&L $V $W) "和" (^ $F m*n)
    "之间的同构.")
   ((proof)
    "我们观察到这个函数是线性的 [译注: 就是上一段], 并且如定理11所言, 这个函数是"
    (&L $V $W) "和" (^ $F m*n) "之间的双射.")
   (P "我们将特别关心从一个空间到自身的线性变换的矩阵表示, 也就是线性算子的矩阵表示. 在"
      "这种情况下使用相同的基是方便的, 即取" (&= $BBB $BBB^) ". 我们将称这个表示矩阵为"
      $T "相对于有序基" $BBB "的矩阵. 因为这个概念是如此重要, 以至于我们将重复这个定义. 如果"
      $T "是有限维向量空间" $V "上的一个线性算子而" basis:def
      "是" $V "的一个有序基, 那么" $T "相对于" $BBB "的矩阵 (或者说, " $T "在有序基" $BBB
      "下的矩阵) 是一个" n*n "矩阵" $A ", 其元素" Aij "由式子"
      (MB (&cm (&= (ap $T $alpha_j) (sum (&= $i $1) $n (&i* Aij $alpha_i)))
               (&= $j (&cm $1 $..h $n))))
      "定义. 读者必须记住这个表示" $T "的矩阵依赖于有序基" $BBB ", 而" $V "的每个有序基下都有一个"
      $T "的表示矩阵. (如果是从一个空间" $V "到另一个空间" $W "的线性变换, 那就是依赖于两个有序基, 一个是"
      $V "的有序基, 另一个是" $W "的有序基.) 为了不忘记这个依赖关系, 我们将使用记号"
      (MB (coordm $T))
      "表示线性算子" $T "在有序基" $BBB "下的矩阵. 这个矩阵以及相关的有序基刻画" $T "的方式在于对于每个"
      $V "中的" $alpha "有"
      (MB (&= (coordm (ap $T $alpha)) (&i* (coordm $T) (coordm $alpha))) "."))
   ((example #:n "13")
    "令" $V "是域" $F "上的" n*1 "列矩阵构成的空间, 令" $W "是域" $F "上的" m*1 "列矩阵构成的空间, 令"
    $A "是域" $F "上一个固定的" m*n "矩阵. 令" $T "是一个从" $V "到" $W "的线性变换, 由"
    (&= (app $T $X) (&i* $A $X)) "定义. 令" $BBB "是" $V "的有序基, 其类似于" $F^n "的标准有序基, "
    "也就是说, " $BBB "的第" $i "个向量是" n*1 "矩阵" $X_i ", 其第" $i "行是" $1 ", 而其他元素为"
    $0 ". 令" $BBB^ "是" $W "的有序基, 其定义方式与" $V "的这个有序基类似. 那么, " $T "相对于"
    $BBB "和" $BBB^ "的矩阵就是" $A "本身. 这是显然的, 因为矩阵" (&i* $A $X_j) "就是" $A
    "的第" $j "列.")
   ((example #:n "14")
    "令" $F "是一个域, 令" $T "是" $F^2 "上的一个线性算子, 由"
    (MB (&= (app $T $x_1 $x_2) (tu0 $x_1 $0)))
    "定义. 令" $BBB "是" $F^2 "的标准有序基, " (&= $BBB (tu0 $epsilon_1 $epsilon_2)) ". 既然"
    (MB (&cm (&= (ap $T $epsilon_1) (appl $T $1 $0) (tu0 $1 $0) (LC $1 $epsilon_1 $0 $epsilon_2))
             (&= (ap $T $epsilon_2) (appl $T $0 $1) (tu0 $0 $0) (LC $0 $epsilon_1 $0 $epsilon_2))) ",")
    "那么" $T "在有序基" $BBB "下的矩阵是"
    (MB (&= (coordm $T) (Mat ($1 $0) ($0 $0))) "."))
   ((example #:n "15")
    "令" $V "是所有具有形式"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2) (&i* $c_3 $x^3))))
    "的从" $RR "到" $RR "的多项式函数构成的向量空间, 即次数小于等于三的多项式函数的空间. 例子2的微分算子"
    $D "映射" $V "至" $V ", 鉴于" $D "是&quot;降次的&quot;. 令" $BBB "是" $V "的有序基, 其由四个函数"
    (&cm $f_1 $f_2 $f_3 $f_4) "构成, 通过" (&= (app $f_j $x) (^ $x (&- $j $1))) "定义, 那么"
    (let* ((lc (lambda (a b c d) (LC a $f_1 b $f_2 c $f_3 d $f_4)))
           (Df (lambda (n) (ap $D (_ $f n))))
           (Dfx (lambda (n) (app (@ (Df n)) $x)))
           (template (lambda (n e a b c d)
                       (list (Dfx n) $= (: e ",") $ (Df n) $= (lc a b c d)))))
      (MB
       ((Ttable (lambda (d i j)
                  (if (= j 2)
                      (set-attr* d 'columnalign "right")
                      d)))
        (&table
         (list (template $1 $0 $0 $0 $0 $0)
               (template $2 $1 $1 $0 $0 $0)
               (template $3 (&i* $2 $x) $0 $2 $0 $0)
               (template $4 (&i* $3 $x^2) $0 $0 $3 $0)
               )))))
    "于是" $D "在有序基" $BBB "下的矩阵是"
    (MB (&= (coordm $D) (Mat ($0 $1 $0 $0) ($0 $0 $2 $0) ($0 $0 $0 $3) ($0 $0 $0 $0))) "."))
   (P "我们已经见过把变换相加时表示矩阵会怎么变化了, 即把矩阵相加. 现在我们想问把变换复合起来时"
      "会发生些什么. 更准确地说, 令" (&cm $V $W $Z) "是域" $F "上相应维数为" (&cm $n $m $p)
      "的向量空间. 令" $T "是一个从" $V "到" $W "的线性变换, 令" $U "是一个从" $W "到" $Z
      "的线性变换. 设" (&cm $V $W $Z) "相应的有序基分别为"
      (MB (&cm basis:def
               (&= $BBB^ (setE $beta_1 $..h $beta_m))
               (&= $BBB^^ (setE $gamma_1 $..h $gamma_p))) ".")
      "令" $A "是" $T "相对于" $BBB "和" $BBB^ "的矩阵, 令" $B "是" $U "相对于" $BBB^ "和"
      $BBB^^ "的矩阵. 那么, 很容易看出来变换" (&i* $U $T) "相对于" $BBB "和" $BBB^^
      "的矩阵" $C "就是" $B "和" $A "的积. 这是因为, 如果" $alpha "是" $V "中任意的向量, 那么"
      (MB (&cm (&= (coordm (ap $T $alpha) $BBB^)
                   (&i* $A (coordm $alpha $BBB)))
               (&= (coordm (ap $U (@ap $T $alpha)) $BBB^^)
                   (&i* $B (coordm (ap $T $alpha) $BBB^)))))
      "于是"
      (MB (&= (coordm (app (@i* $U $T) $alpha) $BBB^^)
              (&i* (@i* $B $A) (coordm $alpha $BBB))))
      "根据表示矩阵的定义和唯一性, 我们必有" (&= $C (&i* $B $A)) ". 读者也可通过施行以下计算来看出这点."
      (MB (deriv (app (@i* $U $T) $alpha_j)
                 (ap $U (@ap $T $alpha_j))
                 (ap $U (@sum (&= $k $1) $m (&i* (mref $A $k $j) $beta_k)))
                 (sum (&= $k $1) $m (&i* (mref $A $k $j) (@ap $U $beta_k)))
                 (sum (&= $k $1) $m
                      (&i* (mref $A $k $j)
                           (sum (&= $i $1) $p
                                (&i* (mref $B $i $k) $gamma_i))))
                 (sum (&= $i $1) $p
                      (&i* (@sum (&= $k $1) $m
                                 (&i* (mref $B $i $k) (mref $A $k $j)))
                           $gamma_i))))
      "于是我们必有"
      (MB (&= (mref $C $i $j)
              (sum (&= $k $1) $m (&i* (mref $B $i $k) (mref $A $k $j)))) ".")
      "之前我们定义矩阵乘法的动机在于矩阵行上的操作. 这里我们看到线性变换的复合也提供了强烈的动机. "
      "让我们形式化地总结一下这个结果.")
   ((theorem #:n "13")
    "令" (&cm $V $W $Z) "是域" $F "上的有限维向量空间. 令" $T "是从" $V "到" $W "的线性变换, " $U
    "是从" $W "到" $Z "的线性变换. 如果" (&cm $BBB $BBB^ $BBB^^) "分别是" (&cm $V $W $Z)
    "的有序基, 如果" $A "是" $T "相对于" $BBB "和" $BBB^ "的矩阵, " $B "是" $U "相对于" $BBB^
    "和" $BBB^^ "的矩阵, 那么变换的复合" (&i* $U $T) "相对于" $BBB "和" $BBB^^ "的矩阵是积"
    (&= $C (&i* $B $A)) ".")
   (P "注意到定理13给我们了一个矩阵乘法是结合运算的证明, 这个证明不需要计算, 并且独立于我们在第1章给出的证明."
      " 我们还应该指出我们在例子10中证明了定理13的特殊情况. [译注: 原文是例子12, 疑似应该是例子10.]")
   (P "如果" $T "和" $U "是空间" $V "上的线性算子, 并且我们以单一的有序基" $BBB "表示这两个变换, "
      "那么定理13呈现出特别简单的形式" (preserve coordm $U &i* $T) ". 因此, 在这种情况下由" $BBB
      "所决定的算子和矩阵之间的对应不仅是向量空间的同构, 还保持乘法. 这个事实的一个简单推论是线性算子" $T
      "可逆当且仅当矩阵" (coordm $T) "可逆. 这是因为恒等算子" $I "在任意的有序基下都由恒等矩阵表示, 于是"
      (MB (&= (&i* $U $T) (&i* $T $U) $I))
      "等价于"
      (MB (&= (&i* (coordm $U) (coordm $T)) (&i* (coordm $T) (coordm $U)) $I) ".")
      "当然, " $T "可逆时有"
      (MB (&= (coordm (inv $T)) (_^ (bra0 $T) $BBB $-1)) "."))
   (P "现在我们想要探究当有序基改变时表示矩阵会怎样变化. 为了简单起见, 我们将只考虑空间" $V
      "上的线性算子, 于是我们可以只使用一个有序基. 我们想问的特定问题如下. 令" $T "是有限维向量空间"
      $V "上的一个线性算子, 并令"
      (MB basis:def
          "和" (&= $BBB^ (setE (_^ $alpha $1 $prime) $..h (_^ $alpha $n $prime))))
      "是" $V "的两个有序基. 矩阵" (coordm $T) "和" (coordm $T $BBB^) "之间有什么联系呢? "
      "正如我们在第2章所观察到的那样, 存在一个唯一的" n*n "(可逆)矩阵" $P "满足对于每个" $V "的向量"
      $alpha "有"
      (MB (&= (coordm $alpha) (&i* $P (coordm $alpha $BBB^))) ".")
      "这个矩阵即" (&= $P (li0 $P_1 $..h $P_n)) ", 其中" (&= $P_j (coordm (_^ $alpha $j $prime)))
      ". 根据定义,"
      (MB (&= (coordm (ap $T $alpha)) (&i* (coordm $T) (coordm $alpha))) ".")
      "将坐标变换公式应用于" (ap $T $alpha) ", 我们就得到"
      (MB (&= (coordm (ap $T $alpha)) (&i* $P (coordm (ap $T $alpha) $BBB^))) ".")
      "结合这三个式子, 我们有"
      (MB (&= (&i* (coordm $T) $P (coordm $alpha $BBB^))
              (&i* $P (coordm (ap $T $alpha) $BBB^))))
      "或是"
      (MB (&= (&i* (sim (coordm $T)) (coordm $alpha $BBB^))
              (coordm (ap $T $alpha) $BBB^)))
      "因此就得到"
      (MB (&= (coordm $T $BBB^) (sim (coordm $T))) ".")
      "这回答了我们的问题.")
   (P "在形式化陈述这个结果之前, 让我们观察一下以下事实. 存在唯一的一个线性算子" $U "将有序基" $BBB
      "映射成" $BBB^ ", 其由"
      (MB (&cm (&= (ap $U $alpha_j) (_^ $alpha $j $prime))
               (&= $j (&cm $1 $..h $n))))
      "定义. 这个算子" $U "是可逆的, 因为它将" $V "的一个基映射至" $V "的另一个基. 上面的矩阵" $P
      "恰是" $U "在有序基" $BBB "下的表示, 因为" $P "是由"
      (MB (&= (_^ $alpha $j $prime) (sum (&= $i $1) $n (&i* (mref $P $i $j) $alpha_i))))
      "定义的, 既然" (&= (ap $U $alpha_j) (_^ $alpha $j $prime)) ", 这个式子也可以写成"
      (MB (&= (ap $U $alpha_j) (sum (&= $i $1) $n (&i* (mref $P $i $j) $alpha_i))))
      "于是" (&= $P (coordm $U)) ", 根据定义.")
   ((theorem #:n "14")
    "令" $V "是一个域" $F "上的有限维向量空间. 令"
    (MB basis:def
        "和" (&= $BBB^ (setE (_^ $alpha $1 $prime) $..h (_^ $alpha $n $prime))))
    "是" $V "的有序基. 设" $T "是" $V "上的一个线性算子. 如果" (&= $P (li0 $P_1 $..h $P_n))
    "是一个以" (&= $P_j (coordm (_^ $alpha $j $prime))) "为列的" n*n "矩阵, 那么"
    (MB (&= (coordm $T $BBB^) (sim (coordm $T))) ".")
    "或者说, 如果" $U "是由" (&cm (&= (ap $U $alpha_j) (_^ $alpha $j $prime)) (&= $j (&cm $1 $..h $n)))
    "定义的" $V "上的可逆线性算子, 那么"
    (MB (&= (coordm $T $BBB^) (&i* (_^ (bra0 $U) $BBB $-1) (coordm $T) (coordm $U))) "."))
   ((example #:n "16")
    "令" $T "是" $RR^2 "上由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) "定义的线性算子. 在例子14中我们表明"
    $T "在标准有序基" (&= $BBB (setE $epsilon_1 $epsilon_2)) "下的矩阵是"
    (MB (&= (coordm $T) (Mat ($1 $0) ($0 $0))) ".")
    "设" $BBB^ "是" $RR^2 "的有序基, 其由向量" (&= (_^ $epsilon $1 $prime) (tu0 $1 $1)) "和"
    (&= (_^ $epsilon $2 $prime) (tu0 $2 $1)) "构成, 那么"
    (MB (&cm (&= (_^ $epsilon $1 $prime) (&+ $epsilon_1 $epsilon_2))
             (&= (_^ $epsilon $2 $prime) (&+ (&i* $2 $epsilon_1) $epsilon_2))))
    "于是" $P "是矩阵"
    (MB (&= $P (Mat ($1 $2) ($1 $1))) ".")
    "根据简单的计算"
    (MB (&= (inv $P) (Mat ($-1 $2) ($1 $-1))) ".")
    "因此"
    (MB (deriv (coordm $T $BBB^)
               (sim (coordm $T))
               (&i* (Mat ($-1 $2) ($1 $-1)) (Mat ($1 $0) ($0 $0)) (Mat ($1 $2) ($1 $1)))
               (&i* (Mat ($-1 $2) ($1 $-1)) (Mat ($1 $2) ($0 $0)))
               (Mat ($-1 $-2) ($1 $2))))
    "我们很容易验证这是正确的, 因为"
    (MB (&cm (&= (ap $T (_^ $epsilon $1 $prime)) (tu0 $1 $0)
                 (&+ (&- (_^ $epsilon $1 $prime)) (_^ $epsilon $2 $prime)))
             (&= (ap $T (_^ $epsilon $2 $prime)) (tu0 $2 $0)
                 (LC $-2 (_^ $epsilon $1 $prime) $2 (_^ $epsilon $2 $prime)))) "."))
   ((example #:n "17")
    "令" $V "是从" $RR "到" $RR "的次数小于等于" $3 "的多项式函数构成的向量空间. 如例子15, 令"
    $D "是" $V "上的微分算子, 并令"
    (MB (&= $BBB (setE $f_1 $f_2 $f_3 $f_4)))
    "是" $V "的有序基, 其由" (&= (app $f_i $x) (^ $x (&- $i $1))) "定义. 令" $t "是一个实数, 定义"
    (&= (app $g_i $x) (^ (@+ $x $t) (&- $i $1))) ", 即"
    (MB (set-attr*
         (&Table
          ($g_1 $= $f_1)
          ($g_2 $= (&+ (&i* $t $f_1) $f_2))
          ($g_3 $= (&+ (&i* $t^2 $f_1) (&i* $2 $t $f_2) $f_3))
          ($g_4 $= (&+ (&i* $t^3 $f_1) (&i* $3 $t^2 $f_2) (&i* $3 $t $f_3) $f_4)))
         'columnalign "left"))
    "既然矩阵"
    (MB (&= $P (Mat ($1 $t $t^2 $t^3)
                    ($0 $1 (&i* $2 $t) (&i* $3 $t^2))
                    ($0 $0 $1 (&i* $3 $t))
                    ($0 $0 $0 $1))))
    "很容易看出来是可逆的, 并有"
    (MB (&= (inv $P)
            (Mat ($1 (&- $t) $t^2 (&- $t^3))
                 ($0 $1 (&i* $-2 $t) (&i* $3 $t^2))
                 ($0 $0 $1 (&i* $-3 $t))
                 ($0 $0 $0 $1))))
    "从中我们得知" (&= $BBB^ (setE $g_1 $g_2 $g_3 $g_4)) "是" $V "的一个有序基. 在例子15里, 我们发现"
    $D "在有序基" $BBB "下的矩阵为"
    (MB (&= (coordm $D)
            (Mat ($0 $1 $0 $0)
                 ($0 $0 $2 $0)
                 ($0 $0 $0 $3)
                 ($0 $0 $0 $0))) ".")
    "因此" $D "相对于有序基" $BBB^ "的矩阵为"
    (MB (deriv (sim (coordm $D))
               (&i* (Mat ($1 (&- $t) $t^2 (&- $t^3))
                         ($0 $1 (&i* $-2 $t) (&i* $3 $t^2))
                         ($0 $0 $1 (&i* $-3 $t))
                         ($0 $0 $0 $1))
                    (Mat ($0 $1 $0 $0)
                         ($0 $0 $2 $0)
                         ($0 $0 $0 $3)
                         ($0 $0 $0 $0))
                    (Mat ($1 $t $t^2 $t^3)
                         ($0 $1 (&i* $2 $t) (&i* $3 $t^2))
                         ($0 $0 $1 (&i* $3 $t))
                         ($0 $0 $0 $1)))
               (&i* (Mat ($1 (&- $t) $t^2 (&- $t^3))
                         ($0 $1 (&i* $-2 $t) (&i* $3 $t^2))
                         ($0 $0 $1 (&i* $-3 $t))
                         ($0 $0 $0 $1))
                    (Mat ($0 $1 (&i* $2 $t) (&i* $3 $t^2))
                         ($0 $0 $2 (&i* $6 $t))
                         ($0 $0 $0 $3)
                         ($0 $0 $0 $0)))
               (Mat ($0 $1 $0 $0)
                    ($0 $0 $2 $0)
                    ($0 $0 $0 $3)
                    ($0 $0 $0 $0))))
    "于是" $D "在有序基" $BBB "和" $BBB^ "下由相同的矩阵表示. 当然, 或许我们可以更直接地看出这点来, 因为"
    (MB (&cm (&= (ap $D $g_1) $0)
             (&= (ap $D $g_2) $g_1)
             (&= (ap $D $g_3) (&i* $2 $g_2))
             (&= (ap $D $g_4) (&i* $3 $g_3))) ".")
    "这个例子刻画了很好的一点. 如果读者已知一个线性算子在某个有序基" $BBB "下的矩阵, 并想要找出其在另一个有序基"
    $BBB^ "下的矩阵, 经常的情况是使用可逆矩阵" $P "施行坐标变换是最方便的. 然而, 有时直接诉诸定义来寻找"
    "表示矩阵可能要简单得多.")
   ((definition)
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵. 我们称" $B "在" $F "上相似于" $A ", 如果存在一个域" $F
    "上的可逆矩阵" $P "满足" (&= $B (sim $A)) ".")
   (P "根据定理14, 我们知道: 如果" $V "是一个域" $F "上的" $n "维向量空间而" $BBB "和" $BBB^
      "是" $V "的两个有序基, 那么对于每个" $V "上的线性算子" $T ", 矩阵" (&= $B (coordm $T $BBB^))
      "相似于矩阵" (&= $A (coordm $T)) ". 我们也可以从另一个方向看待这个事情. 设" $A "和" $B
      "是域" $F "上的" n*n "矩阵, 令" $BBB "是" $V "的一个有序基. 令" $T "是" $V "上的线性算子, 其在基"
      $BBB "下由" $A "表示. 如果" (&= $B (sim $A)) ", 令" $BBB^ "是经" $P "由" $BBB "得到的" $V
      "的有序基, 即"
      (MB (&= (_^ $alpha $j $prime) (sum (&= $i $1) $n (&i* (mref $P $i $j) $alpha_i))) ",")
      "那么" $T "在有序基" $BBB^ "下的矩阵就是" $B ".")
   (P "因此, 陈述" $B "相似于" $A "意味着在每个域" $F "上的" $n "维空间上, 矩阵" $A "和" $B
      "在两个(可能)不同的有序基下表示着相同的线性变换.")
   (P "注意到每个" n*n "矩阵" $A "都相似于自身, 只需令" (&= $P $I) "; 如果" $B "相似于" $A ", 那么"
      $A "相似于" $B ", 因为" (&= $B (sim $A)) "可以推出" (&= $A (&i* (inv (@ (inv $P))) $B (inv $P)))
      "; 如果" $B "相似于" $A "而" $C "相似于" $B ", 那么" $C "相似于" $A ", 因为" (&= $B (sim $A))
      "和" (&= $C (sim $B $Q)) "可以推出" (&= $C (sim $A (@i* $P $Q))) ". 因此, 相似性是域" $F "上的"
      n*n "矩阵的集合上的一个等价关系. 读者还应该注意到唯一与恒等矩阵" $I "相似的矩阵就是" $I
      "本身, 唯一与零矩阵相似的矩阵就是零矩阵本身.")
   ((exercise #:n "1")
    "令" $T "是" $CC^2 "上由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $x_2)) "定义的线性算子. 令" $BBB
    "是" $CC^2 "的标准有序基而" (&= $BBB^ (setE $alpha_1 $alpha_2)) "是由"
    (&cm (&= $alpha_1 (tu0 $1 $i)) (&= $alpha_2 (tu0 (&- $i) $2))) "定义的有序基."
    (Ol #:attr* '((type "a"))
        (Li $T "相对于" $BBB "和" $BBB^ "的矩阵是什么?")
        (Li $T "相对于" $BBB^ "和" $BBB "的矩阵是什么?")
        (Li $T "在有序基" $BBB^ "下的矩阵是什么?")
        (Li $T "在有序基" (setE $alpha_2 $alpha_1) "下的矩阵是什么?")))
   ((exercise #:n "2")
    "令" $T "是从" $RR^3 "到" $RR^2 "的线性变换, 其由"
    (MB (&= (appl $T $x_1 $x_2 $x_3) (tu0 (&+ $x_1 $x_2) (&- (&i* $2 $x_3) $x_1))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li "如果" $BBB "是" $RR^3 "的标准有序基而" $BBB^ "是" $RR^2 "的标准有序基, 那么" $T
            "相对于" $BBB "和" $BBB^ "的矩阵是什么?")
        (Li "如果" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "且" (&= $BBB^ (tu0 $beta_1 $beta_2)) ", 其中"
            (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1)) (&= $alpha_2 (tu0 $1 $1 $1)) (&= $alpha_3 (tu0 $1 $0 $0))
                     (&= $beta_1 (tu0 $0 $1)) (&= $beta_2 (tu0 $1 $0))))
            $T "相对于" $BBB "和" $BBB^ "的矩阵是什么?")))
   ((exercise #:n "3")
    "令" $T "是" $F^n "上的线性算子, 令" $A "是" $T "在" $F^n "的标准基下的矩阵, 令" $W "是由" $A
    "的列向量张成的" $F^n "的子空间. 请问" $W "和" $T "有何关系?")
   ((exercise #:n "4")
    "令" $V "是域" $F "上的一个二维向量空间, 令" $BBB "是" $V "的一个有序基. 如果" $T "是" $V
    "上的一个线性算子, 并且"
    (MB (&= (coordm $T) (Mat ($a $b) ($c $d))))
    "证明" (&= (: $T^2 $- (&i* (@+ $a $d) $T) $+ (&i* (@- (&i* $a $d) (&i* $b $c)) $I)) $0) ".")
   ((exercise #:n "5")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下的矩阵为"
    (MB (&= $A (Mat ($1 $2 $1) ($0 $1 $1) ($-1 $3 $4))) ".")
    "找出" $T "的像的一个基和" $T "的零空间的一个基.")
   ((exercise #:n "6")
    "令" $T "是" $RR^2 "上由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 (&- $x_2) $x_1)))
    "定义的线性算子."
    (Ol #:attr* '((type "a"))
        (Li $T "在" $RR^2 "的标准基下的矩阵是什么?")
        (Li $T "在有序基" (&= $BBB (setE $alpha_1 $alpha_2)) "下的矩阵是什么, 其中"
            (&= $alpha_1 (tu0 $1 $2)) "且" (&= $alpha_2 (tu0 $1 $-1)) "?")
        (Li "证明对于每个实数" $c ", 算子" (@- $T (&i* $c $I)) "都是可逆的.")
        (Li "证明如果" $BBB "是" $RR^2 "任意的有序基并且" (&= (coordm $T) $A) ", 那么"
            (&!= (&i* (mref $A $1 $2) (mref $A $2 $1)) $0) ".")))
   ((exercise #:n "7")
    "令" $T "是" $RR^3 "上的线性算子, 由"
    (MB (&= (ap $T (tu0 $x_1 $x_2 $x_3))
            (tu0 (&+ (&i* $3 $x_1) $x_3) (&+ (&i* $-2 $x_1) $x_2)
                 (&+ (&- $x_1) (&i* $2 $x_2) (&i* $4 $x_3)))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li $T "在" $RR^3 "的标准有序基下的矩阵是什么?")
        (Li $T "在有序基"
            (MB (setE $alpha_1 $alpha_2 $alpha_3))
            "下的矩阵是什么, 其中"
            (&cm (&= $alpha_1 (tu0 $1 $0 $1)) (&= $alpha_2 (tu0 $-1 $2 $1))
                 (&= $alpha_3 (tu0 $2 $1 $1))) "?")
        (Li "证明" $T "是可逆的, 并如定义" $T "一样给出" (inv $T) "的规则.")))
   ((exercise #:n "8")
    "令" $theta "是一个实数. 证明以下两个矩阵在复数域上是相似的:"
    (MB (&cm (Mat ((&cos $theta) (&- (&sin $theta)))
                  ((&sin $theta) (&cos $theta)))
             (Mat ((^ $e (&i* $i $theta)) $0)
                  ($0 (^ $e (&- (&i* $i $theta)))))))
    "(提示: 令" $T "是" $CC^2 "上的线性算子, 其在标准有序基下由第一个矩阵表示. 接着, 找出向量"
    $alpha_1 "和" $alpha_2 "使得"
    (&cm (&= (ap $T $alpha_1) (&i* (^ $e (&i* $i $theta)) $alpha_1))
         (&= (ap $T $alpha_2) (&i* (^ $e (&- (&i* $i $theta))) $alpha_2)))
    "并且" (setE $alpha_1 $alpha_2) "是一个基.)")
   ((exercise #:n "9")
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $S "和" $T "是" $V "上的线性算子. 我们问: "
    "什么时候存在" $V "的有序基" $BBB "和" $BBB^ "使得" (&= (coordm $S) (coordm $T $BBB^))
    "? 证明这样的基存在当且仅当存在一个" $V "上的可逆线性算子" $U "使得" (&= $T (&i* $U $S (inv $U)))
    ". (证明大纲: 如果" (&= (coordm $S) (coordm $T $BBB^)) ", 令" $U "是将" $BBB "映射成"
    $BBB^ "的线性算子, 然后表明" (&= $S (&i* $U $T (inv $U))) ". 反过来, 如果对于某个可逆的"
    $U "有" (&= $T (&i* $U $S (inv $U))) ", 令" $BBB "是" $V "任意的有序基, 令" $BBB^
    "是其在" $U "下的像 [译注: 当然要保持顺序], 然后表明" (&= (coordm $S) (coordm $T $BBB^)) ".)")
   ((exercise #:n "10")
    "我们已经知道由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) "定义的" $RR^2 "上的线性算子" $T
    "在标准有序基下由矩阵"
    (MB (&= $A (Mat ($1 $0) ($0 $0))))
    "表示. 这个算子满足" (&= $T^2 $T) ". 证明如果" $S "是一个" $RR^2 "上满足" (&= $S^2 $S)
    "的线性算子, 那么" (&= $S $0) ", 或者" (&= $S $I) ", 或者存在" $RR^2 "的一个有序基使得"
    (&= (coordm $S) $A) ".")
   ((exercise #:n "11")
    "令" $W "是域" $F "上所有" n*1 "矩阵构成的空间. 如果" $A "是域" $F "上的一个" n*n "矩阵, 那么"
    $A "通过左乘定义了一个" $W "上的线性算子" $L_A ": " (&= (app $L_A $X) (&i* $A $X))
    ". 证明每个" $W "上的线性算子都是左乘某个" n*n "矩阵, 即是对于某个矩阵" $A "而言的" $L_A "." (Br)
    "现在设" $V "是域" $F "上的一个" $n "维向量空间, 令" $BBB "是" $V "的一个有序基. 对于每个" $V
    "中的" $alpha ", 定义" (&= (ap $U $alpha) (coordm $alpha)) ". 证明" $U "是一个从" $V "到" $W
    "的线性算子. 如果" $T "是一个" $V "的线性算子, 那么" (&i* $U $T (inv $U)) "是一个" $W
    "上的线性算子. 于是, " (&i* $U $T (inv $U)) "是一个左乘某个" n*n "矩阵" $A "的变换, 那么"
    $A "是什么呢?")
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个" $n "维向量空间, 令" basis:def
    "是" $V "的一个有序基."
    (Ol #:attr* '((type "a"))
        (Li "根据定理1, 存在唯一的" $V "上的线性算子" $T "满足"
            (MB (&cm (&= (ap $T $alpha_j) (_ $alpha (&+ $j $1)))
                     (&= $j (&cm $1 $..h (&- $n $1)))
                     (&= (ap $T $alpha_n) $0)) ".")
            $T "在有序基" $BBB "下的矩阵" $A "是什么?")
        (Li "证明" (&= $T^n $0) "但是" (&!= (^ $T (&- $n $1)) $0) ".")
        (Li "令" $S "是" $V "上任意的满足" (&= $S^n $0) "但是" (&!= (^ $S (&- $n $1)) $0)
            "的线性算子. 证明存在" $V "的有序基" $BBB^ "使得" $S "在" $BBB^ "下的表示是a里的矩阵" $A ".")
        (Li "证明如果" $M "和" $N "是域" $F "上满足" (&= $M^n $N^n $0) "但是" (&!= (^ $M (&- $n $1)) $0)
            "且" (&!= (^ $N (&- $n $1)) $0) "的" n*n "矩阵, 那么" $M "和" $N "是相似的.")))
   ((exercise #:n "13")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 令" $T "是一个从" $V "到" $W "的线性变换. 如果"
    (MB basis:def
        "和" (&= $BBB^ (setE $beta_1 $..h $beta_m)))
    "分别是" $V "和" $W "的有序基, 如定理5的证明一样定义线性变换" (&E $p $q) ": "
    (&= (app (&E $p $q) $alpha_i) (&i* (&delta $i $q) $beta_p)) ", 那么"
    (&cm (&E $p $q) (&<= $1 $p $m) (&<= $1 $q $n)) "构成了" (&L $V $W) "的一个基, 并且对于特定的标量"
    (mref $A $p $q) "有"
    (MB (&= $T (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (&E $p $q))))) ".")
    (mref $A $p $q) "即" $T "在这个" (&L $V $W) "的基下的坐标. 证明以" (&= (appl $A $p $q) (mref $A $p $q))
    "为元素的矩阵" $A "就恰是" $T "相对于" $BBB "和" $BBB^ "的表示矩阵.")
   (H3 "第3.5节 线性泛函")
   (P "如果" $V "是一个域" $F "上的向量空间, 那么从" $V "到标量域" $F "的线性变换" $f
      "也被称为" $V "上的线性泛函. 如果我们从头开始, 那么这意味着" $f "是一个从" $V
      "到" $F "的函数, 并且满足"
      (MB (&= (app $f (LC $c $alpha $beta))
              (LC $c (app $f $alpha) (app $f $beta))))
      "对于所有" $V "中的" $alpha "和" $beta "以及所有" $F "中的标量" $c "成立. "
      "线性泛函这个概念的重要性在于它有助于组织和澄清关于子空间, 线性方程和坐标的讨论.")
   ((example #:n "18")
    "令" $F "是一个域而" (&cm $a_1 $..h $a_n) "是" $F "中标量, 我们根据"
    (MB (&= (appl $f $x_1 $..h $x_n) (LC0 $a_1 $x_1 $a_n $x_n)))
    "定义一个" $F^n "上的函数" $f ", 那么" $f "是" $F^n "上的一个线性泛函. 它是这样的泛函, 其在"
    $F^n "的标准有序基和" $F "的基" (setE $1) "下由矩阵" (Mat ($a_1 $..c $a_n)) "表示:"
    (MB (&cm (&= $a_j (app $f $epsilon_j)) (&= $j (&cm $1 $..h $n))) ".")
    "[译注: 其实" (setE $1) "就是" $F "的标准有序基.] 每个" $F^n "上的线性泛函都具有这种形式, 对于某些标量"
    (&cm $a_1 $..h $a_n) "而言. 这是由线性泛函的定义立即得到的, 因为如果我们定义"
    (&= $a_j (app $f $epsilon_j)) "并使用线性性质, 那么"
    (MB (deriv (appl $f $x_1 $..h $x_n)
               (ap $f (@sum (&= $j $1) $n (&i* $x_j $epsilon_j)))
               (sum (&= $j $1) $n (&i* $x_j (app $f $epsilon_j)))
               (sum (&= $j $1) $n (&i* $a_j $x_j)))))
   ((example #:n "19")
    "这里给出一个线性泛函的重要例子. 令" $n "是一个正整数而" $F "是一个域, 如果" $A "是一个以" $F
    "中标量为元素的" n*n "矩阵, 那么" $A "的迹是标量"
    (MB (&= (&tr $A) (&+ (mref $A $1 $1) (mref $A $2 $2) $..c (mref $A $n $n))) ".")
    "迹函数是一个矩阵空间" (^ $F n*n) "上的线性泛函, 因为"
    (MB (deriv (&tr (LC $c $A $B))
               (sum (&= $i $1) $n (@LC $c (mref $A $i $i) (mref $B $i $i)))
               (LC $c (sum (&= $i $1) $n (mref $A $i $i))
                   (sum (&= $i $1) $n (mref $B $i $i)))
               (LC $c (&tr $A) (&tr $B)))))
   ((example #:n "20")
    "令" $V "是所有从域" $F "到自身的多项式函数构成的空间. 令" $t "是" $F "的一个元素. 如果我们定义"
    (MB (&= (app $L_t $p) (app $p $t)))
    "那么" $L_t "是一个" $V "上的线性泛函. 人们经常这样描述这个泛函, 对于每个" $t
    ", &quot;在" $t "处求值&quot;是一个多项式函数空间上的线性泛函. 或许我们应该指出, 在这个例子里"
    "多项式函数实际上并不发挥任何作用, 对于所有从" $F "到" $F "的函数构成的空间, 在" $t
    "处求值同样也是一个线性泛函.")
   ((example #:n "21")
    "这或许是数学中最重要的线性泛函. 令" (li0 $a $b) "是实轴上的一个闭区间, " (app $C (li0 $a $b))
    "是" (li0 $a $b) "上的连续实值函数构成的空间, 那么"
    (MB (&= (app $L $g) (integral $a $b (app $g $t) $t)))
    "定义了一个" (app $C (li0 $a $b)) "上的线性泛函" $L ".")
   (P "如果" $V "是一个向量空间, 那么所有" $V "上的线性泛函自然地构成了一个向量空间, 此即"
      (&L $V $F) ", 我们记作" V* "并将其称为" $V "的对偶空间:"
      (MB (&= V* (&L $V $F)) "."))
   (P "如果" $V "是有限维的, 那么我们可以得到一个对于对偶空间" V*
      "相当显式的描述. 从定理5我们知道了一件关于" V* "的事情, 即"
      (MB (&= (&dim V*) (&dim $V)) ".")
      "令" basis:def "是" $V "的一个基. 根据定理1, (对于每个" $i
      ")存在唯一的" $V "上的线性泛函" $f_i "满足"
      (MB (&= (app $f_i $alpha_j) δij) ".")
      "用这种方法我们从" $BBB "得到了" $n "个不同的" $V "上的线性泛函" (&cm $f_1 $..h $f_n)
      ". 这些泛函也是线性无关的, 因为若设"
      (MB (&= $f (sum (&= $i $1) $n (&i* $c_i $f_i))))
      "那么"
      (MB (deriv (app $f $alpha_j)
                 (sum (&= $i $1) $n (&i* $c_i (app $f_i $alpha_j)))
                 (sum (&= $i $1) $n (&i* $c_i δij))
                 $c_j))
      "特别地, 如果" $f "是零泛函, 那么对于每个" $j "有" (&= (app $f $alpha_j) $0)
      ", 因此标量" $c_j "都是" $0 ". 现在" (&cm $f_1 $..h $f_n) "是" $n
      "个线性无关的泛函, 而且我们知道" V* "的维数是" $n ", 那么"
      (&= (&* $BBB) (setE $f_1 $..h $f_n)) "必然是" V* "的一个基, 其被称为"
      $BBB "的对偶基.")
   ((theorem #:n "15")
    "令" $V "是域" $F "上的一个有限维向量空间, 令" basis:def
    "是" $V "的一个基. 那么, 存在唯一的" V* "的对偶基" (&= (&* $BBB) (setE $f_1 $..h $f_n))
    ", 其满足" (&= (app $f_i $alpha_j) δij) ". 对于每个" $V "上的线性泛函" $f ", 我们有"
    (MB (&= $f (sum (&= $i $1) $n (&i* (app $f $alpha_i) $f_i))))
    "以及对于每个" $V "中的" $alpha ", 我们有"
    (MB (&= $alpha (sum (&= $i $1) $n (&i* (app $f_i $alpha) $alpha_i))) "."))
   ((proof)
    "上面我们已经说明了存在唯一的基与" $BBB "&quot;对偶&quot;. 如果" $f "是一个" $V "上的线性泛函, 那么"
    $f "即是" $f_i "的某个线性组合, 并且我们观察到标量" $c_j "必然由" (&= $c_j (app $f $alpha_j))
    "给出. 类似地, 如果"
    (MB (&= $alpha (sum (&= $i $1) $n (&i* $x_i $alpha_i))))
    "是" $V "的一个向量, 那么"
    (MB (deriv (app $f_j $alpha)
               (sum (&= $i $1) $n (&i* $x_i (app $f_j $alpha_i)))
               (sum (&= $i $1) $n (&i* $x_i δij))
               $x_j))
    "因此" $alpha "作为" $alpha_i "的线性组合的唯一表达为"
    (MB (&= $alpha (sum (&= $i $1) $n (&i* (app $f_i $alpha) $alpha_i))) "."))
   (P "上面这个式子给我们提供了一种刻画对偶基的绝佳方式. 它是说, 如果"
      basis:def "是" $V "的一个有序基, 并且"
      (&= (&* $BBB) (setE $f_1 $..h $f_n)) "是其对偶基, 那么" $f_i "就恰是那个赋予" $V
      "中的向量" $alpha "相对于有序基" $BBB "的第" $i "个坐标的函数. 因此, 我们也可以将"
      $f_i "称为" $BBB "的坐标函数. 定理15实际上告诉了我们以下事实: 如果" $f "在" V*
      "中而令" (&= (app $f $alpha_i) $a_i) ", 那么当"
      (MB (&= $alpha (LC0 $x_1 $alpha_1 $x_n $alpha_n)))
      "时, 我们有"
      (MB (&= (app $f $alpha) (LC0 $a_1 $x_1 $a_n $x_n)) ".")
      "换言之, 如果我们选定了" $V "的一个有序基" $BBB "并描述" $V "中的每个向量以其相对于"
      $BBB "的" $n "元坐标组" (tu0 $x_1 $..h $x_n) ", 那么每个" $V "上的线性泛函都具有"
      (&= (app $f $alpha) (LC0 $a_1 $x_1 $a_n $x_n)) "的形式. 这是例子18的自然泛化, 其为"
      (&= $V $F^n) "和" (&= $BBB (setE $epsilon_1 $..h $epsilon_n)) "的特别情形.")
   ((example #:n "22")
    "令" $V "是所有从" $RR "到" $RR "的次数小于等于" $2 "的多项式函数构成的向量空间, 令"
    (&cm $t_1 $t_2 $t_3) "是三个不同的实数, 令"
    (MB (&= (app $L_i $p) (app $p $t_i)) ".")
    "那么, " (&cm $L_1 $L_2 $L_3) "是" $V "上的线性泛函. 这些线性泛函是线性无关的, 因为若设"
    (MB (&= $L (LC $c_1 $L_1 $c_2 $L_2 $c_3 $L_3)))
    "当" (&= $L $0) "时, 即对于每个" $V "中的" $p "都有" (&= (app $L $p) $0)
    ", 那么应用" $L "于特定的多项式&quot;函数&quot;" (&cm $1 $x $x^2) ", 我们就得到"
    (MB (Ttle (Choice ($c_1 $+ $c_2 $+ $c_3 $= $0)
                      ((&i* $t_1 $c_1) $+ (&i* $t_2 $c_2) $+ (&i* $t_3 $c_3) $= $0)
                      ((&i* (_^ $t $1 $2) $c_1)
                       $+ (&i* (_^ $t $2 $2) $c_2)
                       $+ (&i* (_^ $t $3 $2) $c_3) $= $0))))
    "从中我们得到" (&= $c_1 $c_2 $c_3 $0) ", 因为(根据简单的计算可知)矩阵"
    (MB (Mat ($1 $1 $1) ($t_1 $t_2 $t_3) ((_^ $t $1 $2) (_^ $t $2 $2) (_^ $t $3 $2))))
    "在" (&cm $t_1 $t_2 $t_3) "互异时是可逆的. 既然" $L_i "是线性无关的并且" $V "的维数是"
    $3 ", 这些泛函构成了" V* "的一个基. 它是什么" $V "的基的对偶呢? 这样一个" $V
    "的基" (setE $p_1 $p_2 $p_3) "必然满足"
    (MB (&= (app $L_i $p_j) δij))
    "或者说"
    (MB (&= (app $p_j $t_i) δij) ".")
    "很容易看出这些多项式函数应该是"
    (MB (&cm (&= (app $p_1 $x)
                 (~ (&i* (@- $x $t_2) (@- $x $t_3))
                    (&i* (@- $t_1 $t_2) (@- $t_1 $t_3))))
             (&= (app $p_2 $x)
                 (~ (&i* (@- $x $t_1) (@- $x $t_3))
                    (&i* (@- $t_2 $t_1) (@- $t_2 $t_3))))
             (&= (app $p_3 $x)
                 (~ (&i* (@- $x $t_1) (@- $x $t_2))
                    (&i* (@- $t_3 $t_1) (@- $t_3 $t_2))))) ".")
    $V "的基" (setE $p_1 $p_2 $p_3) "是有趣的, 因为根据定理15, 对于每个" $V "中的" $p "我们有"
    (MB (&= $p (LC (app $p $t_1) $p_1 (app $p $t_2) $p_2 (app $p $t_3) $p_3)) ".")
    "因此, 如果" (&cm $c_1 $c_2 $c_3) "是任意的实数, 那么恰存在唯一的" $RR "上的次数至多为" $2
    "的多项式函数" $p "满足" (&cm (&= (app $p $t_j) $c_j) (&= $j (&cm $1 $2 $3)))
    ". 这个多项式函数为" (&= $p (LC $c_1 $p_1 $c_2 $p_2 $c_3 $p_3)) ".")
   (P "现在让我们来讨论线性泛函和子空间之间的关系. 如果" $f "是一个非零的线性泛函, 那么" $f
      "的秩就是" $1 ", 因为其像是标量域的非零子空间, 必然是标量域本身. 如果潜在的空间" $V
      "是有限维的, 那么秩加零化度定理 (定理2) 告诉我们零空间" $N_f "的维数"
      (MB (&= (&dim $N_f) (&- (&dim $V) $1)) "."))
   (P "在一个" $n "维空间中, 具有" (&- $n $1) "维的子空间被称为超空间. 这样的空间有时也被称为"
      "超平面或者余维数为" $1 "的子空间. 每个超空间都是某个线性泛函的零空间吗? 答案很容易看出来是"
      "yes. 而且, 证明以下事实也并不更加困难. " $n "维空间的每个" $d "维子空间都是" (@- $n $d)
      "个线性泛函的零空间之交. (下面的定理16)")
   ((definition)
    "如果" $V "是域" $F "上的向量空间而" $S "是" $V "的一个子集, " $S "的零化子" $S^0
    "是" $V "上所有这样的线性泛函" $f "构成的集合, 其对于每个" $S "中的" $alpha "有"
    (&= (app $f $alpha) $0) ".")
   (P "读者应该很容易看出" $S^0 "是" V* "的子空间, 不论" $S "是否是" $V "的子空间. 如果"
      $S "仅包含零向量, 那么" (&= $S^0 V*) ". 如果" (&= $S $V) ", 那么" $S^0
      "是" V* "的零子空间. (在" $V "是有限维的情况下很容易看出来.)")
   ((theorem #:n "16")
    "令" $V "是域" $F "上的有限维向量空间, 令" $W "是" $V "的子空间, 那么"
    (MB (&= (&+ (&dim $W) (&dim $W^0)) (&dim $V)) "."))
   ((proof)
    "令" $k "是" $W "的维数而" (setE $alpha_1 $..h $alpha_k) "是" $W "的一个基. 选择"
    $V "中向量" (&cm (_ $alpha (&+ $k $1)) $..h $alpha_n) "使得" (setE $alpha_1 $..h $alpha_n)
    "是" $V "的一个基. 令" (setE $f_1 $..h $f_n) "是" V* "的基, 其对偶于这个" $V
    "的基. 我们现在证明" (setE (_ $f (&+ $k $1)) $..h $f_n) "是零化子" $W^0
    "的一个基. 显然对于" (&>= $i (&+ $k $1)) "我们知道" $f_i "属于" $W^0 ", 因为"
    (MB (&= (app $f_i $alpha_j) δij))
    "于是当" (&>= $i (&+ $k $1)) "且" (&<= $j $k) "时有" (&= δij $0)
    ". 从中我们可知当" $alpha "是" (&cm $alpha_1 $..h $alpha_k) "的线性组合时, 对于"
    (&>= $i (&+ $k $1)) "有" (&= (app $f_i $alpha) $0) ". 因为泛函"
    (setE (_ $f (&+ $k $1)) $..h $f_n) "是线性无关的, 所以剩下来我们必须要做的就是证明它们可以张成"
    $W^0 ". 设" $f "在" V* "中, 既然"
    (MB (&= $f (sum (&= $i $1) $n (&i* (app $f $alpha_i) $f_i))) ",")
    "于是若" $f "在" $W^0 "中, 我们有" (&= (app $f $alpha_i) $0) "对于" (&<= $i $k) "成立, 那么"
    (MB (&= $f (sum (&= $i (&+ $k $1)) $n (&i* (app $f $alpha_i) $f_i))) ".")
    "我们证明了如果" (&= (&dim $W) $k) "而" (&= (&dim $V) $n) ", 那么" (&= (&dim $W^0) (&- $n $k)) ".")
   ((corollary)
    "如果" $W "是" $n "维向量空间" $V "的" $k "维子空间, 那么" $W "是" $V "中" (@- $n $k)
    "个超空间之交.")
   ((proof)
    "这是定理16证明的推论而不是定理16本身的推论. 在这个证明的记号下, " $W "恰是满足"
    (&cm (&= (app $f_i $alpha) $0) (&= $i (&cm (&+ $k $1) $..h $n))) "的所有向量" $alpha
    "的集合. 在" (&= $k (&- $n $1)) "的情形, " $W "即是" $f_n "的零空间.")
   ((corollary)
    "如果" $W_1 "和" $W_2 "是某个有限维向量空间的子空间, 那么" (&= $W_1 $W_2) "当且仅当"
    (&= (_^ $W $1 $0) (_^ $W $2 $0)) ".")
   ((proof)
    "如果" (&= $W_1 $W_2) ", 那么显然有" (&= (_^ $W $1 $0) (_^ $W $2 $0)) ". 如果"
    (&!= $W_1 $W_2) ", 那么其中之一的子空间包含有不在另一个子空间的向量. 不妨设向量" $alpha
    "在" $W_2 "之中但不在" $W_1 "中. 根据前面的推论 (或者定理16的证明), 存在一个线性泛函"
    $f "满足对于所有的" $W_1 "中" $beta "有" (&= (app $f $beta) $0) "但" (&!= (app $f $alpha) $0)
    ", 那么" $f "在" (_^ $W $1 $0) "之中但不在" (_^ $W $2 $0) "中, 即"
    (&!= (_^ $W $1 $0) (_^ $W $2 $0)) ".")
   (P "接下来的一节我们将给出这两个推论的不同的证明. 第一个推论是说, 如果我们挑选了空间的某个有序基, "
      "那么每个" $k "维的子空间都可以由" (@- $n $k) "个相对于基的坐标上的齐次线性条件刻画.")
   (P "让我们从线性泛函的视角简要看看齐次线性方程组. 设我们有一个想要求解的齐次线性方程组"
      (MB (Choice ((&i* (mref $A $1 $1) $x_1) $+ $..c $+ (&i* (mref $A $1 $n) $x_n) $= $0)
                  ($..v $ $ $ $..v $ $)
                  ((&i* (mref $A $m $1) $x_1) $+ $..c $+ (&i* (mref $A $m $n) $x_n) $= $0)))
      "如果我们令" (&cm $f_i (&= $i (&cm $1 $..h $m))) "是由"
      (MB (&= (appl $f_i $x_1 $..h $x_n) (LC0 (mref $A $i $1) $x_1 (mref $A $i $n) $x_n)))
      "定义的" $F^n "上的线性泛函, 那么其实我们就是在寻找一个" $F^n "的子空间, 其由所有满足"
      (MB (&cm (&= (app $f_i $alpha) $0) (&= $i (&cm $1 $..h $m))))
      "的" $alpha "构成. 换言之, 我们在寻找被" (&cm $f_1 $..h $f_m) "零化的子空间. 对于系数矩阵"
      "进行行规约为我们提供了找出这个子空间的系统方法. " $n "元组"
      (tu0 (mref $A $i $1) $..h (mref $A $i $n)) "给出了线性泛函" $f_i "相对于与" $F^n
      "的标准基对偶的基的坐标. 系数矩阵的行空间因此可被视为由" (&cm $f_1 $..h $f_m)
      "张成的线性泛函的空间, 而解空间是被这个泛函的空间零化的子空间.")
   (P "现在我们或许可以从&quot;对偶&quot;的角度看待线性方程组, 即给定" $F^n "中的" $m "个向量"
      (MB (&= $alpha_i (tu0 (mref $A $i $1) $..h (mref $A $i $n))))
      "我们希望寻找由这些向量张成的子空间的零化子. 既然" $F^n "上一个典型的线性泛函具有形式"
      (MB (&= (appl $f $x_1 $..h $x_n) (LC0 $c_1 $x_1 $c_n $x_n)))
      "那么" $f "在这个零化子之中的条件即"
      (MB (&cm (&= (sum (&= $j $1) $n (&i* (mref $A $i $j) $c_j)) $0)
               (&= $i (&cm $1 $..h $m))))
      "换言之, " (tu0 $c_1 $..h $c_n) "是线性方程组" AX=0 "的一个解. 从此观点来看, 行规约为我们提供了"
      "一种系统性的方法来寻找由给定的" $F^n "的有限子集张成的子空间的零化子.")
   ((example #:n "23")
    "现在我们给出" $RR^4 "上的三个线性泛函:"
    (MB (set-attr*
         (&Table
          ((appl $f_1 $x_1 $x_2 $x_3 $x_4) $= (&+ $x_1 (&i* $2 $x_2) (&i* $2 $x_3) $x_4))
          ((appl $f_2 $x_1 $x_2 $x_3 $x_4) $= (LC $2 $x_2 $x_4))
          ((appl $f_3 $x_1 $x_2 $x_3 $x_4) $= (&+ (&- (&i* $-2 $x_1) (&i* $4 $x_3)) (&i* $3 $x_4))))
         'columnalign "left"))
    "它们所零化的子空间可以通过显式寻找矩阵"
    (MB (&= $A (Mat ($1 $2 $2 $1) ($0 $2 $0 $1) ($-2 $0 $-4 $3))))
    "的行简化阶梯形式得到. 经过简单的计算, 或者看看第2章的例子21, 我们知道"
    (MB (&= $R (Mat ($1 $0 $2 $0) ($0 $1 $0 $0) ($0 $0 $0 $1))) ".")
    "因此, 线性泛函"
    (MB (set-attr*
         (&Table
          ((appl $g_1 $x_1 $x_2 $x_3 $x_4) $= (&+ $x_1 (&i* $2 $x_3)))
          ((appl $g_2 $x_1 $x_2 $x_3 $x_4) $= $x_2)
          ((appl $g_3 $x_1 $x_2 $x_3 $x_4) $= $x_4))
         'columnalign "left"))
    "与" (&cm $f_1 $f_2 $f_3) "张成了相同的" (&* (@ $RR^4)) "的子空间, 并且零化了相同的"
    $RR^4 "的子空间. 被零化的子空间由所有满足"
    (MB (&cm (&= $x_1 (&i* $-2 $x_3)) (&= $x_2 $x_4 $0)))
    "的向量构成.")
   ((example #:n "24")
    "令" $W "是由"
    (MB (&cm (&= $alpha_1 (tu0 $2 $-2 $3 $4 $-1))
             (&= $alpha_2 (tu0 $-1 $1 $2 $5 $2))
             (&= $alpha_3 (tu0 $0 $0 $-1 $-2 $3))
             (&= $alpha_4 (tu0 $1 $-1 $2 $3 $0))))
    "张成的" $RR^5 "的子空间. 人们该如何描述" $W^0 ", 即" $W "的零化子呢? 让我们构造一个以"
    (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "为行向量的矩阵" $A ", 并找出行等价于" $A
    "的行简化阶梯矩阵" $R ":"
    (MB (&-> (&= $A (Mat ($2 $-2 $3 $4 $-1)
                         ($-1 $1 $2 $5 $2)
                         ($0 $0 $-1 $-2 $3)
                         ($1 $-1 $2 $3 $0)))
             (&= $R (Mat ($1 $-1 $0 $-1 $0)
                         ($0 $0 $1 $2 $0)
                         ($0 $0 $0 $0 $1)
                         ($0 $0 $0 $0 $0)))) ".")
    "如果" $f "是" $RR^5 "上的一个线性泛函:"
    (MB (&= (appl $f $x_1 $..h $x_5) (sum (&= $j $1) $5 (&i* $c_j $x_j))))
    "那么" $f "在" $W^0 "中当且仅当" (&cm (&= (app $f $alpha_i) $0) (&= $i (&cm $1 $2 $3 $4)))
    ", 即当且仅当"
    (MB (&cm (&= (sum (&= $j $1) $5 (&i* (mref $A $i $j) $c_j)) $0) (&<= $1 $i $4)) ".")
    "这等价于"
    (MB (&cm (&= (sum (&= $j $1) $5 (&i* (mref $R $i $j) $c_j)) $0) (&<= $1 $i $3)))
    "或者"
    (MB (set-attr*
         (&Table
          ((&- $c_1 $c_2 $c_4) $= $0)
          ((&+ $c_3 (&i* $2 $c_4)) $= $0)
          ($c_5 $= $0))
         'columnalign "right"))
    "我们可以通过给" $c_2 "和" $c_4 "赋任意的值以得到所有这样的线性泛函" $f ", 例如令" (&= $c_2 $a) "和"
    (&= $c_4 $b) ", 然后找出相应的" (&cm (&= $c_1 (&+ $a $b)) (&= $c_3 (&i* $-2 $b)) (&= $c_5 $0))
    ". 于是, " $W^0 "由所有具有形式"
    (MB (&= (appl $f $x_1 $x_2 $x_3 $x_4 $x_5)
            (&+ (&- (LC (@+ $a $b) $x_1 $a $x_2) (&i* $2 $b $x_3)) (&i* $b $x_4))))
    "的线性泛函" $f "构成. " $W^0 "的维数是" $2 ", 而" $W^0 "的一个基" (setE $f_1 $f_2)
    "可由先令" (&cm (&= $a $1) (&= $b $0)) "再令" (&cm (&= $a $0) (&= $b $1)) "得到:"
    (MB (set-attr*
         (&Table
          ((appl $f_1 $x_1 $..h $x_5) $= (&+ $x_1 $x_2))
          ((appl $f_2 $x_1 $..h $x_5) $= (: $x_1 $- (&i* $2 $x_3) $+ $x_4)))
         'columnalign "left"))
    "上面" $W^0 "中一般的" $f "即" (&= $f (LC $a $f_1 $b $f_2)) ".")
   ((exercise #:n "1")
    "在" $RR^3 "中, 令"
    (&cm (&= $alpha_1 (tu0 $1 $0 $1))
         (&= $alpha_2 (tu0 $0 $1 $-2))
         (&= $alpha_3 (tu0 $-1 $-1 $0)))
    "."
    (Ol #:attr* '((type "a"))
        (Li "如果" $f "是" $RR^3 "上满足"
            (MB (&cm (&= (app $f $alpha_1) $1)
                     (&= (app $f $alpha_2) $-1)
                     (&= (app $f $alpha_3) $3)))
            "的线性泛函, 并且" (&= $alpha (tu0 $a $b $c)) ", 找出" (app $f $alpha) ".")
        (Li "显式描述" $RR^3 "上满足"
            (MB (&= (app $f $alpha_1) (app $f $alpha_2) $0)
                "但是" (&!= (app $f $alpha_3) $0))
            "的线性泛函" $f ".")
        (Li "令" $f "是任意的满足"
            (MB (&= (app $f $alpha_1) (app $f $alpha_2) $0)
                "并且" (&!= (app $f $alpha_3) $0))
            "的线性泛函. 如果" (&= $alpha (tu0 $2 $3 $-1)) ", 表明"
            (&!= (app $f $alpha) $0) ".")))
   ((exercise #:n "2")
    "令" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "是" $CC^3 "的基, 其由"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $1 $1))
             (&= $alpha_3 (tu0 $2 $2 $0))))
    "定义. 找出" $BBB "的对偶基.")
   ((exercise #:n "3")
    "如果" $A "和" $B "是域" $F "上的" n*n "矩阵, 证明"
    (&= (&trace (&i* $A $B)) (&trace (&i* $B $A)))
    ", 接着证明相似矩阵有着相同的迹.")
   ((exercise #:n "4")
    "令" $V "是从" $RR "到" $RR "的所有次数小于等于" $2 "的多项式函数" $p ":"
    (MB (&= (app $p $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "构成的向量空间. 定义三个" $V "上的线性泛函如下:"
    (let ((fdef (lambda (n b) (&= (app (_ $f n) $p) (integral $0 b (app $p $x) $x)))))
      (MB (&cm (fdef $1 $1) (fdef $2 $2) (fdef $3 $-1)) "."))
    "证明" (setE $f_1 $f_2 $f_3) "是" $V "的基, 通过找出以其为对偶的" $V "的基.")
   ((exercise #:n "5")
    "如果" $A "和" $B "是" n*n "的复矩阵, 证明" (&= (&- (&i* $A $B) (&i* $B $A)) $I)
    "是不可能的.")
   ((exercise #:n "6")
    "令" $m "和" $n "是正整数而" $F "是一个域. 令" (&cm $f_1 $..h $f_m) "是" $F^n
    "上的线性泛函. 对于" $F^n "中的" $alpha ", 定义"
    (MB (&= (ap $T $alpha) (tu0 (app $f_1 $alpha) $..h (app $f_m $alpha))) ".")
    "证明" $T "是一个从" $F^n "到" $F^m "的线性变换, 接着表明每个从" $F^n "到" $F^m
    "的线性变换都具有以上形式, 对于特定的" (&cm $f_1 $..h $f_m) "而言.")
   ((exercise #:n "7")
    "令" (&= $alpha_1 (tu0 1 0 -1 2)) "和" (&= $alpha_2 (tu0 2 3 1 1)) ", 令" $W
    "是" $alpha_1 "和" $alpha_2 "张成的" $RR^4 "的子空间. 哪些线性泛函" $f ":"
    (MB (&= (appl $f $x_1 $x_2 $x_3 $x_4)
            (LC $c_1 $x_1 $c_2 $x_2 $c_3 $x_3 $c_4 $x_4)))
    "在" $W "的零化子之中呢?")
   ((exercise #:n "8")
    "令" $W "是" $RR^5 "的子空间, 其由下列向量张成:"
    (MB (&cm (&= $alpha_1 (&+ $epsilon_1 (&i* $2 $epsilon_2) $epsilon_3))
             (&= $alpha_2 (&+ $epsilon_2 (&i* $3 $epsilon_3) (&i* $3 $epsilon_4) $epsilon_5))
             (&= $alpha_3 (&+ $epsilon_1 (&i* $4 $epsilon_2) (&i* $6 $epsilon_3)
                              (&i* $4 $epsilon_4) $epsilon_5))) ".")
    "找出" $W^0 "的一个基.")
   ((exercise #:n "9")
    "令" $V "是实数域上的所有" 2*2 "矩阵的向量空间, 令"
    (MB (&= $B (Mat ($2 $-2) ($-1 $1))) ".")
    "令" $W "是" $V "的子空间, 其由所有满足" (&= (&i* $A $B) $0) "的矩阵" $A "构成. 令" $f
    "是" $V "上的线性泛函, 其在" $W "的零化子之中. 设" (&= (app $f $I) $0) "且"
    (&= (app $f $C) $3) ", 其中" $I "是" 2*2 "的恒等矩阵而"
    (MB (&= $C (Mat ($0 $0) ($0 $1))) ".")
    "找出" (app $f $B) ".")
   ((exercise #:n "10")
    "令" $F "是复数域的一个子域. 我们通过"
    (MB (&cm (&= (appl $f_k $x_1 $..h $x_n) (sum (&= $j $1) $n (&i* (@- $k $j) $x_j)))
             (&<= $1 $k $n)))
    "定义" $F^n "上的" $n "个线性泛函, 其中" (&>= $n $2) ". 由" (&cm $f_1 $..h $f_n)
    "零化的子空间维数是多少呢?")
   ((exercise #:n "11")
    "令" $W_1 "和" $W_2 "是有限维向量空间" $V "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (^ (@+ $W_1 $W_2) $0) (&cap (_^ $W $1 $0) (_^ $W $2 $0))) ".")
        (Li "证明" (&= (^ (@ (&cap $W_1 $W_2)) $0) (&+ (_^ $W $1 $0) (_^ $W $2 $0))) ".")))
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $W "是" $V "的一个子空间. 如果" $f
    "是" $W "上的线性泛函, 证明存在一个" $V "上的线性泛函" $g "满足对于每个" $W "中的" $alpha
    "有" (&= (app $g $alpha) (app $f $alpha)) ".")
   ((exercise #:n "13")
    "令" $F "是复数域的一个子域. 令" $V "是域" $F "上任意的向量空间. 设" $f "和" $g
    "是" $V "上的线性泛函, 并且满足由" (&= (app $h $alpha) (&i* (app $f $alpha) (app $g $alpha)))
    "定义的函数" $h "仍然是" $V "上的线性泛函. 证明" (&= $f $0) "或" (&= $g $0) ".")
   ((exercise #:n "14")
    "令" $F "是特征为零的域. 令" $V "是域" $F "上的一个有限维向量空间. 如果"
    (&cm $alpha_1 $..h $alpha_m) "是" $V "中有限多个向量, 并且每个都异于零向量, 证明存在" $V
    "上的线性泛函" $f "满足"
    (MB (&cm (&!= (app $f $alpha_i) $0) (&= $i (&cm $1 $..h $m))) "."))
   ((exercise #:n "15")
    "根据练习3, 相似的矩阵拥有相同的迹. 因此, 我们可以将有限维空间上的线性算子的迹定义为其在"
    "任意有序基下的矩阵的迹. 这是良定的, 因为所有这样的表示矩阵都是相似的." (Br)
    "现在令" $V "是域" $F "上的" 2*2 "矩阵的向量空间, 令" $P "是一个固定的" 2*2 "矩阵. 令"
    $T "是由" (&= (app $T $A) (&i* $P $A)) "定义的" $V "上的线性算子. 证明"
    (&= (&trace $T) (&i* $2 (&trace $P))) ".")
   ((exercise #:n "16")
    "证明" n*n "矩阵上的迹泛函在以下意义上唯一. 如果" $W "是域" $F "上的" n*n
    "矩阵的空间, 如果" $f "是" $W "上满足对于" $W "中的每个" $A "和" $B "有"
    (&= (app $f (&i* $A $B)) (app $f (&i* $B $A))) "的线性泛函, 那么" $f
    "是迹函数的标量倍数. 另外, 如果" (&= (app $f $I) $n) ", 那么" $f "就是迹函数.")
   ((exercise #:n "17")
    "令" $W "是域" $F "上的" n*n "矩阵的空间. 令" $W_0 "是由所有具有形式" (&= $C (&- (&i* $A $B) (&i* $B $A)))
    "的矩阵" $C "张成的子空间. 证明" $W_0 "恰好就是迹为零的矩阵构成的子空间. (提示: 迹为零的矩阵的空间"
    "的维数是什么? 使用矩阵&quot;单元&quot;, 即恰具有一个非零元素的矩阵, 来构造足够多具有"
    (&- (&i* $A $B) (&i* $B $A)) "形式的线性无关的矩阵.)")
   (H3 "第3.6节 二次对偶")
   (P "上一节我们还有一个没有回答的问题, 即是否每个" V* "的基都是某个" $V "的基的对偶. "
      "一种回答这个问题的方式是考虑" V** ", 即" V* "的对偶空间.")
   (P "如果" $alpha "是" $V "中的一个向量, 那么" $alpha "导出了一个" V* "上的线性泛函, 即"
      (MB (&cm (&= (app $L_alpha $f) (app $f $alpha)) (&in $f V*)) ".")
      $L_alpha "是线性的这一事实不过就是对于" V* "中的线性泛函的定义的重述:"
      (MB (deriv (app $L_alpha (LC $c $f $g))
                 (app (@LC $c $f $g) $alpha)
                 (&+ (app (@i* $c $f) $alpha) (app $g $alpha))
                 (LC $c (app $f $alpha) (app $g $alpha))
                 (LC $c (app $L_alpha $f) (app $L_alpha $g))))
      "如果" $V "是有限维的并且" (&!= $alpha $0) ", 那么" (&!= $L_alpha $0) ". 换言之, 存在线性泛函"
      $f "满足" (&!= (app $f $alpha) $0) ". 证明非常简单, 在第3.5节已经给过了: 选择一个" $V "的有序基"
      basis:def ", 其中" (&= $alpha_1 $alpha) ", 令" $f
      "是赋予每个" $V "中向量其在有序基" $BBB "下的坐标的第一分量的线性泛函. [译注: 换句话说, "
      $f "即满足" (&= (app $f $alpha_1) $1) "而" (&cm (&= (app $f $alpha_i) $0) (&<= $2 $i $n))
      "的存在且唯一的那个线性泛函.]")
   ((theorem #:n "17")
    "令" $V "是域" $F "上的一个有限维向量空间. 对于每个" $V "中的向量" $alpha ", 定义"
    (MB (&cm (&= (app $L_alpha $f) (app $f $alpha)) (&in $f V*)) ".")
    "映射" (&\|-> $alpha $L_alpha) "是一个从" $V "到" V** "的同构.")
   ((proof)
    "我们已经证明过对于每个" $alpha "函数" $L_alpha "是线性的了. 设" $alpha "和" $beta
    "在" $V "中而" $c "在" $F "中, 令" (&= $gamma (LC $c $alpha $beta)) ", 那么对于" V* "中的每个" $f "有"
    (MB (deriv (app $L_gamma $f)
               (app $f $gamma)
               (app $f (LC $c $alpha $beta))
               (LC $c (app $f $alpha) (app $f $beta))
               (LC $c (app $L_alpha $f) (app $L_beta $f))
               (app (@LC $c $L_alpha $L_beta) $f)))
    "于是"
    (MB (&= $L_gamma (LC $c $L_alpha $L_beta)) ".")
    "这表明映射" (&\|-> $alpha $L_alpha) "是一个从" $V "到" V** "的线性变换. 这个变换是非奇异的, "
    "因为根据之前的评注, " (&= $L_alpha $0) "当且仅当" (&= $alpha $0) ". 既然" (&\|-> $alpha $L_alpha)
    "是从" $V "到" V** "的非奇异的线性变换, 并且"
    (MB (&= (&dim V**) (&dim V*) (&dim $V)))
    "定理9告诉我们这个变换是可逆的, 因而是一个从" $V "到" V** "的同构.")
   ((corollary)
    "令" $V "是域" $F "上的一个有限维向量空间. 如果" $L "是" $V "的对偶空间" V* "上的一个线性泛函, 那么"
    $V "中存在唯一的向量" $alpha "满足"
    (MB (&= (app $L $f) (app $f $alpha)))
    "对于" V* "中的每个" $f "成立.")
   ((corollary)
    "令" $V "是域" $F "上的一个有限维向量空间. 每个" V* "的基都是某个" $V "的基的对偶.")
   ((proof)
    "令" (&= (&* $BBB) (setE $f_1 $..h $f_n)) "是" V* "的一个基. 根据定理15, 存在" V**
    "的一个基" (setE $L_1 $..h $L_n) "满足"
    (MB (&= (app $L_i $f_j) δij) ".")
    "使用上面的推论, 对于每个" $i "存在" $V "中唯一的向量" $alpha_i "满足"
    (MB (&= (app $L_i $f) (app $f $alpha_i)))
    "对于" V* "中的每个" $f "成立, 即" (&= $L_i (_ $L $alpha_i)) ". 立刻就能得到" (setE $alpha_1 $..h $alpha_n)
    "是" $V "的一个基, 并且" (&* $BBB) "是这个基的对偶.")
   (P "在定理17的观点下, 我们通常将" $alpha "和" $L_alpha "视为等同的, 并称" $V "&quot;是&quot;" V*
      "的对偶空间或者说空间" $V "和" V* "自然地相互对偶. 上面的推论中, 我们描述了该定理是怎样可能有用的. "
      "下面我们给出更进一步的刻画.")
   (P "如果" $E "是" V* "的一个子集, 那么零化子" $E^0 "(从技术上说)是" V** "的一个子集. 如果我们选择"
      "如定理17那样将" $V "和" V** "视为等同的, 那么" $E^0 "是一个" $V "的一个子空间, 即所有满足对于每个"
      $E "中的" $f "有" (&= (app $f $alpha) $0) "的" $V "中向量" $alpha "构成的集合. 在定理16的一个推论"
      "中我们注意到每个子空间" $W "是由其零化子" $W^0 "决定的. 然而是怎样决定的呢? 答案是" $W "是被所有"
      $W^0 "中的" $f "零化的子空间 [译注: 这个也是定理16的推论], 即所有" $W^0 "中的" $f
      "的零空间之交. 在我们现有的零化子的记号下, 这个定理可以被简单地陈述为: " (&= $W (^ (@ $W^0) $0)) ".")
   ((theorem #:n "18")
    "如果" $S "是有限维向量空间" $V "的子集, 那么" (^ (@ $S^0) $0) "是由" $S "张成的子空间.")
   ((proof)
    "令" $W "是由" $S "张成的子空间. 显然" (&= $W^0 $S^0) ". 因此, 我们要证明的是" (&= $W (&00 $W))
    ". 我们已经给出了一个证明, 现在我们给出另一个. 根据定理16, 我们有"
    (MB (&cm (&= (&+ (&dim $W) (&dim $W^0)) (&dim $V))
             (&= (&+ (&dim $W^0) (&dim (&00 $W))) (&dim V*))))
    "既然" (&= (&dim $V) (&dim V*)) ", 于是"
    (MB (&= (&dim $W) (&dim (&00 $W))) ".")
    "因为" $W "是" (&00 $W) "的子空间, 所以我们知道" (&= $W (&00 $W)) ".")
   (P "本节的结果对于任意的向量空间也是成立的. 然而, 证明就需要使用所谓的选择公理 (Axiom of Choice). "
      "我们想避免被卷入对于这个公理的冗长讨论之中, 所以我们不会对于一般的向量空间处理零化子的结果. "
      "然而, 有两个关于一般向量空间上的线性泛函的结果是如此基本, 以至于我们要涵盖它们.")
   (P "令" $V "是一个向量空间. 我们想要定义" $V "中的超空间. 除非" $V "是有限维的, 否则我们不能"
      "通过维数来定义超空间. 但是, 我们可以用以下的方式来表达一个空间" $N "差一个维度就能填满"
      $V "的想法:"
      (Ol (Li $N "是" $V "的一个真子空间;")
          (Li "如果" $W "是一个包含" $N "的子空间, 那么要么" (&= $W $N) "要么" (&= $W $V) "."))
      "条件1和2表达了" $N "是一个真子空间并且没有更大的真子空间, 换言之, " $N "是极大的真子空间.")
   ((definition)
    "如果" $V "是一个向量空间, 那么" $V "中的一个超空间就是" $V "的一个极大的真子空间.")
   ((theorem #:n "19")
    "如果" $f "是向量空间" $V "上的一个非零的线性泛函, 那么" $f "的零空间就是" $V
    "中的一个超空间. 反过来说, 每个" $V "中的超空间都是某个" $V "上(并不唯一的)非零的线性泛函的零空间.")
   ((proof)
    "令" $f "是" $V "上一个非零的线性泛函, 并且" $N_f "是其零空间. 我们令" $alpha "是一个不在"
    $N_f "中的" $V "的向量, 即一个满足" (&!= (app $f $alpha) $0) "的向量. 我们将证明" $V
    "中的每个向量都在" $N_f "和" $alpha "张成的子空间之中. 这个子空间由所有具有形式"
    (MB (&cm (&+ $gamma (&i* $c $alpha)) (&in $gamma $N_f) (&in $c $F)))
    "的向量构成. 令" $beta "是" $V "中的向量, 定义"
    (MB (&= $c (~ (app $f $beta) (app $f $alpha))))
    "这个定义是合理的, 因为" (&!= (app $f $alpha) $0) ". 那么, " (&= $gamma (&- $beta (&i* $c $alpha)))
    "在" $N_f "之中, 因为"
    (MB (deriv (app $f $gamma)
               (app $f (&- $beta (&i* $c $alpha)))
               (&- (app $f $beta) (&i* $c (app $f $alpha)))
               $0))
    "于是" $beta "在由" $N_f "和" $alpha "张成的子空间中." (Br)
    "现在令" $N "是" $V "中的一个超空间. 固定" $alpha "为某个不在" $N "中的向量. 既然" $N
    "是极大的真子空间, 那么由" $N "和" $alpha "张成的子空间就是整个空间" $V ". 因此, 每个" $V
    "中的向量" $beta "都具有形式"
    (MB (&cm (&= $beta (&+ $gamma (&i* $c $alpha))) (&in $gamma $N) (&in $c $F)) ".")
    "向量" $gamma "和标量" $c "是由" $beta "唯一确定的. 如果我们也有"
    (MB (&cm (&= $beta (&+ $gamma^ (&i* $c^ $alpha))) (&in $gamma^ $N) (&in $c^ $F)) ",")
    "那么"
    (MB (&= (&i* (@- $c^ $c) $alpha) (&- $gamma $gamma^)) ".")
    "如果" (&!= (&- $c^ $c) $0) ", 那么" $alpha "就应该在" $N "中了, 因而有" (&= $c^ $c)
    "且" (&= $gamma^ $gamma) ". 另一种表述这个结论的方式如下: 如果" $beta "在" $V
    "中, 那么存在唯一的标量" $c "使得" (&- $beta (&i* $c $alpha)) "在" $N "中. 称这个标量为"
    (app $g $beta) ". 很容易看出来" $g "是" $V "上的一个线性泛函并且" $N "是" $g
    "的零空间.")
   ((lemma)
    "如果" $f "和" $g "是一个向量空间" $V "上的线性泛函, 那么" $g "是" $f "的标量倍数当且仅当"
    $g "的零空间包含" $f "的零空间, 即当且仅当" (&= (app $f $alpha) $0) "可以推出"
    (&= (app $g $alpha) $0) ".")
   ((proof)
    "如果" (&= $f $0) ", 那么也有" (&= $g $0) ", " $g "平凡地是" $f "的标量倍数. 设"
    (&!= $f $0) ", 于是其零空间" $N_f "是" $V "中的一个超空间. 选择" $V "中的某个向量" $alpha
    "使得" (&!= (app $f $alpha) $0) ", 并且令"
    (MB (&= $c (~ (app $g $alpha) (app $f $alpha))) ".")
    "线性泛函" (&= $h (&- $g (&i* $c $f))) "在" $N_f "上是" $0 ", 因为" $f "和" $g "在其上都是"
    $0 ". 并且, 我们还有" (&= (app $h $alpha) (&- (app $g $alpha) (&i* $c (app $f $alpha))) $0)
    ". 因此, " $h "在由" $N_f "和" $alpha "张成的子空间上都是" $0 ", 而这个子空间就是" $V
    ". 于是, 我们得出结论" (&= $h $0) ", 即" (&= $g (&i* $c $f)) ".")
   ((theorem #:n "20")
    "令" (&cm $g $f_1 $..h $f_r) "是向量空间" $V "上的线性泛函, 设其相应的零空间分别为"
    (&cm $N $N_1 $..h $N_r) ". 那么, " $g "是" (&cm $f_1 $..h $f_r) "的线性组合当且仅当 (if and only if) "
    $N "包含交集" (&cap $N_1 $..c $N_r) ".")
   ((proof)
    "如果" (&= $g (LC0 $c_1 $f_1 $c_r $f_r)) "且对于每个" $i "有" (&= (app $f_i $alpha) $0)
    ", 那么显然" (&= (app $g $alpha) $0) ". 因此, " $N "包含" (&cm $N $N_1 $..h $N_r) "." (Br)
    "我们将通过数字" $r "上的归纳证明另一个方向 (定理的&quot;if&quot;一半). 之前的引理处理了"
    (&= $r $1) "的情况. 设我们已知结果对于" (&= $r (&- $k $1)) "成立, 并且令" (&cm $f_1 $..h $f_k)
    "是分别以" (&cm $N_1 $..h $N_k) "为零空间的线性泛函, 满足" (&cap $N_1 $..c $N_k) "是" $N
    "的子集, " $N "即" $g "的零空间. 令" (&cm $g^ (_^ $f $1 $prime) $..h (_^ $f (&- $k $1) $prime))
    "分别是" (&cm $g $f_1 $..h (_ $f (&- $k $1))) "于子空间" $N_k "上的限制, 那么"
    (&cm $g^ (_^ $f $1 $prime) $..h (_^ $f (&- $k $1) $prime)) "是向量空间" $N_k "上的线性泛函. "
    "而且, 如果" $alpha "是一个" $N_k "中的向量并有"
    (&cm (&= (app (_^ $f $i $prime) $alpha) $0) (&= $i (&cm $1 $..h (&- $k $1))))
    ", 那么" $alpha "在" (&cap $N_1 $..c $N_k) "之中, 因而有" (&= (app $g^ $alpha) $0)
    ". 根据归纳 (" (&= $r (&- $k $1)) "的情形), 存在标量" $c_i "满足"
    (MB (&= $g^ (LC0 $c_1 (_^ $f $1 $prime) (_ $c (&- $k $1)) (_^ $f (&- $k $1) $prime))) ".")
    "现在令"
    (MB (&= $h (&- $g (sum (&= $i $1) (&- $k $1) (&i* $c_i $f_i)))) ",")
    "那么" $h "是一个" $V "上的线性泛函, 并且" $h "的定义告诉我们对于每个" $N_k "中的" $alpha
    "有" (&= (app $h $alpha) $0) ". 根据之前的引理, " $h "是" $f_k "的一个标量倍数. 如果"
    (&= $h (&i* $c_k $f_k)) ", 那么"
    (MB (&= $g (sum (&= $i $1) $k (&i* $c_i $f_i))) "."))
   ((exercise #:n "1")
    "令" $n "是一个正整数而" $F "是一个域. 令" $W "是" $F^n "中所有满足"
    (&= (&+ $x_1 $..c $x_n) $0) "的" (tu0 $x_1 $..h $x_n) "构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W^0 "由所有具有形式"
            (MB (&= (appl $f $x_1 $..h $x_n) (&i* $c (sum (&= $j $1) $n $x_j))))
            "的线性泛函" $f "构成.")
        (Li "证明" $W "的对偶空间" W* "可被&quot;自然地&quot;等同为" $F^n
            "上所有满足" (&= (&+ $c_1 $..c $c_n) $0) "的线性泛函"
            (MB (&= (appl $f $x_1 $..h $x_n) (LC0 $c_1 $x_1 $c_n $x_n)))
            "构成的集合.")))
   ((exercise #:n "2")
    "运用定理20来证明以下事实. 如果" $W "是一个有限维向量空间" $V "的子空间, 并且如果"
    (setE $g_1 $..h $g_r) "是" $W^0 "任意的基, 那么"
    (MB (&= $W (&Cap (&= $i $1) $r (_ $N $g_i))) "."))
   ((exercise #:n "3")
    "令" $S "是一个集合, " $F "是一个域, 以及" (app $V (&\; $S $F)) "是所有从" $S
    "到" $F "的函数构成的空间:"
    (MB (&cm (&= (app (@+ $f $g) $x) (&+ (app $f $x) (app $g $x)))
             (&= (app (@i* $c $f) $x) (&i* $c (app $f $x)))) ".")
    "令" $W "是" (app $V (&\; $S $F)) "任意的" $n "维子空间. 证明存在" $S "中的点"
    (&cm $x_1 $..h $x_n) "和" $W "中的函数" (&cm $f_1 $..h $f_n) "满足"
    (&= (app $f_i $x_j) δij) ".")
   (H3 "第3.7节 线性变换的转置")
   (P "设我们有两个域" $F "上的向量空间" $V "和" $W ", 以及一个从" $V "到" $W
      "的线性变换" $T ", 那么" $T "按照以下方式导出了一个从" W* "到" V* "的线性变换. 设"
      $g "是" $W "上的一个线性泛函, 对于每个" $V "中的" $alpha ", 令"
      (MB (&= (app $f $alpha) (app $g (ap $T $alpha))))
      "那么这就定义了一个从" $V "到" $F "的函数" $f ", 即" $T " (一个从" $V
      "到" $W "的函数) 与" $g " (一个从" $W "到" $F "的函数) 相复合. 既然" $T
      "和" $g "都是线性的, 那么定理6告诉我们" $f "也是线性的, 即" $f "是一个" $V
      "上的线性泛函. 因此, " $T "给我们提供了一个规则" $T^t ", 其为每个" $W "上的线性泛函"
      $g "赋一个" $V "上的线性泛函" (&= $f (ap $T^t $g)) ", 如上面的式子所定义的那样. "
      "读者也应该注意到" $T^t "实际上是一个从" W* "到" V* "的线性变换, 因为如果"
      $g_1 "和" $g_2 "在" W* "中而" $c "是一个标量, 那么"
      (MB (deriv (app (bra0 (app $T^t (LC $c $g_1 $g_2))) $alpha)
                 (app (@LC $c $g_1 $g_2) (ap $T $alpha))
                 (LC $c (app $g_1 (ap $T $alpha)) (app $g_2 (ap $T $alpha)))
                 (LC $c (app (@ap $T^t $g_1) $alpha) (app (@ap $T^t $g_2) $alpha))))
      "于是" (&= (app $T^t (LC $c $g_1 $g_2)) (LC $c (ap $T^t $g_1) (ap $T^t $g_2)))
      ". 让我们总结一下.")
   ((theorem #:n "21")
    "令" $V "和" $W "是域" $F "上的向量空间. 对于每个从" $V "到" $W "的线性变换, 存在唯一的从"
    W* "到" V* "的线性变换" $T^t "满足"
    (MB (&= (app (@ap $T^t $g) $alpha) (app $g (ap $T $alpha))))
    "对于每个" W* "中的" $g "和" $V "中的" $alpha "成立.")
   (P "我们将称" $T^t "为" $T "的" (B "转置") ". 这个变换" $T^t "也常被称作" $T
      "的伴随. 然而, 我们不会使用这个术语.")
   ((theorem #:n "22")
    "令" $V "和" $W "是域" $F "上的向量空间, " $T "是一个从" $V "到" $W "的线性变换. "
    $T^t "的零空间是" $T "的像的零化子. 如果" $V "和" $W "是有限维的, 那么"
    (Ol #:attr* '((type "i"))
        (Li (&= (&rank $T^t) (&rank $T)) ";")
        (Li $T^t "的像是" $T "的零空间的零化子.")))
   ((proof)
    "如果" $g "在" W* "中, 那么根据定义有"
    (MB (&= (app (@ap $T^t $g) $alpha) (app $g (ap $T $alpha))))
    "对于每个" $V "中的" $alpha "成立. " $g "在" $T^t "的零空间之中的意思是对于每个"
    $V "中的" $alpha "有" (&= (app $g (ap $T $alpha)) $0) ". 因此, " $T^t "的零空间就恰是"
    $T "的像的零化子." (Br)
    "设" $V "和" $W "是有限维的, 比如说" (&= (&dim $V) $n) "和" (&= (&dim $W) $m) ". 对于i: 令"
    $r "是" $T "的秩, 即" $T "的像的维数. 根据定理16, " $T "的像的零化子的维数是" (@- $m $r)
    ". 根据这个定理的第一条陈述, 我们知道" $T^t "的零化度必然是" (@- $m $r) ". 但是如果这样的话, 既然"
    $T^t "是一个" $m "维空间上的线性变换, 那么" $T^t "的秩就应该是" (&= (&- $m (@- $m $r)) $r)
    ", 于是" $T "和" $T^t "有着相同的秩. 对于ii: 令" $N "是" $T "的零空间. 每个" $T^t
    "的像之中的线性泛函都在" $N "的零化子之中, 因为若设对于某个" W* "中的" $g "有"
    (&= $f (ap $T^t $g)) ", 那么如果" $alpha "在" $N "中, 有"
    (MB (&= (app $f $alpha) (app (@ap $T^t $g) $alpha) (app $g (ap $T $alpha))
            (app $g $0) $0) ".")
    "现在我们知道" $T^t "的像是空间" $N^0 "的一个子空间, 并且"
    (MB (&= (&dim $N^0) (&- $n (&dim $N)) (&rank $T) (&rank $T^t)))
    "于是" $T^t "的像必然就恰是" $N^0 ".")
   ((theorem #:n "23")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 令" $BBB "是" $V "的一个有序基, 其对偶基是"
    (&* $BBB) ". 令" $BBB^ "是" $W "的一个有序基, 其对偶基是" (&* $BBB^) ". 令" $T
    "是一个从" $V "到" $W "的线性变换, 令" $A "是" $T "相对于" $BBB "和" $BBB^
    "的矩阵. 令" $B "是" $T^t "相对于" (&* $BBB^) "和" (&* $BBB) "的矩阵, 那么"
    (&= (mref $B $i $j) (mref $A $j $i)) ".")
   ((proof)
    "令"
    (MB (&cm basis:def (&= $BBB^ (setE $beta_1 $..h $beta_m))
             (&= (&* $BBB) (setE $f_1 $..h $f_n))
             (&= (&* $BBB^) (setE $g_1 $..h $g_m))) ".")
    "根据定义,"
    (MB (&cm (&= (ap $T $alpha_j) (sum (&= $i $1) $m (&i* (mref $A $i $j) $beta_i)))
             (&= $j (&cm $1 $..h $n))
             (&= (ap $T^t $g_j) (sum (&= $i $1) $n (&i* (mref $B $i $j) $f_i)))
             (&= $j (&cm $1 $..h $m))) ".")
    "另一方面,"
    (MB (deriv (app (@ap $T^t $g_j) $alpha_i)
               (app $g_j (ap $T $alpha_i))
               (ap $g_j (@sum (&= $k $1) $m (&i* (mref $A $k $i) $beta_k)))
               (sum (&= $k $1) $m (&i* (mref $A $k $i) (app $g_j $beta_k)))
               (sum (&= $k $1) $m (&i* (mref $A $k $i) (&delta $j $k)))
               (mref $A $j $i)))
    "对于" $V "上任意的线性泛函" $f "我们有"
    (MB (&= $f (sum (&= $i $1) $n (&i* (app $f $alpha_i) $f_i))) ".")
    "如果我们将此公式应用于泛函" (&= $f (ap $T^t $g_j)) "并运用"
    (&= (app (@ap $T^t $g_j) $alpha_i) (mref $A $j $i)) "的事实, 那么我们有"
    (MB (&= (ap $T^t $g_j) (sum (&= $i $1) $n (&i* (mref $A $j $i) $f_i))))
    "从中立即可以得出" (&= (mref $B $i $j) (mref $A $j $i)) ".")
   ((definition)
    "如果" $A "是域" $F "上的一个" m*n "矩阵, 那么" $A "的转置" $A^t
    "是由" (&= (_^ $A (&cm $i $j) $t) (mref $A $j $i)) "定义的"
    (&c* $n $m) "矩阵.")
   (P "定理23是说如果" $T "是一个从" $V "到" $W "的线性变换, 其在某对有序基下的矩阵是"
      $A ", 那么转置变换" $T^t "在与之对偶的一对有序基下由转置矩阵" $A^t "表示.")
   ((theorem #:n "24")
    "令" $A "是域" $F "上任意的" m*n "矩阵, 那么" $A "的行秩等于" $A "的列秩.")
   ((proof)
    "令" $BBB "是" $F^n "的标准有序基, " $BBB^ "是" $F^m "的标准有序基. 令" $T
    "是从" $F^n "到" $F^m "的线性变换, 其相对于" $BBB "和" $BBB^ "的矩阵是" $A ", 即"
    (MB (&= (appl $T $x_1 $..h $x_n) (tu0 $y_1 $..h $y_m)))
    "其中"
    (MB (&= $y_i (sum (&= $j $1) $n (&i* (mref $A $i $j) $x_j))) ".")
    $A "的列秩等于变换" $T "的秩, 因为" $T "的像由所有这样的" $m "元组构成, 其是" $A
    "的列向量的线性组合. [译注: 在同构的意义下]" (Br)
    "相对于对偶基" (&* $BBB^) "和" (&* $BBB) ", 转置变换" $T^t "由矩阵" $A^t
    "表示. 既然" $A^t "的列即" $A "的行, 以相同的推理我们看出" $A "的行秩 (" $A^t
    "的列秩) 等于" $T^t "的秩. 根据定理22, " $T "和" $T^t "有着相同的秩, 因此" $A
    "的行秩等于" $A "的列秩.")
   (P "现在我们知道如果" $A "是一个域" $F "的" m*n "矩阵而" $T "是一个按照以上方式定义的从"
      $F^n "到" $F^m "的线性变换, 那么"
      (MB (&= (&rank $T) (&row-rank $A) (&column-rank $A)) ".")
      "我们将简单地称这个数字为" $A "的秩.")
   ((example #:n "25")
    "这个例子是一般性质的&mdash;&mdash;与其说是例子, 不如说是讨论. 令" $V "是域" $F
    "上的一个" $n "维向量空间, 令" $T "是" $V "上的一个线性变换. 设" basis:def
    "是" $V "的一个有序基. " $T "在有序基" $BBB "下的矩阵被定义为" n*n "矩阵" $A ", 即"
    (MB (&= (ap $T $alpha_j) (sum (&= $i $1) $n (&i* (mref $A $i $j) $alpha_i))) ".")
    "换言之, " (mref $A $i $j) "是向量" (ap $T $alpha_j) "在有序基" $BBB "下的第" $i
    "个坐标. 如果" (setE $f_1 $..h $f_n) "是" $BBB "的对偶基的话, 这可以被简单地陈述为"
    (MB (&= (mref $A $i $j) (app $f_i (ap $T $alpha_j))) ".")
    "让我们看看若改变基会发生什么. 设"
    (MB (&= $BBB^ (setE (_^ $alpha $1 $prime) $..h (_^ $alpha $n $prime))))
    "是" $V "的另一个有序基, 其对偶基是" (setE (_^ $f $1 $prime) $..h (_^ $f $n $prime))
    ". 如果" $B "是" $T "在有序基" $BBB^ "下的矩阵, 那么"
    (MB (&= (mref $B $i $j) (app (_^ $f $i $prime) (ap $T (_^ $alpha $j $prime)))) ".")
    "令" $U "是满足" (&= (ap $U $alpha_j) (_^ $alpha $j $prime)) "的可逆线性算子, 那么"
    $U "的转置由" (&= (ap $U^t (_^ $f $i $prime)) $f_i) "给出. 读者很容易验证如果" $U
    "是可逆的, 那么" $U^t "和" (&= (inv (@ $U^t)) (^ (@ (inv $U)) $t)) "也是可逆的. 因此, "
    (&cm (&= (_^ $f $i $prime) (ap (^ (@ (inv $U)) $t) $f_i)) (&= $i (&cm $1 $..h $n)))
    ". 于是,"
    (MB (deriv (mref $B $i $j)
               (app (_^ $f $i $prime) (ap $T (_^ $alpha $j $prime)))
               (app (bra0 (ap (^ (@ (inv $U)) $t) $f_i)) (ap $T (_^ $alpha $j $prime)))
               (app $f_i (ap (inv $U) (ap $T (_^ $alpha $j $prime))))
               (app $f_i (ap (inv $U) (ap $T (ap $U $alpha_j))))))
    "那么这说明了什么呢? 嗯, " (app $f_i (ap (inv $U) (ap $T (ap $U $alpha_j))))
    "是" (sim $T $U) "在有序基" $BBB "下的矩阵的第" $i "行" $j "列元素. 上面的计算表明这个标量也是"
    $T "在有序基" $BBB^ "下的第" $i "行" $j "列元素. 换句话说,"
    (MB (deriv (coordm $T $BBB^)
               (coordm (sim $T $U))
               (&i* (coordm (inv $U)) (coordm $T) (coordm $U))
               (&i* (_^ (bra0 $U) $BBB $-1) (coordm $T) (coordm $U))))
    "而这恰好就是我们之前推导出来的基变换公式.")
   ((exercise #:n "1")
    "令" $F "是一个域, 令" $f "是" $F^2 "上由" (&= (appl $f $x_1 $x_2) (LC $a $x_1 $b $x_2))
    "定义的线性泛函. 对于以下的每个线性算子" $T ", 令" (&= $g (ap $T^t $f)) ", 找出"
    (appl $g $x_1 $x_2) "."
    (Ol #:attr* '((type "a"))
        (Li (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) ";")
        (Li (&= (appl $T $x_1 $x_2) (tu0 (&- $x_2) $x_1)) ";")
        (Li (&= (appl $T $x_1 $x_2) (tu0 (&- $x_1 $x_2) (&+ $x_1 $x_2))) ".")))
   ((exercise #:n "2")
    "令" $V "是实数域上的多项式函数的向量空间. 令" $a "和" $b "是固定的实数, 令" $f
    "是" $V "上由"
    (MB (&= (app $f $p) (integral $a $b (app $p $x) $x)))
    "定义的线性泛函. 如果" $D "是" $V "上的微分算子, 那么" (ap $D^t $f) "是什么呢?")
   ((exercise #:n "3")
    "令" $A "是域" $F "上" n*n "矩阵的向量空间, 令" $B "是一个固定的" n*n "矩阵. 如果"
    $T "是" $V "上由" (&= (app $T $A) (&- (&i* $A $B) (&i* $B $A))) "定义的线性算子, "
    $f "是迹函数, 那么" (ap $T^t $f) "是什么呢?")
   ((exercise #:n "4")
    "令" $V "是域" $F "上的一个有限维向量空间, 令" $T "是" $V "上的一个线性算子. 令" $c
    "是一个标量, 设" $V "中存在非零的向量" $alpha "使得" (&= (ap $T $alpha) (&i* $c $alpha))
    ". 证明" $V "上存在一个非零的线性泛函" $f "使得" (&= (ap $T^t $f) (&i* $c $f)) ".")
   ((exercise #:n "5")
    "令" $A "是" $RR "上的" m*n "矩阵. 证明" (&= $A $0) "当且仅当"
    (&= (&trace (&i* $A^t $A)) $0) ".")
   ((exercise #:n "6")
    "令" $n "是一个正整数, 令" $V "是实数域上次数不超过" $n "的多项式函数构成的向量空间, 即所有具有形式"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
    "的函数构成的空间. 令" $D "是" $V "上的微分算子. 找出转置算子" $D^t "的零空间的一个基.")
   ((exercise #:n "7")
    "令" $V "是域" $F "上的一个有限维向量空间. 证明" (&\|-> $T $T^t) "是一个从" (&L $V $V)
    "到" (&L V* V*) "的同构.")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的" n*n "矩阵构成的向量空间."
    (Ol #:attr* '((type "a"))
        (Li "如果" $B "是一个固定的" n*n "矩阵, 以" (&= (app $f_B $A) (&trace (&i* $B^t $A)))
            "定义一个" $V "上的函数" $f_B ". 证明" $f_B "是" $V "上的一个线性泛函.")
        (Li "证明每个" $V "上的线性泛函都具有以上形式, 即是某个" $B "下的" $f_B ".")
        (Li "证明" (&\|-> $B $f_B) "是一个从" $V "到" V* "的同构.")))
   (H2 "第4章 多项式")
   (H3 "第4.1节 代数")
   (P "本章的目的在于建立域上的多项式代数的一些基本性质. 如果我们先引入域上的"
      "线性代数的概念的话, 讨论会更加容易.")
   ((definition)
    "令" $F "是一个域, 域" $F "上的一个线性代数是一个" $F "上的向量空间" $V:fraktur
    ", 其带有一个额外的被称为向量的乘法的运算. 它将每对" $V:fraktur "中的向量" $alpha
    "和" $beta "联系以一个" $V:fraktur "中的向量" (&i* $alpha $beta) ", 其被称为"
    $alpha "和" $beta "的积, 满足"
    (Ol #:attr* '((type "a"))
        (Li "乘法是结合的,"
            (MB (assoc* $alpha $beta $gamma) ";"))
        (Li "乘法对于加法是分配的,"
            (MB (disR $alpha $beta $gamma) "且" (disL $alpha $beta $gamma) ";"))
        (Li "对于每个" $F "中的标量" $c ","
            (MB (&= (&i* $c (@i* $alpha $beta))
                    (&i* (@i* $c $alpha) $beta)
                    (&i* $alpha (@i* $c $beta))) ".")))
    "如果" $V:fraktur "中存在元素" $1 "满足" (&= (&i* $1 $alpha) (&i* $alpha $1) $alpha)
    "对于每个" $V:fraktur "中的" $alpha "均成立, 那么我们就称" $V:fraktur "是域" $F
    "上一个含幺元的线性代数, 并称" $1 "为" $V:fraktur "的幺元. 代数" $V:fraktur
    "被称为是交换的, 如果对于所有" $V:fraktur "中的" $alpha "和" $beta "有"
    (commute* $alpha $beta) ".")
   ((example #:n "1")
    "域" $F "上的" n*n "矩阵的集合, 在通常的运算下, 是一个含幺元的线性代数. 特别地, 域本身"
    "就是一个含幺元的线性代数. 这个代数在" (&>= $n $2) "时不交换, 域本身当然是交换的.")
   ((example #:n "2")
    "一个向量空间上的所有线性算子的空间, 以复合为积, 是一个含幺元的线性代数. 它是交换的"
    "当且仅当空间是一维的. [译注: 零维其实也是.]")
   (P "读者或许对于" $RR^3 "中的点积和叉积已经有了一些经验. 如果确是如此的话, 那么他应该观察到"
      "这两种积和上面的线性代数的定义中所描述的向量乘法均不是一种类型的运算. 点积是一种&quot;"
      "标量积&quot;, 也就是说, 它将一对向量联系以一个标量, 因此它当然不是我们现在所讨论的那种乘法. "
      "叉积的确联系每对" $RR^3 "中的向量以一个" $RR^3 "中的向量, 然而它不是一种结合运算.")
   (P "本节的剩余部分将致力于构造一种与之前的两个例子截然不同的代数. 令" $F "是一个域, " $S
      "是非负整数的集合. 根据第2章的例子3, 所有从" $S "到" $F "的函数构成了一个域" $F
      "上的向量空间. 我们将其记作" $F^inf ". 因此, " $F^inf "中的向量是" $F
      "中的标量" $f_i "的无穷序列" (&= $f (tu0 $f_0 $f_1 $f_2 $..h)) ". 如果"
      (&cm (&= $g (tu0 $g_0 $g_1 $g_2 $..h)) (&in $g_i $F)) "并且" $a "和" $b "是" $F
      "中的标量, 那么" (LC $a $f $b $g) "是由"
      (MB (&= (LC $a $f $b $g)
              (tu0 (LC $a $f_0 $b $g_0)
                   (LC $a $f_1 $b $g_1)
                   (LC $a $f_2 $b $g_2)
                   $..h)))
      "给出的无穷序列. 我们这样定义" $F^inf "中的积, 对于" $F^inf "中的向量" $f
      "和" $g ", 向量" (&i* $f $g) "由"
      (MB (&cm (&= (_ (@i* $f $g) $n)
                   (sum (&= $i $0) $n (&i* $f_i (_ $g (&- $n $i)))))
               (&= $n (&cm $0 $1 $2 $..h))))
      "给出, 因而"
      (MB (&= (&i* $f $g)
              (tu0 (&i* $f_0 $g_0)
                   (&+ (&i* $f_0 $g_1) (&i* $f_1 $g_0))
                   (&+ (&i* $f_0 $g_2) (&i* $f_1 $g_1) (&i* $f_2 $g_0))
                   $..h)))
      "并且因为对于" (&= $n (&cm $0 $1 $2 $..h)) "有"
      (MB (&= (_ (@i* $g $f) $n) (conv $i $n $g $f) (conv $i $n $f $g) (_ (@i* $f $g) $n)))
      "所以乘法是交换的 [译注: 这里用到了域的乘法的交换性质], 即" (commute* $f $g)
      ". 如果" $h "也属于" $F^inf ", 那么对于" (&= $n (&cm $0 $1 $2 $..h)) "我们有"
      (MB (deriv (_ (bra0 (&i* (@i* $f $g) $h)) $n)
                 (conv $i $n (@i* $f $g) $h)
                 (sum (&= $i $0) $n
                      (&i* (@conv $j $i $f $g) (_ $h (&- $n $i))))
                 (sum (&= $i $0) $n
                      (sum (&= $j $0) $i
                           (&i* $f_j (_ $g (&- $i $j)) (_ $h (&- $n $i)))))
                 (sum (&= $j $0) $n
                      (sum (&= $i $j) $n
                           (&i* $f_j (_ $g (&- $i $j)) (_ $h (&- $n $i)))))
                 (sum (&= $j $0) $n
                      (sum (&= $i $0) (&- $n $j)
                           (&i* $f_j $g_i (_ $h (&- $n $i $j)))))
                 (sum (&= $j $0) $n
                      (&i* $f_j (@conv $i (&- $n $j) $g $h)))
                 (conv $j $n $f (@i* $g $h))
                 (_ (bra0 (&i* $f (@i* $g $h))) $n)))
      "[译注: 以上的计算不单纯是指标体操, 还蕴含了&quot;按照两种方式数" (tu0 $i $j) "格点&quot;的想法.] 于是"
      (MB (assoc* $f $g $h) ".")
      "我们将验证该乘法满足上述线性代数定义中的b和c的工作留给读者, 并且读者还应该发现向量"
      (&= $1 (tu0 $1 $0 $0 $..h)) "充当了" $F^inf "的幺元. 因此, " $F^inf "在上述定义的运算下, "
      "构成了一个域" $F "上含幺元的交换线性代数.")
   (P "向量" (tu0 $0 $1 $0 $..h $0 $..h) "在接下来起到了突出的作用, 于是我们将一致地记其为"
      $x ". 在这整整一章里, " $x "从不会被用来表示域" $F "的元素. " $x "自乘" $n "次的结果被记为"
      $x^n ", 并且我们置" (&= $x^0 $1) ", 那么"
      (MB (&cm (&= $x^2 (tu0 $0 $0 $1 $0 $..h))
               (&= $x^3 (tu0 $0 $0 $0 $1 $0 $..h))))
      "而一般地, 对于每个整数" (&>= $k $0) ", " (&= (_ (@ $x^k) $k) $1) ", 对于所有非负整数"
      (&!= $n $k) ", 有" (&= (_ (@ $x^k) $n) $0) ". 本节我们以这样的观察结束, 由"
      (&cm $1 $x $x^2 $..h) "构成的集合是线性无关的且是无限的, 于是代数" $F^inf
      "不是有限维的.")
   (P "代数" $F^inf "有时也被称为域" $F "上的形式幂级数代数. 元素"
      (&= $f (tu0 $f_0 $f_1 $f_2 $..h)) "常被记为"
      (MB (&= $f (sum (&= $n $0) $inf (&i* $f_n $x^n))) ".")
      "这个记号对于处理代数运算而言是十分便利的. 然而在使用时, 必须要记住这是全然形式上的. "
      "代数中并不存在&quot;无限的和&quot;, 幂级数记号并不意图传达任何有关收敛性的想法, "
      "如果读者知道那是什么的话. 通过使用序列, 我们得以谨慎地定义了一个代数, 其行为与"
      "形式幂级数的加法和乘法一致, 但不会引起将其当作无穷和的困惑.")
   (H3 "第4.2节 多项式代数")
   (P "我们现在准备定义域" $F "上的多项式.")
   ((definition)
    "令" polyF "是由" (&cm $1 $x $x^2 $..h) "张成的" $F^inf
    "的子空间. " polyF "的元素被称为域" $F "上的多项式.")
   (P "既然" polyF "由" $x "及其幂的所有线性组合构成, 那么" $F^inf "中的非零向量" $f
      "是多项式当且仅当存在一个整数" (&>= $n $0) "使得" (&!= $f_n $0) "并且对于所有整数"
      (&> $k $n) "有" (&= $f_k $0) ". 这个整数显然是唯一的, 其被称为" $f "的次数 (degree). "
      "我们用" (&deg $f) "代表多项式" $f "的次数, 而" $0 "多项式的次数是没有定义的. 如果"
      $f "是一个次数为" $n "的非零多项式, 那么"
      (MB (&cm (&= $f (LC0 $f_0 $x^0 $f_1 $x^1 $f_2 $x^2 $f_n $x^n))
               (&!= $f_n $0)) ".")
      "标量" (&cm $f_0 $f_1 $..h $f_n) "有时也被称为" $f "的系数, 而且我们也可以说"
      $f "是一个系数在" $F "之中的多项式. 我们称具有形式" (&i* $c $x^0) "的多项式为标量多项式, 并且经常将"
      (&i* $c $x^0) "记作" $c ". 一个次数为" $n "的非零多项式" $f ", 如果" (&= $f_n $1)
      ", 那么就称其为首项系数为一 (monic) 的多项式.")
   (P "读者应该注意多项式和我们之前已经讨论甚多的" $F "上的多项式函数不是同一种对象. 如果" $F
      "包含无限的元素, 那么" polyF "和" $F "上的多项式函数的代数之间有一个自然的同构. "
      "我们将在下一节讨论这个事情. 现在让我们来验证" polyF "是一个代数.")
   ((theorem #:n "1")
    "令" $f "和" $g "是域" $F "上非零的多项式, 那么"
    (Ol #:attr* '((type "i"))
        (Li (&i* $f $g) "是一个非零的多项式;")
        (Li (&= (&deg (@i* $f $g)) (&+ (&deg $f) (&deg $g))) ";")
        (Li "如果" $f "和" $g "都是首项系数为一的多项式, 那么" (&i* $f $g)
            "也是首项系数为一的多项式;")
        (Li (&i* $f $g) "是标量多项式当且仅当" $f "和" $g "都是标量多项式;")
        (Li "如果" (&!= (&+ $f $g) $0) ", 那么"
            (MB (&<= (&deg (@+ $f $g)) (&max (&deg $f) (&deg $g))) "."))))
   ((proof)
    "设" $f "的次数为" $m ", " $g "的次数为" $n ". 如果" $k "是一个非负整数, 那么"
    (MB (&= (_ (@i* $f $g) (&+ $m $n $k)) (conv $i (&+ $m $n $k) $f $g)) ".")
    "为了使得" (&!= (&i* $f_i (_ $g (&- (&+ $m $n $k) $i))) $0) ", "
    (&<= $i $m) "且" (&<= (&- (&+ $m $n $k) $i) $n) "是必要的. 因此"
    (&<= (&+ $m $k) $i $m) "是必要的, 这推出了" (&= $k $0) "然后" (&= $i $m)
    ", 于是"
    (MB (&= (_ (@i* $f $g) (&+ $m $n)) (&i* $f_m $g_n)))
    "且"
    (MB (&cm (&= (_ (@i* $f $g) (&+ $m $n $k)) $0) (&> $k $0)) ".")
    "陈述i, ii, iii立即可由以上两个结果得到, 而iv是i和ii的推论. 我们将v的验证留给读者.")
   ((corollary #:n "1")
    "一个给定域" $F "上所有多项式的集合, 装备以上定义的线性组合和乘法运算后, 成为域"
    $F "上的一个含幺元的交换线性代数.")
   ((proof)
    "既然线性组合和乘法运算是对于" $F^inf "定义的而" polyF "是" $F^inf
    "的一个子空间, 那么只需证明两个多项式之积仍然是多项式就够了. 当其中一个因子是"
    $0 "时这是平凡的, 而剩下来的部分可从i得出.")
   ((corollary #:n "2")
    "设" (&cm $f $g $h) "是域" $F "上的多项式满足" (&!= $f $0) "且"
    (&= (&i* $f $g) (&i* $f $h)) ", 那么" (&= $g $h) ".")
   ((proof)
    "既然" (&= (&i* $f $g) (&i* $f $h)) ", 那么" (&= (&i* $f (@- $g $h)) $0)
    ". 鉴于" (&!= $f $0) ", 从i立即可以得到" (&= (&- $g $h) $0) ".")
   (P "特定的额外事实可由定理1的证明简单推得, 我们将总结其中一些.")
   (P "设"
      (MB (&= $f (sum (&= $i $0) $m (&i* $f_i $x^i)))
          "和" (&= $g (sum (&= $j $0) $n (&i* $g_j $x^j))))
      "那么从" (&cm (&= (_ (@i* $f $g) (&+ $m $n $k)) $0) (&> $k $0))
      "中我们可以得到"
      (MB (&= (&i* $f $g)
              (sum (&= $s $0) (&+ $m $n)
                   (&i* (@conv $r $s $f $g) $x^s))) ".")
      "读者应当验证, 在" (&cm (&= $f (&i* $c $x^m)) (&= $g (&i* $d $x^n)))
      "的特殊情形下, 其中" (&cm $c $d) "是" $F "中的标量, 上式可被规约为"
      (MB (&= (&i* (@i* $c $x^m) (@i* $d $x^n))
              (&i* $c $d (^ $x (&+ $m $n)))) ".")
      "据此, 以及" polyF "的分配律, 我们知道两多项式相乘的积也可由"
      (MB (sum (&cm $i $j) $ (&i* $f_i $g_j (^ $x (&+ $i $j)))))
      "给出, 该求和布于所有满足" (&<= $0 $i $m) "和" (&<= $0 $j $n)
      "的整数序对" (&cm $i $j) "之上.")
   ((definition)
    "令" $V:fraktur "是一个域" $F "上的含幺元的线性代数. 我们用" $1 "表示"
    $V:fraktur "的幺元, 并对于" $V:fraktur "的每个元素" $alpha "作出"
    (&= $alpha^0 $1) "的约定. 那么, 对于每个域" $F "上的多项式"
    (&= $f (sum (&= $i $0) $n (&i* $f_i $x^i))) "和" $V:fraktur
    "中的" $alpha ", 我们联系以一个" $V:fraktur "中的元素" (app $f $alpha)
    ", 由以下规则定义"
    (MB (&= (app $f $alpha) (sum (&= $i $0) $n (&i* $f_i $alpha^i)))))
   ((example #:n "3")
    "令" $CC "是复数域, 令" (&= $f (&+ $x^2 $2)) "."
    (Ol #:attr* '((type "a"))
        (Li "如果" (&= $V:fraktur $CC) "而" (&in $z $CC) ", 那么"
            (&= (app $f $z) (&+ $z^2 $2)) ". 特别地, " (&= (app $f $2) $6) "而"
            (MB (&= (ap $f (pare (~ (&+ $1 $i) (&- $1 $i)))) $1) "."))
        (Li "如果" (&= $V:fraktur (^ $CC (&c* $2 $2))) "且"
            (MB (&= $B (Mat ($1 $0) ($-1 $2))))
            "那么"
            (MB (&= (app $f $B)
                    (&+ (&i* $2 (Mat ($1 $0) ($0 $1)))
                        (^ (Mat ($1 $0) ($-1 $2)) $2))
                    (Mat ($3 $0) ($-3 $6))) "."))
        (Li "如果" $V:fraktur "是" $CC^3 "上的所有线性算子构成的代数, " $T "是由"
            (MB (&= (appl $T $c_1 $c_2 $c_3)
                    (tu0 (&i* $i (Msqrt $2) $c_1) $c_2
                         (&i* $i (Msqrt $2) $c_3))))
            "给定的" $V:fraktur "的元素, 那么" (app $f $T) "是由"
            (MB (&= (appl (app $f $T) $c_1 $c_2 $c_3)
                    (tu0 $0 (&i* $3 $c_2) $0)))
            "定义的" $CC^3 "上的线性算子.")
        (Li "如果" $V:fraktur "是所有" $CC "上的多项式的代数, 并且"
            (&= $g (&+ $x^4 (&i* $3 $i))) ", 那么" (app $f $g) "也是一个"
            $V:fraktur "中的多项式, 由"
            (MB (&= (app $f $g) (&+ $-7 (&i* $6 $i $x^4) $x^8)))
            "给定."))
    "机敏的读者可能会发现与这最后一个例子相关联的一个事实, 即如果" $f
    "是任意的域上的一个多项式而" $x "是多项式" (tu0 $0 $1 $0 $..h) ", 那么"
    (&= $f (app $f $x)) ", 不过我们建议他忘掉这个事实.")
   ((theorem #:n "2")
    "令" $F "是一个域, " $V:fraktur "是域" $F "上的一个含幺元的线性代数. 设"
    $f "和" $g "是域" $F "上的多项式, " $alpha "是" $V:fraktur "的一个元素, "
    $c "属于域" $F ", 那么"
    (Ol #:attr* '((type "i"))
        (Li (&= (app (@LC $c $f $g) $alpha)
                (LC $c (app $f $alpha) (app $g $alpha))) ";")
        (Li (&= (app (@i* $f $g) $alpha)
                (&i* (app $f $alpha) (app $g $alpha))) ".")))
   ((proof)
    "因为i的结果很容易建立, 我们将只证明ii. 设"
    (MB (&= $f (sum (&= $i $0) $m (&i* $f_i $x^i)))
        "和" (&= $g (sum (&= $j $0) $n (&i* $g_j $x^j))))
    "之前我们已经证明了"
    (MB (&= (&i* $f $g) (sum (&cm $i $j) $ (&i* $f_i $g_j (^ $x (&+ $i $j))))))
    "那么根据i,"
    (MB (deriv (app (@i* $f $g) $alpha)
               (sum (&cm $i $j) $ (&i* $f_i $g_j (^ $alpha (&+ $i $j))))
               (&i* (@sum (&= $i $0) $m (&i* $f_i $alpha^i))
                    (@sum (&= $j $0) $n (&i* $g_j $alpha^j)))
               (&i* (app $f $alpha) (app $g $alpha)))))
   ((exercise #:n "1")
    "令" $F "是复数域的子域, 令" $A "是如下" $F "上的" (&c* $2 $2) "矩阵"
    (MB (&= $A (Mat ($2 $1) ($-1 $3))) ".")
    "对于下列" $F "上的多项式" $f ", 计算" (app $f $A) "."
    (Ol #:attr* '((type "a"))
        (Li (&= $f (: $x^2 $- $x $+ $2)) ";")
        (Li (&= $f (&- $x^3 $1)) ";")
        (Li (&= $f (: $x^2 $- (&i* $5 $x) $+ $7)) ".")))
   ((exercise #:n "2")
    "令" $T "是" $RR^3 "上由"
    (MB (&= (appl $T $x_1 $x_2 $x_3)
            (tu0 $x_1 $x_3 (&- (&i* $-2 $x_2) $x_3))))
    "定义的线性算子. 令" $f "是" $RR "上的多项式, 由"
    (&= $f (&+ (&- $x^3) $2)) "定义. 找出" (app $f $T) ".")
   ((exercise #:n "3")
    "令" $A "是域" $F "上的一个" n*n "对角矩阵, 即对于" (&!= $i $j)
    "有" (&= Aij $0) "的矩阵. 令" $f "是" $F "上的多项式, 由"
    (MB (&= $f (&i* (@- $x (mref $A $1 $1)) $..c (@- $x (mref $A $n $n)))))
    "定义. 矩阵" (app $f $A) "是什么?")
   ((exercise #:n "4")
    "如果" $f "和" $g "是域" $F "上线性无关的多项式, " $h "是域" $F
    "上一个非零的多项式, 证明" (&i* $f $h) "和" (&i* $g $h) "是线性无关的.")
   ((exercise #:n "5")
    "如果" $F "是一个域, 证明" $F^inf "的两个非零元素之积仍然是非零的.")
   ((exercise #:n "6")
    "令" $S "是域" $F "上的某些非零多项式的集合. 如果" $S "中没有两个元素具有相同的次数, 证明"
    $S "在" polyF "中是一个线性无关的集合.")
   ((exercise #:n "7")
    "如果" $a "和" $b "是域" $F "的元素并且" (&!= $a $0) ", 证明多项式"
    (&cm $1 (LC $a $x $b) (^ (@LC $a $x $b) $2) (^ (@LC $a $x $b) $3) $..h)
    "构成了" polyF "的一个基.")
   ((exercise #:n "8")
    "如果" $F "是一个域, " $h "是" $F "上一个满足" (&>= (&deg $h) $1) "的多项式, 证明映射"
    (&\|-> $f (app $f $h)) "是" polyF "上的一个非奇异的线性算子. 证明这个算子是从" polyF
    "到自身的同构当且仅当" (&= (&deg $h) $1) ".")
   ((exercise #:n "9")
    "令" $F "是复数域的一个子域, 定义" polyF "上的变换" (&cm $T $D) "为"
    (MB (&= (ap $T (@sum (&= $i $0) $n (&i* $c_i $x^i)))
            (sum (&= $i $0) $n (&i* (~ $c_i (&+ $1 $i)) (^ $x (&+ $i $1))))))
    "和"
    (MB (&= (ap $D (@sum (&= $i $0) $n (&i* $c_i $x^i)))
            (sum (&= $i $1) $n (&i* $i $c_i (^ $x (&- $i $1))))) ".")
    (Ol #:attr* '((type "a"))
        (Li "证明" $T "是" polyF "上的非奇异线性算子, 并表明" $T "不是可逆的.")
        (Li "证明" $D "是" polyF "上满射的线性算子, 并找出其零空间.")
        (Li "证明" (&= (&i* $D $T) $I) "但是" (&!= (&i* $T $D) $I) ".")
        (Li "证明对于所有" polyF "中的" $f "和" $g "有"
            (&= (ap $T (bra0 (ap (@ap $T $f) $g)))
                (&- (ap (@ap $T $f) (@ap $T $g))
                    (ap $T (bra0 (app $f (ap $T $g)))))) ".")
        (Li "陈述并证明一条与d中为" $T "给出的类似的" $D "的规律.")
        (Li "设" $V "是" polyF "的一个非零的子空间, 其满足对于每个" (&in $f $V)
            ", " (&in (ap $T $f) $V) ". 证明" $V "不是有限维的.")
        (Li "设" $V "是" polyF "的一个有限维子空间. 证明存在整数" (&>= $m $0)
            "使得对于每个" (&in $f $V) "有" (&= (ap $D^m $f) $0) ".")))
   (H3 "第4.3节 Lagrange插值")
   (P "整节我们将默认" $F "是一个固定的域并且" (&cm $t_0 $t_1 $..h $t_n)
      "是" $F "的" (&+ $n $1) "个不同的元素. 令" $V "是" polyF "的子空间, 其由所有次数小于等于"
      $n "的多项式构成 (并包括" $0 "多项式). 令" $L_i "是由"
      (MB (&cm (&= (app $L_i $f) (app $f $t_i)) (&<= $0 $i $n)))
      "定义的从" $V "到" $F "的函数. 根据定理2的i, 每个" $L_i "都是" $V
      "上的线性泛函, 而我们想要证明的事实之一是由" (&cm $L_0 $L_1 $..h $L_n)
      "构成的集合是" V* "的一个基, " V* "即" $V "的对偶空间.")
   (P "当然为了达成这个目的, 实际上只需要说明 (参见第3章的定理15) "
      (setE $L_0 $L_1 $..h $L_n) "是某个" $V "的基" (setE $P_0 $P_1 $..h $P_n)
      "的对偶就足够了. 最多只存在一个这样的基, 而且若存在的话则其由"
      (MB (&= (app $L_j $P_i) (app $P_i $t_j) δij))
      "刻画. 多项式"
      (MB (deriv $P_i
                 (~ (&i* (@- $x $t_0) $..c (@- $x (_ $t (&- $i $1)))
                         (@- $x (_ $t (&+ $i $1))) $..c (@- $x $t_n))
                    (&i* (@- $t_i $t_0) $..c (@- $t_i (_ $t (&- $i $1)))
                         (@- $t_i (_ $t (&+ $i $1))) $..c (@- $t_i $t_n)))
                 (prod (&!= $j $i) $ (pare (~ (&- $x $t_j) (&- $t_i $t_j))))))
      "的次数均为" $n ", 因而属于" $V ". 根据定理2, 它们满足上述刻画.")
   (P "如果" (&= $f (sum $i $ (&i* $c_i $P_i))) ", 那么对于每个" $j "有"
      (MB (&= (app $f $t_j) (sum $i $ (&i* $c_i (app $P_i $t_j))) $c_j) ".")
      "既然" $0 "多项式有着对于每个" (&in $t $F) ", " (&= (app $0 $t) $0)
      "的性质, 于是多项式" (&cm $P_0 $P_1 $..h $P_n) "是线性无关的. 鉴于多项式"
      (&cm $1 $x $..h $x^n) "构成了" $V "的一个基, " $V "的维数是" (@+ $n $1)
      ". 因此, 线性无关集合" (setE $P_0 $P_1 $..h $P_n) "必然也是" $V
      "的一个基, 于是对于每个" (&in $f $V) "有"
      (MB (&= $f (sum (&= $i $0) $n (&i* (app $f $t_i) $P_i))) ".")
      "上述表达式被称为Lagrange插值公式, 置" (&= $f $x^j) "我们得到"
      (MB (&= $x^j (sum (&= $i $0) $n (&i* (^ (@ $t_i) $j) $P_i))) ".")
      "现在根据第2章的定理7, 我们知道矩阵"
      (MB (Mat ($1 $t_0 (_^ $t $0 $2) $..c (_^ $t $0 $n))
               ($1 $t_1 (_^ $t $1 $2) $..c (_^ $t $1 $n))
               ($..v $..v $..v $ $..v)
               ($1 $t_n (_^ $t $n $2) $..c (_^ $t $n $n))))
      "是可逆的. 该矩阵被称为Vandermonde矩阵. 直接证明这样的矩阵是可逆的或许是"
      "一个有趣的练习, 其中" (&cm $t_0 $t_1 $..h $t_n) "是" $F "的" (&+ $n $1)
      "个不同的元素.")
   (P "如果" $f "是域" $F "上任意的多项式, 在我们当下的讨论中, 我们将用" (&~ $f)
      "表示将每个" (&in $t $F) "映射到" (app $f $t) "的从" $F "到" $F
      "的多项式函数. 根据定义 (参见第2章的例子4), 每个多项式函数都以这样的方式"
      "产生. 然而, 对于两个多项式" $f "和" $g ", 即便" (&!= $f $g) ", 也可能出现"
      (&= (&~ $f) (&~ $g)) "的情况. 幸运的是, 我们将看到这种令人不快的情况只会在"
      $F "是有限域的时候发生. 为了精确地刻画多项式与多项式函数之间的关系, 我们需要"
      "定义两个多项式函数的积. 如果" $f "和" $g "是域" $F "上的多项式, " (&~ $f)
      "和" (&~ $g) "的积是从" $F "到" $F "的函数" (&i* (&~ $f) (&~ $g)) ", 由"
      (MB (&cm (&= (app (@i* (&~ $f) (&~ $g)) $t)
                   (&i* (app (&~ $f) $t) (app (&~ $g) $t)))
               (&in $t $F)))
      "给出. 根据定理2的ii, " (&= (app (@i* $f $g) $t) (&i* (app $f $t) (app $g $t)))
      ", 因而对于每个" (&in $t $F) "有"
      (MB (&= (app (&~ (@i* $f $g)) $t) (&i* (app (&~ $f) $t) (app (&~ $g) $t))) ".")
      "于是, " (&= (&i* (&~ $f) (&~ $g)) (&~ (@i* $f $g))) "是一个多项式函数. 此时, "
      "尽管是相当直接的, 我们将验证" $F "上的所有多项式函数构成的向量空间在上述定义的乘法下"
      "构成了一个域" $F "上的含幺元的交换线性代数的事情留给读者完成.")
   ((definition)
    "令" $F "是一个域, " $V:fraktur "和" (&~ $V:fraktur) "是" $F "上的线性代数. 称代数"
    $V:fraktur "和" (&~ $V:fraktur) "是同构的, 如果存在一个从" $V:fraktur "到"
    (&~ $V:fraktur) "的双射满足"
    (Ol #:attr* '((type "a"))
        (Li (&= (&~ (@LC $c $alpha $d $beta)) (LC $c (&~ $alpha) $d (&~ $beta))))
        (Li (&= (&~ (@i* $alpha $beta)) (&i* (&~ $alpha) (&~ $beta)))))
    "对于所有" (&in (&cm $alpha $beta) $V:fraktur) "和所有" (&in (&cm $c $d) $F)
    "成立. 映射" (&\|-> $alpha (&~ $alpha)) "被称为从" $V:fraktur "到"
    (&~ $V:fraktur) "的同构. 因此, 一个从" $V:fraktur "到" (&~ $V:fraktur)
    "的同构是一个&quot;保持&quot;乘积的向量空间的同构.")
   ((example #:n "4")
    "令" $V "是域" $F "上的一个" $n "维向量空间. 根据第3章的定理13及其之后的评注, 每个"
    $V "的有序基" $BBB "都确定了一个从" $V "上的线性算子的代数到域" $F "上的" n*n
    "矩阵的代数的同构" (&\|-> $T (coordm $T)) ". 设" $U "是" $V "上一个固定的线性算子, "
    "并给定多项式 [译注: 这个" $n "和" n*n "里的" $n "是两个毫不相关的数字]"
    (MB (&= $f (sum (&= $i $0) $n (&i* $c_i $x^i))))
    "其中系数" (&in $c_i $F) ", 那么"
    (MB (&= (app $f $U) (sum (&= $i $0) $n (&i* $c_i $U^i))))
    "既然" (&\|-> $T (coordm $T)) "是一个线性映射, 于是"
    (MB (&= (coordm (app $f $U))
            (sum (&= $i $0) $n (&i* $c_i (coordm $U^i)))) ".")
    "现在我们还知道"
    (MB (preserve coordm $T_1 &i* $T_2))
    "对于所有" (&in (&cm $T_1 $T_2) (&L $V $V)) "成立, 于是"
    (MB (&cm (&= (coordm $U^i) (^ (@ (coordm $U)) $i)) (&<= $2 $i $n)) ".")
    "这个关系对于" (&= $i (&cm $0 $1)) "也是成立的, 因而我们得到结果"
    (MB (&= (coordm (app $f $U)) (app $f (coordm $U))) ".")
    "用自然语言说, 如果" $U "是" $V "上的一个线性算子, 那么一个多项式应用于"
    $U "的结果的矩阵, 和该多项式应用于" $U "的矩阵的结果是相等的.")
   ((theorem #:n "3")
    "如果" $F "是一个无限域, 那么映射" (&\|-> $f (&~ $f)) "是从域" $F
    "上的多项式代数到域" $F "上的多项式函数代数的同构.")
   ((proof)
    "根据定义, 这个映射是一个满射. 如果" (&in (&cm $f $g) polyF)
    ", 对于所有的标量" $c "和" $d "显然有"
    (MB (&= (&~ (@LC $c $f $d $g)) (LC $c (&~ $f) $d (&~ $g))) ".")
    "之前我们已经说明了" (&= (&~ (@i* $f $g)) (&i* (&~ $f) (&~ $g)))
    ", 所以我们需要做的仅仅是证明该映射是一个单射. 根据线性性质, 实际上证明"
    (&= (&~ $f) $0) "能够推出" (&= $f $0) "就足够了. 设" $f "是一个次数小于等于"
    $n "的多项式 [译注: 实际上还包括零多项式] 并且满足" (&= (&~ $f) $0) ". 令"
    (&cm $t_0 $t_1 $..h $t_n) "是" $F "中" (&+ $n $1) "个不同的元素. 既然" (&= (&~ $f) $0)
    ", 那么对于" (&= $i (&cm $0 $1 $..h $n)) "有" (&= (app $f $t_i) $0)
    ", 根据Lagrange插值公式就立即得到" (&= $f $0) ".")
   (P "根据下一节的结果, 我们将得到该定理的一个完全不同的证明.")
   ((exercise #:n "1")
    "使用Lagrange插值公式找出这样一个实系数的多项式" $f ", 其次数小于等于" $3 ", 并且满足"
    (&cm (&= (app $f $-1) $-6) (&= (app $f $0) $2) (&= (app $f $1) $-2) (&= (app $f $2) $6)) ".")
   ((exercise #:n "2")
    "令" (&cm $alpha $beta $gamma $delta) "是实数. 我们问何时能够找到一个域" $RR "上的次数不高于"
    $2 "的多项式" $f "满足"
    (&cm (&= (app $f $-1) $alpha) (&= (app $f $1) $beta)
         (&= (app $f $3) $gamma) (&= (app $f $0) $delta))
    ". 证明当且仅当"
    (MB (&= (: (&i* $3 $alpha) $+ (&i* $6 $beta) $- $gamma $- (&i* $8 $delta)) $0))
    "的时候这是可能的.")
   ((exercise #:n "3")
    "令" $F "是实数域,"
    (MB (&cm (&= $A (Mat ($2 $0 $0 $0) ($0 $2 $0 $0) ($0 $0 $3 $0) ($0 $0 $0 $1)))
             (&= $p (&i* (@- $x $2) (@- $x $3) (@- $x $1)))) ".")
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (app $p $A) $0) ".")
        (Li "令" (&cm $P_1 $P_2 $P_3) "是对于" (&cm (&= $t_1 $2) (&= $t_2 $3) (&= $t_3 $1))
            "的Lagrange多项式, 计算" (&cm (&= $E_i (app $P_i $A)) (&= $i (&cm $1 $2 $3))) ".")
        (Li "证明" (&= (&+ $E_1 $E_2 $E_3) $I) "; 如果" (&!= $i $j) ", " (&= (&i* $E_i $E_j) $0)
            "; " (&= (_^ $E $i $2) $E_i) ".")
        (Li "证明" (&= $A (&+ (&i* $2 $E_1) (&i* $3 $E_2) $E_3)) ".")))
   ((exercise #:n "4")
    "令" (&= $p (&i* (@- $x $2) (@- $x $3) (@- $x $1))) ", 令" $T "是" $RR^4 "上任意的满足"
    (&= (app $p $T) $0) "的线性算子. 令" (&cm $P_1 $P_2 $P_3) "是练习3的Lagrange多项式. 令"
    (&cm (&= $E_i (app $P_i $T)) (&= $i (&cm $1 $2 $3))) ". 证明" (&= (&+ $E_1 $E_2 $E_3) $I)
    "; 如果" (&!= $i $j) ", " (&= (&i* $E_i $E_j) $0) "; " (&= (_^ $E $i $2) $E_i) "; "
    (&= $T (&+ (&i* $2 $E_1) (&i* $3 $E_2) $E_3)) ".")
   ((exercise #:n "5")
    "令" $n "是一个正整数, " $F "是一个域. 设" $A "是域" $F "上的一个" n*n "矩阵, " $P
    "是域" $F "上一个可逆的" n*n "矩阵. 如果" $f "是域" $F "上任意的多项式, 证明"
    (MB (&= (app $f (sim $A)) (sim (app $f $A))) "."))
   ((exercise #:n "6")
    "令" $F "是一个域. 我们已经考虑了由&quot;在" $t "处求值&quot;得到的"
    polyF "上的相当特殊的线性泛函:"
    (MB (&= (app $L $f) (app $f $t)) ".")
    "这样的线性泛函不仅是线性的, 还具有" (preserve* $L $f $g) "的性质. 证明如果" $L
    "是" polyF "上的线性泛函, 并且满足"
    (MB (preserve* $L $f $g))
    "对于所有的域" $F "上的多项式" $f "和" $g "成立, 那么要么" (&= $L $0) ", 要么存在"
    (&in $t $F) "使得对于每个多项式" $f "有" (&= (app $L $f) (app $f $t)) ".")
   (H3 "第4.4节 多项式理想")
   (P "本节我们关心主要依赖于域上的多项式代数的乘性结构的结果.")
   ((lemma)
    "设" $f "和" $d "是域" $F "上的非零多项式并且满足" (&<= (&deg $d) (&deg $f))
    ", 那么存在" (&in $g polyF) "使得"
    (MB (&= (&- $f (&i* $d $g)) $0)
        "或者" (&< (&deg (@- $f (&i* $d $g))) (&deg $f)) "."))
   ((proof)
    "设"
    (MB (&cm (&= $f (&+ (&i* $a_m $x^m)
                        (sum (&= $i $0) (&- $m $1) (&i* $a_i $x^i))))
             (&!= $a_m $0)))
    "以及"
    (MB (&cm (&= $d (&+ (&i* $b_n $x^n)
                        (sum (&= $i $0) (&- $n $1) (&i* $b_i $x^i))))
             (&!= $b_n $0)) ",")
    "那么" (&>= $m $n) ", 并且"
    (let ((expr (&- $f (&i* (pare (~ $a_m $b_n)) (^ $x (&- $m $n)) $d))))
      (MB (&= expr $0) "或者" (&< (&deg (brac expr)) (&deg $f)) "."))
    "因此, 我们可以取"
    (&= $g (&i* (pare (~ #:attr* '((displaystyle "true")) $a_m $b_n))
                (^ $x (&- $m $n)))) ".")
   (P "使用该引理我们可以表明众所周知的实或复系数多项式的&quot;长除&quot;"
      "过程在任意的域上都是可能的.")
   ((theorem #:n "4")
    "如果" $f "和" $d "是域" $F "上的多项式并且" (&!= $d $0) ", 那么存在"
    (&in (&cm $q $r) polyF) "满足"
    (Ol #:attr* '((type "i"))
        (Li (&= $f (&+ (&i* $d $q) $r)) ";")
        (Li "要么" (&= $r $0) "要么" (&< (&deg $r) (&deg $d)) "."))
    "满足i和ii的多项式" $q "和" $r "是唯一的.")
   ((proof)
    "如果" $f "是" $0 "或者" (&< (&deg $f) (&deg $d)) ", 那么取"
    (&= $q $0) "和" (&= $r $f) "即可. 在" (&!= $f $0) "并且"
    (&>= (&deg $f) (&deg $d)) "的情况下, 上述引理告诉我们存在多项式" $g
    "使得" (&= (&- $f (&i* $d $g)) $0) "或者"
    (&< (&deg (@- $f (&i* $d $g))) (&deg $f)) ". 如果"
    (&!= (&- $f (&i* $d $g)) $0) "并且"
    (&>= (&deg (@- $f (&i* $d $g))) (&deg $d)) ", 那么我们可以选择一个多项式"
    $h "使得" (&= (&- (@- $f (&i* $d $g)) (&i* $d $h)) $0) "或者"
    (MB (&< (&deg (bra0 (&- $f (&i* $d (@+ $g $h)))))
            (&deg (@- $f (&i* $d $g)))) ".")
    "若有必要则继续施行这个过程, 最终我们可以得到多项式" $q "和" $r "满足"
    (&= $r $0) "或者" (&< (&deg $r) (&deg $d)) ", 并且"
    (&= $f (&+ (&i* $d $q) $r)) ". 现在设我们也有"
    (&= $f (&+ (&i* $d $q_1) $r_1)) ", 其中" (&= $r_1 $0) "或者"
    (&< (&deg $r_1) (&deg $d)) ", 那么"
    (&= (&+ (&i* $d $q) $r) (&+ (&i* $d $q_1) $r_1)) ", 于是"
    (&= (&i* $d (@- $q $q_1)) (&- $r_1 $r)) ". 如果"
    (&!= (&- $q $q_1) $0) ", 那么" (&!= (&i* $d (@- $q $q_1)) $0) ", 并有"
    (MB (&= (&+ (&deg $d) (&deg (@- $q $q_1)))
            (&deg (@- $r_1 $r))) ".")
    "但是鉴于" (&- $r_1 $r) "的次数是小于" $d "的次数的, 这是不可能的. 因而"
    (&= (&- $q $q_1) $0) ", 随之亦有" (&= (&- $r_1 $r) $0) ".")
   ((definition)
    "令" $d "是域" $F "上的一个非零多项式. 如果" (&in $f polyF) ", 之前的定理告诉我们至多存在一个多项式"
    (&in $q polyF) "满足" (&= $f (&i* $d $q)) ". 如果这样的" $q "存在, 那么我们称" $d
    "整除" $f ", 或者" $f "被" $d "整除, 或者" $f "是" $d "的倍数, 并称" $q "是" $f "和" $d
    "的商. 我们也记" (&= $q (&/ $f $d)) ".")
   ((corollary #:n "1")
    "令" $f "是域" $F "上的一个多项式, 令" $c "是" $F "的一个元素, 那么" $f
    "被" (&- $x $c) "整除当且仅当" (&= (app $f $c) $0) ".")
   ((proof)
    "根据定理, " (&= $f (&+ (&i* (@- $x $c) $q) $r)) ", 其中" $r "是一个标量多项式. 又根据定理2,"
    (MB (&= (app $f $c) (&+ (&i* $0 (app $q $c)) (app $r $c)) (app $r $c)) ".")
    "于是, " (&= $r $0) "当且仅当" (&= (app $f $c) $0) ".")
   ((definition)
    "令" $F "是一个域, " (&in $c $F) "被称为是多项式" (&in $f polyF) "的根或者零点, 如果"
    (&= (app $f $c) $0) ".")
   ((corollary #:n "2")
    "域" $F "上的" $n "次多项式在" $F "中至多只有" $n "个根.")
   ((proof)
    "这个结果对于" $0 "次和" $1 "次多项式而言显然是真的. 我们假设其对于" (&- $n $1)
    "次的多项式而言是真的. 如果" $a "是" $n "次多项式" $f "的一个根, 那么"
    (&= $f (&i* (@- $x $a) $q)) ", 其中" $q "的次数是" (&- $n $1) ". 既然"
    (&= (app $f $b) $0) "当且仅当" (&= $a $b) "或者" (&= (app $q $b) $0)
    ", 根据归纳假设我们可以得到" $f "至多只有" $n "个根.")
   (P "读者应该观察到定理3的证明的主要步骤可由该推论立即得到. "
      "[译注: 原本的证明用的是Lagrange插值.]")
   (P "多项式的形式导数在讨论多重根的时候是很有用的. 多项式"
      (MB (&= $f (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
      "的导数是多项式"
      (MB (&= $f^ (&+ $c_1 (&i* $2 $c_2 $x) $..c (&i* $n $c_n (^ $x (&- $n $1))))) ".")
      "我们也使用记号" (&= (ap $D $f) $f^) ". [译注: 实际上, 形式导数由"
      (&= (_^ $f $n $prime) (&i* (@+ $n $1) (_ $f (&+ $n $1)))) "刻画.] "
      "微分是线性的, 也就是说, " $D "是" polyF "上的一个线性算子. 我们也有高阶形式导数"
      (&= (&Prime $f) (ap $D^2 $f)) ", " (&= (^ $f (@ $3)) (ap $D^3 $f)) ", 等等.")
   ((theorem #:n "5. Taylor公式")
    "令" $F "是一个特征为零的域, " $c "是" $F "的一个元素, " $n "是一个正整数. 如果"
    $f "是域" $F "上一个满足" (&<= (&deg $f) $n) "的多项式, 那么"
    (MB (&= $f (sum (&= $k $0) $n
                    (&i* (app (~ (@ap $D^k $f) (&fact $k)) $c)
                         (^ (@- $x $c) $k)))) "."))
   ((proof)
    "Taylor公式是二项式定理和算子" (&cm $D $D^2 $..h $D^n)
    "的线性性质的推论. 二项式定理很容易通过归纳证明, 并断言"
    (MB (&= (^ (@+ $a $b) $m)
            (sum (&= $k $0) $m
                 (&i* (comb $m $k) (^ $a (&- $m $k)) $b^k))))
    "其中"
    (MB (&= (comb $m $k)
            (~ (&fact $m) (&i* (&fact $k) (&fact (@- $m $k))))
            (~ (&i* $m (@- $m $1) $..c (@ $m $- $k $+ $1))
               (&d* $1 $2 $..c $k))))
    "是我们熟悉的二项式系数, 其给出了从" $m "个物品中一次取" $k "个的组合数. 根据二项式定理,"
    (MB (deriv $x^m
               (^ (bra0 (&+ $c (@- $x $c))) $m)
               (sum (&= $k $0) $m
                    (&i* (comb $m $k)
                         (^ $c (&- $m $k))
                         (^ (@- $x $c) $k)))
               (&+ $c^m (&i* $m (^ $c (&- $m $1)) (@- $x $c)) $..c (^ (@- $x $c) $m))))
    "而这就是在" (&= $f $x^m) "的情形下Taylor公式的陈述. 如果"
    (MB (&= $f (sum (&= $m $0) $n (&i* $a_m $x^m))))
    "那么"
    (MB (&= (app (@ap $D^k $f) $c)
            (sum (&= $m $0) $n
                 (&i* $a_m (app (@ap $D^k $x^m) $c)))))
    "因此"
    (MB (deriv (sum (&= $k $0) $n
                    (&i* (~ (app (@ap $D^k $f) $c) (&fact $k))
                         (^ (@- $x $c) $k)))
               (sum (&= $k $0) $n
                    (sum (&= $m $0) $n
                         (&i* $a_m (app (~ (@ap $D^k $x^m) (&fact $k)) $c)
                              (^ (@- $x $c) $k))))
               (sum (&= $m $0) $n
                    (&i* $a_m
                         (@sum (&= $k $0) $n
                               (&i* (app (~ (@ap $D^k $x^m) (&fact $k)) $c)
                                    (^ (@- $x $c) $k)))))
               (sum (&= $m $0) $n (&i* $a_m $x^m))
               $f)))
   (P "读者应该注意到, 因为多项式" (&cm $1 (@- $x $c) $..h (^ (@- $x $c) $n))
      "是线性无关的 (参见4.2节的练习7), 所以Taylor公式为" $f "写成多项式"
      (&cm (^ (@- $x $c) $k) (&<= $0 $k $n)) "唯一的线性组合提供了方法.")
   (P "尽管我们不会给出任何细节, 但是在这个点上或许值得提及Taylor公式的正当解释使得其"
      "也适用于非零特征域上的多项式. 如果域" $F "的特征不为零, 那么在" $F "中我们可以有"
      (&= (&fact $k) $0) ", 那么这就使得" (app (@ap $D^k $f) $c) "除以" (&fact $k)
      "毫无意义. 然而, 我们也可以赋予" (app (@ap $D^k $f) $c) "除以" (&fact $k)
      "一种意义, 因为" (ap $D^k $f) "的每个系数都是" $F "的一个元素乘上某个可以被"
      (&fact $k) "整除的整数. [译注: 不过, 在这种观点下, " (ap $D^k $f)
      "就是相当不同的对象了, 因为你不能仅从这个多项式对象本身还原出那些整数来, 还要考虑"
      (ap $D^k $f) "的内涵.] 如果这些话使你感到困惑, 那么我们建议读者把自己的注意力"
      "限制于特征为零的域, 或者复数域的子域.")
   (P "如果" $c "是非零多项式" $f "的一个根, 那么" $c "作为" $f "的根的重数是满足"
      (^ (@- $x $c) $r) "整除" $f "的最大正整数" $r ".")
   (P "一个根的重数显然小于等于" $f "的次数. 对于特征为零的域上的多项式而言, " $c
      "作为" $f "的根的重数与" $f "的高阶导数有关.")
   ((theorem #:n "6")
    "令" $F "是一个特征为零的域, 令" $f "是域" $F "上的一个多项式并且满足"
    (&<= (&deg $f) $n) ", 那么标量" $c "是" $f "的一个" $r "重根当且仅当"
    (MB (&cm (&= (app (@ap $D^k $f) $c) $0) (&<= $0 $k (&- $r $1)))
        "并且" (&!= (app (@ap $D^r $f) $c) $0) "."))
   ((proof)
    "设" $r "是" $c "作为" $f "的根的重数, 那么存在多项式" $g "满足"
    (&= $f (&i* (^ (@- $x $c) $r) $g)) "且" (&!= (app $g $c) $0) ". 如果"
    (&= (app $g $c) $0) ", 那么根据定理4的推论1, " $f "就会被"
    (^ (@- $x $c) (&+ $r $1)) "整除. 将Taylor公式应用于" $g ", 我们得到"
    (MB (deriv $f
               (&i* (^ (@- $x $c) $r)
                    (brac (sum (&= $m $0) (&- $n $r)
                               (&i* (app (~ (@ap $D^m $g) (&fact $m)) $c)
                                    (^ (@- $x $c) $m)))))
               (sum (&= $m $0) (&- $n $r)
                    (&i* (app (~ (@ap $D^m $g) (&fact $m)) $c)
                         (^ (@- $x $c) (&+ $r $m))))))
    "既然" $f "写成幂" (&cm (^ (@- $x $c) $k) (&<= $0 $k $n))
    "的线性组合的方式是唯一的, 于是"
    (MB (&= (~ (app (@ap $D^k $f) $c) (&fact $k))
            (Choice0
             ($0 ", 如果" (&<= $0 $k (&- $r $1)))
             ((~ (app (@ap (^ $D (&- $k $r)) $g) $c)
                 (&fact (@- $k $r)))
              ", 如果" (&<= $r $k $n)))))
    "因此, " (&cm (&= (app (@ap $D^k $f) $c) $0) (&<= $0 $k (&- $r $1))) "并且"
    (&!= (&= (app (@ap $D^r $f) $c) (&d* (&fact $r) (app $g $c))) $0)
    ". 反过来说, 如果这些条件被满足了, 那么根据Taylor公式就能立即得出存在多项式"
    $g "满足" (&= $f (&i* (^ (@- $x $c) $r) $g)) "并且" (&!= (app $g $c) $0)
    ". 现在设" $r "不是满足" (^ (@- $x $c) $r) "整除" $f "的最大正整数, 那么存在多项式"
    $h "满足" (&= $f (&i* (^ (@- $x $c) (&+ $r $1)) $h)) ". 然而, 根据定理1的推论2, 这将推出"
    (&= $g (&i* (@- $x $c) $h)) ", 于是" (&= (app $g $c) $0) ", 一个矛盾.")
   ((definition)
    "令" $F "是一个域. " polyF "中的一个理想是" polyF "的一个子空间" $M "满足对于每个"
    (&in $f polyF) "和" (&in $g $M) "有" (&in (&i* $f $g) $M) ".")
   ((example #:n "5")
    "如果" $F "是一个域, 并且" $d "是" $F "上的一个多项式, 那么集合" (&= $M (&i* $d polyF))
    "是一个理想, 其由所有" $d "乘上" polyF "中任意的" $f "得到的倍数" (&i* $d $f)
    "构成. 鉴于" $M "事实上包含" $d ", " $M "是非空的. 如果" (&in (&cm $f $g) polyF)
    "而" $c "是一个标量, 那么"
    (MB (&= (&- (&i* $c (@i* $d $f)) (&i* $d $g))
            (&i* $d (@- (&i* $c $f) $g))))
    "属于" $M ", 于是" $M "是一个子空间. 最后, " $M "也包含"
    (&= (&i* (@i* $d $f) $g) (&i* $d (@i* $f $g))) ". 理想" $M
    "被称为由" $d "生成的主理想.")
   ((example #:n "6")
    "令" (&cm $d_1 $..h $d_n) "是" $F "上有限多个多项式, 那么子空间" (&i* $d_i polyF)
    "之和" $M "也是一个理想. 这是因为若设" (&in $p $M) ", 那么存在" polyF "中的多项式"
    (&cm $f_1 $..h $f_n) "满足" (&= $p (LC0 $d_1 $f_1 $d_n $f_n))
    ". 如果" $g "是域" $F "上任意的多项式, 那么"
    (MB (&= (&i* $p $g) (LC0 $d_1 (@i* $f_1 $g) $d_n (@i* $f_n $g))))
    "于是" (&i* $p $g) "也属于" $M ", 因此" $M "是一个理想. 我们称" $M "为由多项式"
    (&cm $d_1 $..h $d_n) "生成的理想.")
   ((example #:n "7")
    "令" $F "是复数域的一个子域, 考虑理想"
    (MB (&= $M (LC (@+ $x $2) polyF (@+ $x^2 (&i* $8 $x) 16) polyF)) ".")
    "我们断言" (&= $M polyF) ". 这是因为" $M "包含"
    (MB (&= (&- (@+ $x^2 (&i* $8 $x) 16) (&i* $x (@+ $x $2))) (LC $6 $x 16)))
    "因而" $M "也包含" (&= (&- (@LC $6 $x 16) (&i* $6 (@+ $x $2))) $4)
    ", 于是标量多项式" (&in $1 $M) ", 那么其倍数自然是整个" polyF ".")
   ((theorem #:n "7")
    "如果" $F "是一个域, 并且" $M "是" polyF "任意的非零理想, 那么存在唯一的首项系数为一的多项式"
    (&in $d polyF) "使得" $M "是由" $d "生成的主理想.")
   ((proof)
    "根据假设, " $M "包含一个非零的多项式. " $M "所有的非零多项式中, 存在多项式" $d
    "具有最低的次数. [译注: 这依赖于自然数集的良序原理.] 我们不妨假设"
    $d "的首项系数为一, 因为不然的话我们可以给" $d
    "乘上一个标量使其变成首项系数为一的. 现在如果" (&in $f $M) ", 定理4表明"
    (&= $f (&+ (&i* $d $q) $r)) ", 其中" (&= $r $0) "或者" (&< (&deg $r) (&deg $d))
    ". 既然" (&in $d $M) ", 也有" (&in (&= (&- $f (&i* $d $q)) $r) $M) ". 因为"
    $d "是" $M "中具有最低次数的元素, 所以我们不可能有" (&< (&deg $r) (&deg $d))
    ", 于是" (&= $r $0) ", 因此" (&= $M (&i* $d polyF)) ". 如果" $g "是另一个满足"
    (&= $M (&i* $g polyF)) "的首项系数为一的多项式, 那么存在非零的多项式" $p
    "和" $q "满足" (&= $d (&i* $g $p)) "和" (&= $g (&i* $d $q)) ", 因而"
    (&= $d (&i* $d $p $q)) ", 然后"
    (MB (&= (&deg $d) (&+ (&deg $d) (&deg $p) (&deg $q))) ".")
    "于是, " (&= (&deg $p) (&deg $q) $0) ". 鉴于" $d "和" $g "的首项系数为一, "
    (&= $p $q $1) ", 即" (&= $d $g)
    ". [译注: 这段证明也表明多项式" $g "是某个非零理想的生成元当且仅当其为"
    "唯一的首项系数为一的生成元" $d "的非零标量倍数.]")
   (P "值得注意的是, 在刚才的证明中我们运用了一个更加一般且相当有用的事实的一种特殊情形, "
      "这个事实即如果" $p "是某个理想" $M "中的非零多项式而" (&in $f $M) "不被" $p
      "整除, 那么" (&= $f (&+ (&i* $p $q) $r)) ", 其中&quot;余项 (remainder)&quot;"
      (&in $r $M) ", 它异于" $0 ", 且次数比" $p "小. 我们已经在例子7中利用了这个"
      "事实来表明标量多项式" $1 "是那里考虑的理想的首项系数为一的生成元. 从原则上说, "
      "找出生成给定的非零理想的首项系数为一的多项式总是可能的. 这是因为人们通过有限步骤内的"
      "辗转相除最终可以得到理想中具有最低次数的多项式.")
   ((corollary)
    "如果" (&cm $p_1 $..h $p_n) "是域" $F "上的不全为零的多项式, 那么" polyF
    "中存在唯一的首项系数为一的多项式" $d "满足"
    (Ol #:attr* '((type "a"))
        (Li $d "在由" (&cm $p_1 $..h $p_n) "生成的理想之中;")
        (Li $d "整除每个多项式" $p_i ";"))
    "任何满足a和b的多项式也必然满足"
    (Ol #:attr* '((type "a") (start "3"))
        (Li "每个整除多项式" (&cm $p_1 $..h $p_n) "的多项式也整除" $d ".")))
   ((proof)
    "令" $d "是理想"
    (MB (LC0 $p_1 polyF $p_n polyF))
    "的首项系数为一的生成元. 每个该理想的成员都被" $d "整除, 因此每个多项式"
    $p_i "也被" $d "整除. 现在设" $f "是整除多项式" (&cm $p_1 $..h $p_n)
    "的多项式, 那么存在多项式" (&cm $g_1 $..h $g_n) "满足"
    (&cm (&= $p_i (&i* $f $g_i)) (&<= $1 $i $n)) ". 并且, 既然" $d "在理想"
    (MB (LC0 $p_1 polyF $p_n polyF))
    "之中, 那么存在多项式" (&in (&cm $q_1 $..h $q_n) polyF) "使得"
    (MB (&= $d (LC0 $p_1 $q_1 $p_n $q_n)))
    "于是"
    (MB (&= $d (&i* $f (@LC0 $g_1 $q_1 $g_n $q_n))) ".")
    "我们已经表明了" $d "是满足a, b, c的首项系数为一的多项式. 如果" $d^
    "是满足a和b的多项式, 根据a和" $d "的定义, 我们知道" $d^ "是" $d "的标量倍数, "
    "于是也满足c. [译注: 不太能理解这句话的推理过程和想法, 可能存在笔误.] "
    "最终, 当" $d^ "是首项系数为一的多项式时, 我们有" (&= $d^ $d) "." (Br)
    "[译注: 以上的证明似乎有些混乱. 实际上, 如果" $d "是满足a和b的多项式, "
    "那么它就是理想" (LC0 $p_1 polyF $p_n polyF) "的生成元. 在首项系数为一的"
    "情况下, 这个多项式至多只有一个. 很容易验证首项系数为一的生成元的确满足"
    "a和b. 另外, 条件a即可推出条件c, 不论首项系数是否为一.]")
   ((definition)
    "如果" (&cm $p_1 $..h $p_n) "是域" $F "上的不全为零的多项式, 那么理想"
    (MB (LC0 $p_1 polyF $p_n polyF))
    "唯一的首项系数为一的生成元被称为" (&cm $p_1 $..h $p_n) "的最大公因子 "
    "(greatest common divisor, g.c.d.). 这个术语可由之前的推论澄清. "
    "[译注: 实际上, 更像是由条件b和c澄清, 但是条件c和条件a是等价的. "
    "另外, 它也澄清了辗转相除法求最大公因子的原理.] "
    "我们称多项式" (&cm $p_1 $..h $p_n) "互素, 如果其最大公因子为"
    $1 ", 或者等价地, 它们生成的理想是整个" polyF ".")
   ((example #:n "8")
    "令" $F "是复数域" $CC ", 那么 [译注: 本书对于最大公因子所用的记号是" 'g.c.d.
    ", 但是我们将其改成现在更加通行的" $gcd ".]"
    (Ol #:attr* '((type "a"))
        (Li (&= (&gcd (&+ $x $2) (&+ $x^2 (&i* $8 $x) 16)) $1)
            " (见例子7);")
        (Li (&= (&gcd (&i* (^ (@- $x $2) $2) (@+ $x $i))
                      (&i* (@- $x $2) (@+ $x^2 $1)))
                (&i* (@- $x $2) (@+ $x $i)))
            ". 这是因为, 理想"
            (MB (LC (&i* (^ (@- $x $2) $2) (@+ $x $i)) polyF
                    (&i* (@- $x $2) (@+ $x^2 $1)) polyF))
            "包含"
            (MB (&= (&- (&i* (^ (@- $x $2) $2) (@+ $x $i))
                        (&i* (@- $x $2) (@+ $x^2 $1)))
                    (&i* (@- $x $2) (@+ $x $i) (@- $i $2))))
            "因而也包含" (&i* (@- $x $2) (@+ $x $i))
            ", 其首项系数为一, 且整除"
            (MB (&i* (^ (@- $x $2) $2) (@+ $x $i))
                "和" (&i* (@- $x $2) (@+ $x^2 $1)) "."))))
   ((example #:n "9")
    "令" $F "是有理数域, 并且在" polyF "中令" $M "是由"
    (MB (&cm (&i* (@- $x $1) (^ (@+ $x $2) $2))
             (&i* (^ (@+ $x $2) $2) (@- $x $3))
             (@- $x $3)))
    "生成的理想, 那么" $M "包含"
    (MB (&= (&i* 1/2 (^ (@+ $x $2) $2) (bra0 (&- (@- $x $1) (@- $x $3))))
            (^ (@+ $x $2) $2)))
    "并且既然"
    (MB (&= (^ (@+ $x $2) $2)
            (&+ (&i* (@- $x $3) (@+ $x $7)) 25)))
    "[译注: 原文是" (&- 17) "而不是" (&+ 25) ", 应该是笔误.] 那么" $M
    "包含标量多项式" $1 ", 于是" (&= $M polyF) "而多项式"
    (MB (&cm (&i* (@- $x $1) (^ (@+ $x $2) $2))
             (&i* (^ (@+ $x $2) $2) (@- $x $3))
             (@- $x $3)))
    "是互素的.")
   ((exercise #:n "1")
    "令" $QQ "是有理数域, 判断以下" (&poly $QQ)
    "的子集是否是理想. 若是理想, 则找出其首项系数为一的生成元."
    (Ol #:attr* '((type "a"))
        (Li "所有偶数次的" $f ";")
        (Li "所有次数大于等于" $5 "的" $f ";")
        (Li "所有满足" (&= (app $f $0) $0) "的" $f ";")
        (Li "所有满足" (&= (app $f $2) (app $f $4) $0)
            "的" $f ";")
        (Li "所有线性算子" $T "的像中的" $f ", 其中" $T "由"
            (MB (&= (ap $T (@sum (&= $i $0) $n (&i* $c_i $x^i)))
                    (sum (&= $i $0) $n
                         (&i* (~ $c_i (&+ $i $1))
                              (^ $x (&+ $i $1))))))
            "定义.")))
   ((exercise #:n "2")
    "找出以下每对多项式的最大公因子"
    (Ol #:attr* '((type "a"))
        (Li (&cm (&+ (&- (&i* $2 $x^5) $x^3 (&i* $3 $x^2) (&i* $6 $x)) $4)
                 (&+ $x^4 (&- $x^3 $x^2 (&i* $2 $x) $2))) ";")
        (Li (&cm (&- (LC 3 $x^4 8 $x^2) 3)
                 (&+ $x^3 (LC 2 $x^2 3 $x 6))) ";")
        (Li (&cm (&- $x^4 (&i* $2 $x^3) (&i* $2 $x^2) (&i* $2 $x) $3)
                 (&+ $x^3 (&i* $6 $x^2) (&i* $7 $x) $1)) ".")))
   ((exercise #:n "3")
    "令" $A "是域" $F "上的一个" n*n "矩阵. 证明所有满足" (&= (app $f $A) $0)
    "的多项式" (&in $f polyF) "构成了一个理想.")
   ((exercise #:n "4")
    "令" $F "是复数域的一个子域, 令"
    (MB (&= $A (Mat (1 -2) (0 3))) ".")
    "找出使得" (&= (app $f $A) $0) "的所有多项式" (&in $f polyF)
    "构成的理想的首项系数为一的生成元.")
   ((exercise #:n "5")
    "令" $F "是一个域, 证明" polyF "中任意数目的理想之交仍然是一个理想.")
   ((exercise #:n "6")
    "令" $F "是一个域, 证明由" (&in (&cm $f_1 $..h $f_n) polyF)
    "生成的理想是所有包含" (&cm $f_1 $..h $f_n) "的理想之交.")
   ((exercise #:n "7")
    "令" $K "是域" $F "的一个子域, 设多项式" (&in (&cm $f $g) (&poly $K))
    ". 令" $M_K "是" (&poly $K) "中由" $f "和" $g "生成的理想, " $M_F
    "是" polyF "中由" $f "和" $g "生成的理想. 证明" $M_K "和" $M_F
    "有着相同的首项系数为一的生成元.")
   (H3 "第4.5节 多项式的素因子分解")
   (P "本节我们将要证明每个域" $F "上的多项式都可以写成&quot;素&quot;"
      "多项式之积. 这种分解为我们提供了寻找有限多个多项式的最大公因子"
      "的有效工具, 并且特别地, 提供了判断多项式是否互素的有效手段.")
   ((definition)
    "令" $F "是一个域. 一个多项式" (&in $f polyF) "被称为在" $F
    "上可约, 如果存在多项式" (&in (&cm $g $h) polyF) ", 它们的次数大于等于"
    $1 ", 并且满足" (&= $f (&i* $g $h)) ". 在不存在的情况下, 我们称" $f
    "在" $F "上不可约. 域" $F "上不可约的非标量多项式被称为域" $F
    "上的素多项式 (prime polynomial over " $F "), 或者有时称其是"
    polyF "中的一个prime.")
   ((example #:n "10")
    "多项式" (&+ $x^2 $1) "在域" $CC "上是可约的, 因为"
    (MB (&= (&+ $x^2 $1) (&i* (@+ $x $i) (@- $x $i))))
    "而多项式" (&+ $x $i) "和" (&- $x $i) "属于" (&poly $CC) ". 另一方面, "
    (&+ $x^2 $1) "在域" $RR "上是不可约的, 因为如果"
    (MB (&= (&+ $x^2 $1) (&i* (@LC $a $x $b) (@LC $a^ $x $b^))))
    "其中" (&in (&cm $a $a^ $b $b^) $RR) ", 那么"
    (MB (&cm (&= (&i* $a $a^) $1)
             (&= (&+ (&i* $a $b^) (&i* $b $a^)) $0)
             (&= (&i* $b $b^) $1)) ".")
    "这些关系可以推出" (&= (&+ $a^2 $b^2) $0) ", 这对于实数是不可能的, 除非"
    (&= $a $b $0) ". [译注: 但是我们需要" (&!= $a $0) ".]")
   ((theorem #:n "8")
    "令" (&cm $p $f $g) "是域" $F "上的多项式, 设" $p "是素多项式, 并且" $p
    "整除" (&i* $f $g) ", 那么要么" $p "整除" $f ", 要么" $p "整除" $g ".")
   ((proof)
    "不失一般性, 假定" $p "是首项系数为一的素多项式. 那么, " $p "是素的就是在说"
    $p "仅有的首项系数为一的因子是" $1 "和" $p ". 令" $d "是" $f "和" $p
    "的最大公因子, 那么要么" (&= $d $1) ", 要么" (&= $d $p) ", 既然" $d
    "是整除" $p "的首项系数为一的多项式. 如果" (&= $d $p) ", 那么" $p "整除" $f
    ", 工作就结束了. 于是, 设" (&= $d $1) ", 即" $f "和" $p "是互素的. 我们将证明"
    $p "整除" $g ". 既然" (&= (&gcd $f $p) $1) ", 存在多项式" $f_0 "和" $p_0 "满足"
    (&= $1 (&+ (&i* $f_0 $f) (&i* $p_0 $p))) ". 两边乘上" $g ", 我们得到"
    (MB (deriv $g
               (&+ (&i* $f_0 $f $g) (&i* $p_0 $p $g))
               (&+ (&i* (@i* $f $g) $f_0) (&i* $p (@i* $p_0 $g)))))
    "既然" $p "整除" (&i* $f $g) ", 它也整除" (&i* (@i* $f $g) $f_0) ", 并且" $p
    "当然整除" (&i* $p (@i* $p_0 $g)) ", 因此" $p "整除" $g ".")
   ((corollary)
    "如果" $p "是素多项式并且整除" (&i* $f_1 $..c $f_n) ", 那么" $p
    "至少整除多项式" (&cm $f_1 $..h $f_n) "其中一个.")
   ((proof)
    "通过归纳进行证明. 当" (&= $n $2) "时, 该结果就是定理8. 设我们对于推论已经证明了"
    (&= $n $k) "的情形, 并设" $p "整除" (@+ $k $1) "个多项式之积" (&i* $f_1 $..c (_ $f (&+ $k $1)))
    ". 既然" $p "整除" (&i* (@i* $f_1 $..c $f_k) (_ $f (&+ $k $1))) ", 要么" $p "整除"
    (_ $f (&+ $k $1)) ", 要么" $p "整除" (&i* $f_1 $..c $f_k) ". 根据归纳假设, 如果"
    $p "整除" (&i* $f_1 $..c $f_k) ", 那么对于某个" (&cm $j (&<= $1 $j $k)) "有" $p
    "整除" $f_j ". 于是, 我们看到不论什么情况下必然都有对于某个" (&cm $j (&<= $1 $j (&+ $k $1)))
    ", " $p "整除" $f_j ".")
   ((theorem #:n "9")
    "如果" $F "是一个域, 那么" polyF "中的非标量首项系数为一多项式, 在不计顺序的情况下, "
    "有且仅有一种将其分解为" polyF "中的首项系数为一的素因子之积的方式.")
   ((proof)
    "设" $f "是域" $F "上的一个非标量首项系数为一多项式. 因为次数为一的多项式是不可约的, 因此在"
    (&= (&deg $f) $1) "的情况下没有什么好证明的东西. 设" $f "的次数" (&> $n $1) ". 根据归纳, "
    "我们可以假定该定理对于所有次数小于" $n "的非标量首项系数为一多项式均成立. 如果" $f
    "是不可约的, 那么它就已经被分解为首项系数为一的素因子之积了. 若" $f "可约, 则"
    (&= $f (&i* $g $h)) ", 其中" $g "和" $h "是次数小于" $n "的非标量首项系数为一多项式. 因此, "
    $g "和" $h "可以被分解为" polyF "中的首项系数为一的素因子之积, 于是" $f "也可以. 现在设"
    (MB (&= $f (&i* $p_1 $..c $p_m) (&i* $q_1 $..c $q_n)))
    "其中" (&cm $p_1 $..h $p_m) "和" (&cm $q_1 $..h $q_n) "是" polyF "中的首项系数为一的"
    "素多项式. 那么, " $p_m "整除" (&i* $q_1 $..c $q_n) ". 根据上述推论, " $p_m "必然整除某个"
    $q_i ". 鉴于" $q_i "和" $p_m "都是首项系数为一的素多项式, 这意味着"
    (MB (&= $q_i $p_m) ".")
    "从中我们看出, 如果" (&= $m $1) "或者" (&= $n $1) ", 那么" (&= $m $n $1) ", 因为"
    (MB (&= (&deg $f)
            (sum (&= $i $1) $m (&deg $p_i))
            (sum (&= $j $1) $n (&deg $q_j))) ".")
    "在" (&= $m $n $1) "的情况下没有什么好证明的东西, 所以我们不妨设" (&> $m $1) "且"
    (&> $n $1) ". 通过重排" $q "的下标, 我们可以假定" (&= $p_m $q_n) ", 并有"
    (MB (&= (&i* $p_1 $..c (_ $p (&- $m $1)) $p_m)
            (&i* $q_1 $..c (_ $q (&- $n $1)) $p_m)) ".")
    "根据定理1的推论2, 我们有"
    (MB (&= (&i* $p_1 $..c (_ $p (&- $m $1))) (&i* $q_1 $..c (_ $q (&- $n $1)))) ".")
    "因为多项式" (&i* $p_1 $..c (_ $p (&- $m $1))) "的次数小于" $n ", 可以应用归纳假设表明序列"
    (&cm $q_1 $..h (_ $q (&- $n $1))) "最多只是" (&cm $p_1 $..h (_ $p (&- $m $1)))
    "的重排. 这个事实和" (&= $p_m $q_n) "一起告诉我们" $f "作为首项系数为一的素因子之积的分解, "
    "在不计因子的顺序的情况下是唯一的." (Br)
    "[译注: 以上证明有一个小的混乱, 就是作为多项式" $f "的次数的" $n "和作为多项式序列"
    (&cm $q_1 $..h $q_n) "的长度的" $n "之间是毫无关系的.]")
   (P "在以上对于一个给定非标量首项系数为一的多项式" $f "的分解中, 某些首项系数为一的素因子"
      "是可以重复的. 如果" (&cm $p_1 $..h $p_r) "是对于这个" $f "的分解中所有不同的素因子, 那么"
      (MB (&= $f (&i* (_^ $p $1 $n_1) (_^ $p $2 $n_2) $..c (_^ $p $r $n_r))))
      "幂次" $n_i "是素因子" $p_i "在分解中出现的次数. 这样的分解显然也是唯一的, 其被称为" $f
      "的主分解 (primary decomposition). 很容易验证每个" $f "的首项系数为一的因子都具有"
      (MB (&cm (&i* (_^ $p $1 $m_1) (_^ $p $2 $m_2) $..c (_^ $p $r $m_r)) (&<= $0 $m_i $n_i)))
      "的形式. 这告诉我们有限数目的非标量首项系数为一多项式" (&cm $f_1 $..h $f_s)
      "的最大公因子可由联合所有那些同时出现在每个" (&cm $f_1 $..h $f_s) "的分解中的"
      "首项系数为一的素因子获得, 而其幂次取相应的幂能够整除每个" $f_i "的最大值. "
      "[译注: 这等价于取每个 " $f_i "与之对应的素因子的幂次的最小值.] "
      "若无素因子的(非平凡)幂次是每个" $f_i "的因子, 那么这些多项式是互素的. "
      "[译注: 这等价于若没有素因子出现在每个" $f_i "的分解中, 那么这些多项式是互素的.]")
   ((example #:n "11")
    "设" $F "是一个域, 令" (&cm $a $b $c) "是" $F "的不同元素, 那么多项式"
    (&cm (&- $x $a) (&- $x $b) (&- $x $c)) "是" polyF "中不同的首项系数为一的素多项式. 如果"
    (&cm $m $n $s) "是正整数, 那么" (^ (@- $x $c) $s) "是多项式"
    (MB (&i* (^ (@- $x $b) $n) (^ (@- $x $c) $s))
        "和" (&i* (^ (@- $x $a) $m) (^ (@- $x $c) $s)))
    "的最大公因子, 尽管这三个多项式"
    (MB (&cm (&i* (^ (@- $x $b) $n) (^ (@- $x $c) $s))
             (&i* (^ (@- $x $a) $m) (^ (@- $x $c) $s))
             (&i* (^ (@- $x $a) $m) (^ (@- $x $b) $n))))
    "是互素的.")
   ((theorem #:n "10")
    "令" $f "是域" $F "上的一个非标量首项系数为一多项式, 并且令"
    (MB (&= $f (&i* (_^ $p $1 $n_1) $..c (_^ $p $k $n_k))))
    "是" $f "的素因子分解. [译注: 按照上面的说法, 这里的prime factorization应该写成primary decomposition. "
    "当然了, 有基本理解能力的读者应该明白primary decompostion不过就是prime factorization的一种形式而已.] "
    "对于每个" (&cm $j (&<= $1 $j $k)) ", 令"
    (MB (&= $f_j (&/ $f (_^ $p $j $n_j)) (prod (&!= $i $j) $ (_^ $p $i $n_i))))
    "那么" (&cm $f_1 $..h $f_k) "是互素的. [译注: 这里需要定义多项式除法, 不过这是显然的.]")
   ((proof)
    "我们将这个(简单的)证明留给读者. 我们陈述这个定理很大程度上是因为"
    "我们想要在之后引用它.")
   ((theorem #:n "11")
    "令" $f "是一个域" $F "上的多项式, 其导数是" $f^ ", 那么" $f
    "是域" $F "上的不同的不可约多项式之积当且仅当" $f "和" $f^ "互素.")
   ((proof)
    "设域" $F "上对于" $f "的素因子分解中某个(非标量)素多项式" $p
    "是重复的 [译注: 原文之所以给非标量加上括号, 是因为素多项式按照定义本来就是非标量多项式], 那么"
    (&= $f (&i* $p^2 $h)) ", 其中" (&in $h polyF) ", 于是"
    (MB (&= $f^ (&+ (&i* $p^2 $h^) (&i* $2 $p $p^ $h))))
    "所以" $p "也是" $f^ "的一个因子, 因此" $f "和" $f^ "不是互素的." (Br)
    "现在设" (&= $f (&i* $p_1 $..c $p_k)) ", 其中" (&cm $p_1 $..h $p_k) "是域" $F
    "上不同的非标量不可约多项式. 令" (&= $f_j (&/ $f $p_j)) ", 那么"
    (MB (&= $f^ (LC0 (_^ $p $1 $prime) $f_1 (_^ $p $2 $prime) $f_2 (_^ $p $k $prime) $f_k)) ".")
    "令" $p "是一个整除" $f "和" $f^ "的素多项式, 那么对于某个" $i "有" (&= $p $p_i)
    ". 既然若" (&!= $j $i) ", 则" $p_i "整除" $f_j ", 并且" $p_i "也整除"
    (MB (&= $f^ (sum (&= $j $1) $k (&i* (_^ $p $j $prime) $f_j))))
    "我们看出来" $p_i "也必然整除" (&i* (_^ $p $i $prime) $f_i) ", 因而" $p_i
    "整除" $f_i "或" (&i* (_^ $p $i $prime) $f_i) ". 但是, " $p_i "并不整除" $f_i
    ", 鉴于" (&cm $p_1 $..h $p_k) "都是不同的, 于是" $p_i "整除" (_^ $p $i $prime)
    ". 这是不可能的, 因为" (_^ $p $i $prime) "的次数比" $p_i "的次数少一. 我们总结一下, "
    "就是没有素多项式能够同时整除" $f "和" $f^ ", 即" $f "和" $f^ "是互素的.")
   (P "[译注: 定理11的陈述和证明都有些粗糙. 如果根据之前给出的定义稍加打磨一下, 定理11应该是&quot;"
      "令" $f "是域" $F "上的首项系数为一的多项式, 那么" $f "的素因子分解中每个因子仅出现一次"
      "当且仅当" $f "和" $f^ "互素&quot;. 其中" $1 "的素因子分解应该是&quot;空白&quot;, 因为"
      "&quot;空白&quot;的积定义为乘法的单位元 (也就是多项式" $1 ") 是很合理的. 至于证明, "
      "许多地方应该加上&quot;首项系数为一&quot;, 不然的话是不正确的. 另外, 这个证明中还用到了"
      "形式导数类似于导数的性质却没有另加证明, 尽管证明起来并不困难.]")
   ((definition)
    "域" $F "被称为代数封闭的 (algebraically closed), 如果每个域" $F
    "上的素多项式的次数都是" $1 ".")
   (P "称" $F "是代数封闭的意味着每个" $F "上的非标量不可约的首项系数为一多项式均具有"
      (@- $x $c) "的形式. 我们已经观察到每个这样的多项式对于任意的" $F "都是不可约的. "
      "据此, 代数闭域的一个等价定义是" polyF "中的每个非标量多项式" $f "都可以被表达为"
      (MB (&= $f (&i* $c (^ (@- $x $c_1) $n_1) $..c (^ (@- $x $c_k) $n_k))))
      "的形式, 其中" $c "是一个标量, " (&cm $c_1 $..h $c_k) "是" $F "的不同元素, "
      (&cm $n_1 $..h $n_k) "是正整数. 另一种对于代数闭域的刻画是如果" $f "是域"
      $F "上的非标量多项式, 那么存在" (&in $c $F) "使得" (&= (app $f $c) $0) ".")
   (P "实数域" $RR "不是代数封闭的, 因为多项式" (@+ $x^2 $1) "在" $RR "上是不可约的且次数不为"
      $1 ", 或是因为不存在实数" $c "满足" (&= (&+ $c^2 $1) $0) ". 所谓的代数基本定理陈述了复数域"
      $CC "是代数闭域的事实. 我们将不会证明这个定理, 尽管我们之后将在本书中稍微使用一下它. 省略这个定理的证明的"
      "一部分原因在于时间的限制, 一部分原因在于此证明依赖于实数系的一个&quot;非代数&quot;性质. "
      "至于一种可能的证明, 感兴趣的读者可以阅读参考文献中Schreier和Sperner所写的书.")
   (P "代数基本定理也使得实系数多项式的素因子分解的可能性明晰化. 如果" $f "是一个实系数多项式而"
      $c "是" $f "的一个复根, 那么其复共轭" (OverBar $c) "也是" $f "的一个根. 因此, 那些非实的复根必然以"
      "共轭对偶的形式出现, 而整个根的集合具有"
      (setE $t_1 $..h $t_k $c_1 (_ (OverBar $c) $1) $..h $c_r (_ (OverBar $c) $r))
      "的形式, 其中" (&cm $t_1 $..h $t_k) "是实数而" (&cm $c_1 $..h $c_r) "是非实的复数, 因此" $f "可以被分解为"
      (MB (&= $f (&i* $c (@- $x $t_1) $..c (@- $x $t_k) $p_1 $..c $p_r)))
      "其中" $p_i "是二次多项式"
      (MB (&= $p_i (&i* (@- $x $c_i) (@- $x (_ (OverBar $c) $i)))) ".")
      "这些多项式" $p_i "具有实系数. 我们总结一下, 实数域上的每个非标量不可约多项式的次数都是" $1 "或" $2
      ". " $RR "上的每个非标量多项式都是特定的线性因子 (从" $f "的实根中得到) 和特定的不可约二次多项式"
      "之积 [译注: 还要考虑一下最后再乘上一个系数].")
   ((exercise #:n "1")
    "令" $p "是域" $F "上一个首项系数为一的多项式. 令" $f "和" $g "是域" $F "上互素的多项式. 证明"
    (&i* $p $f) "和" (&i* $p $g) "的最大公因子是" $p ".")
   ((exercise #:n "2")
    "默认代数基本定理成立, 证明以下事实. 如果" $f "和" $g "是复数域上的多项式, 那么"
    (&= (&gcd $f $g) $1) "当且仅当" $f "和" $g "没有共同的根.")
   ((exercise #:n "3")
    "令" $D "是" (&poly $CC) "上的微分算子. 令" $f "是复数域上的首项系数为一多项式. 证明"
    (MB (&= $f (&i* (@- $x $c_1) $..c (@- $x $c_k))))
    "其中" (&cm $c_1 $..h $c_k) "是不同的复数, 当且仅当" $f "和" (ap $D $f) "互素. 换言之, " $f
    "没有重复的根当且仅当" $f "和" (ap $D $f) "没有相同的根. (默认代数基本定理成立.)")
   ((exercise #:n "4")
    "证明以下Taylor公式的推广. 令" (&cm $f $g $h) "是某个复数域的子域上的多项式, 并且"
    (&<= (&deg $f) $n) ", 那么"
    (MB (&= (app $f $g) (sum (&= $k $0) $n
                             (&i* (~ $1 (&fact $k))
                                  (app (^ $f (@ $k)) $h)
                                  (^ (@- $g $h) $k)))) ".")
    "(这里" (app $f $g) "代表&quot;应用" $f "于" $g "&quot;.)")
   (P "对于剩余的练习, 我们需要如下定义. 如果" (&cm $f $g $p) "是域" $F "上的多项式并且"
      (&!= $p $0) ", 那么我们称模" $p "下" $f "和" $g "同余, 如果" (@- $f $g) "被" $p
      "整除. 如果模" $p "下" $f "同余于" $g ", 那么我们记"
      (MB (equivmod $f $g) "."))
   ((exercise #:n "5")
    "对于任意的非零多项式" $p ", 证明模" $p "同余是一个等价关系."
    (Ol #:attr* '((type "a"))
        (Li "自反: " (equivmod $f $f) ".")
        (Li "对称: 如果" (equivmod $f $g) ", 那么" (equivmod $g $f) ".")
        (Li "传递: 如果" (equivmod $f $g) "并且" (equivmod $g $h)
            ", 那么" (equivmod $f $h) ".")))
   ((exercise #:n "6")
    "设" (equivmod $f $g) "且" (equivmod $f_1 $g_1) "."
    (Ol #:attr* '((type "a"))
        (Li "证明" (equivmod (&+ $f $f_1) (&+ $g $g_1)) ".")
        (Li "证明" (equivmod (&i* $f $f_1) (&i* $g $g_1)) ".")))
   ((exercise #:n "7")
    "使用练习6证明以下结果. 如果" (&cm $f $g $h $p) "是域" $F "上的多项式而" (&!= $p $0)
    ", 若" (equivmod $f $g) ", 则" (equivmod (app $h $f) (app $h $g))
    ". [译注: 原文是练习7, 应该是练习6. 或许其他地方这样的编号引用错误还有很多, 因为我没有一一检查.]")
   ((exercise #:n "8")
    "如果" $p "是一个 [译注: 非标量] 不可约多项式而" (equivmod (&i* $f $g) $0) ", 那么" (equivmod $f $0)
    "或者" (equivmod $g $0) ". 给出反例说明在" $p "可约的情况下这是错误的.")
   (H2 "第5章 行列式")
   (H3 "第5.1节 交换环")
   (P "本章我们将证明与方阵的行列式有关的基本事实. 我们不仅对于域上的矩阵这么做, "
      "矩阵的元素还可能是更一般类型的&quot;标量&quot;. 这种一般化有两个理由. "
      "首先, 在下一章, 我们将会发现不得不处理元素是多项式的矩阵的行列式. "
      "其次, 在我们呈现的对于行列式的处理中, 有一条公理是不发挥作用的, 也就是"
      "保证每个非零元素都拥有乘法逆元的那条公理. 出于这些原因, 建立含幺交换环上"
      "的矩阵的行列式理论是合适的.")
   ((definition)
    "一个环是一个集合" $K ", 带有两种运算" (&\|-> (tu0 $x $y) (&+ $x $y)) "和"
    (&\|-> (tu0 $x $y) (&i* $x $y)) "满足"
    (Ol #:attr* '((type "a"))
        (Li $K "在运算" (&\|-> (tu0 $x $y) (&+ $x $y)) "下是一个交换群;")
        (Li (&= (&i* (@ (&i* $x $y)) $z) (&i* $x (@ (&i* $y $z)))) ";")
        (Li (&= (&i* $x (@ (&+ $y $z))) (&+ (&i* $x $y) (&i* $x $z))) "; "
            (&= (&i* (@ (&+ $y $z)) $x) (&+ (&i* $y $x) (&i* $z $x))) "."))
    "如果" (commute* $x $y) "对于所有" $K "中的" $x "和" $y "成立, 那么我们称环" $K "是交换的. "
    "如果" $K "中存在一个元素" $1 "满足对于每个" $x "有" (&= (&i* $1 $x) (&i* $x $1) $x)
    ", 那么" $K "就被称为含幺环, 而" $1 "就被称为" $K "的幺元.")
   (P "这里我们感兴趣的是含幺交换环. 这样的环, 可以被简要地描述为一个集合" $K
      "带有两种运算, 满足第1章给出的域公理, 除了公理8和条件" (&!= $1 $0) ". "
      "因此, 域是含有非零幺元的交换环, 并且每个非零元都可逆. 整数集, 带有通常的运算, "
      "就是一个含幺交换环, 但不是域. 另一个含幺交换环的例子是域上的多项式.")
   (P "如果" $K "是一个含幺交换环, 我们定义" $K "上的" m*n
      "矩阵是一个从整数序对" (&cm (tu0 $i $j) (&<= $1 $i $m) (&<= $1 $j $n))
      "的集合到" $K "的函数. 像往常一样, 我们将这样的矩阵表示为" $m
      "行" $n "列的矩形阵列. " $K "上的矩阵的和与积定义恰如域上的矩阵"
      (MB (&= (mref (@+ $A $B) $i $j) (&+ Aij (mref $B $i $j))))
      (MB (&= (_ @AB (&cm $i $j))
              (sum $k $ (&i* (mref $A $i $k) (mref $B $k $j)))))
      "当" $A "和" $B "具有相同的行数和列数时, 和有定义. "
      "当" $A "的列数等于" $B "的行数时, 积有定义. "
      "这些运算的基本代数性质当然仍然成立, 例如"
      (MB (&cm (disR $A $B $C) (assoc* $A $B $C) "等等.")))
   (P "和域的情况一样, 我们将称" $K "的元素为标量. 接着, 我们可以像之前一样"
      "定义矩阵的行或列的线性组合. 粗略说来, 我们对于域上的矩阵所做的事情, 对于"
      $K "上的矩阵一样合法, 除了那些需要&quot;除法&quot;的结果.")
   (H3 "第5.2节 行列式函数")
   (P "令" $K "是一个含幺交换环. 我们希望为每个" $K "上的"
      n*n "矩阵赋一个被称为行列式的标量. 将行列式定义为基于"
      "矩阵元素的公式是可能的, 接着人们可以从这个公式里推导出行列式的性质. "
      "然而, 这样的公式是相当复杂的, 为了获得一些技术性优势, 我们将按以下方式处理. "
      "我们将" (^ $K n*n) "上的&quot;行列式函数&quot;定义为一种"
      "具有如下特别性质的函数. 它对于矩阵的每一行都是线性的; 若矩阵具有两个相等的行, "
      "那么其值为" $0 "; 对于恒等矩阵, 其值为" $1 ". "
      "我们将证明这样的函数存在, 并且唯一, 也就是恰有一个这样的函数. 随着我们证明唯一性, "
      "就得到了一个行列式的显式公式, 以及许多有用的性质.")
   (P "本节我们将致力于&quot;行列式函数&quot;的定义, 以及证明至少有一个这样的函数存在.")
   ((definition)
    "令" $K "是一个含幺交换环, 令" $n "是一个正整数, 令" $D
    "是一个函数, 其赋每个" $K "上的" n*n "矩阵" $A
    "以一个" $K "中标量" (app $D $A) ". 我们称" $D "是"
    $n "线性的, 如果对于每个" (&cm $i (&<= $1 $i $n)) ", "
    "在其他" (@- $n $1) "行固定的情况下, " $D "对于第" $i
    "行是一个线性函数.")
   (P "这个定义需要一些澄清. 如果" $D "是一个从" (^ $K n*n) "到"
      $K "的函数, 并且如果" alpha_1..n "是矩阵" $A "的行, 那么我们也记"
      (MB (&= (app $D $A) (appl $D $alpha_1 $..h $alpha_n)))
      "即是说, 我们也将" $D "想成是" $A "的行的函数. " $D "是" $n "线性的陈述意味着"
      (MB (&= (appl $D $alpha_1 $..h (&+ (&i* $c $alpha_i)
                                         (_^ $alpha $i $prime))
                    $..h $alpha_n)
              (&+ (&i* $c (appl $D $alpha_1 $..h $alpha_i $..h $alpha_n))
                  (appl $D $alpha_1 $..h (_^ $alpha $i $prime) $..h $alpha_n))))
      "如果我们固定除了第" $i "行之外的所有行并将" $D "视为第" $i "行的函数, 那么将"
      (app $D $A) "写成" (app $D $alpha_i) "是更方便的. 因此, 我们可以将上式"
      "简写成"
      (MB (&= (app $D (&+ (&i* $c $alpha_i)
                          (_^ $alpha $i $prime)))
              (&+ (&i* $c (app $D $alpha_i))
                  (app $D (_^ $alpha $i $prime)))))
      "只要意思足够清楚即可.")
   ((example #:n "1")
    "令" (&cm $k_1 $..h $k_n) "是正整数, 其中" (&<= $1 $k_i $n) ", 并令"
    $a "是" $K "的一个元素. 对于每个" $K "上的" n*n "矩阵" $A ", 定义"
    (MB (&= (app $D $A)
            (&i* $a (appl $A $1 $k_1) $..c (appl $A $n $k_n))))
    "那么函数" $D "就是" $n "线性的. 这是因为如果我们将" $D "视为第" $i "行的函数, "
    "而其他行固定, 我们可以将其写作"
    (MB (&= (app $D $alpha_i)
            (&i* (appl $A $i $k_i) $b)))
    "其中" $b "是一个" $K "的固定元素. 令"
    (&= (_^ $alpha $i $prime)
        (tu0 (_^ $A (&cm $i $1) $prime) $..h (_^ $A (&cm $i $n) $prime)))
    ", 那么我们有"
    (MB (deriv (app $D (&+ (&i* $c $alpha_i) (_^ $alpha $i $prime)))
               (&i* (bra0 (&+ (&i* $c (appl $A $i $k_i))
                              (appl $A^ $i $k_i)))
                    $b)
               (&+ (&i* $c (app $D $alpha_i))
                   (app $D (_^ $alpha $i $prime)))))
    "因此" $D "对于" $A "的每一行都是一个线性函数." (Br)
    "这种类型的" $n "线性函数的一个特别例子是"
    (MB (&= (app $D $A) (&i* (mref $A $1 $1)
                             (mref $A $2 $2)
                             $..c
                             (_ $A (&cm $n $n)))))
    "换言之, &quot;对角线元素之积&quot;是一个" (^ $K n*n)
    "上的" $n "线性函数.")
   ((example #:n "2")
    "让我们找出所有" $K "上的" 2*2 "矩阵上的" $2 "线性函数. "
    "令" $D "是这样一个函数. 如果我们用" (&cm $epsilon_1 $epsilon_2)
    "代表" 2*2 "的恒等矩阵的行, 那么我们有"
    (MB (&= (app $D $A)
            (appl $D
                  (&+ (&i* (mref $A $1 $1) $epsilon_1)
                      (&i* (mref $A $1 $2) $epsilon_2))
                  (&+ (&i* (mref $A $2 $1) $epsilon_1)
                      (&i* (mref $A $2 $2) $epsilon_2)))))
    "因为" $D "是" $2 "线性的, 我们有"
    (MB (deriv (app $D $A)
               (&+ (&i* (mref $A $1 $1)
                        (appl $D $epsilon_1
                              (&+ (&i* (mref $A $2 $1) $epsilon_1)
                                  (&i* (mref $A $2 $2) $epsilon_2))))
                   (&i* (mref $A $1 $2)
                        (appl $D $epsilon_2
                              (&+ (&i* (mref $A $2 $1) $epsilon_1)
                                  (&i* (mref $A $2 $2) $epsilon_2)))))
               (&+ (&i* (mref $A $1 $1)
                        (mref $A $2 $1)
                        (appl $D $epsilon_1 $epsilon_1))
                   (&i* (mref $A $1 $1)
                        (mref $A $2 $2)
                        (appl $D $epsilon_1 $epsilon_2))
                   (&i* (mref $A $1 $2)
                        (mref $A $2 $1)
                        (appl $D $epsilon_2 $epsilon_1))
                   (&i* (mref $A $1 $2)
                        (mref $A $2 $2)
                        (appl $D $epsilon_2 $epsilon_2)))))
    "因此, " $D "完全由四个标量"
    (MB (&cm (appl $D $epsilon_1 $epsilon_1)
             (appl $D $epsilon_1 $epsilon_2)
             (appl $D $epsilon_2 $epsilon_1)
             (appl $D $epsilon_2 $epsilon_2)))
    "决定. 读者应该很容易验证, 如果" (&cm $a $b $c $d) "是" $K "中四个标量, 定义"
    (MB (&= (app $D $A)
            (&+ (&i* (mref $A $1 $1)
                     (mref $A $2 $1)
                     $a)
                (&i* (mref $A $1 $1)
                     (mref $A $2 $2)
                     $b)
                (&i* (mref $A $1 $2)
                     (mref $A $2 $1)
                     $c)
                (&i* (mref $A $1 $2)
                     (mref $A $2 $2)
                     $d))))
    "那么" $D "是一个" $K "上的" 2*2 "矩阵上的" $2 "线性函数, 并且"
    (MB (&cm (&= (appl $D $epsilon_1 $epsilon_1) $a)
             (&= (appl $D $epsilon_1 $epsilon_2) $b)
             (&= (appl $D $epsilon_2 $epsilon_1) $c)
             (&= (appl $D $epsilon_2 $epsilon_2) $d))))
   ((lemma)
    $n "线性函数之线性组合亦是" $n "线性函数.")
   ((proof)
    "证明两个" $n "线性函数的线性组合是" $n "线性函数足矣. 令" $D "和" $E "是" $n
    "线性函数. 如果" $a "和" $b "属于" $K ", 那么" (&+ (&i* $a $D) (&i* $b $E))
    "当然由"
    (MB (&= (app (@ (&+ (&i* $a $D) (&i* $b $E))) $A)
            (&+ (&i* $a (app $D $A))
                (&i* $b (app $E $A)))))
    "定义. 因此, 如果我们固定除了第" $i "行之外的所有行"
    (MB (deriv (app (@ (&+ (&i* $a $D) (&i* $b $E)))
                    (&+ (&i* $c $alpha_i) (_^ $alpha $i $prime)))
               (&+ (&i* $a (app $D (&+ (&i* $c $alpha_i) (_^ $alpha $i $prime))))
                   (&i* $b (app $E (&+ (&i* $c $alpha_i) (_^ $alpha $i $prime)))))
               (&+ (&i* $a $c (app $D $alpha_i))
                   (&i* $a (app $D (_^ $alpha $i $prime)))
                   (&i* $b $c (app $E $alpha_i))
                   (&i* $b (app $E (_^ $alpha $i $prime))))
               (&+ (&i* $c (app (@ (&+ (&i* $a $D) (&i* $b $E))) $alpha_i))
                   (app (@ (&+ (&i* $a $D) (&i* $b $E))) (_^ $alpha $i $prime))))))
   (P "如果" $K "是一个域而" $V "是" $K "上的" n*n "矩阵的集合, 那么以上引理是说, "
      $V "上的" $n "线性函数的集合是从" $V "到" $K "的所有函数的空间的子空间.")
   ((example #:n "3")
    "令" $D "是" $K "上的" 2*2 "矩阵上的函数, 由"
    (MB (&= (app $D $A) (&- (&i* (mref $A $1 $1) (mref $A $2 $2))
                            (&i* (mref $A $1 $2) (mref $A $2 $1)))))
    "定义. 现在" $D "是两个函数之和, 它们具有例子1所刻画的类型:"
    (MB (&Table ($D $= (&+ $D_1 $D_2))
                ((app $D_1 $A) $= (&i* (mref $A $1 $1) (mref $A $2 $2)))
                ((app $D_2 $A) $= (&- (&i* (mref $A $1 $2) (mref $A $2 $1))))))
    "根据以上引理, " $D "是一个" $2 "线性函数. 对于行列式有任何一点经验的读者"
    "都不会对此感到惊讶, 因为他会识别出来这就是" 2*2 "矩阵的行列式的通常定义. "
    "当然了, 我们刚才定义的函数" $D "不是一个普通的" $2 "线性函数. 它拥有许多特别的性质. "
    "让我们注意到其中一些. "
    "首先, 如果" $I "是" 2*2 "的恒等矩阵, 那么" (&= (app $D $I) $1) ", 即"
    (&= (appl $D $epsilon_1 $epsilon_2) $1) ". 其次, 如果" $A "的两行是相等的, 那么"
    (MB (&= (app $D $A)
            (&- (&i* (mref $A $1 $1) (mref $A $2 $2))
                (&i* (mref $A $1 $2) (mref $A $2 $1)))
            $0))
    "最后, 如果" $A^ "是由一个" 2*2 "的矩阵" $A "交换其行得到的, 那么"
    (&= (app $D $A^) (&- (app $D $A))) ", 因为"
    (MB (deriv (app $D $A^)
               (&- (&i* (_^ $A (&cm $1 $1) $prime) (_^ $A (&cm $2 $2) $prime))
                   (&i* (_^ $A (&cm $1 $2) $prime) (_^ $A (&cm $2 $1) $prime)))
               (&- (&i* (mref $A $2 $1) (mref $A $1 $2))
                   (&i* (mref $A $2 $2) (mref $A $1 $1)))
               (&- (app $D $A)))))
   ((definition)
    "令" $D "是一个" $n "线性函数, 称" $D "是交错的, 如果其下两个条件满足:"
    (Ol #:attr* '((type "a"))
        (Li "凡" $A "有两行相等, 则" (&= (app $D $A) $0) ".")
        (Li "如果" $A^ "由" $A "交换两行获得, 那么"
            (&= (app $D $A^) (&- (app $D $A))) ".")))
   (P "我们将在之后证明任何满足条件a的" $n "线性函数自动地满足条件b. "
      "我们将两种条件放在交错" $n "线性函数的定义里主要是为了方便. "
      "读者可能也会注意到如果" $D "满足b, 而" $A "是一个有着相等两行的矩阵, 那么"
      (&= (app $D $A) (&- (app $D $A))) ". "
      "这让人忍不住断言" $D "也满足条件a. 这在某些时候是对的, 例如" $K
      "是一个满足" (&!= (&+ $1 $1) $0) "的域, 但在一般情况下a不是b的推论.")
   ((definition)
    "令" $K "是一个含幺交换环, 令" $n "是一个正整数. 设" $D "是一个从" $K "上的"
    n*n "矩阵到" $K "的函数. 我们称" $D "是一个行列式函数, 如果" $D "是" $n
    "线性的, 交错的, 并且" (&= (app $D $I) $1) ".")
   (P "正如我们之前所说的, 我们最终要证明" $K "上的" n*n "矩阵上恰存在一个行列式函数. "
      "这对于" $K "上的" (&c* $1 $1) "矩阵" (&= $A (bra0 $a)) "而言是显然的. "
      "由" (&= (app $D $A) $a) "给定的函数" $D "是一个行列式函数, 并且很明显这就是"
      (&c* $1 $1) "的矩阵上唯一的行列式函数. "
      "现在我们来处理" (&= $n $2) "的情况. 我们已经在例子3中表明了"
      (MB (&= (app $D $A) (&- (&i* (mref $A $1 $1) (mref $A $2 $2))
                              (&i* (mref $A $1 $2) (mref $A $2 $1)))))
      "是一个行列式函数. 而且, 例子2中呈现的公式表明" $D "是" 2*2
      "矩阵上唯一的行列式函数. 这是因为, 我们已经证明了对于任何" $2 "线性函数" $D "有"
      (MB (&= (app $D $A)
              (&+ (&i* (mref $A $1 $1)
                       (mref $A $2 $1)
                       (appl $D $epsilon_1 $epsilon_1))
                  (&i* (mref $A $1 $1)
                       (mref $A $2 $2)
                       (appl $D $epsilon_1 $epsilon_2))
                  (&i* (mref $A $1 $2)
                       (mref $A $2 $1)
                       (appl $D $epsilon_2 $epsilon_1))
                  (&i* (mref $A $1 $2)
                       (mref $A $2 $2)
                       (appl $D $epsilon_2 $epsilon_2)))))
      "如果" $D "是交错的, 那么"
      (MB (&= (appl $D $epsilon_1 $epsilon_1)
              (appl $D $epsilon_2 $epsilon_2)
              $0))
      "且"
      (MB (&= (appl $D $epsilon_2 $epsilon_1)
              (&- (appl $D $epsilon_1 $epsilon_2))
              (&- (app $D $I))))
      "如果" $D "还满足" (&= (app $D $I) $1) ", 那么"
      (MB (&= (app $D $A) (&- (&i* (mref $A $1 $1) (mref $A $2 $2))
                              (&i* (mref $A $1 $2) (mref $A $2 $1))))))
   ((example #:n "4")
    "令" $F "是一个域, 令" $D "是多项式环" polyF "上的" (&c* $3 $3)
    "矩阵上的任意一个交错的" $3 "线性函数. 令"
    (MB (&= $A (Mat ($x $0 (&- $x^2))
                    ($0 $1 $0)
                    ($1 $0 $x^3))))
    "如果我们将" (&c* $3 $3) "的恒等矩阵的行表示为"
    (&cm $epsilon_1 $epsilon_2 $epsilon_3) ", 那么"
    (MB (&= (app $D $A)
            (appl $D
                  (&- (&i* $x $epsilon_1) (&i* $x^2 $epsilon_3))
                  $epsilon_2
                  (&+ $epsilon_1 (&i* $x^3 $epsilon_3)))))
    "既然" $D "对于每一行都是线性的,"
    (MB (deriv
         (app $D $A)
         (&- (&i* $x (appl $D $epsilon_1 $epsilon_2
                           (&+ $epsilon_1 (&i* $x^3 $epsilon_3))))
             (&i* $x^2
                  (appl $D  $epsilon_3 $epsilon_2
                        (&+ $epsilon_1 (&i* $x^3 $epsilon_3)))))
         (&-
          (&+ (&i* $x (appl $D $epsilon_1 $epsilon_2 $epsilon_1))
              (&i* (^ $x $4) (appl $D $epsilon_1 $epsilon_2 $epsilon_3)))
          (&i* $x^2 (appl $D  $epsilon_3 $epsilon_2 $epsilon_1))
          (&i* (^ $x $5) (appl $D  $epsilon_3 $epsilon_2 $epsilon_3))
          )
         ))
    "因为" $D "是交错的, 于是"
    (MB (&= (app $D $A)
            (&i* (@ (&+ (^ $x $4) $x^2))
                 (appl $D $epsilon_1 $epsilon_2 $epsilon_3))))
    )
   ((lemma)
    "令" $D "是一个" $2 "线性函数, 并且对于" $K "上具有相同的行的" 2*2
    "矩阵" $A "有" (&= (app $D $A) $0) ", 那么" $D "是交错的."
    )
   ((proof)
    "我们必须证明的是, 如果" $A "是一个" 2*2 "的矩阵而" $A^
    "是由" $A "交换两行得到的, 那么"
    (&= (app $D $A^) (&- (app $D $A))) ". 如果" $A "的行是" $alpha "和" $beta
    ", 这意味着我们必须证明的是"
    (&= (appl $D $beta $alpha) (&- (appl $D $alpha $beta)))
    ". 既然" $D "是" $2 "线性的,"
    (MB (&= (appl $D (&+ $alpha $beta) (&+ $alpha $beta))
            (&+ (appl $D $alpha $alpha)
                (appl $D $alpha $beta)
                (appl $D $beta $alpha)
                (appl $D $beta $beta))))
    "根据我们的假设, "
    (&= (appl $D (&+ $alpha $beta) (&+ $alpha $beta))
        (appl $D $alpha $alpha)
        (appl $D $beta $beta)
        $0)
    ", 于是"
    (MB (&= $0 (&+ (appl $D $alpha $beta) (appl $D $beta $alpha))))
    )
   ((lemma)
    "令" $D "是一个" $K "上的" n*n "矩阵上的" $n "线性函数. 设" $D "满足凡" $A "两相邻行相等时"
    "即有" (&= (app $D $A) $0) ", 那么" $D "是交错的."
    )
   ((proof)
    "我们必须证明, 每当" $A "的两行相等时, " (&= (app $D $A) $0) ", 以及若" $A^
    "是由" $A "交换某两行得到的, 那么" (&= (app $D $A^) (&- (app $D $A))) ". "
    "首先, 让我们设" $A^ "是由" $A "交换两个相邻的行得到的. 读者应该能够看出来, "
    "前一个引理的证明中使用的论证可以扩展到目前的情形, 并告诉我们"
    (&= (app $D $A^) (&- (app $D $A))) "." (Br)
    "现在令" $B "由" $A "交换第" $i "行和第" $j "行得到, 其中" (&< $i $j) ". "
    "我们可以由" $A "通过一系列交换相邻行的操作得到" $B ". 我们首先交换第" $i "行和第"
    (@ (&+ $i $1)) "行, 如此反复直至行的排列呈现"
    (MB (&cm $alpha_1 $..h (_ $alpha (&- $i $1)) (_ $alpha (&+ $i $1))
             $..h $alpha_j $alpha_i (_ $alpha (&+ $j $1))
             $..h $alpha_n))
    "的顺序. 这需要交换" (&= $k (&- $j $i)) "次交换相邻的行. 现在我们用" (@ (&- $k $1))
    "次交换相邻的行将" $alpha_j "移到第" $i "行的位置. 因此, 我们通过"
    (&= (&+ $k (@ (&- $k $1))) (&- (&i* $2 $k) $1)) "次交换相邻行的操作由" $A
    "获得了" $B ", 于是"
    (MB (&= (app $D $B)
            (&i* (^ (@ $-1) (&- (&i* $2 $k) $1)) (app $D $A))
            (&- (app $D $A))))
    "设" $A "是任意拥有相等两行的" n*n "矩阵, 即有" (&= $alpha_i $alpha_j)
    ", 其中" (&< $i $j) ". 如果" (&= $j (&+ $i $1)) ", 那么" $A "有相等的邻行, 于是"
    (&= (app $D $A) $0) ". 如果" (&> $j (&+ $i $1)) ", 我们交换"
    (_ $alpha (&+ $i $1)) "和" $alpha_j ", 其结果" $B "拥有相等的邻行, 于是"
    (&= (app $D $B) $0) ". 从另一方面说, " (&= (app $D $B) (&- (app $D $A)))
    ", 因此" (&= (app $D $A) $0) ".")
   ((definition)
    "如果" (&> $n $1) "并且" $A "是一个" $K "上的" n*n "矩阵, 我们令"
    (subm $A $i $j) "代表删去" $A "的第" $i "行和第" $j "列得到的"
    (&c* (@- $n $1) (@- $n $1)) "矩阵. 如果" $D "是一个"
    (@- $n $1) "线性函数, 而" $A "是一个" n*n "矩阵, 我们记"
    (&= (app (_ $D (&cm $i $j)) $A) (ap $D (bra0 (subm $A $i $j)))) ".")
   ((theorem #:n "1")
    "令" (&> $n $1) ", 令" $D "是" $K "上的" (&c* (@- $n $1) (@- $n $1))
    "矩阵上的一个交错的" (@- $n $1) "线性函数. 对于每个" (&cm $j (&<= $1 $j $n))
    ", 由"
    (MB (&= (app $E_j $A)
            (sum (&= $i $1) $n
                 (&i* (^ (@ $-1) (&+ $i $j))
                      Aij
                      (app (_ $D (&cm $i $j)) $A)))))
    "定义的函数" $E_j "是" n*n "矩阵" $A "上的一个交错的" $n "线性函数. "
    "如果" $D "是一个行列式函数, 那么每个" $E_j "也是行列式函数.")
   ((proof)
    "如果" $A "是一个" n*n "矩阵, 那么" (app (_ $D (&cm $i $j)) $A)
    "独立于" $A "的第" $i "行. 既然" $D "是" (@- $n $1) "线性的, 那么显然"
    (_ $D (&cm $i $j)) "对于除了第" $i "行之外的行都是线性的. 因此, "
    (&i* Aij (app (_ $D (&cm $i $j)) $A)) "是" $A "的一个" $n
    "线性函数. " $n "线性函数的线性组合仍是" $n "线性的, 于是" $E_j
    "是" $n "线性的. 为了证明" $E_j "是交错的, 只需证明凡" $A "有相等的邻行则"
    (&= (app $E_j $A) $0) "就够了. 设" (&= $alpha_k (_ $alpha (&+ $k $1)))
    ", 如果" (&!= $i $k) "且" (&!= $i (&+ $k $1)) ", 那么矩阵" (subm $A $i $j)
    "拥有相等的两行, 于是" (&= (app (_ $D (&cm $i $j)) $A) $0) ", 因此"
    (MB (&= (app $E_j $A)
            (&+ (&i* (^ (@ $-1) (&+ $k $j))
                     (mref $A $k $j)
                     (app (_ $D (&cm $k $j)) $A))
                (&i* (^ (@ $-1) (&+ (&+ $k $1) $j))
                     (mref $A (&+ $k $1) $j)
                     (app (_ $D (&cm (&+ $k $1) $j)) $A)))))
    "既然" (&= $alpha_k (_ $alpha (&+ $k $1))) ", 那么"
    (MB (&= (mref $A $k $j) (mref $A (&+ $k $1) $j))
        "且"
        (&= (subm $A $k $j) (subm $A (&+ $k $1) $j)))
    "显然有" (&= (app $E_j $A) $0) "." (Br)
    "现在设" $D "是一个行列式函数. 如果" (^ $I (@ $n)) "是" n*n "的恒等矩阵, 那么"
    (subm (^ $I (@ $n)) $j $j) "是" (&c* (@- $n $1) (@- $n $1)) "的恒等矩阵"
    (^ $I (@- $n $1)) ". 既然" (&= (mref (^ $I (@ $n)) $i $j) δij)
    ", 那么根据" $E_j "的定义有"
    (MB (&= (app $E_j (^ $I (@ $n))) (app $D (^ $I (@- $n $1)))))
    "因为" (&= (app $D (^ $I (@- $n $1))) $1) ", 所以"
    (&= (app $E_j (^ $I (@ $n))) $1) ", 即" $E_j "是一个行列式函数.")
   ((corollary)
    "令" $K "是一个含幺交换环而" $n "是一个正整数, 那么至少存在一个" (^ $K n*n)
    "上的行列式函数."
    )
   ((proof)
    "我们已经证明了" $K "上的" (&c* $1 $1) "矩阵上行列式函数的存在性, 甚至"
    2*2 "的矩阵上也证明了. 定理1告诉我们如何从"
    (&c* (@- $n $1) (@- $n $1)) "矩阵上的行列式函数构造出" n*n
    "矩阵上的行列式函数, 根据归纳可得推论.")
   ((example #:n "5")
    "如果" $B "是" $K "上的一个" 2*2 "矩阵, 我们令"
    (MB (&= (&abs $B)
            (&- (&i* (mref $B $1 $1)
                     (mref $B $2 $2))
                (&i* (mref $B $1 $2)
                     (mref $B $2 $1)))))
    "那么" (&= (&abs $B) (app $D $B)) ", 其中" $D "是" 2*2 "矩阵上的行列式函数. "
    "我们已经证明过" (^ $K 2*2) "上这样的函数是唯一的了. 令"
    (MB (&= $A (Mat ((mref $A $1 $1) (mref $A $1 $2) (mref $A $1 $3))
                    ((mref $A $2 $1) (mref $A $2 $2) (mref $A $2 $3))
                    ((mref $A $3 $1) (mref $A $3 $2) (mref $A $3 $3)))))
    "是" $K "上的一个" (&c* $3 $3) "矩阵. 如果我们如定理1中对于" $E_j
    "的定义一样定义了" (&cm $E_1 $E_2 $E_3) ", 那么"
    (let ((Tt (Ttable (lambda (d i j)
                        (if (= j 2)
                            (set-attr* d 'columnalign "right")
                            d)))))
      (MB
       (Tt
        (&Table
         ((app $E_1 $A)
          $= (&i* (mref $A $1 $1)
                  (Det ((mref $A $2 $2) (mref $A $2 $3))
                       ((mref $A $3 $2) (mref $A $3 $3))))
          $- (&i* (mref $A $2 $1)
                  (Det ((mref $A $1 $2) (mref $A $1 $3))
                       ((mref $A $3 $2) (mref $A $3 $3))))
          $+ (&i* (mref $A $3 $1)
                  (Det ((mref $A $1 $2) (mref $A $1 $3))
                       ((mref $A $2 $2) (mref $A $2 $3)))))
         ((app $E_2 $A)
          $= (&i* (&- (mref $A $1 $2))
                  (Det ((mref $A $2 $1) (mref $A $2 $3))
                       ((mref $A $3 $1) (mref $A $3 $3))))
          $+ (&i* (mref $A $2 $2)
                  (Det ((mref $A $1 $1) (mref $A $1 $3))
                       ((mref $A $3 $1) (mref $A $3 $3))))
          $- (&i* (mref $A $3 $2)
                  (Det ((mref $A $1 $1) (mref $A $1 $3))
                       ((mref $A $2 $1) (mref $A $2 $3)))))
         ((app $E_3 $A)
          $= (&i* (mref $A $1 $3)
                  (Det ((mref $A $2 $1) (mref $A $2 $2))
                       ((mref $A $3 $1) (mref $A $3 $2))))
          $- (&i* (mref $A $2 $3)
                  (Det ((mref $A $1 $1) (mref $A $1 $2))
                       ((mref $A $3 $1) (mref $A $3 $2))))
          $+ (&i* (mref $A $3 $3)
                  (Det ((mref $A $1 $1) (mref $A $1 $2))
                       ((mref $A $2 $1) (mref $A $2 $2)))))
         ))))
    "从定理1可知" (&cm $E_1 $E_2 $E_3) "都是行列式函数. 实际上, 我们之后将证明"
    (&= $E_1 $E_2 $E_3) ", 但即便在此简单情形之下这也并非显然. "
    "然而, 这可以直接地通过展开以上每个表达式进行验证. "
    "我们不做这种事情, 转而给出一些特定的例子."
    (Ol #:attr* '((type "a"))
        (Li "令" (&= $K (&poly $RR)) "并且"
            (MB (&= $A
                    (Mat ((&- $x $1) $x^2 $x^3)
                         ($0 (&- $x $2) $1)
                         ($0 $0 (&- $x $3)))))
            "那么"
            (let ((Tt (Ttable (lambda (d i j)
                                (if (= j 2)
                                    (set-attr* d 'columnalign "left")
                                    d)))))
              (MB
               (Tt
                (&Table
                 ((app $E_1 $A) $= (&i* (@ (&- $x $1))
                                        (Det ((&- $x $2) $1)
                                             ($0 (&- $x $3)))))
                 ($ $= (&i* (@ (&- $x $1))
                            (@ (&- $x $2))
                            (@ (&- $x $3))))
                 ((app $E_2 $A) $= (&+ (&i* (&- $x^2)
                                            (Det ($0 $1)
                                                 ($0 (&- $x $3))))
                                       (&i* (@ (&- $x $2))
                                            (Det ((&- $x $1) $x^3)
                                                 ($0 (&- $x $3))))))
                 ($ $= (&i* (@ (&- $x $1))
                            (@ (&- $x $2))
                            (@ (&- $x $3))))
                 ((app $E_3 $A)
                  $=
                  (&+
                   (&- (&i* $x^3
                            (Det ($0 (&- $x $2))
                                 ($0 $0)))
                       (Det ((&- $x $1) $x^2)
                            ($0 $0)))
                   (&i* (@ (&- $x $3))
                        (Det ((&- $x $1) $x^2)
                             ($0 (&- $x $2))))))
                 ($ $= (&i* (@ (&- $x $1))
                            (@ (&- $x $2))
                            (@ (&- $x $3)))))))))
        (Li "令" (&= $K $RR) "并且"
            (MB (&= $A (Mat ($0 $1 $0)
                            ($0 $0 $1)
                            ($1 $0 $0))))
            "那么"
            (let ((Tt (Ttable (lambda (d i j)
                                (if (= j 2)
                                    (set-attr* d 'columnalign "right")
                                    d)))))
              (MB
               (Tt
                (&Table
                 ((app $E_1 $A)
                  $= (Det ($1 $0)
                          ($0 $1))
                  $= $1)
                 ((app $E_2 $A)
                  $= (&- (Det ($0 $1)
                              ($1 $0)))
                  $= $1)
                 ((app $E_3 $A)
                  $= (&- (Det ($0 $1)
                              ($1 $0)))
                  $= $1)
                 )))))))
   ((exercise #:n "1")
    "下列每个表达式都定义了一个实数域上的" (&c* $3 $3) "矩阵上的函数" $D ", 其中哪些" $D
    "是" $3 "线性函数?"
    (Ol #:attr* '((type "a"))
        (Li (&= (app $D $A) (&+ (mref $A $1 $1) (mref $A $2 $2) (mref $A $3 $3))) ";")
        (Li (&= (app $D $A) (&+ (^ (@ (mref $A $1 $1)) $2)
                                (&i* $3 (mref $A $1 $1) (mref $A $2 $2)))) ";")
        (Li (&= (app $D $A) (&i* (mref $A $1 $1) (mref $A $1 $2) (mref $A $3 $3))) ";")
        (Li (&= (app $D $A)
                (&+ (&i* (mref $A $1 $3) (mref $A $2 $2) (mref $A $3 $2))
                    (&i* $5 (mref $A $1 $2) (mref $A $2 $2) (mref $A $3 $2)))) ";")
        (Li (&= (app $D $A) $0) ";")
        (Li (&= (app $D $A) $1) ".")))
   ((exercise #:n "2")
    "直接验证前文中的" (&cm $E_1 $E_2 $E_3) "是等同的.")
   ((exercise #:n "3")
    "令" $K "是一个含幺交换环. 如果" $A "是" $K "上的一个" 2*2
    "矩阵, 那么" $A "的古典伴随" (ap $adj $A) "由"
    (MB (&= (ap $adj $A)
            (Mat ((mref $A $2 $2) (&- (mref $A $1 $2)))
                 ((&- (mref $A $2 $1)) (mref $A $1 $1)))))
    "定义. 如果" $det "代表" $K "上的" 2*2 "矩阵上唯一的行列式函数, 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&i* (&adj $A) $A) (&i* $A (&adj $A)) (&i* (&det0 $A) $I)) ";")
        (Li (&= (ap $det (&adj $A)) detA) ";")
        (Li (&= (app $adj $A^t) (^ (&adj $A) $t)) "."))
    "(" $A^t "代表" $A "的转置.)")
   ((exercise #:n "4")
    "令" $A "是一个域" $F "上的" 2*2 "矩阵. 证明" $A "可逆当且仅当"
    (&!= detA $0) ". 当" $A "可逆时, 给出一个" (inv $A) "的公式.")
   ((exercise #:n "5")
    "令" $A "是一个域" $F "上的" 2*2 "矩阵, 设" (&= $A^2 $0) ". 证明对于每个标量"
    $c "有" (&= (&det (&- (&i* $c $I) $A)) $c^2) ".")
   ((exercise #:n "6")
    "令" $K "是一个复数域的子域, 并且" $n "是一个正整数. 令" (&cm $j_1 $..h $j_n) "和"
    (&cm $k_1 $..h $k_n) "是不超过" $n "的正整数. 对于一个" $K "上的" n*n "的矩阵" $A
    "而言定义"
    (MB (&= (app $D $A)
            (&i* (appl $A $j_1 $k_1) (appl $A $j_2 $k_2) $..c
                 (appl $A $j_n $k_n))))
    "证明" $D "是" $n "线性的当且仅当整数" (&cm $j_1 $..h $j_n) "是互异的.")
   ((exercise #:n "7")
    "令" $K "是一个含幺交换环. 证明" $K "上的" 2*2 "矩阵上的行列式函数对于列是" $2 
    "线性的和交错的.")
   ((exercise #:n "8")
    "令" $K "是一个含幺交换环. 通过规则"
    (MB (&= (app $D $A)
            (&+ (&- (&i* (mref $A $1 $1)
                         (Det ((mref $A $2 $2) (mref $A $2 $3))
                              ((mref $A $3 $2) (mref $A $3 $3))))
                    (&i* (mref $A $1 $2)
                         (Det ((mref $A $2 $1) (mref $A $2 $3))
                              ((mref $A $3 $1) (mref $A $3 $3)))))
                (&i* (mref $A $1 $3)
                     (Det ((mref $A $2 $1) (mref $A $2 $2))
                          ((mref $A $3 $1) (mref $A $3 $2)))))))
    "定义了一个" $K "上的" (&c* $3 $3) "矩阵上的函数" $D ". "
    "证明" $D "对于列而言是交错的和" $3 "线性的.")
   ((exercise #:n "9")
    "令" $K "是一个含幺交换环而" $D "是" $K "上的" n*n "矩阵上的交错的" $n
    "线性函数, 证明"
    (Ol #:attr* '((type "a"))
        (Li "如果" $A "有一行为" $0 ", 那么" (&= (app $D $A) $0) ";")
        (Li "如果" $B "是由" $A "通过将一行的倍数加到另一行上去得到的, 那么"
            (&= (app $D $B) (app $D $A)) ".")))
   ((exercise #:n "10")
    "令" $F "是一个域, " $A "是一个域" $F "上的" (&c* $2 $3) "矩阵. "
    (tu0 $c_1 $c_2 $c_3) "是一个" $F^3 "中的向量, 由"
    (MB (&cm (&= $c_1 (Det ((mref $A $1 $2) (mref $A $1 $3))
                           ((mref $A $2 $2) (mref $A $2 $3))))
             (&= $c_2 (Det ((mref $A $1 $3) (mref $A $1 $1))
                           ((mref $A $2 $3) (mref $A $2 $1))))
             (&= $c_3 (Det ((mref $A $1 $1) (mref $A $1 $2))
                           ((mref $A $2 $1) (mref $A $2 $2))))))
    "定义. 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&rank $A) $2) "当且仅当" (&!= (tu0 $c_1 $c_2 $c_3) $0) ";")
        (Li "如果" $A "的秩为" $2 ", 那么" (tu0 $c_1 $c_2 $c_3)
            "是线性方程组" AX=0 "的解空间的一个基.")))
   ((exercise #:n "11")
    "令" $K "是一个含幺交换环而" $D "是" $K "上的" 2*2 "矩阵上的一个交错的" $2
    "线性函数. 证明对于每个" $A "而言有" (&= (app $D $A) (&i* (&det0 $A) (app $D $I)))
    ". 现在使用这个结果, 在不对于矩阵的元素进行计算的情况下, 证明"
    (&= (&det AB) (&i* (&det0 $A) (&det0 $B))) "对于" $K "上任意的"
    2*2 "矩阵" $A "和" $B "成立.")
   ((exercise #:n "12")
    "令" $F "是一个域, " $D "是一个" $F "上的" n*n "矩阵上的函数. 设"
    (&= (app $D AB) (&i* (app $D $A) (app $D $B)))
    "对于所有" $A "和" $B "成立. 证明要么对于所有的" $A "有" (&= (app $D $A) $0)
    ", 要么" (&= (app $D $I) $1) ". 在后一种情况, 证明凡" $A "可逆即有"
    (&!= (app $D $A) $0) ".")
   ((exercise #:n "13")
    "令" $RR "是实数域, 令" $D "是一个" $RR "上的" 2*2 "矩阵上的函数, 满足"
    (&= (app $D AB) (&i* (app $D $A) (app $D $B)))
    "对于所有" $A "和" $B "成立, 并设"
    (MB (&!= (ap $D (pare (Mat ($0 $1) ($1 $0))))
             (ap $D (pare (Mat ($1 $0) ($0 $1))))))
    "证明以下命题."
    (Ol #:attr* '((type "a"))
        (Li (&= (app $D $0) $0) ";")
        (Li "如果" (&= $A^2 $0) ", 那么" (&= (app $D $A) $0) ";")
        (Li "如果" $B "由" $A "交换两行 (或交换两列) 获得, 那么"
            (&= (app $D $B) (&- (app $D $A))) ";")
        (Li "如果" $A "有一行 (或一列) 为零, 那么" (&= (app $D $A) $0) ";")
        (Li "若" $A "是奇异的, 那么" (&= (app $D $A) $0) ".")))
   ((exercise #:n "14")
    "令" $A "是域" $F "上的一个" 2*2 "矩阵, 那么所有具有形式" (app $f $A)
    "的矩阵, 其中" $f "是" $F "上的一个多项式, 构成了一个含幺交换环" $K ". "
    "如果" $B "是" $K "上的一个" 2*2 "矩阵, 那么" $B
    "的行列式是" $F "上的一个" 2*2 "矩阵. 设" $I "是" $F "上的"
    2*2 "的恒等矩阵, " $K "上的" 2*2 "矩阵" $B "为"
    (MB (&= $B (Mat ((&- $A (&i* (mref $A $1 $1) $I)) (&- (&i* (mref $A $1 $2) $I)))
                    ((&- (&i* (mref $A $2 $1) $I)) (&- $A (&i* (mref $A $2 $2) $I))))))
    "证明" (&= (&det $B) (app $f $A)) ", 其中"
    (&= $f (&+ (&- $x^2 (&i* (@ (&+ (mref $A $1 $1) (mref $A $2 $2))) $x)) detA))
    ", 并证明" (&= (app $f $A) $0) ".")
   (H3 "第5.3节 置换和行列式的唯一性")
   (P "本节我们将证明" $K "上的" n*n "矩阵上的行列式函数的唯一性. 这个证明相当自然地将我们"
      "引向考虑置换及其一些基本性质.")
   (P "设" $D "是" $K "上的" n*n "矩阵上的一个交错的" $n "线性函数. 令" $A "是一个"
      $K "上的" n*n "矩阵, 其行分别为" alpha_1..n ". 如果我们用"
      (&cm $epsilon_1 $epsilon_2 $..h $epsilon_n) "表示" $K "上的" n*n
      "恒等矩阵的行, 那么"
      (MB (&cm
           (&= $alpha_i
               (sum (&= $j $1) $n (&i* (appl $A $i $j) $epsilon_j)))
           (&<= $1 $i $n)))
      "因此"
      (MB (deriv (app $D $A)
                 (ap $D (tup (sum $j $ (&i* (appl $A $1 $j) $epsilon_j))
                             $alpha_2 $..h $alpha_n))
                 (sum $j $
                      (&i* (appl $A $1 $j)
                           (appl $D $epsilon_j $alpha_2 $..h $alpha_n)))))
      "如果我们现在替换" $alpha_2 "以"
      (sum $k $ (&i* (appl $A $2 $k) $epsilon_k)) ", 那么我们看到"
      (MB (&= (appl $D $epsilon_j $alpha_2 $..h $alpha_n)
              (sum $k $
                   (&i* (appl $A $2 $k)
                        (appl $D $epsilon_j
                              $epsilon_k $..h $alpha_n)))))
      "因此"
      (MB (&= (app $D $A)
              (sum (&cm $j $k) $
                   (&i* (appl $A $1 $j) (appl $A $2 $k)
                        (appl $D $epsilon_j
                              $epsilon_k $..h $alpha_n)))))
      "对于" (appl $D $epsilon_j $epsilon_k $..h $alpha_n)
      "我们接着替换" $alpha_3 "以" (sum $l $ (&i* (appl $A $3 $l) (_ $epsilon $l)))
      ", 如此反复. 最终我们得到了一个" (app $D $A) "的表达式, 其复杂但在理论上十分重要, 即"
      (MB (&= (app $D $A)
              (sum (&cm $k_1 $k_2 $..h $k_n) $
                   (&i* (appl $A $1 $k_1) (appl $A $2 $k_2) $..c (appl $A $n $k_n)
                        (appl $D (_ $epsilon $k_1) (_ $epsilon $k_2) $..h
                              (_ $epsilon $k_n))))))
      "此和布于所有不超过" $n "的正整数的有限序列" (tu0 $k_1 $k_2 $..h $k_n) "之上. "
      "这表明" $D "是一系列函数的有限之和, 它们具有例子1所刻画的类型. "
      "应该注意到此式仅是" $D "为" $n "线性之推论, 而例子2是其一个特殊情形. "
      "既然" $D "是交错的, 那么每当下标" $k_i "之中有两个相等时, 有"
      (MB (&= (appl $D (_ $epsilon $k_1) (_ $epsilon $k_2) $..h (_ $epsilon $k_n)) $0))
      "不超过" $n "的正整数的一个有限序列" (tu0 $k_1 $k_2 $..h $k_n) ", 若其没有两个相等的分量, "
      "则被称为一个" $n "阶置换. 因此, 在这" $D "的复杂表达式之中, 我们只需要将"
      (tu0 $k_1 $k_2 $..h $k_n) "算是" $n "阶置换的部分加起来即可.")
   (P "既然一个有限的序列, 或者说" $n "元组, 是一个定义于前" $n "个正整数上的函数, 一个"
      $n "阶置换可以被定义为从集合" (setE $1 $2 $..h $n) "到自身的双射. "
      "这样一个函数" $sigma "对应于" $n "元组" (tu0 σ1 σ2 $..h σn)
      ", 因此实际上它不过就是一个以某种良定的方式排列" (&cm $1 $2 $..h $n) "的规则.")
   (P "如果" $D "是一个交错的" $n "线性函数, 而" $A "是" $K "上的一个" n*n "矩阵, 那么"
      (MB (&= (app $D $A)
              (sum $sigma $
                   (&i* (appl $A $1 σ1) $..c (appl $A $n σn)
                        (appl $D (_ $epsilon σ1) $..h
                              (_ $epsilon σn))))))
      "此和布于所有" $n "阶置换" $sigma "之上.")
   (P "接着我们将证明"
      (MB (&= (appl $D (_ $epsilon σ1) $..h (_ $epsilon σn))
              (&+- (appl $D $epsilon_1 $..h $epsilon_n))))
      "其中符号" $+- "仅依赖于排列" $sigma ". 理由如下. 序列"
      (tu0 σ1 σ2 $..h σn) "可由"
      (tu0 $1 $2 $..h $n) "通过有限次交换元素得到. 例如, 如果" (&!= σ1 $1)
      ", 那么我们可以交换" $1 "和" σ1 "的位置, 获得"
      (tu0 σ1 $..h $1 $..h) ". 继行此法, 我们将在" $n "次或更少这样的交换之后"
      "抵达序列" (tu0 σ1 σ2 $..h σn) ". "
      "[译注: 实际上最多仅需" (@- $n $1) "次这样的交换. 另外, 交换也可以被视为"
      "一种特殊的置换, 那么这是说任何置换都可以被表示为交换的复合.] "
      "既然" $D "是交错的, 那么每当我们交换行" $epsilon_i "和" $epsilon_j
      "其值的符号就会改变. 因此, 如果我们通过" $m "次交换从" (tu0 $1 $2 $..h $n) "得到了"
      (tu0 σ1 σ2 $..h σn) ", 我们有"
      (MB (&= (appl $D (_ $epsilon σ1) $..h (_ $epsilon σn))
              (&i* (^ (@ $-1) $m) (appl $D $epsilon_1 $..h $epsilon_n))))
      "特别地, 如果" $D "是一个行列式函数,"
      (MB (&= (appl $D (_ $epsilon σ1) $..h (_ $epsilon σn))
              (^ (@ $-1) $m)))
      "其中" $m "仅依赖于" $sigma "而不依赖于" $D ". 因此, 所有的行列式函数为以"
      (&cm (_ $epsilon σ1) $..h (_ $epsilon σn))
      "为行的矩阵赋相同的值, 该值要么是" $1 "要么是" $-1 ".")
   (P "现在我们给出一个关于置换的基本事实. 如果" $sigma "是一个" $n "阶置换, 读者可以通过"
      "一系列交换由" (tu0 $1 $2 $..h $n) "得到" (tu0 σ1 σ2 $..h σn)
      ", 而且这可以按照各种不同的方式进行. 尽管如此, 不论以何种方式进行, 交换的次数要么"
      "总是偶数, 要么总是奇数. 于是, 置换也就相应地被称为偶的或奇的. 我们以"
      (MB (&= sgnσ
              (Choice
               ($1 (: $cm "如果" $sigma "是偶置换"))
               ($-1 (: $cm "如果" $sigma "是奇置换")))))
      "定义置换的符号 (sign), 其中符号 (symbol) &quot;" $1 "&quot;代表整数" $1 ". "
      "[译注: 实际上, "$1 "的意义随上下文而变.]"
      )
   (P "我们将在之后表明置换的这个基本性质可从我们已经知道的关于行列式函数的东西推导出来. "
      "让我们暂时假设这个性质成立, 那么整数" $m "在" $sigma "是偶置换的情况下总是偶数, 在"
      $sigma "是奇置换的情况下总是奇数. 那么, 对于任何一个交错的" $n "线性函数" $D "我们有"
      (MB (&= (appl $D (_ $epsilon σ1) $..h (_ $epsilon σn))
              (&i* @sgnσ (appl $D $epsilon_1 $..h $epsilon_n))))
      "那么根据我们已经得到的公式,"
      (MB (&= (app $D $A)
              (&i* (brac
                    (sum $sigma $
                         (&i* @sgnσ
                              (appl $A $1 σ1)
                              $..c
                              (appl $A $n σn))))
                   (app $D $I))))
      "当然" $I "代表" n*n "的恒等矩阵.")
   (P "从此结果之中我们可以看出来" $K "上的" n*n "矩阵上恰存在唯一的行列式函数. "
      "如果我们用" $det "代表这个函数, 那么它由"
      (MB (&= detA
              (sum $sigma $
                   (&i* @sgnσ
                        (appl $A $1 σ1)
                        $..c
                        (appl $A $n σn)))))
      "给出, 其中和布于所有" $n "阶置换之上. 我们可以将其形式化地总结如下.")
   ((theorem #:n "2")
    "令" $K "是一个含幺交换环, 令" $n "是一个正整数. " $K "上的" n*n
    "矩阵上恰存在唯一的行列式函数, 即由"
    (MB (&= detA
            (sum $sigma $
                 (&i* @sgnσ
                      (appl $A $1 σ1)
                      $..c
                      (appl $A $n σn)))))
    "给定的函数" $det ". 如果" $D "是一个" (^ $K n*n) "上的交错的" $n
    "线性函数, 那么对于每个" n*n "的矩阵" $A ","
    (MB (&= (app $D $A) (&i* (@ (ap $det $A)) (app $D $I)))))
   (P "这就是我们一直在寻求的定理, 不过证明中我们留下了一个gap. 这个gap就是证明对于一个给定的"
      $sigma ", 当我们从" (tu0 $1 $2 $..h $n) "经过交换得到"
      (tu0 σ1 σ2 $..h σn) "时, 交换的次数要么总是偶数, "
      "要么总是奇数. 这个基本的组合学事实当然可以不借助于行列式来证明. 然而, 我们乐意指出如何从"
      n*n "矩阵上的行列式函数的存在性中得到这个事实.")
   (P "令" $K "是整数环, 令" $D "是" $K "上的" n*n "矩阵上的一个行列式函数. 令" $sigma
      "是一个" $n "阶置换, 设我们通过" $m "次交换从" (tu0 $1 $2 $..h $n) "得到"
      (tu0 σ1 σ2 $..h σn) ". 之前我们已经知道的"
      (MB (&= (^ (@ $-1) $m)
              (appl $D (_ $epsilon σ1) $..h (_ $epsilon σn))))
      "也就是说, " (^ (@ $-1) $m) "必须是" $D "在以"
      (&cm (_ $epsilon σ1) $..h (_ $epsilon σn))
      "为行的矩阵上的值. 如果"
      (MB (&=
           (appl $D (_ $epsilon σ1) $..h (_ $epsilon σn))
           $1))
      "那么" $m "必须是偶数. 如果"
      (MB (&=
           (appl $D (_ $epsilon σ1) $..h (_ $epsilon σn))
           $-1))
      "那么" $m "必须是奇数. [译注: 若"$m "可能为奇可能为偶, 那么" $D "就不是良定的了.]")
   (P "既然我们有了" n*n "矩阵的行列式的显式公式, 并且这个公式牵扯到" $n "阶置换, "
      "让我们对于置换的一些观察为本节作结. 首先, 我们注意到恰存在"
      (&= (&fact $n) (&d* $1 $2 $..c $n)) "个" $n "阶置换. 这是因为, 如果" $sigma
      "是一个置换, " σ1 "存在" $n "种可能的选择. 当作出这个选择之后, "
      σ2 "有" (@- $n $1) "种选择, 然后" (ap $sigma $3) "有"
      (@ (&- $n $2)) "种选择, 诸如此类. 因此, 存在"
      (MB (&= (&d* $n (@- $n $1) (@ (&- $n $2)) $..c $2 $1) (&fact $n)))
      "种置换" $sigma ". 于是, " detA "的公式是" (&fact $n) "个项的和, 每一项对应于一个"
      $n "阶置换. 每个项都是" $A "的" $n "个元素之积"
      (MB (&i* (appl $A $1 σ1) $..c (appl $A $n σn)))
      "其中每个元素都来自于不同的每一行和不同的每一列, 并且根据" $sigma "是偶置换还是奇置换, "
      "前面带着符号&quot;" $+ "&quot;或者&quot;" $- "&quot;.")
   (P "当置换被认为是从集合" (setE $1 $2 $..h $n) "到自身的双射时, 我们可以定义置换的积. "
      $sigma "和" $tau "之积被简单地定义为复合函数" (&i* $sigma $tau) ", 其由"
      (MB (&= (app (@ (&i* $sigma $tau)) $i) (app $sigma (app $tau $i))))
      "定义. 如果" $epsilon "代表恒等置换, 即由" (&= (app $epsilon $i) $i)
      "定义的置换, 那么对于每个置换" $sigma "存在一个逆" (inv $sigma) "满足"
      (MB (&= (&i* $sigma (inv $sigma)) (&i* (inv $sigma) $sigma) $epsilon))
      "我们可以这样总结我们的观察, 即是说所有" $n "阶置换构成的集合, 在函数复合之下, 是一个群. "
      "这个群一般被称为" $n "阶对称群.")
   (P "从置换的积的角度来看, 置换的符号的基本性质是"
      (MB (&= (&sgn (@ (&i* $sigma $tau)))
              (&i* @sgnσ
                   (@ (&sgn $tau)))))
      "换句话说, " (&i* $sigma $tau) "是偶置换, 如果" $sigma "和" $tau "都是偶置换或都是"
      "奇置换; " (&i* $sigma $tau) "是奇置换, 如果其中有一个是奇置换, 另一个是偶置换. "
      "读者可以基于交换操作的相继从符号的定义中看出来这个结果. "
      "[译注: 如果" $sigma "可以被表示为" $m "个交换的复合, 而" $tau "可以被表示为" $l
      "个交换的复合, 那么显然" (&i* $sigma $tau) "可以被表示为" (@ (&+ $m $l))
      "个交换的复合, 由此看出这基本性质.] "
      "如果我们指出如何从行列式的一个基本性质中得到"
      (&= (&sgn (@ (&i* $sigma $tau)))
          (&i* @sgnσ
               (@ (&sgn $tau))))
      ", 那也是很有好处的.")
   (P "令" $K "是整数环, 令" $sigma "和" $tau "是" $n "阶置换. 令"
      (&cm $epsilon_1 $..h $epsilon_n) "是" $K "上的" n*n "恒等矩阵的行, 令" $A "是以"
      (&cm (_ $epsilon (ap $tau $1)) $..h (_ $epsilon (ap $tau $n)))
      "为行的矩阵, 令" $B "是以"
      (&cm (_ $epsilon σ1) $..h (_ $epsilon σn))
      "为行的矩阵. " $A "的第" $i "行仅包含一个非零元素, 那就是在第" (ap $tau $i)
      "列的" $1 ". 从这点很容易看出" (_ $epsilon (ap (&i* $sigma $tau) $i))
      "是积矩阵" AB "的第" $i "行, 那么现在有"
      (MB (&cm (&= detA (&sgn $tau))
               (&= (&det $B) sgnσ)
               (&= (&det AB) (&sgn (@ (&i* $sigma $tau))))))
      "只要我们证明了以下定理, 就能立刻得出"
      (&= (&sgn (@ (&i* $sigma $tau))) (&i* @sgnσ (@ (&sgn $tau)))) ".")
   ((theorem #:n "3")
    "令" $K "是一个含幺交换环, 令" $A "和" $B "是" $K "上的" n*n "矩阵, 那么"
    (MB (&= (&det AB) (&i* (@ (ap $det $A)) (@ (ap $det $B))))))
   ((proof)
    "令" $B "是" $K "上一个固定的" n*n "矩阵, 并且对于每个" n*n "矩阵" $A ", 定义"
    (&= (app $D $A) (&det AB)) ". 如果我们用"
    alpha_1..n "代表矩阵" $A "的行, 那么"
    (MB (&= (appl $D $alpha_1 $..h $alpha_n)
            (appl $det (&i* $alpha_1 $B) $..h (&i* $alpha_n $B))))
    "这里" (&i* $alpha_j $B) "代表一个" (&c* $1 $n) "矩阵, 其是" (&c* $1 $n) "矩阵"
    $alpha_j "和" n*n "矩阵" $B "之积. 既然"
    (MB (&= (&i* (@ (&+ (&i* $c $alpha_i) (_^ $alpha $i $prime))) $B)
            (&+ (&i* $c $alpha_i $B) (&i* (_^ $alpha $i $prime) $B))))
    "并且" $det "是" $n "线性的, 那么很容易看出" $D "是" $n "线性的. "
    "如果" (&= $alpha_i $alpha_j) ", 那么"
    (&= (&i* $alpha_i $B) (&i* $alpha_j $B)) ", 鉴于" $det "是交错的,"
    (MB (&= (appl $D $alpha_1 $..h $alpha_n) $0))
    "因此, " $D "是交错的, 现在" $D "是一个交错的" $n "线性函数. 根据定理2,"
    (MB (&= (app $D $A) (&i* (&det0 $A) (app $D $I))))
    "但是" (&= (app $D $I) (&det (&i* $I $B)) (&det $B)) ", 那么"
    (MB (&= (&det AB) (app $D $A) (&i* (&det0 $A) (&det0 $B)))))
   (P (&= (&sgn (@ (&i* $sigma $tau)))
          (&i* @sgnσ
               (@ (&sgn $tau))))
      "仅是定理3的众多推论之一. 我们将在下一节考虑其中一些推论.")
   ((exercise #:n "1")
    "如果" $K "是一个含幺交换环, 而" $K "上的矩阵"
    (MB (&= $A (Mat ($0 $a $b)
                    ((&- $a) $0 $c)
                    ((&- $b) (&- $c) $0))))
    "证明" (&= detA $0) ".")
   ((exercise #:n "2")
    "证明Vandermonde矩阵"
    (MB (Mat ($1 $a $a^2)
             ($1 $b $b^2)
             ($1 $c $c^2)))
    "的行列式为" (&i* (@ (&- $b $a)) (@ (&- $c $a)) (@ (&- $c $b))) ".")
   ((exercise #:n "3")
    "显式列出所有的六个" $3 "阶置换, 判断它们是奇是偶, 然后给出" (&c* $3 $3)
    "行列式的完整公式.")
   ((exercise #:n "4")
    "令" $sigma "和" $tau "是" $4 "阶置换, 其由"
    (&cm (&= σ1 $2) (&= σ2 $3)
         (&= (ap $sigma $3) $4) (&= (ap $sigma $4) $1))
    "和"
    (&cm (&= (ap $tau $1) $3) (&= (ap $tau $2) $1)
         (&= (ap $tau $3) $2) (&= (ap $tau $4) $4))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li "判断" $sigma "和" $tau "奇偶性.")
        (Li "找出" (&i* $sigma $tau) "和" (&i* $tau $sigma) ".")))
   ((exercise #:n "5")
    "如果" $A "是一个" n*n "的可逆矩阵, 证明" (&!= detA $0) ".")
   ((exercise #:n "6")
    "如果" $A "是某个域上的" 2*2 "矩阵, 证明"
    (&= (&det (&+ $I $A)) (&+ $1 detA)) "当且仅当"
    (&= (&trace $A) $0) "."
    )
   ((exercise #:n "7")
    "一个" n*n "的矩阵" $A "被称为三角的, 若每当" (&> $i $j)
    "即有" (&= Aij $0) ", 或是每当" (&< $i $j)
    "即有" (&= Aij $0) ". 证明三角矩阵的行列式是其对角线元素之积"
    (&i* (mref $A $1 $1) (mref $A $2 $2) $..c (mref $A $n $n)) ".")
   ((exercise #:n "8")
    "令" $A "是复数域上的一个" (&c* $3 $3) "矩阵. 我们构造一个矩阵"
    (&- (&i* $x $I) $A) ", 其元素是多项式, 该矩阵第" $i "行" $j "列的元素是"
    (&- (&i* δij $x) Aij) ". 如果"
    (&= $f (&det (&- (&i* $x $I) $A))) ", 证明" $f "是一个次数为" $3
    "的首项次数为一的多项式. 如果我们将多项式写成"
    (MB (&= $f (&i* (@- $x $c_1) (@- $x $c_2) (@- $x $c_3))))
    "其中" (&cm $c_1 $c_2 $c_3) "是复数, 证明"
    (MB (&= (&+ $c_1 $c_2 $c_3) (&trace $A))
        "和"
        (&= (&i* $c_1 $c_2 $c_3) detA)))
   ((exercise #:n "9")
    "令" $n "是一个正整数而" $F "是一个域, 如果" $sigma "是一个" $n "阶置换, 证明函数"
    (MB (&= (appl $T $x_1 $..h $x_n)
            (tu0 (_ $x σ1) $..h (_ $x σn))))
    "是一个" $F^n "上的可逆线性算子.")
   ((exercise #:n "10")
    "令" $F "是一个域, " $n "是一个正整数, " $S "是域" $F "上的" n*n "所有矩阵的集合. "
    "令" $V "是一个从" $S "到" $F "的所有函数构成的向量空间, 令" $W
    "是" $S "上交错" $n "线性形式的集合. 证明" $W "是" $V "的一个子空间. "
    $W "的维数又是多少?")
   ((exercise #:n "11")
    "令" $T "是" $F^n "上的一个线性算子. 定义"
    (MB (&= (appl $D_T $alpha_1 $..h $alpha_n)
            (appl $det (ap $T $alpha_1) $..h (ap $T $alpha_n))))
    (Ol #:attr* '((type "a"))
        (Li "证明" $D_T "是一个交错的" $n "线性函数.")
        (Li "如果"
            (MB (&= $c (appl $det (ap $T $epsilon_1) $..h (ap $T $epsilon_n))))
            "证明对于任意的" $n "个向量" alpha_1..n "我们有"
            (MB (&= (appl $det (ap $T $alpha_1) $..h (ap $T $alpha_n))
                    (&i* $c (appl $det $alpha_1 $..h $alpha_n))))
            )
        (Li "如果" $BBB "是" $F^n "任意的有序基, " $A "是" $T "在有序基" $BBB
            "下的矩阵, 证明" (&= detA $c) ".")
        (Li "你觉得标量" $c "的合理名字是什么?")))
   ((exercise #:n "12")
    "如果" $sigma "是一个" $n "阶置换, " $A "是一个以" alpha_1..n
    "为行向量的域" $F "上的" n*n "矩阵, 令" (app $sigma $A)
    "代表以" (&cm (_ $alpha σ1) $..h (_ $alpha σn))
    "为行向量的" n*n "矩阵."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (app $sigma AB) (&i* (app $sigma $A) $B)) "并且特别地, "
            (&= (app $sigma $A) (&i* (app $sigma $I) $A)) ".")
        (Li "如果" $T "是练习9中的线性算子, 证明" $T "在标准有序基下的矩阵是"
            (app $sigma $I) ".")
        (Li (app (inv $sigma) $I) "是" (app $sigma $I) "的逆矩阵吗?")
        (Li (app $sigma $A) "相似于" $A "吗?")))
   ((exercise #:n "13")
    "证明置换的符号函数在以下意义上是唯一的. 如果" $f "是一个函数, 其赋每个" $n
    "阶置换以一个整数, 并且" (preserve* $f $sigma $tau)
    ", 那么要么" $f "恒为" $0 ", 要么" $f "是符号函数.")
   (H3 "第5.4节 行列式的额外性质")
   (P "本节我们将讲述" n*n "矩阵上的行列式函数的一些有用性质. "
      "或许首先应该注意到以下事实. 在我们对于" detA "的讨论中, " $A
      "的行扮演着具有特权的角色. 既然行和列本质上没有区别, 那么读者也会期望" detA
      "是" $A "的列的交错的" $n "线性函数. 诚然如此, 而为了证明它, 仅需要证明"
      (MB (&= (&det $A^t) detA))
      "就够了, 其中" $A^t "代表" $A "的转置. ")
   (P "如果" $sigma "是一个" $n "阶置换,"
      (MB (&= (appl $A^t $i (ap $sigma $i))
              (appl $A (ap $sigma $i) $i)))
      "根据行列式的公式, 我们可以得到"
      (MB (&= (&det $A^t)
              (sum $sigma $
                   (&i* @sgnσ
                        (appl $A σ1 $1)
                        $..c
                        (appl $A σn $n)))))
      "当" (&= $i (ap (inv $sigma) $j)) "时, "
      (&= (appl $A (ap $sigma $i) $i)
          (appl $A $j (ap (inv $sigma) $j)))
      ", 因此"
      (MB (&= (&i* (appl $A σ1 $1)
                   $..c
                   (appl $A σn $n))
              (&i* (appl $A $1 (ap (inv $sigma) $1))
                   $..c
                   (appl $A $n (ap (inv $sigma) $n)))))
      "既然" (&i* $sigma (inv $sigma)) "是恒等置换, 那么"
      (MB (&= (&i* @sgnσ (@ (&sgn (inv $sigma)))) $1)
          "或"
          (&= (&sgn (@ (inv $sigma))) (&sgn (@ $sigma))))
      "而且, 当" $sigma "遍历所有" $n "阶置换时, " (inv $sigma)
      "也遍历了所有的" $n "阶置换. 因此,"
      (MB (deriv (&det $A^t)
                 (sum $sigma $
                      (&i* (@ (&sgn (inv $sigma)))
                           (appl $A $1 (ap (inv $sigma) $1))
                           $..c
                           (appl $A $n (ap (inv $sigma) $n))))
                 detA))
      "证明完毕.")
   (P "在特定场合, 读者需要计算特定的行列式. 当不得不进行计算时, 以下事实往往是很有用的. "
      "如果" $B "是由" $A "通过将某一行的倍数加到另一行上去 (或者将某一列的倍数加到"
      "另一列上去) 得到的, 那么"
      (MB (&= (&det $B) detA))
      "我们将证明关于行的陈述. 令" $B "是" $A "由加" (&i* $c $alpha_j) "到"
      $alpha_i "上得到的, 其中" (&!= $i $j) ". "
      "[译注: 原文是" (&< $i $j) ", 疑有误.] "
      "既然" $det "对于第" $i "行是线性的, 那么"
      (MB (deriv (&det $B)
                 (&+ detA
                     (&i* $c (appl $det $alpha_1 $..h $alpha_j
                                   $..h $alpha_j $..h $alpha_n)))
                 detA))
      "[译注: 当然这也用到交错性.]")
   (P "另一个有用的事实如下. 设我们拥有一个分块形式的" n*n "矩阵"
      (MB (Mat ($A $B) ($0 $C)))
      "其中" $A "是一个" (&c* $r $r) "的矩阵, 而" $C "是一个" (&c* $s $s)
      "的矩阵, " $B "是一个" (&c* $r $s) "矩阵, " $0 "是一个" (&c* $s $r)
      "的零矩阵, 那么"
      (MB (&= (ap $det (Mat ($A $B) ($0 $C)))
              (&i* (&det0 $A) (&det0 $C))))
      "为了证明这个, 我们定义"
      (MB (&= (appl $D $A $B $C) (ap $det (Mat ($A $B) ($0 $C)))))
      "如果我们固定" $A "和" $B ", 那么" $D "对于" $C "的行而言是一个交错的" $s
      "线性函数. 因此, 根据定理2,"
      (MB (&= (appl $D $A $B $C) (&i* (&det0 $C) (appl $D $A $B $I))))
      "其中" $I "是" (&c* $s $s) "的恒等矩阵. 通过给" $B "的行减去" $I
      "的行的倍数, 我们得到了"
      (MB (&= (appl $D $A $B $I) (appl $D $A $0 $I)))
      "现在" (appl $D $A $0 $I) "显然对于" $A "的行是一个交错的" $r "线性函数, 因此"
      (MB (&= (appl $D $A $0 $I) (&i* (&det0 $A) (appl $D $I $0 $I))))
      "但是" (&= (appl $D $I $0 $I) $1) ", 于是"
      (MB (deriv (appl $D $A $B $C)
                 (&i* (&det0 $C) (appl $D $A $B $I))
                 (&i* (&det0 $C) (appl $D $A $0 $I))
                 (&i* (&det0 $C) (&det0 $A))))
      "通过类似的论证, 或者通过转置, 可以得到"
      (MB (&= (ap $det (Mat ($A $0) ($B $C)))
              (&i* (&det0 $A) (&det0 $C)))))
   ((example #:n "6")
    "设" $K "是有理数域, 我们希望计算" (&c* $4 $4) "矩阵"
    (MB (&= $A (Mat ($1 $-1 $2 $3)
                    ($2 $2 $0 $2)
                    ($4 $1 $-1 $-1)
                    ($1 $2 $3 $0))))
    "的行列式." (Br)
    "通过给第" (&cm $2 $3 $4) "行减去第" $1 "行的适当倍数, 我们就得到了"
    (MB (Mat ($1 $-1 $2 $3)
             ($0 $4 $-4 $-4)
             ($0 $5 $-9 (&- 13))
             ($0 $3 $1 $-3)))
    "我们知道其与" $A "有着相同的行列式. 如果我们给第" $3 "行减去" 5/4
    "倍的第" $2 "行, 给第" $4 "行减去" 3/4 "倍的第" $2 "行, 就得到了"
    (MB (&= $B (Mat ($1 $-1 $2 $3)
                    ($0 $4 $-4 $-4)
                    ($0 $0 $-4 $-8)
                    ($0 $0 $4 $0))))
    "又一次, 我们知道" (&= (&det $B) detA) ". " $B "的分块形式告诉我们"
    (MB (&= detA (&det $B)
            (&i* (Det ($1 $-1) ($0 $4))
                 (Det ($-4 $-8) ($4 $0)))
            (&c* $4 32)
            128)))
   (P "现在我们令" (&> $n $1) ", 令" $A "是" $K "上的" n*n "矩阵. "
      "在定理1中, 我们呈现了如何从" (&c* (@- $n $1) (@- $n $1))
      "矩阵上的行列式函数构造" n*n "矩阵上的行列式函数. "
      "既然现在我们已经证明了行列式的唯一性, 这告诉我们, 如果固定列数" $j ", 那么"
      (MB (&= detA
              (sum (&= $i $1) $n
                   (&i* (^ (@ $-1) (&+ $i $j))
                        Aij
                        (ap $det (bra0 (subm $A $i $j)))))))
      "标量" (&i* (^ (@ $-1) (&+ $i $j)) (ap $det (bra0 (subm $A $i $j))))
      "通常被称为" $A "的" (&cm $i $j) "代数余子式, 或者" $A "的第" $i "行" $j "列"
      "的代数余子式. [译注: &quot;代数余子式&quot;的英文是&quot;cofactor&quot;.] "
      "那么, 以上关于" detA "的公式被称为" detA "按第" $j "列的代数余子式展开 "
      "(有的时候也被称为按第" $j "列的余子式 (minor) 展开). 如果我们令"
      (MB (&= (mref $C $i $j)
              (&i* (^ (@ $-1) (&+ $i $j)) (ap $det (bra0 (subm $A $i $j))))))
      "那么以上公式即对于每个" $j ","
      (MB (&= detA
              (sum (&= $i $1) $n (&i* Aij (mref $C $i $j)))))
      "其中代数余子式" (mref $C $i $j) "为" (^ (@ $-1) (&+ $i $j)) "乘上一个"
      (&c* (@- $n $1) (@- $n $1)) "矩阵的行列式, 这个矩阵是由" $A
      "删去第" $i "行和第" $j "列得到的.")
   (P "如果" (&!= $j $k) ", 那么"
      (MB (&= (sum (&= $i $1) $n (&i* (mref $A $i $k) (mref $C $i $j))) $0))
      "这是因为, 如果将" $A "的第" $j "列替换以第" $k "列, 并称结果为" $B ", 那么"
      $B "有相等的两列, 于是" (&= (&det $B) $0) ". 既然"
      (&= (subm $B $i $j) (subm $A $i $j)) ", 我们有"
      (MB (deriv $0 (&det $B)
                 (sum (&= $i $1) $n
                      (&i* (^ (@ $-1) (&+ $i $j))
                           (mref $B $i $j)
                           (ap $det (bra0 (subm $B $i $j)))))
                 (sum (&= $i $1) $n
                      (&i* (^ (@ $-1) (&+ $i $j))
                           (mref $A $i $k)
                           (ap $det (bra0 (subm $A $i $j)))))
                 (sum (&= $i $1) $n
                      (&i* (mref $A $i $k) (mref $C $i $j)))))
      "代数余子式的这些性质可以被总结为"
      (MB (&= (sum (&= $i $1) $n
                   (&i* (mref $A $i $k) (mref $C $i $j)))
              (&i* (_ $delta (&cm $j $k)) detA))))
   (P n*n "矩阵" (ap (Mi "adj") $A) ", 其是" $A "的代数余子式的矩阵的转置, "
      "被称为" $A "的古典伴随, 因此"
      (MB (&= (mref (&adj $A) $i $j)
              (mref $C $j $i)
              (&i* (^ (@ $-1) (&+ $i $j))
                   (ap $det (bra0 (subm $A $j $i))))))
      "那么以上关于代数余子式的性质, 可以被转写成以下形式."
      (MB (&= (&i* (&adj $A) $A) (&i* (&det0 $A) $I)))
      "我们也希望看到"
      (&= (&i* $A (&adj $A)) (&i* (&det0 $A) $I))
      ". 既然" (&= (subm $A^t $i $j) (^ (bra0 (subm $A $j $i)) $t)) ", 我们有"
      (MB (&= (&i* (^ (@ $-1) (&+ $i $j))
                   (ap $det (bra0 (subm $A^t $i $j))))
              (&i* (^ (@ $-1) (&+ $j $i))
                   (ap $det (bra0 (subm $A $j $i))))))
      "这简单说来就是" $A^t "的" (&cm $i $j) "代数余子式等于" $A "的"
      (&cm $j $i) "代数余子式. 因此,"
      (MB (&= (app $adj $A^t) (^ (&adj $A) $t)))
      "应用" (&= (&i* (&adj $A) $A) (&i* (&det0 $A) $I)) "于" $A^t ", 我们就得到"
      (MB (&= (&i* (&adj $A^t) $A^t)
              (&i* (&det0 $A^t) $I)
              (&i* (&det0 $A) $I)))
      "再进行转置"
      (MB (&= (&i* $A (^ (bra0 (app $adj $A^t)) $t)) (&i* (&det0 $A) $I)))
      "使用" (&= (app $adj $A^t) (^ (&adj $A) $t)) ", 我们得到了我们想要的"
      (MB (&= (&i* $A (&adj $A)) (&i* (&det0 $A) $I))))
   (P "就像域上的矩阵, 一个" $K "上的" n*n "矩阵被称为在" $K "上可逆, 如果存在" $K
      "上的" n*n "矩阵" (inv $A) "满足" (&= (&i* $A (inv $A)) (&i* (inv $A) $A) $I)
      ". 若逆矩阵存在, 则它是唯一的, 因为第1章使用的相同论证表明当"
      (&= (&i* $B $A) (&i* $A $C) $I) "时我们有" (&= $B $C) ". "
      "上面关于古典伴随的公式告诉我们以下关于" $K "上矩阵的可逆性的事实. "
      "如果" detA "在" $K "中具有乘法逆元, 那么" $A "是可逆的, 并且"
      (&= (inv $A) (&i* (inv (&det0 $A)) (&adj $A))) "是" $A "唯一的逆元. "
      "反过来说, 很容易看出来如果" $A "在" $K "上可逆, 那么" detA
      "在" $K "中可逆, 因为如果" (&= AB $I) ", 那么"
      (MB (&= $1 (&det $I) (&det AB) (&i* (&det0 $A) (&det0 $B))))
      "我们已经证明的是以下定理.")
   ((theorem #:n "4")
    "令" $A "是" $K "上的一个" n*n "矩阵, 那么" $A "是" $K "上的可逆矩阵当且仅当"
    detA "在" $K "中可逆. 当" $A "可逆的时候, " $A "唯一的逆元是"
    (MB (&= (inv $A) (&i* (inv (&det0 $A)) (&adj $A))))
    "特别地, 域上的" n*n "矩阵可逆当且仅当其行列式异于零.")
   (P "我们应该指出这个可逆性的行列式判则也证明了有左逆或右逆的" n*n "矩阵可逆. "
      "这个证明独立于我们在第1章中为域上的矩阵给出的. 我们还应该指出可逆性对于"
      "多项式环上的矩阵意味着什么. 如果" $K "是多项式环" polyF ", 那么"
      $K "中仅有的可逆元素是非零的标量多项式, 因为若" $f "和" $g "是多项式且有"
      (&= (&i* $f $g) $1) ", 那么" (&= (&+ (&deg $f) (&deg $g)) $0) ", 于是"
      (&= (&deg $f) (&deg $g) $0) ", 即" $f "和" $g "都是非零的标量多项式. 因此, "
      "一个多项式环" polyF "上的" n*n "矩阵在" polyF
      "上可逆当且仅当其行列式是一个非零的标量多项式.")
   ((example #:n "7")
    "令" (&= $K (&poly $RR)) ", 即实数域上的多项式环, 令"
    (MB (&cm (&= $A (Mat ((&+ $x^2 $x) (&+ $x $1))
                         ((&- $x $1) $1)))
             (&= $B (Mat ((&- $x^2 $1) (&+ $x $2))
                         ((&+ (&- $x^2 (&i* $2 $x)) $3) $x)))))
    "接着, 根据简单的计算, " (&= detA (&+ $x $1)) ", "
    (&= (&det $B) $-6) ". 因此, " $A "在" $K "上不可逆, 而" $B "在" $K "上可逆. "
    "注意到"
    (MB (&cm (&= (app $adj $A)
                 (Mat ($1 (&- (&- $x) $1))
                      ((&+ (&- $x) $1) (&+ $x^2 $x))))
             (&= (app $adj $B)
                 (Mat ($x (&- (&- $x) $2))
                      ((&- (&+ (&- $x^2) (&i* $2 $x)) $3) (&- $x^2 $1))))))
    "并且" (&= (&i* (&adj $A) $A) (&i* (@ (&+ $x $1)) $I)) ", "
    (&= (&i* (&adj $B) $B) (&i* $-6 $I)) ". 当然,"
    (MB (&= (inv $B)
            (&i* -1/6
                 (Mat ($x (&- (&- $x) $2))
                      ((&- (&+ (&- $x^2) (&i* $2 $x)) $3) (&- $x^2 $1))))))
    "[译注: 原文将" (&- $x^2 $1) "写成了" (&- $1 $x^2) ", 应该是笔误.]")
   ((example #:n "8")
    "令" $K "是整数环, 并且"
    (MB (&= $A (Mat ($1 $2) ($3 $4))))
    "那么" (&= detA $-2) ","
    (MB (&= (app $adj $A)
            (Mat ($4 $-2)
                 ($-3 $1))))
    "因此, " $A "作为一个整数环上的矩阵是不可逆的. 然而, 我们也可以将" $A
    "当成有理数域上的矩阵, 那么" $A "就可逆了, 并且"
    (MB (&= $A (&i* -1/2 (Mat ($4 $-2) ($-3 $1)))
            (Mat ($-2 $1) (3/2 -1/2))))
    "[译注: 原文将" -1/2 "写成了" $1/2 ", 应该是笔误.]")
   (P "与可逆矩阵有关, 我们想要提及一个更加初等的事实. 相似矩阵具有相同的行列式, 即若"
      $P "在" $K "上可逆, 并有" (&= $B (&i* (inv $P) $A $P)) ", 那么"
      (&= (&det $B) detA) ". 这很显然, 因为"
      (MB (&= (&det (&i* (inv $P) $A $P))
              (&i* (&det0 (inv $P)) (&det0 $A) (&det0 $P))
              detA))
      "这个简单的观察使得定义有限维向量空间上的线性算子的行列式是可能的. 如果" $T
      "是" $V "上的一个线性算子, 那么我们定义" $T "的行列式为任何在" $V "的某个有序基下"
      "表示" $T "的" n*n "矩阵的行列式. 因为这样的矩阵都是相似的, 所以我们的定义是"
      "有意义的. 在此联系之下, 看看第5.3节的练习11.")
   (P "现在我们想要讨论以下求解线性方程组的Cramer法则. 设" $A "是一个域" $F
      "上的" n*n "矩阵, 我们想要求解线性方程组" AX=Y ", 对于某个给定的" $n "元组"
      (tu0 $y_1 $..h $y_n) ". 若" AX=Y ", 那么"
      (MB (&= (&i* (&adj $A) $A $X) (&i* (&adj $A) $Y)))
      "于是"
      (MB (&= (&i* (&det0 $A) $X) (&i* (&adj $A) $Y)))
      "因此"
      (MB (deriv (&i* (&det0 $A) $x_j)
                 (sum (&= $i $1) $n
                      (&i* (mref (&adj $A) $j $i) $y_i))
                 (sum (&= $i $1) $n
                      (&i* (^ (@ $-1) (&+ $i $j))
                           $y_i
                           (ap $det (bra0 (subm $A $i $j)))))
                 ))
      "最后一个表达式的值是由将" $A "的第" $j "列替换为" $Y "得到的" n*n "矩阵的行列式. "
      "如果" (&= detA $0) ", 那么它什么也没有告诉我们. 然而, 若" (&!= detA $0)
      ", 那么我们就得到了所谓的Cramer法则. 令" $A "是一个域" $F "上的" n*n "矩阵满足"
      (&!= detA $0) ", 如果" (&cm $y_1 $..h $y_n) "是" $F "中任意的标量, 那么"
      "线性方程组" AX=Y "的唯一解" (&= $X (&i* (inv $A) $Y)) "由"
      (MB (&cm (&= $x_j (~ (&det $B_j) detA))
               (&= $j (&cm $1 $..h $n))))
      "给出, 其中" $B_j "是由将" $A "的第" $j "列替换为" $Y "得到的" n*n "矩阵.")
   (P "在本章的末尾, 我们想要作出一些评注, 以将行列式置于我们所认为的适当位置. "
      "我们时常不得不计算一些特定的行列式, 而本节的很大一部分是在处理相关的技巧. "
      "然而, 在本书之中, 行列式的主要地位是理论性的. "
      "这不是要否认某些结果的漂亮, 例如Cramer法则. 但是对于求解线性方程组而言Cramer法则"
      "是一个并不有效的工具, 主要是因为它牵扯太多的计算. "
      "因此, 读者应该关注Cramer法则说了什么, 而不是如何利用它进行计算. "
      "的确, 在回顾整个章节的时候, 我们希望读者将更多的精力放在理解行列式函数是什么以及"
      "它具有怎样的行为上, 而不是计算特定矩阵的行列式. "
      "[译注: 的确这不是本章的末尾, 但是原文的确使用的是&quot;chapter&quot;, "
      "这大概是因为后文是之后补充的高级部分.]")
   ((exercise #:n "1")
    "使用古典伴随公式计算下列" (&c* $3 $3) "实矩阵的逆."
    (MB (&cm (Mat ($-2 $3 $2)
                  ($6 $0 $3)
                  ($4 $1 $-1))
             (Mat ((&cos $theta) $0 (&- (&sin $theta)))
                  ($0 $1 $0)
                  ((&sin $theta) $0 (&cos $theta)))
             ))
    )
   ((exercise #:n "2")
    "使用Cramer法则计算下列每个有理数域上的线性方程组的解."
    (Ol #:attr* '((type "a"))
        (Li (MB
             (Ttle
              (Choice
               ($x $+ $y $+ $z $= 11)
               ((&i* $2 $x) $- (&i* $6 $y) $- $z $= $0)
               ((&i* $3 $x) $+ (&i* $4 $y) $+ (&i* $2 $z) $= $0)))))
        (Li (MB
             (Ttle
              (Choice
               ((&i* $3 $x) $- (&i* $2 $y) $= $7)
               ((&i* $3 $y) $- (&i* $2 $z) $= $6)
               ((&i* $3 $z) $- (&i* $2 $x) $= $-1)))))))
   ((exercise #:n "3")
    "一个域" $F "上的" n*n "矩阵" $A "被称为斜对称的, 如果" (&= $A^t (&- $A))
    ". 如果" $A "是一个复数域上的" n*n "的斜对称矩阵, 并且" $n "是奇数, 证明"
    (&= detA $0) ".")
   ((exercise #:n "4")
    "一个域" $F "上的" n*n "矩阵" $A "被称为正交的, 如果" (&= (&i* $A $A^t) $I)
    ". 如果" $A "是正交的, 证明" (&= detA (&+- $1)) ". 给出一个正交矩阵" $A
    "的例子, 其行列式" (&= detA $-1) ".")
   ((exercise #:n "5")
    "一个复数域上的" n*n "矩阵被称为是酉的 (unitary), 如果" (&= (&i* $A (ctrans $A)) $I)
    " (" (ctrans $A) "代表" $A "的共轭转置). 如果" $A "是酉矩阵, 证明"
    (&= (&abs detA) $1) ".")
   ((exercise #:n "6")
    "令" $T "和" $U "是有限维向量空间" $V "上的线性算子, 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&det (&i* $T $U)) (&i* (&det0 $T) (&det0 $U))) ";")
        (Li $T "可逆当且仅当" (&!= (&det $T) $0) ".")))
   ((exercise #:n "7")
    "令" $A "是一个含幺交换环" $K "上的" n*n "矩阵, 设" $A "具有分块形式"
    (MB (&= $A (Mat ($A_1 $0 $..c $0)
                    ($0 $A_2 $..c $0)
                    ($..v $..v $ $..v)
                    ($0 $0 $..c $A_k))))
    "其中" $A_j "是一个" (&c* $r_j $r_j) "矩阵. 证明"
    (MB (&= detA (&i* (&det0 $A_1) (&det0 $A_2) $..c (&det0 $A_k))))
    )
   ((exercise #:n "8")
    "令" $V "是域" $F "上的" n*n "矩阵构成的向量空间, 令" $B "是" $V
    "的一个固定元素. 令" $T_B "是一个" $V "上的线性算子, 由"
    (&= (app $T_B $A) (&- AB (&i* $B $A))) "定义. 证明"
    (&= (&det $T_B) $0) ".")
   ((exercise #:n "9")
    "令" $A "是域" $F "上的一个" n*n "矩阵, 并且" (&!= $A $0) ". "
    "如果" $r "是一个" $1 "和" $n "之间的正整数, 那么" $A "的" (&c* $r $r)
    "子矩阵是由" $A "删去" (@- $n $r) "行和" (@- $n $r) "列得到的. "
    $A "的行列式秩是最大的正整数" $r ", 满足存在" $A "的某个" (&c* $r $r)
    "子矩阵其行列式不为零. 证明" $A "的行列式秩等于" $A "的行秩, 当然也等于" $A "的列秩.")
   ((exercise #:n "10")
    "令" $A "是一个域" $F "上的" n*n "矩阵. 证明至多存在" $n "个不同的标量" $c
    "满足" (&= (&det (&- (&i* $c $I) $A)) $0) ".")
   ((exercise #:n "11")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵. 证明如果" $A "可逆, 那么至多存在" $n
    "个不同的标量" $c "使得矩阵" (&+ (&i* $c $A) $B) "不可逆.")
   ((exercise #:n "12")
    "如果" $V "是域" $F "上的" n*n "矩阵的向量空间, " $B "是" $F "上一个固定的" n*n
    "矩阵, 令" $L_B "和" $R_B "是" $V "上的线性算子, 由"
    (&= (app $L_B $A) (&i* $B $A)) "和" (&= (app $R_B $A) AB) "定义. 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&det $L_B) (^ (&det0 $B) $n)) ";")
        (Li (&= (&det $R_B) (^ (&det0 $B) $n)) ".")))
   ((exercise #:n "13")
    "令" $V "是复数域上所有的" n*n "矩阵构成的向量空间, 令" $B "是" $CC "上一个固定的"
    n*n "矩阵. 由" (&= (app $M_B $A) (&i* $B $A (ctrans $B)))
    "定义一个" $V "上的线性算子" $M_B ", 其中"
    (&= (ctrans $B) (OverBar $B^t)) ". 证明"
    (MB (&= (&det $M_B) (^ (&abs (&det $B)) (&i* $2 $n))))
    "现在令" $H "是" $V "中所有的Hermite矩阵构成的集合, 称" $A "是Hermite的, 如果"
    (&= $A (ctrans $A)) ", 那么" $H "是实数域上的一个向量空间. "
    "证明由" (&= (app $T_B $A) (&i* $B $A (ctrans $B))) "定义的函数" $T_B
    "实向量空间" $H "上的一个线性算子, 并证明"
    (&= (&det $T_B) (^ (&abs (&det $B)) (&i* $2 $n))) ". "
    "(提示: 计算" $T_B "的时候表明" $V "具有一个由Hermite矩阵构成的基, 然后证明"
    (&= (&det $T_B) (&det $M_B)) ".)")
   ((exercise #:n "14")
    "令" (&cm $A $B $C $D) "是域" $F "上" n*n "的可交换矩阵, 证明"
    (&c* (&i* $2 $n) (&i* $2 $n)) "矩阵"
    (MB (Mat ($A $B)
             ($C $D)))
    "的行列式为" (&det (&- (&i* $A $D) (&i* $B $C))) ".")
   (H3 "第5.5节 模")
   (P "如果" $K "是一个含幺交换环 [译注: 本章的剩余部分, 凡提到含幺交换环, 均默认是非平凡的], 一个"
      $K "上的模是一种表现得类似于向量空间的代数系统, "
      "其中" $K "扮演着类似于标量域的角色. 为了精确起见, 我们称" $V "是一个" $K "上的模 "
      "(或者一个" $K "模) 如果"
      (Ol (Li $V "上存在一个加法" (&\|-> (tu0 $alpha $beta) (&+ $alpha $beta)) ", "
              $V "在其下是一个交换群;")
          (Li "存在一个乘法" (&\|-> (tu0 $c $alpha) (&i* $c $alpha)) ", 其中"
              $alpha "在" $V "之中, " $c "在" $K "之中, 满足"
              (MB ((Ttable (lambda (d i j)
                             (cond ((= j 0) (set-attr* d 'columnalign "right"))
                                   ((= j 2) (set-attr* d 'columnalign "left"))
                                   (else d))))
                   (&Table
                    ((&i* (@ (&+ $c_1 $c_2)) $alpha)
                     $=
                     (&+ (&i* $c_1 $alpha) (&i* $c_2 $alpha)))
                    ((&i* $c (@ (&+ $alpha_1 $alpha_2)))
                     $=
                     (&+ (&i* $c $alpha_1)
                         (&i* $c $alpha_2)))
                    ((&i* (@ (&i* $c_1 $c_2)) $alpha)
                     $=
                     (&i* $c_1 (@ (&i* $c_2 $alpha))))
                    ((&i* $1 $alpha) $= $alpha)))))))
   (P "对于我们而言, 最重要的" $K "模是" $n "元组的模" $K^n ". 矩阵模" (^ $K m*n)
      "也很重要. 如果" $V "是一个模, 我们可以讨论线性组合, 线性相关和线性无关, 就像在向量空间里一样. "
      "我们必须小心不将依赖于非零标量的可逆性的向量空间的结果应用于" $V
      ", 因为在域中可以施行的除法不一定在环" $K "中可以进行. 例如, 如果"
      (&cm $alpha_1 $..h $alpha_k) "是线性相关的, 我们不能断言某个" $alpha_i
      "可以被表示为其他元素的线性组合. 这使得在模中寻找基变得更加困难.")
   (P "模" $V "的一个基是一个线性无关的子集, 其可以张成 (或者说生成) 这个模. "
      "这与我们对于向量空间给出的定义是一样的. 一个基" $BBB "的重要性质在于每个" $V
      "的元素都可以被唯一地表示为" $BBB "的 (有限数目的) 元素的线性组合. 如果承认选择公理 (见附录) 的话, "
      "那么可以证明每个向量空间都拥有一个基. 读者已经很清楚若是一个向量空间可由有限数目的向量张成, 那么"
      "它肯定拥有一个基, 但是对于模来说这并非如此. 因此, 对于拥有基的模和可由有限数目的元素张成的模, "
      "我们需要特别的不同名字.")
   ((definition)
    $K "模" $V "被称为一个自由模, 如果它拥有一个基. 如果" $V "拥有一个有限的基, 其包含" $n "个元素, 那么"
    $V "被称为具有" $n "个生成元的自由" $K "模.")
   ((definition)
    "模" $V "是有限生成的, 如果它包含一个能够张成" $V "的有限子集. 一个有限生成模的秩是使得某" $k
    "个元素能够张成" $V "的最小整数" $k ".")
   (P "我们需要强调一个模在没有有限的基的情况下仍然可能是有限生成的. 如果" $V "是一个具有"
      $n "个生成元的自由" $K "模, 那么" $V "同构于模" $K^n ". 如果" (setE $beta_1 $..h $beta_n) "是" $V
      "的一个基, 那么存在一个同构, 将向量" (&+ (&i* $c_1 $beta_1) $..c (&i* $c_n $beta_n)) "送至" $K^n
      "中的" $n "元组" (tu0 $c_1 $..h $c_n) ". 我们并不能立即看出来这相同的模" $V "不能也是一个具有"
      $k "个生成元的自由模, 其中" (&!= $k $n) ". 换句话说, " $V "的任意两个基都必然包含相同数目的元素"
      "并非显然的事实, 而其证明是行列式的一个有趣应用.")
   ((theorem #:n "5")
    "令" $K "是一个含幺交换环, 如果" $V "是一个具有" $n "个生成元的自由" $K "模, 那么" $V "的秩是" $n ".")
   ((proof)
    "我们要证明的是" $V "不能由少于" $n "个它的元素张成. 既然" $V "同构于" $K^n ", 我们必须证明, 如果"
    (&< $m $n) ", 那么模" $K^n "不能由" $n "元组" (&cm $alpha_1 $..h $alpha_m) "张成. 令" $A "是以"
    (&cm $alpha_1 $..h $alpha_m) "为行的矩阵. 假设标准基向量" (&cm $epsilon_1 $..h $epsilon_n) "都是"
    (&cm $alpha_1 $..h $alpha_m) "的线性组合, 那么存在矩阵" (&in $P (^ $K (&c* $n $m))) "使得"
    (MB (&= (&i* $P $A) $I))
    "其中" $I "是" n*n "的恒等矩阵. 令" (&~~ $A) "是一个" n*n "的矩阵, 其由" $A "往底部再填充"
    (&- $n $m) "个零行得到. 令" (&~~ $P) "是任意的以" $P "的列为前" $m "列的" n*n "矩阵. 那么,"
    (MB (&= (&i* (&~~ $P) (&~~ $A)) $I) ".")
    "因此, " (&!= (&det (&~~ $A)) $0) ". 但是, 既然" (&< $m $n) ", " (&~~ $A) "至少有一行全为零. "
    "这个矛盾表明" (&cm $alpha_1 $..h $alpha_m) "不能张成" $K^n
    ". [译注: 这里的证明用到了" (&!= $0 $1) ", 也就是说, 排除了平凡环的情况. 另请读者参考维基百科条目"
    (A "invariant basis number" #:attr* '((href "https://en.wikipedia.org/wiki/Invariant_basis_number"))) ".]")
   (P "有趣的是, 读者应该注意到定理5建立了(有限维)向量空间的维数的唯一性. 而且, "
      "这个基于行列式函数的存在性的证明, 与我们第2章所给出的证明截然不同. 从定理5我们知道"
      "&quot;秩为" $n "的自由模&quot;和&quot;具有" $n "个生成元的自由模&quot;是一样的.")
   (P "如果" $V "是" $K "上的一个模, 那么对偶模" V* "由所有从" $V "到" $K "的线性函数"
      $f "构成. 如果" $V "是秩为" $n "的自由模, 那么" V* "也是秩为" $n "的自由模. 这个事实的"
      "证明就和向量空间一样. 如果" (setE $beta_1 $..h $beta_n) "是" $V "的一个有序基, 那么存在与之对应的"
      V* "的对偶基" (setE $f_1 $..h $f_n) ". 函数" $f_i "赋予每个" (&in $alpha $V) "以其相对于"
      (setE $beta_1 $..h $beta_n) "的第" $i "个坐标分量:"
      (MB (&= $alpha (LC0 (app $f_1 $alpha) $beta_1 (app $f_n $alpha) $beta_n)) ".")
      "如果" $f "是" $V "上的一个线性函数, 那么"
      (MB (&= $f (LC0 (app $f $beta_1) $f_1 (app $f $beta_n) $f_n)) "."))
   (H3 "第5.6节 多线性函数")
   (P "本节的目的在于将关于行列式的讨论置于我们所相信的正确视角之下. 我们将处理模上的"
      "交错多线性形式. 这些形式是我们之前呈现的行列式的自然泛化. 还没有阅读 (或者不希望"
      "阅读) 第5.5节对于模的简要总结的读者仍可从学习本节中获益良多, 只要一致地将&quot;"
      $K "上秩为" $n "的自由模&quot;读作&quot;" $F "上维数为" $n "的向量空间&quot;即可.")
   (P "令" $K "是一个含幺交换环, " $V "是" $K "上的一个模. 如果" $r "是一个正整数, 那么从"
      (&= $V^r (&c* $V $V $..c $V)) "到" $K "的函数" $L "被称为多线性的, 如果"
      (appl $L $alpha_1 $..h $alpha_r) "对于每个" $alpha_i "在其他" $alpha_j
      "的值固定的情况下是线性的函数. 也就是说, 对于每个" $i "有"
      (MB (&= (appl $L $alpha_1 $..h (LC $c $alpha_i $beta_i) $..h $alpha_r)
              (LC $c (appl $L $alpha_1 $..h $alpha_i $..h $alpha_r)
                  (appl $L $alpha_1 $..h $beta_i $..h $alpha_r))) ".")
      $V^r "上的多线性函数也被称为" $V "上的" $r "线性形式或者" $V "上的阶数为" $r
      "的多线性形式. 这样的函数有时也被称为" $V "上的" $r "张量. " $V^r
      "上所有多线性形式的集合将被记成" (app $M^r $V) ". 如果" (∈ $L $M (app $M^r $V))
      ", 那么其和" (&+ $L $M) ":"
      (MB (&= (appl (@+ $L $M) $alpha_1 $..h $alpha_r)
              (&+ (appl $L $alpha_1 $..h $alpha_r)
                  (appl $M $alpha_1 $..h $alpha_r))))
      "也是多线性的; 并且, 如果" (∈ $c $K) ", 那么积" (&i* $c $L) ":"
      (MB (&= (appl (@i* $c $L) $alpha_1 $..h $alpha_r)
              (&i* $c (appl $L $alpha_1 $..h $alpha_r))))
      "是多线性的. 因此, " (app $M^r $V) "是一个" $K "模&mdash;&mdash;所有从" $V^r
      "到" $K "的函数构成的模的一个子模.")
   (P "如果" (&= $r $1) ", 那么我们有" (&= (app $M^1 $V) V*) ", 即由线性函数构成的"
      $V "的对偶模. 线性函数也可被用来构造更高阶的多线性形式. 如果" (&cm $f_1 $..h $f_r)
      "是" $V "上的线性函数, 那么"
      (MB (&= (appl $L $alpha_1 $..h $alpha_r)
              (&i* (app $f_1 $alpha_1) (app $f_2 $alpha_2) $..c (app $f_r $alpha_r))))
      "显然是" $V "上的一个" $r "线性形式.")
   ((example #:n "9")
    "如果" $V "是一个模, 那么" $V "上的" $2 "线性形式也常被称为" $V "上的双线性形式 (bilinear form). 令"
    $A "是一个元素来源于" $K "的" n*n "矩阵, 那么"
    (MB (&= (appl $L $X $Y) (&i* $Y^t $A $X)))
    "定义了模" (^ $K n*1) "上的一个双线性形式" $L ". 类似地,"
    (MB (&= (appl $M $alpha $beta) (&i* $alpha $A $beta^t)))
    "定义了一个" $K^n "上的双线性形式" $M ". [译注: 你需要将" (^ $K (&c* $1 $1))
    "和" $K "通过自然的同构视为等同的.]")
   ((example #:n "10")
    "行列式函数将" $K "上的每个" n*n "矩阵与元素" (&in (&det $A) $K) "联系起来. 若"
    (&det $A) "被视为" $A "的行的函数:"
    (MB (&= (&det $A) (appl $D $alpha_1 $..h $alpha_n)))
    "那么" $D "是" $K^n "上的一个" $n "线性形式.")
   ((example #:n "11")
    "很容易得到模" $K^n "上的一般的" $r "线性形式的代数表达式. 如果向量" (∈ $alpha_1 $..h $alpha_r $V)
    "而" $A "是以" (&cm $alpha_1 $..h $alpha_r) "为行的" (&c* $r $n) "矩阵, 那么对于任意的函数"
    (∈ $L (app $M^r $K^n)) "有"
    (MB (deriv (appl $L $alpha_1 $..h $alpha_r)
               (ap $L (tup (sum (&= $j $1) $n (&i* (mref $A $1 $j) $epsilon_j))
                           $alpha_2 $..h $alpha_r))
               (sum (&= $j $1) $n
                    (&i* (mref $A $1 $j)
                         (appl $L $epsilon_j $alpha_2 $..h $alpha_r)))
               (sum (&= $j $1) $n
                    (&i* (mref $A $1 $j)
                         (ap $L (tup $epsilon_j
                                     (sum (&= $k $1) $n (&i* (mref $A $2 $k) $epsilon_k))
                                     $alpha_3 $..h $alpha_r))))
               (sum (&= $j $1) $n
                    (sum (&= $k $1) $n
                         (&i* (mref $A $1 $j)
                              (mref $A $2 $k)
                              (appl $L $epsilon_j $epsilon_k $alpha_3 $..h $alpha_r))))
               (sum (&= (&cm $j $k) $1) $n
                    (&i* (mref $A $1 $j)
                         (mref $A $2 $k)
                         (appl $L $epsilon_j $epsilon_k $alpha_3 $..h $alpha_r)))))
    "如果我们将" (&cm $alpha_3 $..h $alpha_r) "依次替换以其标准基向量下的线性组合, 并且记"
    (mref $A $i $j) "为" (appl $A $i $j) ", 那么我们得到了以下表达式:"
    (MB (&= (appl $L $alpha_1 $..h $alpha_r)
            (sum (&= (&cm $j_1 $..h $j_r) $1) $n
                 (&i* (appl $A $1 $j_1) $..c (appl $A $r $j_r)
                      (appl $L (_ $epsilon $j_1) $..h (_ $epsilon $j_r))))) ".")
    "此表达式中, 每个分量为从" $1 "至" $n "的正整数的" $r "元组" (&= $J (tu0 $j_1 $..h $j_r))
    "与一个项相对应. 这样的" $r "元组有" $n^r "个. 因此, " $L "完全由该表达式以及赋给"
    $n^r "个元素" (tu0 (_ $epsilon $j_1) $..h (_ $epsilon $j_r)) "的特定值:"
    (MB (&= $c_J (appl $L (_ $epsilon $j_1) $..h (_ $epsilon $j_r))))
    "决定. 也很容易看出以下事实, 如果我们为每个" $r "元组" $J "挑选一个元素" (∈ $c_J $K) ", 那么"
    (MB (&= (appl $L $alpha_1 $..h $alpha_r)
            (sum $J $ (&i* (appl $A $1 $j_1) $..c (appl $A $r $j_r) $c_J))))
    "定义了一个" $K^n "上的" $r "线性形式.")
   (P "设" $L "是" $V^r "上的一个多线性形式而" $M "是" $V^s "上的一个多线性形式. 我们定义"
      (^ $V (&+ $r $s)) "上的函数" (&t* $L $M) "为"
      (MB (&= (appl (@t* $L $M) $alpha_1 $..h (_ $alpha (&+ $r $s)))
              (&i* (appl $L $alpha_1 $..h $alpha_r)
                   (appl $M (_ $alpha (&+ $r $1)) $..h (_ $alpha (&+ $r $s))))) ".")
      "如果我们将" (^ $V (&+ $r $s)) "想成是" (&c* $V^r $V^s) ", 那么对于"
      (∈ $alpha $V^r) "和" (∈ $beta $V^s) "有"
      (MB (&= (appl (@t* $L $M) $alpha $beta) (&i* (app $L $alpha) (app $M $beta))) ".")
      "显然" (&t* $L $M) "在" (^ $V (&+ $r $s)) "是多线性的, 其被称为" $L "和" $M
      "的张量积 (tensor product). 张量积不是可交换的. 实际上, 除非" (&= $L $0) "或"
      (&= $M $0) ", " (&!= (&t* $M $L) (&t* $L $M)) ". 然而, 张量积的确与" $M^r "和"
      $M^s "中的模运算漂亮地联系在一起.")
   ((lemma)
    "令" (&cm $L $L_1) "是" $V "上的" $r "线性形式, " (&cm $M $M_1) "是" $V "上的" $s
    "线性形式, " $c "是" $K "的一个元素."
    (Ol #:attr* '((type "a"))
        (Li (&= (&t* (@LC $c $L $L_1) $M) (LC $c (@t* $L $M) (&t* $L_1 $M))) ";")
        (Li (&= (&t* $L (@LC $c $M $M_1)) (LC $c (@t* $L $M) (&t* $L $M_1))) ".")))
   ((proof) "留作练习.")
   (P "张量积的确是可结合的, 例如, 令" (&cm $L $M $N) "分别是" $V "上的" (&cm $r $s $t)
      "线性形式, 那么"
      (MB (&assoc &t* $L $M $N) ".")
      "这从" $K "的乘法的结合律中可立即推出. 因此, 如果" (&cm $L_1 $..h $L_k)
      "是" (&cm (^ $V $r_1) $..h (^ $V $r_k)) "上的多线性函数, 那么张量积"
      (MB (&= $L (&t* $L_1 $..c $L_k)))
      "无歧义地被定义为" $V^r "上的一个多线性函数, 其中" (&= $r (&+ $r_1 $..c $r_k))
      ". 之前我们已经提及了它的一种特殊情形, 即如果" (&cm $f_1 $..h $f_r) "是" $V
      "上的线性函数, 那么张量积"
      (MB (&= $L (&t* $f_1 $..c $f_r)))
      "由"
      (MB (&= (appl $L $alpha_1 $..h $alpha_r)
              (&i* (app $f_1 $alpha_1) $..c (app $f_r $alpha_r))))
      "给出.")
   ((theorem #:n "6")
    "令" $K "是一个含幺交换环. 如果" $V "是一个秩为" $n "的自由" $K "模, 那么"
    (app $M^r $V) "是一个秩为" $n^r "的自由" $K "模. 实际上, 如果"
    (setE $f_1 $..h $f_n) "是对偶模" V* "的一个基, 那么" $n^r "个张量积"
    (MB (&cm (&t* (_ $f $j_1) $..c (_ $f $j_r))
             (&<= $1 $j_1 $n) $..h (&<= $1 $j_r $n)))
    "构成了" (app $M^r $V) "的一个基.")
   ((proof)
    "令" (setE $f_1 $..h $f_n) "是" V* "的一个有序基, 其对偶于" $V "的基"
    (setE $beta_1 $..h $beta_n) ". 对于每个向量" (&in $alpha $V) ", 我们有"
    (MB (&= $alpha (LC0 (app $f_1 $alpha) $beta_1 (app $f_n $alpha) $beta_n)) ".")
    "现在我们进行例子11所施行的计算. 如果" $L "是" $V "上的一个" $r "线性形式而"
    (&cm $alpha_1 $..h $alpha_r) "是" $V "的元素, 那么"
    (MB (&= (appl $L $alpha_1 $..h $alpha_r)
            (sum (&cm $j_1 $..h $j_r) $
                 (&i* (app (_ $f $j_1) $alpha_1) $..c (app (_ $f $j_r) $alpha_r)
                      (appl $L (_ $beta $j_1) $..h (_ $beta $j_r))))) ".")
    "换言之, 即"
    (MB (&= $L (sum (&cm $j_1 $..h $j_r) $
                    (&i* (appl $L (_ $beta $j_1) $..h (_ $beta $j_r))
                         (&t* (_ $f $j_1) $..c (_ $f $j_r))))) ".")
    "这表明由" $r "元组" (&= $J (tu0 $j_1 $..h $j_r)) "给出的" $n^r "个张量积"
    (MB (&= $E_J (&t* (_ $f $j_1) $..c (_ $f $j_r))))
    "可以张成模" (app $M^r $V) ". 我们也可看出这些" $r "形式" $E_J "是线性无关的. 设对于每个"
    $J "我们有一个元素" (∈ $c_J $K) ", 然后我们构造多线性函数"
    (MB (&= $L (sum $J $ (&i* $c_J $E_J))) ".")
    "注意到如果" (&= $I (tu0 $i_1 $..h $i_r)) ", 那么"
    (MB (&= (appl $E_J (_ $beta $i_1) $..h (_ $beta $i_r))
            (Choice0
             ($0 ",&nbsp;" (&!= $I $J))
             ($1 ",&nbsp;" (&= $I $J)))))
    "因而我们看到"
    (MB (&= $c_I (appl $L (_ $beta $i_1) $..h (_ $beta $i_r))) ".")
    "特别地, 如果" (&= $L $0) ", 那么对于每个" $r "元组" $I "都有" (&= $c_I $0) ".")
   ((definition)
    "令" $L "是" $K "模" $V "上的一个" $r "线性形式. 我们称" $L "是交错的, 如果每当"
    (&cm (&= $alpha_i $alpha_j) (&!= $i $j)) "时有" (&= (appl $L $alpha_1 $..h $alpha_r) $0) ".")
   (P "如果" $L "是" $V^r "上的一个交错多线性函数, 那么"
      (MB (&= (appl $L $alpha_1 $..h $alpha_i $..h $alpha_j $..h $alpha_r)
              (&- (appl $L $alpha_1 $..h $alpha_j $..h $alpha_i $..h $alpha_r))) ".")
      "换言之, 交换" $r "元组" (tu0 $alpha_1 $..h $alpha_r) "中两个(不同下标的)向量, 那么与之关联的"
      $L "的值会改变符号 (sign). 既然每个置换" $sigma "都是交换之积, 我们看出"
      (&= (appl $L (_ $alpha σ1) $..h (_ $alpha (ap $sigma $r)))
          (&i* (@sgn $sigma) (appl $L $alpha_1 $..h $alpha_r))) ".")
   (P "我们用" (Alt $r) "表示" $V "上所有交错" $r "线性形式构成的集合. 显然" (Alt $r) "是"
      (app $M^r $V) "的一个子模.")
   ((example #:n "12")
    "本章的早些时候, 我们证明了模" $K^n "上恰存在一个交错" $n "线性形式" $D "满足性质"
    (&= (appl $D $epsilon_1 $..h $epsilon_n) $1) ". 我们也在定理2中证明了如果形式" (∈ $L (Alt $n $K^n))
    ", 那么"
    (MB (&= $L (&i* (appl $L $epsilon_1 $..h $epsilon_n) $D)) ".")
    "换言之, " (Alt $n $K^n) "是一个秩为" $1 "的自由" $K "模. 我们也建立了" $D "的显式公式. "
    "基于我们现在所使用的记号, 其可以记成"
    (MB (&= $D (sum $sigma $ (&i* (@sgn $sigma) (&t* (_ $f σ1) $..c (_ $f σn))))))
    "其中" (&cm $f_1 $..h $f_n) "是" $K^n "上的标准坐标函数而其和布于所有集合" (setE $1 $..h $n)
    "的" (&fact $n) "个不同置换" $sigma "之上. "
    )
   (H3 "第5.7节 Grassman环")
   
   (H2 "第6章 初等标准形式")
   (H3 "第6.1节 引论")
   (P "之前我们已经提过我们的主要目的在于研究有限维向量空间上的线性变换. "
      "到目前为止, 我们已经见过了许多线性变换的特殊例子, 并且证明了一些"
      "关于一般线性变换的定理. 在有限维的情形我们利用有序基通过矩阵来表示"
      "这样的变换, 这种表示增添了我们对于其行为的直觉. 我们探索了向量空间"
      (&L $V $W) ", 其由从一个向量空间到另一个的线性变换构成. 我们也探索了"
      (&L $V $V) ", 其由从一个向量空间到自身的线性变换构成.")
   (P "在接下来的两章中, 我们将主要关心线性算子. 我们的流程是选取一个有限维向量空间" $V
      "上的单独的一个线性算子" $T ", 将它拆下来, 看看什么使其运转. 在这早期阶段, "
      "将我们的目标以矩阵的语言表述是最为简单的: 给定线性算子" $T ", 找出" $V "的一个有序基使得"
      $T "的矩阵呈现特别简单的形式.")
   (P "现在对于我们心中所想作一个基本的刻画. 或许最简单的矩阵, 除了恒等矩阵之外, 就是对角矩阵了:"
      (MB (&= $D (Mat ($c_1 $0 $0 $..c $0)
                      ($0 $c_2 $0 $..c $0)
                      ($0 $0 $c_3 $..c $0)
                      ($..v $..v $..v $ $..v)
                      ($0 $0 $0 $..c $c_n))))
      "令" $T "是一个" $n "维向量空间" $V "上的线性算子. 如果我们能够找到" $V
      "的一个有序基" basis:def "使得" $T
      "由上面的对角矩阵" $D "表示, 那么我们能够获得和" $T "有关的相当信息. 例如, 和"
      $T "有关的简单数字, 比如说" $T "和秩或者" $T "的行列式, 看一眼矩阵" $D
      "就能出来. 我们可以显式描述" $T "的像和零空间. 既然" (&= (coordm $T) $D)
      "当且仅当"
      (MB (&cm (&= (ap $T $alpha_k) (&i* $c_k $alpha_k)) (&= $k (&cm $1 $..h $n))))
      "那么像就是由那些" (&!= $c_k $0) "的" $alpha_k "张成的子空间, 零空间就是由剩下来的"
      $alpha_k "张成的. 似乎可以这样说, 如果我们知道了一个基" $BBB "和一个对角矩阵"
      $D "满足" (&= (coordm $T) $D) ", 那么我们就能轻易回答一切与" $T "有关的问题.")
   (P "是否每个线性算子都可以在某个有序基下表示为对角矩阵呢? 如果不是的话, 那么什么样的算子"
      $T "下这样的基存在呢? 如果存在这样的基的话, 那么我们又该怎么找到它呢? 如果这样的基"
      "不存在的话, 那么可以表示" $T "的最简单的矩阵类型是什么样的呢? 这些是我们将在本章 "
      "(和下一章) 解决的问题. 随着我们理解到其中的困难, 一些问题的形式也会变得更加复杂.")
   (H3 "第6.2节 特征值")
   (P "前一节的评注为我们提供了尝试分析一般线性算子" $T "的起点. 之前的线索暗示着我们应该研究"
      "这样的向量, 其由" $T "送至自身的标量倍数.")
   ((definition)
    "令" $V "是域" $F "上的向量空间而" $T "是" $V "上的线性算子. " $T "的一个特征值是一个"
    $F "中标量满足存在" $V "中非零的向量" $alpha "使得" (&= (ap $T $alpha) (&i* $c $alpha))
    ". 如果" $c "是" $T "的特征值, 那么"
    (Ol #:attr* '((type "a"))
        (Li "任何满足" (&= (ap $T $alpha) (&i* $c $alpha)) "的向量" $alpha
            "都被称为" $T "在特征值" $c "下的特征向量.")
        (Li "所有满足" (&= (ap $T $alpha) (&i* $c $alpha)) "的向量" $alpha
            "构成的集合被称为" $T "在特征值" $c "下的特征空间.")))
   (P "特征值 (characteristic value) 也被称为特征根 (characteristic root), 隐式根 (latent root), "
      "特征值 (eigenvalue), 恰当值 (proper value) 或者谱值 (spectral value). 本书我们将只使用"
      "&quot;特征值 (characteristic value)&quot;这个名字.")
   (P "如果" $T "是任意的线性算子而" $c "是任意的标量, 所有满足" (&= (ap $T $alpha) (&i* $c $alpha))
      "的向量" $alpha "的集合是" $V "的子空间, 实际上它就是线性变换" (@- $T (&i* $c $I))
      "的零空间. 我们称" $c "是" $T "的特征值, 如果该子空间异于零子空间, 即" (@- $T (&i* $c $I))
      "不是单射的. 在" $V "是有限维的情况下, " (@- $T (&i* $c $I)) "不是单射恰当其行列式等于零.")
   ((theorem #:n "1")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $c "是一个标量, 那么以下是等价的."
    (Ol #:attr* '((type "i"))
        (Li $c "是" $T "的特征值.")
        (Li "算子" (@- $T (&i* $c $I)) "是奇异的 (不可逆的).")
        (Li (&= (&det (&- $T (&i* $c $I))) $0) ".")))
   (P "行列式判则iii是非常重要的, 因为它告诉我们从哪里寻找" $T "的特征值. 既然"
      (&det (&- $T (&i* $c $I))) "是对于变量" $c "的" $n "阶多项式, 那么我们所求的特征值就是"
      "该多项式的根. 让我们仔细解释这个想法.")
   (P "如果" $BBB "是" $V "的基并且" (&= $A (coordm $T)) ", 那么" (@- $T (&i* $c $I))
      "可逆当且仅当矩阵" (@- $A (&i* $c $I)) "可逆. 据此, 我们有如下定义.")
   ((definition)
    "如果" $A "是域" $F "上的一个" n*n "矩阵, 那么" $A "的一个在" $F "中的特征值是一个" $F
    "中标量" $c "满足矩阵" (@- $A (&i* $c $I)) "是奇异的 (不可逆的).")
   (P "既然" $c "是" $A "的特征值当且仅当" (&= (&det (&- $A (&i* $c $I))) $0) "或者等价地当且仅当"
      (&= (&det (&- (&i* $c $I) $A)) $0) ", 我们构造以多项式为元素的矩阵" (@- (&i* $x $I) $A)
      ", 并考虑多项式" (&= $f (&det (&- (&i* $x $I) $A))) ". 显然" $A "在" $F "中的特征值不过就是"
      $F "中满足" (&= (app $f $c) $0) "的标量" $c ". 出于这样的原因" $f "被称为" $A "的特征多项式. "
      "注意到" $f "是一个阶数恰为" $n "的首项系数为一的多项式是重要的. 这很容易从基于元素的矩阵的行列式"
      "公式中看出来.")
   ((lemma)
    "相似矩阵拥有相同的特征多项式.")
   ((proof)
    "如果" (&= $B (&i* (inv $P) $A $P)) ", 那么"
    (let* ((cm (lambda (A) (&- (&i* $x $I) A)))
           (cp (lambda (A) (&det (cm A)))))
      (MB (deriv (cp $B)
                 (cp (&i* (inv $P) $A $P))
                 (&det (&i* (inv $P) (@ (cm $A)) $P))
                 (&d* (ap $det (inv $P)) (cp $A) (ap $det $P))
                 (cp $A)))))
   (P "这条引理允许我们将算子" $T "的特征多项式定义为任意在某个" $V "的有序基下表示" $T
      "的" n*n "矩阵的特征多项式. 正如矩阵一样, " $T "特征值就是" $T "的特征多项式的根. "
      "特别地, 这表明" $T "不可能拥有多于" $n "个不同的特征值. 我们也应该指出" $T
      "可能没有任何特征值.")
   ((example #:n "1")
    "令" $T "是" $RR^2 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (&= $A (Mat ($0 $-1) ($1 $0))))
    "表示. " $T " (或者" $A ") 的特征多项式为"
    (MB (&= (&det (&- (&i* $x $I) $A))
            (Det ($x $1) ($-1 $x))
            (&+ $x^2 $1)) ".")
    "既然这个多项式没有实根, 那么" $T "就没有特征值. 如果" $U "是" $CC^2
    "上的线性算子, 其在标准有序基下由" $A "表示, 那么" $U "就有两个特征值, "
    $i "和" (&- $i) ". 这里我们看到了微妙的一点. 在讨论一个矩阵" $A
    "的特征值时, 我们必须小心地规定所涉及的域. 上面的矩阵" $A "在" $RR
    "中没有特征值, 但在" $CC "中有两个特征值" $i "和" (&- $i) ".")
   ((example #:n "2")
    "令" $A "是" (&c* $3 $3) "的(实)矩阵"
    (MB (Mat ($3 $1 $-1) ($2 $2 $-1) ($2 $2 $0)) ".")
    "那么" $A "的特征多项式为"
    (MB (&= (Det ((&- $x $3) $-1 $1)
                 ($-2 (&- $x $2) $1)
                 ($-2 $-2 $x))
            (: $x^3 $- (&i* $5 $x^2) $+ (&i* $3 $x) $- $4)
            (&i* (@- $x $1) (^ (@- $x $2) $2))) ".")
    "因此" $A "的特征值是" $1 "和" $2 "." (Br)
    "设" $T "是" $RR^3 "上的线性算子, 其在标准基下由" $A "表示. 让我们找出" $T
    "在特征值" $1 "和" $2 "下的特征向量. 现在"
    (MB (&= (&- $A $I) (Mat ($2 $1 $-1) ($2 $1 $-1) ($2 $2 $-1))))
    "显然一眼就可以看出" (&- $A $I) "的秩等于" $2 " (因此" (&- $T $I)
    "的零化度为" $1 "). 于是特征值" $1 "下的特征向量的空间是一维的. 向量"
    (&= $alpha_1 (tu0 $1 $0 $2)) "可以张成" (&- $T $I) "的零空间. 因此"
    (&= (ap $T $alpha) $alpha) "当且仅当" $alpha "是" $alpha_1
    "的标量倍数. 现在考虑"
    (MB (&= (&- $A (&i* $2 $I))
            (Mat ($1 $1 $-1) ($2 $0 $-1) ($2 $2 $-2))))
    "显然" (&- $A (&i* $2 $I)) "的秩也是" $2 ", 于是在特征值" $2
    "下的特征向量的空间维数是" $1 ". 显然" (&= (ap $T $alpha) (&i* $2 $alpha))
    "当且仅当" $alpha "是" (&= $alpha_2 (tu0 $1 $1 $2)) "的标量倍数.")
   ((definition)
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 我们称" $T "是可对角化的, 如果存在" $V
    "的一个基满足其中每个向量都是" $T "的特征向量.")
   (P "为什么要叫这个名字应该是很显然的, 因为如果存在" $V "的一个有序基"
      basis:def "满足每个" $alpha_i "都是" $T
      "的特征向量, 那么" $T "在有序基" $BBB "下的矩阵是对角的. 如果"
      (&= (ap $T $alpha_i) (&i* $c_i $alpha_i)) ", 那么"
      (MB (&= (coordm $T)
              (Mat ($c_1 $0 $..c $0)
                   ($0 $c_2 $..c $0)
                   ($..v $..v $ $..v)
                   ($0 $0 $..c $c_n))))
      "我们当然并不需要标量" (&cm $c_1 $..h $c_n) "互异. 实际上, 它们可以是相同的标量 "
      "(当" $T "是恒等算子的标量倍数时).")
   (P "我们也可以将" $T "可对角化定义为存在" $T "的一集特征向量可以张成" $V ". 这与之前的"
      "定义只是表面上不同而已, 因为我们可以从任意能够张成" $V "的一集向量中挑选出一个基.")
   (P "对于例子1和2我们故意挑选了在" $RR^n "上不可对角化的线性算子" $T ". 在例子1中, " $RR^2
      "上的这个线性算子之所以是不可逆的, 是因为它没有特征值. 在例子2中, 线性算子" $T
      "的确有特征值. 实际上, " $T "的特征多项式可以在实数域上被分解完全: "
      (&= $f (&i* (@- $x $1) (^ (@- $x $2) $2))) ". 然而, " $T "并非可对角化的. 在" $T
      "的两个特征值下每个特征空间都只是一维的, 因此我们并不能构造出一个全由" $T
      "的特征向量构成的" $RR^3 "的基.")
   (P "设" $T "是一个可对角化的线性算子. 令" (&cm $c_1 $..h $c_k) "是" $T "互异的特征值. "
      "那么存在一个有序基" $BBB "满足其下" $T "由一个以标量" $c_i "为对角元素的对角矩阵表示, "
      "每个标量均重复特定的次数. 如果" $c_i "重复了" $d_i "次, 那么(我们可以重新排列有序基的"
      "向量顺序使得)该矩阵具有如下分块形式"
      (MB (&= (coordm $T)
              (Mat ((&i* $c_1 $I_1) $0 $..c $0)
                   ($0 (&i* $c_2 $I_2) $..c $0)
                   ($..v $..v $ $..v)
                   ($0 $0 $..c (&i* $c_k $I_k)))))
      "其中" $I_j "是" (&c* $d_j $d_j) "的恒等矩阵. 从中我们看出两件事. 首先, " $T
      "的特征多项式是(可能重复的)线性因子之积:"
      (MB (&= $f (&i* (^ (@- $x $c_1) $d_1) $..c (^ (@- $x $c_k) $d_k))) ".")
      "如果标量域" $F "是代数闭域, 例如复数域, 那么每个" $F "上的多项式都可以被这么"
      "分解 (见第4.5节). 然而, 如果" $F "不是代数闭域, 当我们说" $T "的特征多项式有这样一种分解时, "
      "我们是在声明" $T "的一个特别性质. 第二件能看出来的事情是" $d_i " (" $c_i "作为" $f
      "的重根次数) 等于与特征值" $c_i "相关的特征空间的维数. 这是因为对角矩阵的零化度等于其主对角线上"
      "零的数目, 而矩阵" (coordm (&- $T (&i* $c_i $I)) $BBB) "在其主对角线上拥有" $d_i
      "个零. 这个特征空间的维数与特征值作为" $f "的根的重数之间的关系最初看上去并不令人兴奋. 然而, "
      "它为我们提供了一种更简单的判断给定算子是否可对角化的方法.")
   ((lemma)
    "设" (&= (ap $T $alpha) (&i* $c $alpha)) ". 如果" $f "是任意的多项式, 那么"
    (&= (ap (app $f $T) $alpha) (&i* (app $f $c) $alpha)) ".")
   ((proof)
    "作为练习.")
   ((lemma)
    "令" $T "是有限维向量空间" $V "上的线性算子. 令" (&cm $c_1 $..h $c_k) "是" $T
    "不同的特征值, 而" $W_i "是特征值" $c_i "下的特征空间. 如果" (&= $W (&+ $W_1 $..c $W_k))
    ", 那么"
    (MB (&= (&dim $W) (&+ (&dim $W_1) $..c (&dim $W_k))) ".")
    "实际上, 如果" $BBB_i "是" $W_i "的一个有序基, 那么"
    (&= $BBB (tu0 (_ $BBB $1) $..h (_ $BBB $k))) "是" $W "的一个有序基.")
   ((proof)
    "空间" (&= $W (&+ $W_1 $..c $W_k)) "是由" $T "的所有特征向量张成的子空间. 当一个人构造子空间"
    $W_i "之和" $W "时, 通常会预料" (&< (&dim $W) (&+ (&dim $W_1) $..c (&dim $W_k)))
    ", 因为不同空间的向量之间也可能存在线性关系. 这条引理告诉我们不同特征值下的特征空间是独立的." (Br)
    "设(对于每个" $i ")我们有一个" $W_i "中的向量" $beta_i ", 并且假定" (&= (&+ $beta_1 $..c $beta_k) $0)
    ". 我们将证明对于每个" $i "有" (&= $beta_i $0) ". 令" $f "是任意的多项式. 既然"
    (&= (ap $T $beta_i) (&i* $c_i $beta_i)) ", 那么之前的引理告诉我们"
    (MB (deriv $0
               (ap (app $f $T) $0)
               (&+ (ap (app $f $T) $beta_1) $..c (ap (app $f $T) $beta_k))
               (&+ (&i* (app $f $c_1) $beta_1) $..c (&i* (app $f $c_k) $beta_k))))
    "选择多项式" (&cm $f_1 $..h $f_k) "使得"
    (MB (&= (app $f_i $c_j) δij
            (Choice ($1 (: $cm (&= $i $j)))
                    ($0 (: $cm (&!= $i $j))))))
    "那么"
    (MB (deriv $0
               (ap (app $f_i $T) $0)
               (sum (&= $j $1) $k (&i* δij $beta_j))
               $beta_i))
    "现在令" $BBB_i "是" $W_i "的一个有序基, 令" $BBB "是序列"
    (&= $BBB (tu0 (_ $BBB $1) $..h (_ $BBB $k))) ", 那么" $BBB "能够张成子空间"
    (&= $W (&+ $W_1 $..c $W_k)) ". 并且, " $BBB "也是线性无关的向量序列, 原因如下. 任何"
    $BBB "中向量之间的线性关系都具有" (&= (&+ $beta_1 $..c $beta_k) $0) "的形式, 其中"
    $beta_i "是" $BBB_i "中的向量的线性组合. 根据我们刚才得到的结果, 我们知道对于每个"
    $i "有" (&= $beta_i $0) ". 既然每个" $BBB_i "都是线性无关的, 那么显然" $BBB
    "中的向量之间只存在平凡的线性关系.")
   ((theorem #:n "2")
    "令" $T "是有限维向量空间" $V "上的线性算子, 令" (&cm $c_1 $..h $c_k) "是" $T
    "不同的特征值, 令" $W_i "是" (@- $T (&i* $c_i $I)) "的零空间, 以下条件是等价的."
    (Ol #:attr* '((type "i"))
        (Li $T "是可对角化的.")
        (Li $T "的特征多项式为"
            (MB (&= $f (&i* (^ (@- $x $c_1) $d_1) $..c (^ (@- $x $c_k) $d_k))))
            "并且" (&cm (&= (&dim $W_i) $d_i) (&= $i (&cm $1 $..h $k))) ".")
        (Li (&= (&+ (&dim $W_1) $..c (&dim $W_k)) (&dim $V)) ".")))
   ((proof)
    "我们已经观察到i可以推出ii. 如果特征多项式" $f "是如ii所示的线性因子之积, 那么"
    (&= (&+ $d_1 $..c $d_k) (&dim $V)) ", 因为" $d_i "之和就是特征多项式的阶数, 而这个阶数就是"
    (&dim $V) ". 于是, ii能够推出iii. 设iii成立. 根据引理, 我们必须有" (&= $V (&+ $W_1 $..c $W_k))
    ", 即" $T "的特征向量能够张成" $V ".")
   (P "定理2的矩阵类比可以按照如下方式陈述. 令" $A "是一个元素来源于域" $F "的" n*n "矩阵, 令"
      (&cm $c_1 $..h $c_k) "是" $A "在" $F "中不同的特征值. 对于每个" $i ", 令" $W_i
      "是满足"
      (MB (LE (@- $A (&i* $c_i $I)) $X $0))
      "的列矩阵" $X "的空间, 当然" $X "的元素应该来源于" $F ", 令" $BBB_i "是" $W_i
      "的一个有序基. 我们将基" (tu0 (_ $BBB $1) $..h (_ $BBB $k)) "连在一起以构成了一个矩阵" $P
      "的列的序列:"
      (MB (&= $P (li0 $P_1 $P_2 $..h) (tu0 (_ $BBB $1) $..h (_ $BBB $k))) ".")
      "矩阵" $A "在域" $F "上能够相似于一个对角矩阵当且仅当" $P "是一个方阵. 当" $P
      "是方阵的时候, " $P "可逆并且" (&i* (inv $P) $A $P) "是对角矩阵.")
   ((example #:n "3")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准基下由矩阵"
    (MB (&= $A (Mat ($5 $-6 $-6) ($-1 $4 $2) ($3 $-6 $-4))))
    "表示. 让我们指出读者计算特征多项式的一种可能方式, 使用行变换和列变换:"
    (MB (deriv (Det ((&- $x $5) $6 $6)
                    ($1 (&- $x $4) $-2)
                    ($-3 $6 (&+ $x $4)))
               (Det ((&- $x $5) $0 $6)
                    ($1 (&- $x $2) $-2)
                    ($-3 (&- $2 $x) (&+ $x $4)))
               (&i* (@- $x $2)
                    (Det ((&- $x $5) $0 $6)
                         ($1 $1 $-2)
                         ($-3 $-1 (&+ $x $4))))
               (&i* (@- $x $2)
                    (Det ((&- $x $5) $0 $6)
                         ($1 $1 $-2)
                         ($-2 $0 (&+ $x $2))))
               (&i* (@- $x $2)
                    (Det ((&- $x $5) $6)
                         ($-2 (&+ $x $2))))
               (&i* (@- $x $2) (@ $x^2 $- (&i* $3 $x) $+ $2))
               (&i* (^ (@- $x $2) $2) (@- $x $1))))
    "在这两个特征值下的特征空间的维数是多少呢? 我们有"
    (MB (&cm (&= (&- $A $I) (Mat ($4 $-6 $-6) ($-1 $3 $2) ($3 $-6 $-5)))
             (&= (&- $A (&i* $2 $I)) (Mat ($3 $-6 $-6) ($-1 $2 $2) ($3 $-6 $-6)))))
    "我们知道" (&- $A $I) "是奇异的, 并且显然有" (&>= (&rank (&- $A $I)) $2)
    ". 因此, " (&= (&rank (&- $A $I)) $2) ". 另外, 显然有"
    (&= (&rank (&- $A (&i* $2 $I))) $1) "." (Br)
    "令" $W_1 "和" $W_2 "分别是特征值" $1 "和" $2 "下的特征空间, 我们知道"
    (&= (&dim $W_1) $1) "和" (&= (&dim $W_2) $2) ". 根据定理2, " $T "是可对角化的. 很容易找出"
    $RR^3 "的一个基满足其下" $T "由一个对角矩阵表示. " (@- $T $I) "的零空间由向量"
    (&= $alpha_1 (tu0 $3 $-1 $3)) "张成, 于是" (setE $alpha_1) "是" $W_1
    "的一个基. " (&- $T (&i* $2 $I)) "的零空间 (即空间" $W_2 ") 由满足"
    (&= $x_1 (&+ (&i* $2 $x_2) (&i* $2 $x_3))) "的向量" (tu0 $x_1 $x_2 $x_3)
    "构成. 因此, " $W_2 "的基的一个例子是"
    (MB (&cm (&= $alpha_2 (tu0 $2 $1 $0)) (&= $alpha_3 (tu0 $2 $0 $1))) ".")
    "如果" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) ", 那么" (coordm $T) "是对角矩阵"
    (MB (&= $D (Mat ($1 $0 $0) ($0 $2 $0) ($0 $0 $2))) ".")
    $T "可对角化的事实意味着原本的矩阵" $A "(在" $RR "上)相似于对角矩阵" $D ". 使得我们能够将基"
    $BBB "下的坐标转换为标准基下的坐标的矩阵" $P "(当然)以" (&cm $alpha_1 $alpha_2 $alpha_3)
    "的转置为列向量:"
    (MB (&= $P (Mat ($3 $2 $2) ($-1 $1 $0) ($3 $0 $1))) ".")
    "而且, " (&= (&i* $A $P) (&i* $P $D)) ", 于是"
    (MB (&= (&i* (inv $P) $A $P) $D) "."))
   ((exercise #:n "1")
    
    )
   (H3 "第6.3节 零化多项式")
   (P "在尝试分析一个线性算子" $T "的时候, 知道能够零化" $T "的多项式类是很有用的. 更确切地说, "
      "设" $T "是域" $F "上的向量空间" $V "上的线性算子. 如果" $p "是域" $F "上的多项式, 那么"
      (app $p $T) "也是" $V "上的线性算子. 如果" $q "是另一个域" $F "上的多项式, 那么"
      (MB (&cm (&= (app (@+ $p $q) $T) (&+ (app $p $T) (app $q $T)))
               (&= (app (@i* $p $q) $T) (&i* (app $p $T) (app $q $T)))) ".")
      "因此, 零化" $T "的多项式" $p " (意即" (&= (app $p $T) $0) ") 的集合是多项式代数"
      polyF "的理想. 它可能是零理想, 也就是说" $T "可能不由任何非零多项式零化. 但是, 如果"
      $V "是有限维的, 这种情况是不可能发生的.")
   (P "设" $T "是一个" $n "维空间" $V "上的线性算子. 看看" $T "的前" (@+ $n^2 $1) "次幂:"
      (MB (&cm $I $T $T^2 $..h (^ $T $n^2)) ".")
      "这是" (&L $V $V) "中" (&+ $n^2 $1) "个算子的序列, " (&L $V $V) "即" $V "上的线性算子的空间. 空间"
      (&L $V $V) "是" $n^2 "维的, 因此这" (&+ $n^2 $1) "个算子的序列必然是线性相关的, "
      "也就是说存在不是全零的标量" $c_i "满足"
      (MB (&= (&+ (&i* $c_0 $I) (&i* $c_1 $T) $..c (&i* (_ $c $n^2) (^ $T $n^2))) $0) ".")
      "于是, 零化" $T "的多项式理想中有一个非零的多项式, 其阶数小于等于" $n^2 ".")
   (P "根据第4章的定理7, 每个非零的多项式理想都可由某个首项系数为一的多项式生成. 因此, 存在一个与" $T
      "相关的首项系数为一的多项式" $p "满足以下性质: 如果" $f "是一个域" $F "上的多项式, 那么"
      (&= (app $f $T) $0) "当且仅当" (&= $f (&i* $p $g)) ", 其中" $g "是某个" $F "上的多项式.")
   ((definition)
    "令" $T "是一个域" $F "上的有限维向量空间" $V "上的线性算子. " $T "的极小多项式是零化" $T
    "的域" $F "上的多项式理想的(唯一的)首项系数为一的生成元.")
   (P "&quot;极小多项式&quot;这个名字来源于这个多项式理想的生成元可由理想中次数最小的"
      "首项系数为一多项式刻画. 这意味着线性算子" $T "的极小多项式" $p "由以下三条性质唯一确定:"
      (Ol (Li $p "是标量域" $F "上的首项系数为一的多项式.")
          (Li (&= (app $p $T) $0) ".")
          (Li "没有能够零化" $T "的域" $F "上的多项式次数比" $p "低.")))
   (P "如果" $A "是域" $F "上的一个" n*n "矩阵, 我们可以按照类似的方式定义" $A
      "的极小多项式, 即域" $F "上零化" $A "的多项式理想的那个唯一的首项系数为一的生成元. 如果" $T
      "在某个有序基下由矩阵" $A "表示, 那么" $T "和" $A "有着相同的极小多项式. 这是因为在这个基下"
      (app $f $T) "由矩阵" (app $f $A) "表示, 于是" (&= (app $f $T) $0) "当且仅当"
      (&= (app $f $A) $0) ".")
   (P "上面关于算子和矩阵的评注也可说明相似矩阵拥有相同的极小多项式. "
      "从定义看这个事实也是显然的, 因为对于每个多项式" $f "有"
      (MB (&= (app $f (sim $A)) (sim (app $f $A))) "."))
   (P "关于矩阵的极小多项式的另一个基本评注也是应该说的. 设" $A "是一个" n*n "矩阵, 其元素来源于域"
      $F ". 设" $F_1 "是以" $F "为子域的一个域. (例如, " $A "的元素可能是有理数, 而" $F_1
      "是实数域. 或者, " $A "的元素是实数, 而" $F_1 "是复数域.) 我们既可以将" $A
      "当成" $F "上的矩阵, 也可以将其当作" $F_1 "上的矩阵. 从表面上来看, 似乎我们会得到" $A
      "的两个不同的极小多项式. 幸运的是, 这并不会发生, 我们必须明白为什么. 当" $A "被视为域" $F
      "上的" n*n "矩阵时, 其极小多项式的定义是什么? 我们考虑能够零化" $A "的系数来源于" $F
      "的首项系数为一的多项式, 并挑选其中次数最小的那个. 如果" $f "是域" $F "上的"
      "一个首项系数为一的多项式:"
      (MB (&= $f (&+ $x^k (sum (&= $j $0) (&- $k $1) (&i* $a_j $x^j)))))
      "那么" (&= (app $f $A) $0) "仅仅是说我们有了一个" $A "的幂之间的线性关系:"
      (MB (&= (&+ $A^k (&i* (_ $a (&- $k $1)) (^ $A (&- $k $1)))
                  $..c (&i* $a_1 $A) (&i* $a_0 $I)) $0) ".")
      "极小多项式的次数是满足存在以上形式的" (&cm $I $A $..h $A^k) "之间的线性关系的最小的正整数"
      $k ". 而且, 根据极小多项式的唯一性, 对于" $k "而言有且仅有一种这样形式的关系, 即一旦最小的"
      $k "确定下来了, 存在唯一的" $F "中标量" (&seq $a #:from $0 #:to (&- $k $1)) "能够使得以上"
      "形式的关系成立. 它们是极小多项式的系数.")
   (P ""
      )
   (H3 "第6.4节 不变子空间")
   (H3 "第6.5节 同时三角化; 同时对角化")
   (H3 "第6.6节 直和分解")
   (H3 "第6.7节 不变直和")
   (H3 "第6.8节 准素分解定理")
   (H2 "第7章 有理形式和Jordan形式")
   (H3 "第7.1节 循环子空间和零化子")
   (P "又一次, " $V "是域" $F "上的一个有限维向量空间, 而" $T "是" $V "上一个固定的 (但也是任意的) "
      "线性算子. 如果" $alpha "是" $V "的任意一个向量, 那么存在一个最小的包含" $alpha "且在" $T
      "下不变的" $V "的子空间. 这个子空间或许可以被定义为所有包含" $alpha "的" $T "不变子空间之交, "
      )
   (H3 "第7.2节 循环分解和有理形式")
   (H3 "第7.3节 Jordan形式")
   (H3 "第7.4节 不变因子的计算")
   (H3 "第7.5节 总结; 半单算子")
   (H2 "第8章 内积空间")
   (H3 "第8.1节 内积")
   (P "整个章节我们只考虑实或复向量空间, 即实数域或复数域上的向量空间. 我们的主要目的在于研究"
      "这样的向量空间, 其中讨论向量的长度和两个向量之间的夹角是有意义的. 我们将研究向量序对上的"
      "特定类型的标量值函数, 其被称为内积. 内积的一个例子是" $RR^3
      "中的向量的标量积或者说点积. " $RR^3 "中的向量"
      (MB (&= $alpha (tu0 $x_1 $x_2 $x_3)) "和" (&= $beta (tu0 $y_1 $y_2 $y_3)))
      "的标量积是实数"
      (MB (&= (inner* $alpha $beta)
              (&+ (&i* $x_1 $y_1) (&i* $x_2 $y_2) (&i* $x_3 $y_3))) ".")
      "从几何上说, 这个点积是向量" $alpha "的长度, 向量" $beta
      "的长度, 以及" $alpha "和" $beta "的夹角的余弦的乘积. "
      "因此代数地定义" $RR^3 "中的长度和夹角的几何概念是可能的.")
   (P "向量空间上的内积是一个与" $RR^3 "的点积性质类似的函数, 并且基于它可以定义长度和角度. "
      "我们关于角度的一般概念的讨论将仅限于向量的垂直性 (正交性). 第一节我们将定义什么是内积, 考虑"
      "一些特定的例子, 并建立内积的一些基本性质. 然后我们回到讨论长度和正交性的任务上来.")
   ((definition)
    "令" $F "是实数域或复数域, 并且" $V "是域"
    $F "上的一个向量空间. " $V "上的一个内积是一个函数, 其赋"
    $V "中每对向量" $alpha "和" $beta "以一个" $F
    "中的标量" (inner* $alpha $beta) "满足对于所有" $V "中的"
    (&cm $alpha $beta $gamma) "以及所有标量" $c
    (Ol #:attr* '((type "a"))
        (Li (&= (inner* (&+ $alpha $beta) $gamma)
                (&+ (inner* $alpha $gamma)
                    (inner* $beta $gamma))) ";")
        (Li (&= (inner* (&i* $c $alpha) $beta)
                (&i* $c (inner* $alpha $beta))) ";")
        (Li (&= (inner* $beta $alpha)
                (OverBar (inner* $alpha $beta)))
            ", 横杠代表复数共轭;")
        (Li (&> (inner* $alpha $alpha) $0) "如果"
            (&!= $alpha $0) ".")))
   (P "读者应该观察到条件a, b, c可以推出下列条件e."
      (MB (&= (inner* $alpha (&+ (&i* $c $beta) $gamma))
              (&+ (&i* (OverBar $c) (inner* $alpha $beta))
                  (inner* $alpha $gamma))) ".")
      "另一点值得指出. 当" $F "是实数域" $RR "时, "
      "出现在c和e中的复数共轭是多余的. 然而, 若是在复的情况下, "
      "为了条件的一致性那么共轭就是必须的. 如果没有共轭, 我们"
      "就会得到以下矛盾:"
      (MB (&> (inner* $alpha $alpha) $0) "且"
          (&> (&= (inner* (&i* $i $alpha) (&i* $i $alpha))
                  (&i* $-1 (inner* $alpha $alpha)))
              $0) "."))
   (P "在本章的剩余部分, " $F "要么代表实数域要么代表复数域.")
   ((example #:n "1")
    "在" $F^n "上存在一个被我们称为标准内积的内积. "
    "它由"
    (MB (&= (inner* $alpha $beta)
            (sum $j $
                 (&i* $x_j (_ (OverBar $y) $j)))))
    "定义, 其中" (&= $alpha (tu0 $x_1 $..h $x_n))
    ", " (&= $beta (tu0 $y_1 $..h $y_n)) ". "
    "当" (&= $F $RR) "时, 这也可以写成"
    (MB (&= (inner* $alpha $beta)
            (sum $j $ (&i* $x_j $y_j))))
    "在实的情况下, 标准内积也经常被称为点积或标量积, 记作"
    (&d* $alpha $beta) ".")
   ((example #:n "2")
    "对于" $RR^2 "的向量" (&= $alpha (tu0 $x_1 $x_2)) "和"
    (&= $beta (tu0 $y_1 $y_2)) ", 令"
    (MB (&= (inner* $alpha $beta)
            (&+ (&- (&i* $x_1 $y_1)
                    (&i* $x_2 $y_1)
                    (&i* $x_1 $y_2))
                (&i* $4 $x_2 $y_2)))
        ".")
    "因为"
    (&= (inner* $alpha $alpha)
        (&+ (^ (@- $x_1 $x_2) $2)
            (&i* $3 (_^ $x $2 $2))))
    ", 所以知道如果" (&!= $alpha $0) ", 那么"
    (&> (inner* $alpha $alpha) $0) ". 定义的条件a, b, c很容易验证.")
   ((example #:n "3")
    "令" $V "是" (^ $F n*n) ", 即"
    $F "上所有" n*n "矩阵构成的空间. "
    "那么, " $V "以很自然的方式同构于" (^ $F n*n)
    ". 因此, 由例子1可知"
    (MB (&= (inner* $A $B)
            (sum (&cm $j $k) $
                 (&i* (mref $A $j $k)
                      (_ (OverBar $B) (&cm $j $k))))))
    "定义了一个" $V "上的内积. 而且, 如果我们引入共轭转置矩阵"
    (ctrans $B) ", 由"
    (&= (_^ $B (&cm $k $j) $*) (_ (OverBar $B) (&cm $j $k)))
    "定义, 我们可以基于迹函数定义内积:"
    (MB (&= (inner* $A $B)
            (&tr (&i* $A (ctrans $B)))
            (&tr (&i* (ctrans $B) $A)))
        ".")
    "因为"
    (MB (deriv (&tr (&i* $A (ctrans $B)))
               (sum $j $ (_ (@ (&i* $A (ctrans $B))) (&cm $j $j)))
               (sum $j $
                    (sum $k $
                         (&i* (mref $A $j $k)
                              (_^ $B (&cm $k $j) $*))))
               (sum $j $
                    (sum $k $
                         (&i* (mref $A $j $k)
                              (_ (OverBar $B) (&cm $j $k))))))))
   ((example #:n "4")
    "令" $F^n*1 "是域" $F "上所有" n*1 "的(列)矩阵构成的空间, 令" $Q "是域"
    $F "上的一个" n*n "的可逆矩阵. 对于" (&in (&cm $X $Y) $F^n*1) ", 令"
    (MB (&= (inner* $X $Y) (&i* (ctrans $Y) (ctrans $Q) $Q $X)))
    "我们将右边的" (&c* $1 $1) "矩阵与它唯一的元素视为等同. "
    "当" $Q "是恒等矩阵的时候, 这个内积本质上和例子1是一样的, "
    "我们将其称为" $F^n*1 "上的标准内积. "
    "读者应该注意到术语&quot;标准内积&quot;在两个不同的上下文被使用. "
    "对于一般的域" $F "上的有限维向量空间, 没有明显的内积可被称为标准的.")
   ((example #:n "5")
    "令" $V "是单位区间" (&<= $0 $t $1)
    "上所有连续复值函数构成的向量空间, 令"
    (MB (&= (inner* $f $g)
            (integral $0 $1
                      (&i* (app $f $t)
                           (OverBar (app $g $t)))
                      $t)))
    "读者可能更熟悉单位区间上的连续实值函数构成的空间, 那么此时共轭就可以去掉.")
   ((example #:n "6")
    "这实际上是一类例子. 人们可以通过以下方法从已有的内积构造出新的内积来. 令"
    $V "和" $W "是域" $F "上的向量空间, 而设" (inner* $ $) "是" $W "上的一个内积. "
    "如果" $T "是一个从" $V "到" $W "的非奇异的线性变换, 那么"
    (MB (&= (appl $p_T $alpha $beta) (inner* (ap $T $alpha) (ap $T $beta))))
    "定义了一个" $V "上的内积" $p_T ". 例4的内积是这种情况的一个特殊情形. 以下同样也是特殊情形."
    (Ol #:attr* '((type "a"))
        (Li "令" $V "是一个有限维向量空间, 设" (&= $BBB (en0 $alpha_1 $..h $alpha_n))
            "是" $V "的一个有序基. 令" (&cm $epsilon_1 $..h $epsilon_n)
            "是" $F^n "的标准基向量, 令" (func $T $V $F^n) "是满足"
            (&cm (&= (ap $T $alpha_j) $epsilon_j) (&= $j (&cm $1 $..h $n)))
            "的线性变换. 换句话说, " $T "是由"
            $BBB "决定的从" $V "到" $F^n "的自然同构. 如果我们选择"
            $F^n "上的标准内积, 那么"
            (MB (&= (appl $p_T
                          (sum $j $ (&i* $x_j $alpha_j))
                          (sum $k $ (&i* $y_k $alpha_k)))
                    (sum (&= $j $1) $n
                         (&i* $x_j (_ (OverBar $y) $j)))))
            "因此, 对于任何" $V "上的基存在一个内积满足"
            (&= (inner* $alpha_j $alpha_k)
                (_ $delta (&cm $j $k)))
            ". 实际上, 很容易证明这样的内积是唯一的. 之后我们将会证明"
            "每个" $V "上的内积都可以由某个基" $BBB "按照以上方式决定.")
        (Li "我们再一次观察例5并令" (&= $V $W) ", 即单位区间上的"
            "连续函数构成的空间. 令" $T "是&quot;乘上" $t "&quot;的线性算子, 即"
            (&cm (&= (app (@ (ap $T $f)) $t)
                     (&i* $t (app $f $t)))
                 (&<= $0 $t $1))
            ". 容易看出" $T "是线性的, 而且" $T
            "是非奇异的. 如果" (&= (ap $T $f) $0) ", 那么"
            (&= (&i* $t (app $f $t)) $0) "对于"
            (&<= $0 $t $1) "成立, 因此当" (&> $t $0) "时"
            (&= (app $f $t) $0) ". 鉴于" $f "是连续的, "
            (&= (app $f $0) $0) ", 于是" (&= $f $0) ". "
            "现在使用例子5的内积, 我们可以构造一个新的" $V "上的内积:"
            (MB (deriv (appl $p_T $f $g)
                       (integral
                        $0 $1
                        (&i* (app (@ (ap $T $f)) $t)
                             (OverBar (app (@ (ap $T $g)) $t)))
                        $t)
                       (integral
                        $0 $1
                        (&i* (app $f $t)
                             (OverBar (app $g $t))
                             (^ $t $2))
                        $t))))))
   
   (H3 "第8.2节 内积空间")
   
   (H3 "第8.3节 线性泛函和伴随")
   (H3 "第8.4节 酉算子")
   (H3 "第8.5节 正规算子")
   
   (H2 "第9章 内积空间上的算子")
   (H3 "第9.1节 引论")
   (H3 "第9.2节 内积空间上的形式")
   (H3 "第9.3节 正定形式")
   (H3 "第9.4节 ")
   (H3 "第9.5节 谱论")
   (H3 "第9.6节 正规算子的更多性质")
   
   (H2 "第10章 双线性形式")
   (H3 "第10.1节 双线性形式")
   (P "本章中, 我们处理有限维向量空间上的双线性形式. 读者可能会发现其与")
   (H3 "第10.2节 对称双线性形式")
   
   (H3 "第10.3节 斜对称双线性形式")
   
   (H3 "第10.4节 保持双线性形式的群")
   
   (H2 "附录")
   (P "这个附录逻辑上分为两个部分. ")
   (H3 "第A.1节 集合")
   
   (H3 "第A.2节 函数")
   (P "一个函数包含以下资料:"
      (Ol (Li "一个集合" $X ", 被称为函数的定义域;")
          (Li "一个集合" $Y ", 被称为函数的陪域 (codomain);")
          (Li "一个法则 (或者说对应关系) " $f ", ")
          )
      )
   (H3 "第A.3节 等价关系")
   (H3 "第A.4节 商空间")
   (H3 "第A.5节 线性代数中的等价关系")
   (H3 "第A.6节 选择公理")

   (H2 "参考文献")
   (Ul (Li "Finite-Dimensional Vector Spaces [Paul Halmos]")
       (Li "Lectures in Abstract Algebra II [Nathan Jacobson]")
       (Li "General Topology [John Kelley]")
       (Li "Algebra [Saunders MacLane, Garrett Birkhoff]")
       (Li "Introduction to Modern Algebra and Matrix Theory "
           "[Otto Schreier, Emanuel Sperner]")
       (Li "Modern Algebra [van der Waerden]"))
   ))