#lang racket
(provide linear_algebra_exercises.html)
(require SMathML "linear_algebra_utils.rkt")
(define ((answer #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "answer")))
   (B (format "解答~a." n)) " " x*))
(define linear_algebra_exercises.html
  (TmPrelude
   #:title "线性代数习题"
   #:css "styles.css"
   (H1 "线性代数习题")
   (H2 "第1章 线性方程")
   (H3 "第1.1节 域")
   (H3 "第1.2节 线性方程组")
   ((exercise #:n "1")
    "验证例子4的集合是" (M $CC) "的子域.")
   (P "定义集合"
      (M (&= $F (setI (&in (&+ $x (&i* $y (Msqrt $2))) $CC)
                      (&in (&cm $x $y) $QQ))))
      ", 我们现在来证明" (M $F) "是" (M $CC) "的子域.")
   (Ol (Li "因为" (M (&= (&+ $0 (&i* $0 (Msqrt $2))) $0)) ", "
           (M (&= (&+ $1 (&i* $0 (Msqrt $2))) $1)) ", 所以"
           (M (&in (&cm $0 $1) $F)) ".")
       (Li "对于"
           (M (&in (&cm (&+ $x_1 (&i* $y_1 (Msqrt $2)))
                        (&+ $x_2 (&i* $y_2 (Msqrt $2)))) $F))
           ","
           (MB (&+ (@ (&+ $x_1 (&i* $y_1 (Msqrt $2))))
                   (@ (&+ $x_2 (&i* $y_2 (Msqrt $2)))))
               $=
               (&+ (@ (&+ $x_1 $x_2)) (&i* (@ (&+ $y_1 $y_2)) (Msqrt $2)))
               $in $F (Mtext ".")))
       (Li "对于" (M (&in (&+ $x (&i* $y (Msqrt $2))) $F)) ", "
           (M (&- (@ (&+ $x (&i* $y (Msqrt $2))))) $=
              (&+ (@ (&- $x)) (&i* (@ (&- $y)) (Msqrt $2))) $in
              $F) ".")
       (Li "对于"
           (M (&in (&cm (&+ $x_1 (&i* $y_1 (Msqrt $2)))
                        (&+ $x_2 (&i* $y_2 (Msqrt $2)))) $F))
           ","
           (MB (&i* (@ (&+ $x_1 (&i* $y_1 (Msqrt $2))))
                    (@ (&+ $x_2 (&i* $y_2 (Msqrt $2)))))
               $=
               (&+ (@ (&+ (&i* $x_1 $x_2) (&i* $2 $y_1 $y_2)))
                   (&i* (@ (&+ (&i* $x_1 $y_2) (&i* $x_2 $y_1))) (Msqrt $2)))
               $in $F (Mtext ".")))
       (Li "对于" (M (&in (&+ $x (&i* $y (Msqrt $2))) $F)) ", "
           (M (&!= (&+ $x (&i* $y (Msqrt $2))) $0)) ","
           (MB (~ $1 (&+ $x (&i* $y (Msqrt $2)))) $=
               (~ (&- $x (&i* $y (Msqrt $2)))
                  (&i* (@ (&+ $x (&i* $y (Msqrt $2))))
                       (@ (&- $x (&i* $y (Msqrt $2))))))
               $=
               (&+ (~ $x (&- $x^2 (&i* $2 $y^2)))
                   (&i* (~ (&- $y) (&- $x^2 (&i* $2 $y^2))) (Msqrt $2)))
               $in $F (Mtext "."))))
   (P "其中第5条用到了如下引理, 即对于"
      (M (&in (&cm (&+ $x_1 (&i* $y_1 (Msqrt $2)))
                   (&+ $x_2 (&i* $y_2 (Msqrt $2)))) $F))
      ", 如果"
      (M (&= (&+ $x_1 (&i* $y_1 (Msqrt $2)))
             (&+ $x_2 (&i* $y_2 (Msqrt $2)))))
      ", 那么"
      (M (&cm (&= $x_1 $x_2) (&= $y_1 $y_2))) ".")
   ((exercise #:n "2")
    "令" (M $F) "是复数域. 下面两个线性方程组等价吗? 如果是, 就互相表示成线性组合."
    (MB (choice (list (list $x_1 $- $x_2 $= $0)
                      (list (&i* $2 $x_1) $+ $x_2 $= $0)))
        (Mspace #:attr* '((width "16ex")))
        (choice (list (list (&i* $3 $x_1) $+ $x_2 $= $0)
                      (list $x_1 $+ $x_2 $= $0)))))
   (P (MB (mat `((,$1 ,$2 ,$3) (,(&- $1) ,$1 ,$1))) $->
          (mat `((,$1 ,$2 ,$3) (,$0 ,$3 ,$4))) $->
          (mat `((,$1 ,$2 ,$3) (,$0 ,$1 ,(~ $4 $3)))) $->
          (mat `((,$1 ,$0 ,(~ $1 $3)) (,$0 ,$1 ,(~ $4 $3)))))
      (MB (mat `((,$1 ,$2 ,$1) (,(&- $1) ,$1 ,$1))) $->
          (mat `((,$1 ,$2 ,$1) (,$0 ,$3 ,$2))) $->
          (mat `((,$1 ,$2 ,$1) (,$0 ,$1 ,(~ $2 $3)))) $->
          (mat `((,$1 ,$0 ,(&- (~ $1 $3))) (,$0 ,$1 ,(~ $2 $3)))))
      (MB (mat `((,$3 ,$1 ,$1) (,$1 ,$1 ,(&- $1)))) $->
          (mat `((,$3 ,$1 ,$1) (,$0 ,(~ $2 $3) ,(&- (~ $4 $3))))) $->
          (mat `((,$3 ,$1 ,$1) (,$0 ,$1 ,(&- $2)))) $->
          (mat `((,$3 ,$0 ,$3) (,$0 ,$1 ,(&- $2)))) $->
          (mat `((,$1 ,$0 ,$1) (,$0 ,$1 ,(&- $2)))))
      (MB (mat `((,$3 ,$1 ,$2) (,$1 ,$1 ,$1))) $->
          (mat `((,$3 ,$1 ,$2) (,$0 ,(~ $2 $3) ,(~ $1 $3)))) $->
          (mat `((,$3 ,$1 ,$2) (,$0 ,$1 ,(~ $1 $2)))) $->
          (mat `((,$3 ,$0 ,(~ $3 $2)) (,$0 ,$1 ,(~ $1 $2)))) $->
          (mat `((,$1 ,$0 ,(~ $1 $2)) (,$0 ,$1 ,(~ $1 $2)))))
      "等价.")
   ((exercise #:n "3")
    "像练习2一样测试以下的线性方程组."
    (MB (choice
         (list
          (list (&- $x_1) $+ $x_2 $+ (&i* $4 $x_3) $= $0)
          (list $x_1 $+ (&i* $3 $x_2) $+ (&i* $8 $x_3) $= $0)
          (list (&i* (~ $1 $2) $x_1) $+ $x_2 $+ (&i* (~ $5 $2) $x_3) $= $0)))
        (Mspace #:attr* '((width "16ex")))
        (choice
         (list
          (list $x_1 $ $ $- $x_3 $= $0)
          (list $ $ $x_2 $+ (&i* $3 $x_3) $= $0)))))
   (P (MB (Mat ($1 $0 $-1) ($0 $1 $1) ($-1 $3 $4)) $->
          (Mat ($1 $0 $-1) ($0 $1 $1) ($0 $3 $3)) $->
          (Mat ($1 $0 $-1) ($0 $1 $1) ($0 $0 $0)))
      (MB (Mat ($1 $0 $1) ($0 $1 $3) ($-1 $3 $8)) $->
          (Mat ($1 $0 $1) ($0 $1 $3) ($0 $3 $9)) $->
          (Mat ($1 $0 $1) ($0 $1 $3) ($0 $0 $0)))
      (MB (Mat ($1 $0 (~ $1 $2)) ($0 $1 $1) ($-1 $3 (~ $5 $2))) $->
          (Mat ($1 $0 (~ $1 $2)) ($0 $1 $1) ($0 $3 $3)) $->
          (Mat ($1 $0 (~ $1 $2)) ($0 $1 $1) ($0 $0 $0)))
      (MB (Mat ($-1 $1 (~ $1 $2) $1)
               ($1 $3 $1 $0)
               ($4 $8 (~ $5 $2) $-1))
          (^ $-> $*)
          (Mat ($1 $0 (&- (~ $1 $8)) (&- (~ $3 $4)))
               ($0 $1 (~ $3 $8) (~ $1 $4))
               ($0 $0 $0 $0)))
      (MB (Mat ($-1 $1 (~ $1 $2) $0)
               ($1 $3 $1 $1)
               ($4 $8 (~ $5 $2) $3))
          (^ $-> $*)
          (Mat ($1 $0 (&- (~ $1 $8)) (~ $1 $4))
               ($0 $1 (~ $3 $8) (~ $1 $4))
               ($0 $0 $0 $0)))
      "等价.")
   ((exercise #:n "4")
    "像练习2一样测试以下的线性方程组."
    (let (($x_4 (_ $x $4)))
      (MB
       (choice
        (list
         (list (&i* $2 $x_1) $+ (&i* (@ (&+ (&- $1) $i)) $x_2) $ $ $+ $x_4 $= $0)
         (list $ $ (&i* $3 $x_2) $- (&i* $2 $i $x_3) $+ (&i* $5 $x_4) $= $0)))
       (Mspace #:attr* '((width "8ex")))
       (choice
        (list
         (list (&i* (@ (&+ $1 (~ $i $2))) $x_1) $+ (&i* $8 $x_2)
               $- (&i* $i $x_3) $- $x_4 $= $0)
         (list (&i* (~ $2 $3) $x_1) $- (&i* (~ $1 $2) $x_2)
               $+ $x_3 $+ (&i* $7 $x_4) $= $0))))))
   (P (MB (Mat ($2 $0 (&+ $1 (&i* (~ $1 $2) $i)))
               ((&+ $-1 $i) $3 $8)
               ($0 (&i* $-2 $i) (&- $i))
               ($1 $5 $-1))
          (^ $-> $*)
          (Mat ($1 $0 $0)
               ($0 $1 $0)
               ($0 $0 $1)
               ($0 $0 $0)))
      "不等价.")
   ((exercise #:n "5")
    "令" (M $F) "是恰包含两个元素" (M $0) "和" (M $1) "的集合. "
    "由以下表格定义加法和乘法:"
    (MB (set-attr*
         (set-attr*
          (&table `((,$+ ,$0 ,$1)
                    (,$0 ,$0 ,$1)
                    (,$1 ,$1 ,$0)))
          'rowlines "solid")
         'columnlines "solid")
        (Mspace #:attr* '((width "16ex")))
        (set-attr*
         (set-attr*
          (&table `((,$d* ,$0 ,$1)
                    (,$0 ,$0 ,$0)
                    (,$1 ,$0 ,$1)))
          'rowlines "solid")
         'columnlines "solid"))
    "验证集合" (M $F) "带有这两种运算是一个域.")
   (P "因为加法和乘法表关于主对角线对称, 所以它们满足交换律.")
   (P (MB (Ttlines
           (&Table
            ($a $b $c (&+ $a (@ (&+ $b $c))) (&+ (@ (&+ $a $b)) $c))
            ($0 $0 $0 $0 $0)
            ($0 $0 $1 $1 $1)
            ($0 $1 $0 $1 $1)
            ($0 $1 $1 $0 $0)
            ($1 $0 $0 $1 $1)
            ($1 $0 $1 $0 $0)
            ($1 $1 $0 $0 $0)
            ($1 $1 $1 $1 $1)
            )))
      (MB (Ttlines
           (&Table
            ($a $b $c (&i* $a (@ (&i* $b $c))) (&i* (@ (&i* $a $b)) $c))
            ($0 $0 $0 $0 $0)
            ($0 $0 $1 $0 $0)
            ($0 $1 $0 $0 $0)
            ($0 $1 $1 $0 $0)
            ($1 $0 $0 $0 $0)
            ($1 $0 $1 $0 $0)
            ($1 $1 $0 $0 $0)
            ($1 $1 $1 $1 $1)
            )))
      "由此可知加法和乘法满足结合律.")
   (P (MB (Ttlines
           (&Table
            ($a $b $c (&i* (@ (&+ $a $b)) $c) (&+ (&i* $a $c) (&i* $b $c)))
            ($0 $0 $0 $0 $0)
            ($0 $0 $1 $0 $0)
            ($0 $1 $0 $0 $0)
            ($0 $1 $1 $1 $1)
            ($1 $0 $0 $0 $0)
            ($1 $0 $1 $1 $1)
            ($1 $1 $0 $0 $0)
            ($1 $1 $1 $0 $0)
            )))
      "由此可知乘法对于加法分配.")
   (P "加法恒元是" $0 ", 乘法恒元是" $1 ", " $0 "的加法逆元是" $0 ", "
      $1 "的加法逆元是" $1 ", " $1 "的乘法逆元是" $1 ".")
   ((exercise #:n "6")
    "证明若两个具二未知元的线性方程组具有相同的解, 那么它们等价.")
   ((exercise #:n "7")
    "证明每个" (M $CC) "的子域都包含所有的有理数.")
   (P "我们知道对于" $CC "的一个子域" $F ", " (&in (&cm $0 $1) $F) ", "
      "故" (&sube $ZZ $F) ", 于是" (&sube $QQ $F) ".")
   ((exercise #:n "8")
    "证明每个特征为零的域都包含一个有理数域的复制.")
   (H3 "第1.3节 矩阵和初等行变换")
   ((exercise #:n "1")
    "找出下列线性方程组的所有解."
    (MB
     (choice
      (list (list (&i* (@ (&- $1 $i)) $x_1) $- (&i* $i $x_2) $= $0)
            (list (&i* $2 $x_1) $+ (&i* (@ (&- $1 $i)) $x_2) $= $0)))))
   (MB (&-> (mat (list (list (&- $1 $i) (&- $i))
                       (list $2 (&- $1 $i))))
            (mat (list (list $2 (&- $1 $i))
                       (list $2 (&- $1 $i))))
            (mat (list (list $2 (&- $1 $i))
                       (list $0 $0)))
            (mat (list (list $1 (~ (&- $1 $i) $2))
                       (list $0 $0)))
            ))
   ((exercise #:n "2")
    "如果"
    (MB (&= $A (mat (list (list $3 (&- $1) $2)
                          (list $2 $1 $1)
                          (list $1 (&- $3) $0)))))
    "通过行简化" (M $A) "以找出" (M AX=0)
    "的所有解.")
   (P (MB (mat (list (list $3 (&- $1) $2)
                     (list $2 $1 $1)
                     (list $1 (&- $3) $0)))
          (&* $->)
          (Mat ($1 $0 $0)
               ($0 $1 $0)
               ($0 $0 $1)))
      "因此只有平凡解.")
   ((exercise #:n "3")
    "如果"
    (MB (&= $A (mat (list (list $6 (&- $4) $0)
                          (list $4 (&- $2) $0)
                          (list (&- $1) $0 $3)))))
    "找出" (M (&= (&i* $A $X) (&i* $2 $X))) "和"
    (M (&= (&i* $A $X) (&i* $3 $X))) "的解. "
    "(符号" (M (&i* $c $X)) "表示一个矩阵, 其每个元素都是"
    (M $c) "乘上相对应的" (M $X) "的元素.)")
   (P "对于标量" $c ", " (&= (&i* $A $X) (&i* $c $X))
      "就等价于" (&= (&i* (@ (&- $A (&i* $c $I))) $X) $0) ". "
      (MB (Mat ($4 $-4 $0)
               ($4 $-4 $0)
               ($-1 $0 $1))
          (&* $->)
          (Mat ($1 $0 $-1)
               ($0 $1 $-1)
               ($0 $0 $0)))
      (MB (Mat ($3 $-4 $0)
               ($4 $-5 $0)
               ($-1 $0 $0))
          (&* $->)
          (Mat ($1 $0 $0)
               ($0 $1 $0)
               ($0 $0 $0))))
   ((exercise #:n "4")
    "找出一个与下列矩阵行等价的行简化矩阵."
    (MB (&= $A (mat (list (list $i (&- (@ (&+ $1 $i))) $0)
                          (list $1 (&- $2) $1)
                          (list $1 (&i* $2 $i) (&- $1)))))))
   (P (MB (mat (list (list $i (&- (@ (&+ $1 $i))) $0)
                     (list $1 (&- $2) $1)
                     (list $1 (&i* $2 $i) (&- $1))))
          (&* $->)
          (Mat ($1 $0 $i)
               ($0 $1 (&+ (&- (~ $1 $2)) (&i* (~ $1 $2) $i)))
               ($0 $0 $0))))
   ((exercise #:n "5")
    "证明下列两个矩阵不是行等价的."
    (MB (mat (list (list $2 $0 $0)
                   (list $a (&- $1) $0)
                   (list $b $c $3)))
        (Mspace #:attr* '((width "16ex")))
        (mat (list (list $1 $1 $2)
                   (list (&- $2) $0 (&- $1))
                   (list $1 $3 $5)))))
   (P (MB (mat (list (list $2 $0 $0)
                     (list $a (&- $1) $0)
                     (list $b $c $3)))
          (&* $->) $I)
      (MB (mat (list (list $1 $1 $2)
                     (list (&- $2) $0 (&- $1))
                     (list $1 $3 $5)))
          (&* $->)
          (Mat ($1 $0 (~ $1 $2))
               ($0 $1 (~ $3 $2))
               ($0 $0 $0)))
      
      )
   ((exercise #:n "6")
    "令"
    (MB (&= $A (mat (list (list $a $b)
                          (list $c $d)))))
    "是一个复数域上的" (M (&c* $2 $2)) "矩阵. 设" (M $A)
    "是行简化的, 并且" (M (&= (&+ $a $b $c $d) $0)) ". "
    "证明恰存在三个这样的矩阵.")
   ((exercise #:n "7")
    "证明交换矩阵两行的操作可由其他两种操作达成.")
   ((exercise #:n "8")
    "考虑线性方程组" (M AX=0) ", 其中"
    (MB (&= $A (mat (list (list $a $b)
                          (list $c $d)))))
    "是一个域" (M $F) "上的" (M (&c* $2 $2)) "矩阵. "
    "[译注: 意即线性方程组就是域" (M $F) "上的.] "
    "证明以下陈述."
    (Ol #:attr* '((type "a"))
        (Li "如果" (M $A) "的每个元素都是" (M $0) ", 那么"
            "每个序对" (M (tu0 $x_1 $x_2)) "都是"
            (M AX=0) "的解.")
        (Li "如果" (M (&!= (&- (&i* $a $d) (&i* $b $c)) $0))
            ", 那么线性方程组" (M AX=0)
            "仅有平凡解" (M (&= $x_1 $x_2 $0)) ".")
        (Li "如果" (M (&= (&- (&i* $a $d) (&i* $b $c)) $0))
            "并且某个" (M $A) "的元素异于" (M $0) ", 那么"
            "存在一个解" (M (tu0 (_^ $x $1 $0) (_^ $x $2 $0)))
            "满足, " (M (tu0 $x_1 $x_2)) "是一个解当且仅当"
            "存在标量" (M $y) "满足"
            (M (&cm (&= $x_1 (&i* $y (_^ $x $1 $0)))
                    (&= $x_2 (&i* $y (_^ $x $2 $0)))))
            ".")))
   (H3 "第1.4节 行简化阶梯矩阵")
   ((exercise #:n "1")
    "通过行规约系数矩阵来找出下列线性方程组的所有解."
    (MB (Choice
         ((&i* $1/3 $x_1) $+ (&i* $2 $x_2) $- (&i* $6 $x_3) $= $0)
         ((&i* $-4 $x_1) $ $ $+ (&i* $5 $x_3) $= $0)
         ((&i* $-3 $x_1) $+ (&i* $6 $x_2) $- (&i* 13 $x_3) $= $0)
         ((&i* -7/3 $x_1) $+ (&i* $2 $x_2) $- (&i* 8/3 $x_3) $= $0))))
   ((answer)
    (MB (Mat (1/3 2 -6)
             (-4 0 5)
             (-3 6 -13)
             (-7/3 2 -8/3))
        (&* $->)
        (Mat (1 0 -5/4)
             (0 1 -67/24)
             (0 0 0)
             (0 0 0))))
   ((exercise #:n "2")
    "找出与下列矩阵行等价的一个行简化阶梯矩阵."
    (MB (&= $A (mat (list (list $1 (&- $i))
                          (list $2 $2)
                          (list $i (&+ $1 $i))))))
    (M AX=0) "的解是什么?")
   ((answer)
    (MB (mat (list (list $1 (&- $i))
                   (list $2 $2)
                   (list $i (&+ $1 $i))))
        (&* $->)
        (Mat (1 0) (0 1) (0 0)))
    "仅有平凡解.")
   ((exercise #:n "3")
    "显式描述所有" (&c* $2 $2) "的行简化阶梯矩阵.")
   ((answer)
    "零矩阵, 恒等矩阵, 以及"
    (MB (Mat (1 $c) (0 0)) "和" (Mat (0 1) (0 0)))
    "其中" $c "是任意的标量.")
   ((exercise #:n "4")
    "考虑以下线性方程组."
    (MB (choice
         (list
          (list $x_1 $- $x_2 $+ (&i* $2 $x_3) $= $1)
          (list (&i* $2 $x_1) $ $ $+ (&i* $2 $x_3) $= $1)
          (list $x_1 $- (&i* $3 $x_2) $+ (&i* $4 $x_3) $= $2))))
    "这个方程组有解吗? 如果有的话, 显式描述所有的解.")
   ((answer)
    (MB (Mat (1 -1 2 1)
             (2 0 2 1)
             (1 -3 4 2))
        (&* $->)
        (Mat (1 0 1 1/2)
             (0 1 -1 -1/2)
             (0 0 0 0)))
    "有解, 其解为" (&cm (&= $x_1 (&- 1/2 $x_3)) (&= $x_2 (&- $x_3 1/2)))
    ", " $x_3 "是任意的标量.")
   ((exercise #:n "5")
    "给出一个无解的具有两个方程和两个未知元的线性方程组的例子.")
   ((answer)
    (MB (Choice
         ($x_1 $+ $x_2 $= $0)
         ($x_1 $+ $x_2 $= $1))))
   ((exercise #:n "6")
    "证明线性方程组"
    (MB (choice
         (list
          (list $x_1 $- (&i* $2 $x_2) $+ $x_3 $+ (&i* $2 $x_4) $= $1)
          (list $x_1 $+ $x_2 $- $x_3 $+ $x_4 $= $2)
          (list $x_1 $+ (&i* $7 $x_2) $- (&i* $5 $x_3) $- $x_4 $= $3))))
    "没有解.")
   ((proof)
    (MB (Mat (1 -2 1 2 1)
             (1 1 -1 1 2)
             (1 7 -5 -1 3))
        (&* $->)
        (Mat (1 0 -1/3 4/3 0)
             (0 1 -2/3 -1/3 0)
             (0 0 0 0 1))))
   ((exercise #:n "7")
    "找出下列线性方程组的所有解."
    (MB
     (choice
      (list
       (list (&i* $2 $x_1) $- (&i* $3 $x_2) $- (&i* $7 $x_3) $+
             (&i* $5 $x_4) $+ (&i* $2 $x_5) $= (&- $2))
       (list $x_1 $- (&i* $2 $x_2) $- (&i* $4 $x_3) $+
             (&i* $3 $x_4) $+ $x_5 $= (&- $2))
       (list (&i* $2 $x_1) $ $ $- (&i* $4 $x_3) $+
             (&i* $2 $x_4) $+ $x_5 $= $3)
       (list $x_1 $- (&i* $5 $x_2) $- (&i* $7 $x_3) $+
             (&i* $6 $x_4) $+ (&i* $2 $x_5) $= (&- $7))))))
   ((answer)
    (MB (Mat (2 -3 -7 5 2 -2)
             (1 -2 -4 3 1 -2)
             (2 0 -4 2 1 3)
             (1 -5 -7 6 2 -7))
        (&* $->)
        (Mat (1 0 -2 1 0 1)
             (0 1 1 -1 0 2)
             (0 0 0 0 1 1)
             (0 0 0 0 0 0))))
   ((exercise #:n "8")
    "令"
    (MB (&= $A (mat (list (list $3 (&- $1) $2)
                          (list $2 $1 $1)
                          (list $1 (&- $3) $0)))))
    "对于什么样的三元组" (M (tu0 $y_1 $y_2 $y_3)) "线性方程组"
    (M AX=Y) "有解?")
   ((answer)
    (MB (Mat (3 -1 2)
             (2 1 1)
             (1 -3 0))
        (&* $->)
        (Mat (1 0 0) (0 1 0) (0 0 1)))
    "任意的三元组均可.")
   ((exercise #:n "9")
    "令"
    (MB (&= $A (mat (list (list $3 (&- $6) $2 (&- $1))
                          (list (&- $2) $4 $1 $3)
                          (list $0 $0 $1 $1)
                          (list $1 (&- $2) $1 $0)))))
    "对于什么样的四元组" (M (tu0 $y_1 $y_2 $y_3 (_ $y $4))) "线性方程组"
    (M AX=Y) "有解?")
   ((answer)
    (MB (Mat (3 -6 2 -1 1 0 0 0)
             (-2 4 1 3 0 1 0 0)
             (0 0 1 1 0 0 1 0)
             (1 -2 1 0 0 0 0 1))
        (&* $->)
        (Mat (1 -2 0 -1 0 0 -1 1)
             (0 0 1 1 0 0 1 0)
             (0 0 0 0 1 0 1 -3)
             (0 0 0 0 0 1 -3 2)))
    "对于满足"
    (&cm (&= (: $y_1 $+ $y_3 $- (&i* $3 $y_4)) $0)
         (&= (: $y_2 $- (&i* $3 $y_3) $+ (&i* $2 $y_4)) $0))
    "的四元组" (tu0 $y_1 $y_2 $y_3 $y_4)
    "有解. 当然, 另一种描述方式是列向量的线性组合, 若要求基则施行列规约或者转置再施行行规约.")
   ((exercise #:n "10")
    "设" (M $R) "和" (M (&prime $R)) "是" (M (&c* $2 $3)) "的行简化阶梯矩阵并且"
    "线性方程组" (M RX=0) "和" (M (LE (&prime $R) $X $0)) "具有相同的解, 证明"
    (M (&= $R (&prime $R))) ".")
   (H3 "第1.5节 矩阵乘法")
   ((exercise #:n "1")
    "令"
    (MB (&cm (&= $A (Mat ($2 (&- $1) $1)
                         ($1 $2 $1)))
             (&= $B (Mat ($3)
                         ($1)
                         ((&- $1))))
             (&= $C (Mat ($1 (&- $1))))))
    "计算" (&i* $A $B $C) "和" (&i* $C $A $B) ".")
   ((answer)
    (MB (&cm (&= (&i* $A $B $C) (Mat (4 -4) (4 -4)))
             (&= (&i* $C $A $B) (Mat (0))))))
   ((exercise #:n "2")
    "令"
    (MB (&cm (&= $A (Mat ($1 $-1 $1)
                         ($2 $0 $1)
                         ($3 $0 $1)))
             (&= $B (Mat ($2 (&- $2))
                         ($1 $3)
                         ($4 $4)))))
    "验证" (&= (&i* $A (@ (&i* $A $B))) (&i* $A^2 $B)) ".")
   ((answer)
    
    )
   ((exercise #:n "3")
    "找出两个不同的" (&c* $2 $2) "矩阵" $A "满足" (&= $A^2 $0) "但是" (&!= $A $0) ".")
   ((exercise #:n "4")
    "对于练习2的矩阵" $A ", 找出初等矩阵" (&cm $E_1 $E_2 $..h (_ $E $k)) "满足"
    (MB (&= (&i* (_ $E $k) $..c $E_2 $E_1 $A) $I)))
   ((exercise #:n "5")
    "令"
    (MB (&cm (&= $A (Mat ($1 $-1)
                         ($2 $2)
                         ($1 $0)))
             (&= $B (Mat ($3 $1)
                         ((&- $4) $4)))))
    "存在矩阵" $C "满足" (LE $C $A $B) "吗?")
   ((exercise #:n "6")
    "令" $A "是一个" m*n "矩阵而" $B "是一个" (&c* $n $k) "矩阵. 证明"
    (&= $C (&i* $A $B)) "的列是" $A "的列的线性组合, 并且如果"
    (&cm $alpha_1 $..h $alpha_n) "是" $A "的列, 而"
    (&cm $gamma_1 $..h (_ $gamma $k)) "是" $C "的列, 那么"
    (MB (&= (_ $gamma $j)
            (sum (&= $r $1) $n
                 (&i* (_ $B (&cm $r $j)) (_ $alpha $r))))))
   ((exercise #:n "7")
    "令" $A "和" $B "是" (&c* $2 $2) "的矩阵满足" (LE $A $B $I) ", 证明"
    (LE $B $A $I) ".")
   ((exercise #:n "8")
    "令"
    (MB (&= $C (Mat ((_ $C (&cm $1 $1)) (_ $C (&cm $1 $2)))
                    ((_ $C (&cm $2 $1)) (_ $C (&cm $2 $2))))))
    "是一个" (&c* $2 $2) "的矩阵. 我们想问什么情况下有可能找到两个"
    (&c* $2 $2) "的矩阵" $A "和" $B "满足"
    (&= $C (&- (&i* $A $B) (&i* $B $A))) ". 证明这样的矩阵可以被找到当且仅当"
    (&= (&+ (_ $C (&cm $1 $1)) (_ $C (&cm $2 $2))) $0) ".")
   (H3 "第1.6节 可逆矩阵")
   ((exercise #:n "1")
    "令"
    (MB (&= $A (Mat ($1 $2 $1 $0)
                    ((&- $1) $0 $3 $5)
                    ($1 (&- $2) $1 $1))))
    "找出一个行等价于" $A "的行简化阶梯矩阵" $R "以及一个可逆的" (&c* $3 $3)
    "矩阵" $P "满足" (&= $R (&i* $P $A)) ".")
   ((exercise #:n "2")
    "做练习1, 但是"
    (MB (&= $A (Mat ($2 $0 $i)
                    ($1 $-3 (&- $i))
                    ($i $1 $1)))))
   ((exercise #:n "3")
    "对于以下两个矩阵的每一个"
    (MB (&cm (Mat ($2 $5 $-1)
                  ($4 $-1 $2)
                  ($6 $4 $1))
             (Mat ($1 $-1 $2)
                  ($3 $2 $4)
                  ($0 $1 $-2))))
    "使用初等行变换来判断其是否可逆, 并且在可逆的情况下找出其逆.")
   ((exercise #:n "4")
    "令"
    (MB (&= $A (Mat ($5 $0 $0)
                    ($1 $5 $0)
                    ($0 $1 $5))))
    "对于什么样的" $X "存在标量" $c "满足" (LE $A $X (&i* $c $X)) "?")
   ((exercise #:n "5")
    "判断"
    (MB (&= $A (Mat ($1 $2 $3 $4)
                    ($0 $2 $3 $4)
                    ($0 $0 $3 $4)
                    ($0 $0 $0 $4))))
    "是否可逆, 并且在" (inv $A) "存在的情况下找到它.")
   ((exercise #:n "6")
    "设" $A "是一个" (&c* $2 $1) "矩阵而" $B "是一个" (&c* $1 $2) "矩阵, "
    "证明" (&= $C (&i* $A $B)) "不可逆.")
   ((exercise #:n "7")
    "令" $A "是一个" n*n "的方阵. 证明以下两个陈述:"
    (Ol #:attr* '((type "a"))
        (Li "如果" $A "可逆而对于某个" n*n "的矩阵" $B "有" (LE $A $B $0)
            ", 那么" (&= $B $0) ".")
        (Li "如果" $A "不可逆, 那么存在一个" n*n "的矩阵" $B "满足"
            (LE $A $B $0) "但是" (&!= $B $0) ".")))
   ((exercise #:n "8")
    "令"
    (MB (&= $A (Mat ($a $b)
                    ($c $d))))
    "使用初等行变换证明, " $A "可逆当且仅当"
    (&!= (@ (&- (&i* $a $d) (&i* $b $c))) $0) ".")
   (P "对于" 2*2 "的矩阵" $A ", 定义"
      (&= (&det $A) (&- (&i* (mref $A $1 $1) (mref $A $2 $2))
                        (&i* (mref $A $1 $2) (mref $A $2 $1))))
      ". 设" $R "是" $A "的一个行简化阶梯矩阵, 我们知道" $A
      "可逆当且仅当" (&= $R $I) ", 这不需要用到行简化阶梯矩阵的唯一性. "
      "一个重要的观察在于, 初等行变换不改变" $det "的值非零与否. 如果" $A
      "可逆, 那么" $A "行等价于" $I ", 因为" (&!= (&det $I) $0)
      ", 所以" (&!= (&det $A) $0) ". 如果" (&!= (&det $A) $0)
      ", 那么" (&!= (&det $R) $0) ", 这只有在" (&= $R $I)
      "的情况下才是可能的, 于是" $A "可逆.")
   ((exercise #:n "9")
    "一个" n*n "矩阵" $A "被称为是上三角的, 如果" (&> $i $j) "时"
    (&= (_ $A (&cm $i $j)) $0) ", 即主对角线以下的元素均为零. "
    "证明一个上三角矩阵可逆当且仅当其每个主对角线上的元素均不为零.")
   (P "如果一个上三角矩阵的主对角线元素均不为零的话, 那么很显然它行等价于恒等矩阵, 因此可逆. "
      "如果一个上三角矩阵的主对角线存在零元, 设最下面的主对角线零元出现在第" $i
      "行. 通过初等行变换, 我们可以将第" $i "行变为零行, 于是它就是不可逆的了.")
   ((exercise #:n "10")
    "证明以下练习6的一般化版本. 若" $A "是一个" m*n "矩阵而" $B "是一个"
    (&c* $n $m) "矩阵, 并且" (&< $n $m) ", 那么" (&i* $A $B) "不可逆.")
   (P "设" $R "是" $A "的行简化阶梯矩阵, 那么存在可逆矩阵" $P "满足"
      (&= $A (&i* $P $R)) ", 于是" (&= (&i* $A $B) (&i* $P (@i* $R $B)))
      ". 显然, " (&i* $R $B) "是不可逆的, 因为有零行, 所以" (&i* $A $B)
      "也是不可逆的.")
   ((exercise #:n "11")
    "令" $A "是一个" m*n "矩阵. 证明通过一系列初等行变换和初等列变换可以从"
    $A "得到一个矩阵" $R ", 其既是行简化阶梯矩阵, 也是列简化阶梯矩阵. 也就是说, 如果"
    (&!= $i $j) ", 那么" (&= (_ $R (&cm $i $j)) $0) "; 如果" (&<= $1 $i $r) ", 那么"
    (&= (_ $R (&cm $i $i)) $1) "; 如果" (&> $i $r) ", 那么"
    (&= (_ $R (&cm $i $i)) $0) ". 证明" (&= $R (&i* $P $A $Q)) ", 其中" $P
    "是一个" (&c* $m $m) "的可逆矩阵, 而" $Q "是一个" n*n "的可逆矩阵.")
   ((exercise #:n "12")
    "例子16的结果暗示或许矩阵"
    (MB (&= $A (Mat ($1 (~ $1 $2) $..c (~ $1 $n))
                    ((~ $1 $2) (~ $1 $3) $..c (~ $1 (&+ $n $1)))
                    ($..v $..v $ $..v)
                    ((~ $1 $n) (~ $1 (&+ $n $1)) $..c (~ $1 (&- (&i* $2 $n) $1))))))
    "可逆并且" (inv $A) "的元素都是整数. 你能证明吗?")
   (H2 "第2章 向量空间")
   (H3 "第2.1节 向量空间")
   ((exercise #:n "1")
    "如果" $F "是一个域, 验证" $F^n " (在例子1中被定义) 是一个域" $F "上的向量空间.")
   ((exercise #:n "2")
    "如果" $V "是一个域" $F "上的向量空间, 验证"
    (MB (&= (&+ (@ (&+ $alpha_1 $alpha_2))
                (@ (&+ $alpha_3 $alpha_4)))
            (&+ (bra0 (&+ $alpha_2 (@ (&+ $alpha_3 $alpha_1))))
                $alpha_4)))
    "对于" $V "中所有向量" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "成立.")
   ((exercise #:n "3")
    "如果" $CC "是复数域, 那么" $CC^3 "中哪些向量是"
    (&cm (tu0 $1 $0 $-1) (tu0 $0 $1 $1) (tu0 $1 $1 $1)) "的线性组合?")
   ((exercise #:n "4")
    "令" $V "是所有实数序对" (tu0 $x $y) "的集合, 令" $F "是实数域, 定义"
    (MB (&cm (&= (&+ (tu0 $x $y) (tu0 $x_1 $y_1))
                 (tu0 (&+ $x $x_1) (&+ $y $y_1)))
             (&= (&i* $c (tu0 $x $y))
                 (tu0 (&i* $c $x) (&i* $c $y)))))
    $V "在这些运算下是一个实数域上的向量空间吗?")
   ((exercise #:n "5")
    "在" $RR^n "上定义两个运算"
    (MB (&cm (&= (&oplus $alpha $beta) (&- $alpha $beta))
             (&= (&d* $c $alpha) (&- (&i* $c $alpha)))))
    "右侧的运算即通常的运算, 那么" (tu0 $RR^n $oplus $d*)
    "满足哪些向量空间的公理?")
   ((exercise #:n "6")
    "令" $V "是所有满足"
    (MB (&= (app $f (&- $t)) (OverBar (app $f $t))))
    "的实数轴上的复值函数" $f "的集合. 横杠代表复共轭. 证明" $V
    ", 对于运算"
    (MB (&cm (&= (app (@ (&+ $f $g)) $t)
                 (&+ (app $f $t) (app $g $t)))
             (&= (app (@ (&i* $c $f)) $t)
                 (&i* $c (app $f $t)))))
    "是一个实数域上的向量空间. 给出" $V "中一个不是实值函数的例子.")
   ((exercise #:n "7")
    "令" $V "是实数序对" (tu0 $x $y) "的集合, 令" $F "是实数域, 定义"
    (MB (&cm (&= (&+ (tu0 $x $y) (tu0 $x_1 $y_1))
                 (tu0 (&+ $x $x_1) $0))
             (&= (&i* $c (tu0 $x $y))
                 (tu0 (&i* $c $x) $0))))
    $V "在这些运算下是一个向量空间吗?")
   (H3 "第2.2节 子空间")
   ((exercise #:n "1")
    "以下哪些" $RR^n "中的向量" (&= $alpha (tu0 $a_1 $..h $a_n))
    "的集合是" $RR^n "的子空间 (" (&>= $n $3) ")?"
    (Ol #:attr* '((type "a"))
        (Li "所有满足" (&>= $a_1 $0) "的" $alpha ";")
        (Li "所有满足" (&= (&+ $a_1 (&i* $3 $a_2)) $a_3) "的" $alpha ";")
        (Li "所有满足" (&= $a_2 (_^ $a $1 $2)) "的" $alpha ";")
        (Li "所有满足" (&= (&i* $a_1 $a_2) $0) "的" $alpha ";")
        (Li "所有" $a_2 "为有理数的" $alpha ".")))
   ((exercise #:n "2")
    "令" $V "是所有从" $RR "到" $RR "的函数" $f "构成的(实)向量空间, "
    "以下哪些函数的集合是" $V "的子空间?"
    (Ol #:attr* '((type "a"))
        (Li "所有满足" (&= (app $f $x^2) (^ (bra0 (app $f $x)) $2)) "的" $f ";")
        (Li "所有满足" (&= (app $f $0) (app $f $1)) "的" $f ";")
        (Li "所有满足" (&= (app $f $3) (&+ $1 (app $f $-5))) "的" $f ";")
        (Li "所有满足" (&= (app $f $-1) $0) "的" $f ";")
        (Li "所有连续的" $f ".")))
   ((exercise #:n "3")
    "向量" (tu0 $3 $-1 $0 $-1) "在由向量"
    (&cm (tu0 $2 $-1 $3 $2) (tu0 $-1 $1 $1 $-3) (tu0 $1 $1 $9 $-5))
    "张成的" $RR^4 "的子空间之中吗?")
   ((exercise #:n "4")
    "令" $W "是满足"
    (MB (&LE ((&i* $2 $x_1) $- $x_2 $+ (&i* (~ $4 $3) $x_3) $- $x_4 $ $ $= $0)
             ($x_1 $ $ $+ (&i* (~ $2 $3) $x_3) $ $ $- $x_5 $= $0)
             ((&i* $9 $x_1) $- (&i* $3 $x_2) $+ (&i* $6 $x_3) $-
                            (&i* $3 $x_4) $- (&i* $3 $x_5) $= $0)))
    "的所有" $RR^5 "中的" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5) "的集合. "
    "找出一个张成" $W "的向量的有限集合.")
   ((exercise #:n "5")
    "令" $F "是一个域, " $n "是一个大于等于" $2 "的正整数. "
    "令" $V "是域" $F "上所有" n*n "矩阵的向量空间. "
    "以下哪些" $V "中矩阵" $A "的集合是" $V "的子空间?"
    (Ol #:attr* '((type "a"))
        (Li "所有可逆的" $A ";")
        (Li "所有不可逆的" $A ";")
        (Li "所有满足" (commute* $A $B) "的" $A ", 其中" $B "是" $V
            "中一个固定的矩阵;")
        (Li "所有满足" (&= $A^2 $A) "的" $A ".")))
   ((exercise #:n "6")
    (Ol #:attr* '((type "a"))
        (Li "证明" $RR^1 "的子空间仅有" $RR^1 "和零子空间.")
        (Li "证明" $RR^2 "的子空间是" $RR^2 ", 或是零子空间, 或是由某个" $RR^2
            "中固定的(非零)向量的标量倍数构成. (最后一种类型的子空间, 从直觉上说, "
            "是一条通过原点的直线.)")
        (Li "你能描述" $RR^3 "的子空间吗?")))
   ((exercise #:n "7")
    "令" $W_1 "和" $W_2 "是向量空间" $V "的子空间, 满足" $W_1 "和" $W_2 "之并也是子空间. "
    "证明其中一个空间" $W_i "是另一个的子集.")
   ((proof)
    "假设相反的情况, 那么存在" $w_1 "满足" (&in $w_1 $W_1) "且" (&!in $w_1 $W_2) "和"
    $w_2 "满足" (&in $w_2 $W_2) "且" (&!in $w_2 $W_1) ". 对于" (&+ $w_1 $w_2) ", 鉴于"
    (&union $W_1 $W_2) "是一个子空间, " (&in (&+ $w_1 $w_2) (&union $W_1 $W_2))
    ". 若" (&in (&+ $w_1 $w_2) $W_1) ", 那么"
    (MB $w_2 $= (&- (@ (&+ $w_1 $w_2)) $w_1) $in $W_1)
    "这就与" (&!in $w_2 $W_1) "矛盾. 若" (&in (&+ $w_1 $w_2) $W_2) ", 那么"
    (MB $w_1 $= (&- (@ (&+ $w_1 $w_2)) $w_2) $in $W_2)
    "这就与" (&!in $w_1 $W_2) "矛盾. 因此, 假设是不可能的.")
   ((exercise #:n "8")
    "令" $V "是所有从" $RR "到" $RR "的函数" $f "的向量空间, 令" $V_e "是偶函数的子集, 即满足"
    (&= (app $f (&- $x)) (app $f $x)) "的函数, 令" $V_o "是奇函数的子集, 即满足"
    (&= (app $f (&- $x)) (&- (app $f $x))) "的函数."
    (Ol #:attr* '((type "a"))
        (Li "证明" $V_e "和" $V_o "是" $V "的子空间.")
        (Li "证明" (&= (&+ $V_e $V_o) $V) ".")
        (Li "证明" (&= (&cap $V_e $V_o) (cur0 $0)) ".")))
   ((proof)
    "对于" (&in (&cm $f $g) $V_e) ", 对于每个" (&in $x $RR) ","
    (MB (deriv (app (@ (&+ $f $g)) (&- $x))
               (&+ (app $f (&- $x)) (app $g (&- $x)))
               (&+ (app $f $x) (app $g $x))
               (app (@ (&+ $f $g)) $x)))
    "因此, " (&in (&+ $f $g) $V_e) ". "
    )
   ((exercise #:n "9")
    "令" $W_1 "和" $W_2 "是向量空间" $V "的子空间, 满足"
    (&= (&+ $W_1 $W_2) $V) "且" (&= (&cap $W_1 $W_2) (cur0 $0)) ". "
    "证明对于每个" $V "中的向量" $alpha "存在唯一的" $W_1
    "中的向量" $alpha_1 "和" $W_2 "中的向量" $alpha_2 "满足"
    (&= $alpha (&+ $alpha_1 $alpha_2)) ".")
   (H3 "第2.3节 基和维数")
   ((exercise #:n "1")
    "证明如果两个向量线性相关, 那么其中一个是另一个的标量倍数.")
   ((proof)
    "给定向量" $alpha "和" $beta ", 若它们线性相关, 那么存在不全为零的标量"
    $lambda "和" $mu "满足"
    (MB (&= (&+ (&i* $lambda $alpha) (&i* $mu $beta)) $0))
    "如果" (&!= $lambda $0) ", 那么"
    (MB (&= $alpha (&i* (pare (&- (~ $mu $lambda))) $beta)))
    "如果" (&!= $mu $0) ", 那么"
    (MB (&= $beta (&i* (pare (&- (~ $lambda $mu))) $alpha))))
   ((exercise #:n "2")
    "向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $2 $4))
             (&= $alpha_2 (tu0 $2 $-1 $-5 $2))
             (&= $alpha_3 (tu0 $1 $-1 $-4 $0))
             (&= $alpha_4 (tu0 $2 $1 $1 $6))
             ))
    "在" $RR^4 "中线性无关吗?")
   ((exercise #:n "3")
    "找到由练习2的四个向量张成的" $RR^4 "的子空间的一个基.")
   ((exercise #:n "4")
    "证明向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $2 $1))
             (&= $alpha_3 (tu0 $0 $-3 $2))))
    "构成了" $RR^3 "的一个基. 将每个标准基向量表达为"
    (&cm $alpha_1 $alpha_2 $alpha_3) "的线性组合.")
   ((exercise #:n "5")
    "找出" $RR^3 "中的三个向量, 它们线性相关, 但是两两线性无关.")
   (MB (&cm (tu0 $1 $0 $0) (tu0 $0 $1 $0) (tu0 $1 $1 $0)))
   ((exercise #:n "6")
    "令" $V "是域" $F "上的" (&c* $2 $2) "矩阵的向量空间. "
    "通过给出" $V "的一个具有四个元素的基, 证明" $V "的维数是" $4 ".")
   ((exercise #:n "7")
    "令" $V "是练习6的向量空间, 令" $W_1 "是由形式为"
    (MB (Mat ($x (&- $x))
             ($y $z)))
    "的矩阵构成的集合, 令" $W_2 "是由形式为"
    (MB (Mat ($a $b)
             ((&- $a) $c)))
    "的矩阵构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W_1 "和" $W_2 "是" $V "的子空间.")
        (Li "找出" (&cm $W_1 $W_2 (&+ $W_1 $W_2) (&cap $W_1 $W_2))
            "的维数.")))
   ((exercise #:n "8")
    "又一次令" $V "是域" $F "上的" (&c* $2 $2) "矩阵的向量空间. "
    "找出" $V "的一个基" (setE $A_1 $A_2 $A_3 $A_4)
    "满足对于每个" $j "有" (&= (_^ $A $j $2) $A_j) ".")
   ((exercise #:n "9")
    "令" $V "是复数域的一个子域" $F "上的一个向量空间. "
    "设" (&cm $alpha $beta $gamma) "是" $V "中线性无关的向量. 证明"
    (&cm (@ (&+ $alpha $beta))
         (@ (&+ $beta $gamma))
         (@ (&+ $gamma $alpha)))
    "是线性无关的.")
   ((exercise #:n "10")
    "令" $V "是域" $F "上的一个向量空间. 设有限数目的向量"
    (&cm $alpha_1 $..h $alpha_r) "能够张成" $V ". 证明"
    $V "是有限维的.")
   ((exercise #:n "11")
    "令" $V "是复数域上所有满足" (&= (&+ (mref $A $1 $1) (mref $A $2 $2)) $0)
    "的" (&c* $2 $2) "矩阵" $A "构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明在通常的运算下, " $V "是实数域上的向量空间.")
        (Li "找出该向量空间的一个基.")
        (Li "令" $W "为" $V "中满足"
            (&= (mref $A $2 $1) (&- (OverBar (mref $A $1 $2))))
            "的矩阵" $A "的集合, 其中横杠代表复数共轭. 证明"
            $W "是" $V "的子空间并找出" $W "的一个基.")))
   ((exercise #:n "12")
    "通过找出向量空间的一个基, 证明域" $F "上的" m*n
    "矩阵构成的向量空间的维数是" (&i* $m $n) ".")
   ((exercise #:n "13")
    "讨论练习9, 其中" $V "是二元域上的向量空间. 二元域见第1.2节的练习5.")
   ((exercise #:n "14")
    "令" $V "是实数集合. 若将" $V "视为有理数域上的向量空间 (带有通常的运算), "
    "证明该向量空间不是有限维的.")
   ((proof)
    "若" $RR "是" $QQ "上的有限维向量空间, 那么对于某个正整数" $n
    "有" $RR "同构于" $QQ^n ", 但是显然" $RR "不可数, " $QQ^n
    "可数, 因此" $RR "不可能是" $QQ "上的有限维向量空间.")
   (H3 "第2.4节 坐标")
   ((exercise #:n "1")
    "证明向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $0 $0))
             (&= $alpha_2 (tu0 $0 $0 $1 $1))
             (&= $alpha_3 (tu0 $1 $0 $0 $4))
             (&= $alpha_4 (tu0 $0 $0 $0 $2))))
    "构成了" $RR^4 "的一个基. 找出每个标准基向量在有序基"
    (setE $alpha_1 $alpha_2 $alpha_3 $alpha_4)
    "下的坐标.")
   ((exercise #:n "2")
    "找出向量" (tu0 $1 $0 $1) "在" $CC^3 "的有序基"
    (&cm (tu0 (&i* $2 $i) $1 $0) (tu0 $2 $-1 $1) (tu0 $0 (&+ $1 $i) (&- $1 $i)))
    "下的坐标矩阵.")
   ((exercise #:n "3")
    "令" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "是由"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $1 $1))
             (&= $alpha_3 (tu0 $1 $0 $0))))
    "构成的" $RR^3 "的有序基. 那么, 向量" (tu0 $a $b $c)
    "在有序基" $BBB "下的坐标是什么呢?")
   ((exercise #:n "4")
    "令" $W "是由" (&= $alpha_1 (tu0 $1 $0 $i)) "和" (&= $alpha_2 (tu0 (&+ $1 $i) $1 $-1))
    "张成的" $CC^3 "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $alpha_1 "和" $alpha_2 "构成了" $W "的一个基.")
        (Li "证明" (&= $beta_1 (tu0 $1 $1 $0)) "和" (&= $beta_2 (tu0 $1 $i (&+ $1 $i)))
            "也在" $W "中并且构成了" $W "的另一个基.")
        (Li $alpha_1 "和" $alpha_2 "在" $W "的有序基" (setE $beta_1 $beta_2)
            "下的坐标是什么?")))
   ((exercise #:n "5")
    "令" (&= $alpha (tu0 $x_1 $x_2)) "和" (&= $beta (tu0 $y_1 $y_2)) "是" $RR^2 "中满足"
    (MB (&cm (&= (&+ (&i* $x_1 $y_1) (&i* $x_2 $y_2)) $0)
             (&= (&+ (_^ $x $1 $2) (_^ $x $2 $2))
                 (&+ (_^ $y $1 $2) (_^ $y $2 $2))
                 $1)))
    "的向量. 证明" (&= $BBB (setE $alpha $beta)) "是" $RR^2 "的一个基. 找出向量" (tu0 $a $b)
    "在有序基" (&= $BBB (setE $alpha $beta)) "下的坐标. (" $alpha "和" $beta
    "上的条件, 从几何上说, 指的是" $alpha "和" $beta "垂直, 并且每个长度均为" $1 ".)")
   ((exercise #:n "6")
    "令" $V "是一个复数域上的向量空间, 其由所有从" $RR "到" $CC "的函数构成, 即实轴上所有复值函数的空间. 令"
    (&cm (&= (app $f_1 $x) $1) (&= (app $f_2 $x) (^ $e (&i* $i $x)))
         (&= (app $f_3 $x) (^ $e (&- (&i* $i $x)))))
    "."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&cm $f_1 $f_2 $f_3) "是线性无关的.")
        (Li "令" (&cm (&= (app $g_1 $x) $1) (&= (app $g_2 $x) (&cos $x)) (&= (app $g_3 $x) (&sin $x)))
            ", 找出一个" (&c* $3 $3) "的矩阵" $P "满足"
            (MB (&= $g_j (sum (&= $i $1) $3 (&i* (mref $P $i $j) $f_i))) "."))))
   ((exercise #:n "7")
    "令" $V "是所有阶数小于等于" $2 "的从" $RR "到" $RR "的多项式函数构成的(实)向量空间, 即由所有形式为"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "的函数" $f "构成的空间. 令" $t "是一个固定的实数, 定义"
    (MB (&cm (&= (app $g_1 $x) $1) (&= (app $g_2 $x) (&+ $x $t)) (&= (app $g_3 $x) (^ (@+ $x $t) $2))))
    "证明" (&= $BBB (setE $g_1 $g_2 $g_3)) "是" $V "的一个基. 如果"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "那么" $f "在此有序基" $BBB "下的坐标是什么呢?")
   (H3 "第2.5节 行等价的总结")
   (H3 "第2.6节 关于子空间的计算")
   ((exercise #:n "1")
    "令" (&< $s $n) "而" $A "是一个域" $F "上的" (&c* $s $n) "矩阵, 使用定理4 (但不是其证明) "
    "证明" $F^n*1 "中存在非零的" $X "满足" AX=0 ".")
   ((exercise #:n "2")
    "令"
    (MB (&cm (&= $alpha_1 (tu0 $1 $1 $-2 $1))
             (&= $alpha_2 (tu0 $3 $0 $4 $-1))
             (&= $alpha_3 (tu0 $-1 $2 $5 $2))))
    "令"
    (MB (&cm (&= $alpha (tu0 $4 $-5 $9 $-7))
             (&= $beta (tu0 $3 $1 $-4 $4))
             (&= $gamma (tu0 $-1 $1 $0 $1))))
    (Ol #:attr* '((type "a"))
        (Li (&cm $alpha $beta $gamma) "中哪些在" $alpha_i "张成的" $RR^4 "的子空间之中?")
        (Li (&cm $alpha $beta $gamma) "中哪些在" $alpha_i "张成的" $CC^4 "的子空间之中?")
        (Li "这是否暗示了一个定理?")))
   ((exercise #:n "3")
    "考虑以下" $RR^4 "中的向量"
    (MB (&cm (&= $alpha_1 (tu0 $-1 $0 $1 $2))
             (&= $alpha_2 (tu0 $3 $4 $-2 $5))
             (&= $alpha_3 (tu0 $1 $4 $0 $9))))
    "找出一个齐次线性方程组, 其解空间恰是这些向量张成的子空间.")
   ((exercise #:n "4")
    "在" $CC^3 "中, 令"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 (&- $i)))
             (&= $alpha_2 (tu0 (&+ $1 $i) (&- $1 $i) $1))
             (&= $alpha_3 (tu0 $i $i $i))))
    "证明这些向量构成了" $CC^3 "的一个基. 向量" (tu0 $a $b $c)
    "在这个基下的坐标是什么?")
   ((exercise #:n "5")
    "给出" $RR^5 "中的向量"
    (MB (&= $beta (tu0 $b_1 $b_2 $b_3 $b_4 $b_5)))
    "的显式描述, 其为向量"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $2 $1 $-1))
             (&= $alpha_2 (tu0 $-1 $2 $-4 $2 $0))
             (&= $alpha_3 (tu0 $2 $-1 $5 $2 $1))
             (&= $alpha_4 (tu0 $2 $1 $3 $5 $2))))
    "的线性组合.")
   ((exercise #:n "6")
    "令" $V "是由矩阵"
    (MB (&= $A (Mat ($3 (Mn "21") $0 $9 $0)
                    ($1 $7 $-1 $-2 $-1)
                    ($2 (Mn "14") $0 $6 $1)
                    ($6 (Mn "42") $-1 (Mn "13") $0))))
    "的行张成的实向量空间."
    (Ol #:attr* '((type "a"))
        (Li "找出" $A "的一个基.")
        (Li "什么样的向量" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5)
            "是" $V "的元素.")
        (Li "如果" (tu0 $x_1 $x_2 $x_3 $x_4 $x_5) "在" $V "中, 那么"
            "它在a选择的基下的坐标是什么?")))
   ((exercise #:n "7")
    "令" $A "是域" $F "上的" m*n "矩阵, 考虑线性方程组" AX=Y
    ". 证明该线性方程组有解当且仅当" $A "的行秩等于其增广矩阵的行秩.")
   (H2 "第3章 线性变换")
   (H3 "第3.1节 线性变换")
   ((exercise #:n "1")
    "以下哪些函数" $T "是从" $RR^2 "到" $RR^2 "的线性变换呢?"
    (let ((Tdef (lambda (v1 v2)
                  (&= (ap $T (tu0 $x_1 $x_2)) (tu0 v1 v2)))))
      (Ol #:attr* '((type "a"))
          (Li (Tdef (&+ $1 $x_1) $x_2) ";")
          (Li (Tdef $x_2 $x_1) ";")
          (Li (Tdef (_^ $x $1 $2) $x_2) ";")
          (Li (Tdef (&sin $x_1) $x_2) ";")
          (Li (Tdef (&- $x_1 $x_2) $0) "."))))
   ((exercise #:n "2")
    "找出有限维向量空间" $V "上的零变换和恒等变换的像, 秩, 零空间, 零化度.")
   ((exercise #:n "3")
    "描述例子2的微分变换和例子5的积分变换的像和零空间.")
   ((exercise #:n "4")
    "存在从" $RR^3 "到" $RR^2 "的线性变换满足" (&= (ap $T (tu0 $1 $-1 $1)) (tu0 $1 $0))
    "且" (&= (ap $T (tu0 $1 $1 $1)) (tu0 $0 $1)) "吗?")
   ((exercise #:n "5")
    "如果"
    (MB (&cm (&= $alpha_1 (tu0 $1 $-1)) (&= $beta_1 (tu0 $1 $0))
             (&= $alpha_2 (tu0 $2 $-1)) (&= $beta_2 (tu0 $0 $1))
             (&= $alpha_3 (tu0 $-3 $2)) (&= $beta_3 (tu0 $1 $1))))
    "存在从" $RR^2 "到" $RR^2 "的线性变换" $T "满足" (&= (ap $T $alpha_i) $beta_i)
    "对于" (&= $i (&cm $1 $2 $3)) "成立吗?")
   ((exercise #:n "6")
    "显式描述 (如练习1和2) 满足"
    (&cm (&= (ap $T $epsilon_1) (tu0 $a $b))
         (&= (ap $T $epsilon_2) (tu0 $c $d)))
    "的从" $F^2 "到" $F^2 "的线性变换" $T ".")
   ((exercise #:n "7")
    "令" $F "是一个复数域的子域, 令" $T "是由"
    (MB (&= (ap $T (tu0 $x_1 $x_2 $x_3))
            (tu0 (&+ (&- $x_1 $x_2) (&i* $2 $x_3))
                 (&+ (&i* $2 $x_1) $x_2)
                 (&+ (&- (&- $x_1) (&i* $2 $x_2)) (&i* $2 $x_3)))))
    "定义的从" $F^3 "到" $F^3 "的函数."
    (Ol #:attr* '((type "a"))
        (Li "验证" $T "是一个线性变换.")
        (Li "如果" (tu0 $a $b $c) "是" $F^3 "中向量, 那么" (&cm $a $b $c)
            "满足什么条件时向量在" $T "的像中? " $T "的秩是多少?")
        (Li (&cm $a $b $c) "满足什么条件时" (tu0 $a $b $c) "在" $T
            "的零空间中? " $T "的零化度是多少?")))
   ((exercise #:n "8")
    "显式描述一个从" $RR^3 "到" $RR^3 "的线性变换, 其像是由"
    (tu0 $1 $0 $-1) "和" (tu0 $1 $2 $2) "张成的子空间.")
   ((exercise #:n "9")
    "令" $V "是域" $F "上的所有" n*n "矩阵构成的向量空间, 令" $B
    "是一个固定的" n*n "矩阵. 如果"
    (MB (&= (app $T $A) (&- AB (&i* $B $A))))
    "验证" $T "是一个从" $V "到" $V "的线性变换.")
   (P (let ((T (lambda (A)
                 (&- (&i* A $B) (&i* $B A)))))
        (MB (deriv (app $T (&+ $A $C))
                   (T (@+ $A $C))
                   (&- (@+ (&i* $A $B) (&i* $C $B))
                       (@+ (&i* $B $A) (&i* $B $C)))
                   (&+ (@ (T $A)) (@ (T $C)))
                   (&+ (app $T $A) (app $T $C))
                   )))
      (let ((T (lambda (A)
                 (&- (&i* A $B) (&i* $B A)))))
        (MB (deriv (app $T (&i* $c $A))
                   (T (@i* $c $A))
                   (&- (&i* $c (@i* $A $B))
                       (&i* $c (@i* $B $A)))
                   (&i* $c (@- (&i* $A $B) (&i* $B $A)))
                   (&i* $c (app $T $A))
                   )))
      )
   ((exercise #:n "10")
    "令" $V "是所有复数的集合, 其被当作实数域上的向量空间 (在通常的运算下). 找出一个从"
    $V "到" $V "的线性变换, 但不是" $CC^1 "上的线性变换, 即不是复线性的.")
   ((exercise #:n "11")
    "令" $V "是" $F "上的" n*1 "矩阵的空间, 令" $W "是" $F "上的" m*1 "矩阵的空间. 令"
    $A "是" $F "上的一个固定的" m*n "矩阵, 令" $T "是由" (&= (app $T $X) (&i* $A $X))
    "定义的从" $V "到" $W "的线性变换. 证明" $T "是零变换当且仅当" $A "是零矩阵.")
   (P "零矩阵推出零变换是显然的. 若" $A "不是零矩阵, 比如非零元出现在第" $j "列, 那么取这样的向量"
      (&in $X $F^n*1) ", 其第" $j "行元素是" $1 ", 而其他行元素为" $0
      ", 可知" (&!= (app $T $X) $0) ", " $T "不是零变换.")
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个" $n "维向量空间, 令" $T "是一个从" $V "到" $V
    "的线性变换, 并且" $T "的像和零空间是相等的. 证明" $n "是偶数. (你能给出这样的线性变换"
    $T "的例子吗?)")
   (P "因为"
      (MB (&= $n (&+ (&rank $T) (&nullity $T)) (&i* $2 (&rank $T))) ",")
      "所以" $n "是偶数. "
      )
   ((exercise #:n "13")
    "令" $V "是一个向量空间, 令" $T "是一个从" $V "到" $V "的线性变换. 证明以下两个关于"
    $T "的陈述是等价的."
    (Ol #:attr* '((type "a"))
        (Li $T "的像与零空间之交是" $V "的零子空间.")
        (Li "如果" (&= (app $T (ap $T $alpha)) $0) ", 那么" (&= (ap $T $alpha) $0) ".")))
   (P "a推出b: 若" (&= (app $T (ap $T $alpha)) $0) ", 那么" (&in (ap $T $alpha) (&ker $T))
      ", 又" (&in (ap $T $alpha) (&img $T)) ", 故"
      (&in (ap $T $alpha) (&= (&cap (&img $T) (&ker $T)) (setE $0)))
      ", 即" (&= (ap $T $alpha) $0) "." (Br)
      "b推出a: 若" (&= (app $T (ap $T $alpha)) $0) "能够推出" (&= (ap $T $alpha) $0)
      ", 设" (&in $beta (&cap (&img $T) (&ker $T))) ". 因为" (&in $beta (&img $T))
      ", 所以存在" (&in $alpha $V) "满足" (&= (ap $T $alpha) $beta) ". 又因为"
      (&in $beta (&ker $T)) ", 所以" (&= (ap $T $beta) $0) ". 于是, "
      (&= (app $T (ap $T $alpha)) $0) ", 这能推出" (&= (ap $T $alpha) $0)
      ", 即" (&= $beta $0) ". 综上所述, " (&= (&cap (&img $T) (&ker $T)) (setE $0)) ".")
   (H3 "第3.2节 线性变换的代数")
   ((exercise #:n "1")
    "令" $T "和" $U "是" $RR^2 "上由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 $x_2 $x_1))
        "和" (&= (appl $U $x_1 $x_2) (tu0 $x_1 $0)))
    "定义的线性算子."
    (Ol #:attr* '((type "a"))
        (Li "如何几何地描述" $T "和" $U "?")
        (Li "像定义" $T "和" $U "一样给出刻画" (&cm (@+ $U $T) (&i* $U $T) (&i* $T $U) $T^2 $U^2)
            "的规则.")))
   ((exercise #:n "2")
    "令" $T "是" $CC^3 "上满足"
    (MB (&cm (&= (ap $T $epsilon_1) (tu0 $1 $0 $i))
             (&= (ap $T $epsilon_2) (tu0 $0 $1 $1))
             (&= (ap $T $epsilon_3) (tu0 $i $1 $0))))
    "的(唯一的)线性算子. " $T "可逆吗?")
   ((exercise #:n "3")
    "令" $T "是" $RR^3 "上由"
    (MB (&= (appl $T $x_1 $x_2 $x_3)
            (tu0 (&i* $3 $x_1) (&- $x_1 $x_2) (&+ (&i* $2 $x_1) $x_2 $x_3))))
    "定义的线性算子. " $T "可逆吗? 如果可逆的话, 像定义" $T "一样给出" (inv $T) "的规则.")
   ((exercise #:n "4")
    "对于练习3的线性算子" $T ", 证明"
    (MB (&= (&i* (@- $T^2 $I) (@- $T (&i* $3 $I))) $0) "."))
   ((exercise #:n "5")
    "令"
    (MB (&= $B (Mat ($1 $-1) ($-4 $4))))
    "令" $T "是由" (&= (app $T $A) (&i* $B $A)) "定义的" (^ $CC (&c* $2 $2))
    "上的线性算子. " $T "的秩是多少? 你能描述" $T^2 "吗?")
   ((exercise #:n "6")
    "令" $T "是从" $RR^3 "到" $RR^2 "的线性变换, 令" $U "是从" $RR^2 "到" $RR^3 "的线性变换. 证明变换"
    (&i* $U $T) "是不可逆的. 给出这个定理的一般化版本.")
   ((exercise #:n "7")
    "找出" $RR^2 "上两个线性算子" $T "和" $U "满足" (&= (&i* $T $U) $0) "但是" (&!= (&i* $U $T) $0) ".")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的向量空间, 令" $T "是" $V "上的一个线性算子. 如果" (&= $T^2 $0)
    ", 关于" $T "的像和零空间的关系你有什么可说的? 给出一个" $RR^2 "上的线性算子" $T
    "的例子, 其满足" (&= $T^2 $0) "但" (&!= $T $0) ".")
   ((exercise #:n "9")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 设存在一个" $V "上的线性算子" $U "满足"
    (&= (&i* $T $U) $I) ". 证明" $T "是可逆的, 并且" (&= $U (inv $T)) ". 给出一个例子表明在"
    $V "不是有限维的情况下这是错的. (提示: 令" (&= $T $D) ", 多项式函数空间上的微分算子.)")
   ((exercise #:n "10")
    "令" $A "是域" $F "上的一个" m*n "矩阵, 令" $T "是由" (&= (app $T $X) (&i* $A $X))
    "定义的从" (^ $F n*1) "到" (^ $F m*1) "的线性变换. 说明在" (&< $m $n) "的情况下" $T
    "可以是满射但不是非奇异的. 类似地, 说明在" (&> $m $n) "的情况下" $T "可以是非奇异的但不是满射.")
   ((exercise #:n "11")
    "令" $V "是一个有限维向量空间, 令" $T "是" $V "上的一个线性算子. 设" (&= (&rank $T^2) (&rank $T))
    ". 证明" $T "的像和零空间是不相交的 (disjoint), 即只有零向量作为共同元素.")
   ((exercise #:n "12")
    "令" (&cm $p $m $n) "是正整数而" $F "是一个域. 令" $V "是域" $F "上的" m*n "矩阵的空间, " $W
    "是域" $F "上的" (&c* $p $n) "矩阵的空间. 令" $B "是一个固定的" (&c* $p $m) "矩阵而" $T
    "是一个由" (&= (app $T $A) (&i* $B $A)) "定义的从" $V "到" $W "的线性变换. 证明" $T
    "可逆当且仅当" (&= $p $m) "且" $B "是一个可逆的" m*m "矩阵.")
   (H3 "第3.3节 同构")
   ((exercise #:n "1")
    "令" $V "是复数集, 令" $F "是实数域. 在通常的运算下, " $V "是" $F
    "上的一个向量空间. 显式描述一个从该空间到" $RR^2 "的同构.")
   ((exercise #:n "2")
    "令" $V "是复数域上的向量空间, 并设存在一个从" $V "到" $CC^3 "的同构" $T
    ". 令" (&cm $alpha_1 $alpha_2 $alpha_3 $alpha_4) "是" $V "中向量, 满足"
    (MB (&cm (&= (ap $T $alpha_1) (tu0 $1 $0 $i))
             (&= (ap $T $alpha_2) (tu0 $-2 (&+ $1 $i) $0))
             (&= (ap $T $alpha_3) (tu0 $-1 $1 $1))
             (&= (ap $T $alpha_4) (tu0 (Msqrt $2) $i $3))) ".")
    (Ol #:attr* '((type "a"))
        (Li $alpha_1 "在" $alpha_2 "和" $alpha_3 "张成的子空间中吗?")
        (Li "令" $W_1 "是" $alpha_1 "和" $alpha_2 "张成的子空间, 令" $W_2 "是" $alpha_3
            "和" $alpha_4 "张成的子空间, 那么" $W_1 "和" $W_2 "的交是什么呢?")
        (Li "找出一个这四个向量" $alpha_j "张成的" $V "的子空间的基.")))
   ((exercise #:n "3")
    "令" $W "是所有" 2*2 "的复Hermite矩阵构成的集合. 正如我们在第2章的例子6中所指出的, 在通常的运算下, "
    $W "是一个实数域上的向量空间. 验证"
    (MB (&\|-> (tu0 $x $y $z $t)
               (Mat ((&+ $t $x) (&+ $y (&i* $i $z)))
                    ((&- $y (&i* $i $z)) (&- $t $x)))))
    "是一个从" $RR^4 "到" $W "的同构.")
   ((exercise #:n "4")
    "表明" (^ $F m*n) "同构于" (^ $F (&i* $m $n)) ".")
   ((exercise #:n "5")
    "令" $V "是复数集, 其可以被视为实数域上的向量空间 (练习1). 我们按照以下方式定义一个从"
    $V "到" 2*2 "实矩阵空间的函数" $T ". 如果" (&= $z (&+ $x (&i* $i $y))) ", 其中"
    $x "和" $y "是实数, 那么"
    (MB (&= (app $T $z) (Mat ((&+ $x (&i* $7 $y)) (&i* $5 $y))
                             ((&- (&i* $10 $y)) (&- $x (&i* $7 $y))))) ".")
    (Ol #:attr* '((type "a"))
        (Li "验证" $T "是一个单射的(实)线性变换.")
        (Li "验证" (preserve* $T $z_1 $z_2) ".")
        (Li "你如何描述" $T "的像?")))
   ((exercise #:n "6")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 证明" $V "和" $W "同构当且仅当"
    (&= (&dim $V) (&dim $W)) ".")
   ((exercise #:n "7")
    "令" $V "和" $W "是域" $F "上的向量空间, " $U "是一个从" $V "到" $W
    "的同构. 证明" (&\|-> $T (&i* $U $T (inv $U))) "是一个从" (&L $V $V) "到"
    (&L $W $W) "的同构.")
   (H3 "第3.4节 通过矩阵表示变换")
   ((exercise #:n "1")
    "令" $T "是" $CC^2 "上由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $x_2)) "定义的线性算子. 令" $BBB
    "是" $CC^2 "的标准有序基而" (&= $BBB^ (setE $alpha_1 $alpha_2)) "是由"
    (&cm (&= $alpha_1 (tu0 $1 $i)) (&= $alpha_2 (tu0 (&- $i) $2))) "定义的有序基."
    (Ol #:attr* '((type "a"))
        (Li $T "相对于" $BBB "和" $BBB^ "的矩阵是什么?")
        (Li $T "相对于" $BBB^ "和" $BBB "的矩阵是什么?")
        (Li $T "在有序基" $BBB^ "下的矩阵是什么?")
        (Li $T "在有序基" (setE $alpha_2 $alpha_1) "下的矩阵是什么?")))
   ((exercise #:n "2")
    "令" $T "是从" $RR^3 "到" $RR^2 "的线性变换, 其由"
    (MB (&= (appl $T $x_1 $x_2 $x_3) (tu0 (&+ $x_1 $x_2) (&- (&i* $2 $x_3) $x_1))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li "如果" $BBB "是" $RR^3 "的标准有序基而" $BBB^ "是" $RR^2 "的标准有序基, 那么" $T
            "相对于" $BBB "和" $BBB^ "的矩阵是什么?")
        (Li "如果" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "且" (&= $BBB^ (tu0 $beta_1 $beta_2)) ", 其中"
            (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1)) (&= $alpha_2 (tu0 $1 $1 $1)) (&= $alpha_3 (tu0 $1 $0 $0))
                     (&= $beta_1 (tu0 $0 $1)) (&= $beta_2 (tu0 $1 $0))))
            $T "相对于" $BBB "和" $BBB^ "的矩阵是什么?")))
   ((exercise #:n "3")
    "令" $T "是" $F^n "上的线性算子, 令" $A "是" $T "在" $F^n "的标准基下的矩阵, 令" $W "是由" $A
    "的列向量张成的" $F^n "的子空间. 请问" $W "和" $T "有何关系?")
   ((exercise #:n "4")
    "令" $V "是域" $F "上的一个二维向量空间, 令" $BBB "是" $V "的一个有序基. 如果" $T "是" $V
    "上的一个线性算子, 并且"
    (MB (&= (coordm $T) (Mat ($a $b) ($c $d))))
    "证明" (&= (: $T^2 $- (&i* (@+ $a $d) $T) $+ (&i* (@- (&i* $a $d) (&i* $b $c)) $I)) $0) ".")
   ((exercise #:n "5")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下的矩阵为"
    (MB (&= $A (Mat ($1 $2 $1) ($0 $1 $1) ($-1 $3 $4))) ".")
    "找出" $T "的像的一个基和" $T "的零空间的一个基.")
   ((exercise #:n "6")
    "令" $T "是" $RR^2 "上由"
    (MB (&= (appl $T $x_1 $x_2) (tu0 (&- $x_2) $x_1)))
    "定义的线性算子."
    (Ol #:attr* '((type "a"))
        (Li $T "在" $RR^2 "的标准基下的矩阵是什么?")
        (Li $T "在有序基" (&= $BBB (setE $alpha_1 $alpha_2)) "下的矩阵是什么, 其中"
            (&= $alpha_1 (tu0 $1 $2)) "且" (&= $alpha_2 (tu0 $1 $-1)) "?")
        (Li "证明对于每个实数" $c ", 算子" (@- $T (&i* $c $I)) "都是可逆的.")
        (Li "证明如果" $BBB "是" $RR^2 "任意的有序基并且" (&= (coordm $T) $A) ", 那么"
            (&!= (&i* (mref $A $1 $2) (mref $A $2 $1)) $0) ".")))
   ((exercise #:n "7")
    "令" $T "是" $RR^3 "上的线性算子, 由"
    (MB (&= (ap $T (tu0 $x_1 $x_2 $x_3))
            (tu0 (&+ (&i* $3 $x_1) $x_3) (&+ (&i* $-2 $x_1) $x_2)
                 (&+ (&- $x_1) (&i* $2 $x_2) (&i* $4 $x_3)))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li $T "在" $RR^3 "的标准有序基下的矩阵是什么?")
        (Li $T "在有序基"
            (MB (setE $alpha_1 $alpha_2 $alpha_3))
            "下的矩阵是什么, 其中"
            (&cm (&= $alpha_1 (tu0 $1 $0 $1)) (&= $alpha_2 (tu0 $-1 $2 $1))
                 (&= $alpha_3 (tu0 $2 $1 $1))) "?")
        (Li "证明" $T "是可逆的, 并如定义" $T "一样给出" (inv $T) "的规则.")))
   ((exercise #:n "8")
    "令" $theta "是一个实数. 证明以下两个矩阵在复数域上是相似的:"
    (MB (&cm (Mat ((&cos $theta) (&- (&sin $theta)))
                  ((&sin $theta) (&cos $theta)))
             (Mat ((^ $e (&i* $i $theta)) $0)
                  ($0 (^ $e (&- (&i* $i $theta)))))))
    "(提示: 令" $T "是" $CC^2 "上的线性算子, 其在标准有序基下由第一个矩阵表示. 接着, 找出向量"
    $alpha_1 "和" $alpha_2 "使得"
    (&cm (&= (ap $T $alpha_1) (&i* (^ $e (&i* $i $theta)) $alpha_1))
         (&= (ap $T $alpha_2) (&i* (^ $e (&- (&i* $i $theta))) $alpha_2)))
    "并且" (setE $alpha_1 $alpha_2) "是一个基.)")
   ((exercise #:n "9")
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $S "和" $T "是" $V "上的线性算子. 我们问: "
    "什么时候存在" $V "的有序基" $BBB "和" $BBB^ "使得" (&= (coordm $S) (coordm $T $BBB^))
    "? 证明这样的基存在当且仅当存在一个" $V "上的可逆线性算子" $U "使得" (&= $T (&i* $U $S (inv $U)))
    ". (证明大纲: 如果" (&= (coordm $S) (coordm $T $BBB^)) ", 令" $U "是将" $BBB "映射成"
    $BBB^ "的线性算子, 然后表明" (&= $S (&i* $U $T (inv $U))) ". 反过来, 如果对于某个可逆的"
    $U "有" (&= $T (&i* $U $S (inv $U))) ", 令" $BBB "是" $V "任意的有序基, 令" $BBB^
    "是其在" $U "下的像 [译注: 当然要保持顺序], 然后表明" (&= (coordm $S) (coordm $T $BBB^)) ".)")
   ((exercise #:n "10")
    "我们已经知道由" (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) "定义的" $RR^2 "上的线性算子" $T
    "在标准有序基下由矩阵"
    (MB (&= $A (Mat ($1 $0) ($0 $0))))
    "表示. 这个算子满足" (&= $T^2 $T) ". 证明如果" $S "是一个" $RR^2 "上满足" (&= $S^2 $S)
    "的线性算子, 那么" (&= $S $0) ", 或者" (&= $S $I) ", 或者存在" $RR^2 "的一个有序基使得"
    (&= (coordm $S) $A) ".")
   ((exercise #:n "11")
    "令" $W "是域" $F "上所有" n*1 "矩阵构成的空间. 如果" $A "是域" $F "上的一个" n*n "矩阵, 那么"
    $A "通过左乘定义了一个" $W "上的线性算子" $L_A ": " (&= (app $L_A $X) (&i* $A $X))
    ". 证明每个" $W "上的线性算子都是左乘某个" n*n "矩阵, 即是对于某个矩阵" $A "而言的" $L_A "." (Br)
    "现在设" $V "是域" $F "上的一个" $n "维向量空间, 令" $BBB "是" $V "的一个有序基. 对于每个" $V
    "中的" $alpha ", 定义" (&= (ap $U $alpha) (coordm $alpha)) ". 证明" $U "是一个从" $V "到" $W
    "的线性算子. 如果" $T "是一个" $V "的线性算子, 那么" (&i* $U $T (inv $U)) "是一个" $W
    "上的线性算子. 于是, " (&i* $U $T (inv $U)) "是一个左乘某个" n*n "矩阵" $A "的变换, 那么"
    $A "是什么呢?")
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个" $n "维向量空间, 令" basis:def
    "是" $V "的一个有序基."
    (Ol #:attr* '((type "a"))
        (Li "根据定理1, 存在唯一的" $V "上的线性算子" $T "满足"
            (MB (&cm (&= (ap $T $alpha_j) (_ $alpha (&+ $j $1)))
                     (&= $j (&cm $1 $..h (&- $n $1)))
                     (&= (ap $T $alpha_n) $0)) ".")
            $T "在有序基" $BBB "下的矩阵" $A "是什么?")
        (Li "证明" (&= $T^n $0) "但是" (&!= (^ $T (&- $n $1)) $0) ".")
        (Li "令" $S "是" $V "上任意的满足" (&= $S^n $0) "但是" (&!= (^ $S (&- $n $1)) $0)
            "的线性算子. 证明存在" $V "的有序基" $BBB^ "使得" $S "在" $BBB^ "下的表示是a里的矩阵" $A ".")
        (Li "证明如果" $M "和" $N "是域" $F "上满足" (&= $M^n $N^n $0) "但是" (&!= (^ $M (&- $n $1)) $0)
            "且" (&!= (^ $N (&- $n $1)) $0) "的" n*n "矩阵, 那么" $M "和" $N "是相似的.")))
   ((exercise #:n "13")
    "令" $V "和" $W "是域" $F "上的有限维向量空间. 令" $T "是一个从" $V "到" $W "的线性变换. 如果"
    (MB basis:def
        "和" (&= $BBB^ (setE $beta_1 $..h $beta_m)))
    "分别是" $V "和" $W "的有序基, 如定理5的证明一样定义线性变换" (&E $p $q) ": "
    (&= (app (&E $p $q) $alpha_i) (&i* (&delta $i $q) $beta_p)) ", 那么"
    (&cm (&E $p $q) (&<= $1 $p $m) (&<= $1 $q $n)) "构成了" (&L $V $W) "的一个基, 并且对于特定的标量"
    (mref $A $p $q) "有"
    (MB (&= $T (sum (&= $p $1) $m
                    (sum (&= $q $1) $n
                         (&i* (mref $A $p $q) (&E $p $q))))) ".")
    (mref $A $p $q) "即" $T "在这个" (&L $V $W) "的基下的坐标. 证明以" (&= (appl $A $p $q) (mref $A $p $q))
    "为元素的矩阵" $A "就恰是" $T "相对于" $BBB "和" $BBB^ "的表示矩阵.")
   (H3 "第3.5节 线性泛函")
   ((exercise #:n "1")
    "在" $RR^3 "中, 令"
    (&cm (&= $alpha_1 (tu0 $1 $0 $1))
         (&= $alpha_2 (tu0 $0 $1 $-2))
         (&= $alpha_3 (tu0 $-1 $-1 $0)))
    "."
    (Ol #:attr* '((type "a"))
        (Li "如果" $f "是" $RR^3 "上满足"
            (MB (&cm (&= (app $f $alpha_1) $1)
                     (&= (app $f $alpha_2) $-1)
                     (&= (app $f $alpha_3) $3)))
            "的线性泛函, 并且" (&= $alpha (tu0 $a $b $c)) ", 找出" (app $f $alpha) ".")
        (Li "显式描述" $RR^3 "上满足"
            (MB (&= (app $f $alpha_1) (app $f $alpha_2) $0)
                "但是" (&!= (app $f $alpha_3) $0))
            "的线性泛函" $f ".")
        (Li "令" $f "是任意的满足"
            (MB (&= (app $f $alpha_1) (app $f $alpha_2) $0)
                "并且" (&!= (app $f $alpha_3) $0))
            "的线性泛函. 如果" (&= $alpha (tu0 $2 $3 $-1)) ", 表明"
            (&!= (app $f $alpha) $0) ".")))
   ((exercise #:n "2")
    "令" (&= $BBB (setE $alpha_1 $alpha_2 $alpha_3)) "是" $CC^3 "的基, 其由"
    (MB (&cm (&= $alpha_1 (tu0 $1 $0 $-1))
             (&= $alpha_2 (tu0 $1 $1 $1))
             (&= $alpha_3 (tu0 $2 $2 $0))))
    "定义. 找出" $BBB "的对偶基.")
   ((exercise #:n "3")
    "如果" $A "和" $B "是域" $F "上的" n*n "矩阵, 证明"
    (&= (&trace (&i* $A $B)) (&trace (&i* $B $A)))
    ", 接着证明相似矩阵有着相同的迹.")
   ((exercise #:n "4")
    "令" $V "是从" $RR "到" $RR "的所有次数小于等于" $2 "的多项式函数" $p ":"
    (MB (&= (app $p $x) (&+ $c_0 (&i* $c_1 $x) (&i* $c_2 $x^2))))
    "构成的向量空间. 定义三个" $V "上的线性泛函如下:"
    (let ((fdef (lambda (n b) (&= (app (_ $f n) $p) (integral $0 b (app $p $x) $x)))))
      (MB (&cm (fdef $1 $1) (fdef $2 $2) (fdef $3 $-1)) "."))
    "证明" (setE $f_1 $f_2 $f_3) "是" $V "的基, 通过找出以其为对偶的" $V "的基.")
   ((exercise #:n "5")
    "如果" $A "和" $B "是" n*n "的复矩阵, 证明" (&= (&- (&i* $A $B) (&i* $B $A)) $I)
    "是不可能的.")
   ((exercise #:n "6")
    "令" $m "和" $n "是正整数而" $F "是一个域. 令" (&cm $f_1 $..h $f_m) "是" $F^n
    "上的线性泛函. 对于" $F^n "中的" $alpha ", 定义"
    (MB (&= (ap $T $alpha) (tu0 (app $f_1 $alpha) $..h (app $f_m $alpha))) ".")
    "证明" $T "是一个从" $F^n "到" $F^m "的线性变换, 接着表明每个从" $F^n "到" $F^m
    "的线性变换都具有以上形式, 对于特定的" (&cm $f_1 $..h $f_m) "而言.")
   ((exercise #:n "7")
    "令" (&= $alpha_1 (tu0 1 0 -1 2)) "和" (&= $alpha_2 (tu0 2 3 1 1)) ", 令" $W
    "是" $alpha_1 "和" $alpha_2 "张成的" $RR^4 "的子空间. 哪些线性泛函" $f ":"
    (MB (&= (appl $f $x_1 $x_2 $x_3 $x_4)
            (LC $c_1 $x_1 $c_2 $x_2 $c_3 $x_3 $c_4 $x_4)))
    "在" $W "的零化子之中呢?")
   ((exercise #:n "8")
    "令" $W "是" $RR^5 "的子空间, 其由下列向量张成:"
    (MB (&cm (&= $alpha_1 (&+ $epsilon_1 (&i* $2 $epsilon_2) $epsilon_3))
             (&= $alpha_2 (&+ $epsilon_2 (&i* $3 $epsilon_3) (&i* $3 $epsilon_4) $epsilon_5))
             (&= $alpha_3 (&+ $epsilon_1 (&i* $4 $epsilon_2) (&i* $6 $epsilon_3)
                              (&i* $4 $epsilon_4) $epsilon_5))) ".")
    "找出" $W^0 "的一个基.")
   ((exercise #:n "9")
    "令" $V "是实数域上的所有" 2*2 "矩阵的向量空间, 令"
    (MB (&= $B (Mat ($2 $-2) ($-1 $1))) ".")
    "令" $W "是" $V "的子空间, 其由所有满足" (&= (&i* $A $B) $0) "的矩阵" $A "构成. 令" $f
    "是" $V "上的线性泛函, 其在" $W "的零化子之中. 设" (&= (app $f $I) $0) "且"
    (&= (app $f $C) $3) ", 其中" $I "是" 2*2 "的恒等矩阵而"
    (MB (&= $C (Mat ($0 $0) ($0 $1))) ".")
    "找出" (app $f $B) ".")
   ((exercise #:n "10")
    "令" $F "是复数域的一个子域. 我们通过"
    (MB (&cm (&= (appl $f_k $x_1 $..h $x_n) (sum (&= $j $1) $n (&i* (@- $k $j) $x_j)))
             (&<= $1 $k $n)))
    "定义" $F^n "上的" $n "个线性泛函, 其中" (&>= $n $2) ". 由" (&cm $f_1 $..h $f_n)
    "零化的子空间维数是多少呢?")
   ((exercise #:n "11")
    "令" $W_1 "和" $W_2 "是有限维向量空间" $V "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (^ (@+ $W_1 $W_2) $0) (&cap (_^ $W $1 $0) (_^ $W $2 $0))) ".")
        (Li "证明" (&= (^ (@ (&cap $W_1 $W_2)) $0) (&+ (_^ $W $1 $0) (_^ $W $2 $0))) ".")))
   ((exercise #:n "12")
    "令" $V "是域" $F "上的一个有限维向量空间. 令" $W "是" $V "的一个子空间. 如果" $f
    "是" $W "上的线性泛函, 证明存在一个" $V "上的线性泛函" $g "满足对于每个" $W "中的" $alpha
    "有" (&= (app $g $alpha) (app $f $alpha)) ".")
   ((exercise #:n "13")
    "令" $F "是复数域的一个子域. 令" $V "是域" $F "上任意的向量空间. 设" $f "和" $g
    "是" $V "上的线性泛函, 并且满足由" (&= (app $h $alpha) (&i* (app $f $alpha) (app $g $alpha)))
    "定义的函数" $h "仍然是" $V "上的线性泛函. 证明" (&= $f $0) "或" (&= $g $0) ".")
   ((exercise #:n "14")
    "令" $F "是特征为零的域. 令" $V "是域" $F "上的一个有限维向量空间. 如果"
    (&cm $alpha_1 $..h $alpha_m) "是" $V "中有限多个向量, 并且每个都异于零向量, 证明存在" $V
    "上的线性泛函" $f "满足"
    (MB (&cm (&!= (app $f $alpha_i) $0) (&= $i (&cm $1 $..h $m))) "."))
   ((exercise #:n "15")
    "根据练习3, 相似的矩阵拥有相同的迹. 因此, 我们可以将有限维空间上的线性算子的迹定义为其在"
    "任意有序基下的矩阵的迹. 这是良定的, 因为所有这样的表示矩阵都是相似的." (Br)
    "现在令" $V "是域" $F "上的" 2*2 "矩阵的向量空间, 令" $P "是一个固定的" 2*2 "矩阵. 令"
    $T "是由" (&= (app $T $A) (&i* $P $A)) "定义的" $V "上的线性算子. 证明"
    (&= (&trace $T) (&i* $2 (&trace $P))) ".")
   ((exercise #:n "16")
    "证明" n*n "矩阵上的迹泛函在以下意义上唯一. 如果" $W "是域" $F "上的" n*n
    "矩阵的空间, 如果" $f "是" $W "上满足对于" $W "中的每个" $A "和" $B "有"
    (&= (app $f (&i* $A $B)) (app $f (&i* $B $A))) "的线性泛函, 那么" $f
    "是迹函数的标量倍数. 另外, 如果" (&= (app $f $I) $n) ", 那么" $f "就是迹函数.")
   ((exercise #:n "17")
    "令" $W "是域" $F "上的" n*n "矩阵的空间. 令" $W_0 "是由所有具有形式" (&= $C (&- (&i* $A $B) (&i* $B $A)))
    "的矩阵" $C "张成的子空间. 证明" $W_0 "恰好就是迹为零的矩阵构成的子空间. (提示: 迹为零的矩阵的空间"
    "的维数是什么? 使用矩阵&quot;单元&quot;, 即恰具有一个非零元素的矩阵, 来构造足够多具有"
    (&- (&i* $A $B) (&i* $B $A)) "形式的线性无关的矩阵.)")
   (H3 "第3.6节 二次对偶")
   ((exercise #:n "1")
    "令" $n "是一个正整数而" $F "是一个域. 令" $W "是" $F^n "中所有满足"
    (&= (&+ $x_1 $..c $x_n) $0) "的" (tu0 $x_1 $..h $x_n) "构成的集合."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W^0 "由所有具有形式"
            (MB (&= (appl $f $x_1 $..h $x_n) (&i* $c (sum (&= $j $1) $n $x_j))))
            "的线性泛函" $f "构成.")
        (Li "证明" $W "的对偶空间" W* "可被&quot;自然地&quot;等同为" $F^n
            "上所有满足" (&= (&+ $c_1 $..c $c_n) $0) "的线性泛函"
            (MB (&= (appl $f $x_1 $..h $x_n) (LC0 $c_1 $x_1 $c_n $x_n)))
            "构成的集合.")))
   ((exercise #:n "2")
    "运用定理20来证明以下事实. 如果" $W "是一个有限维向量空间" $V "的子空间, 并且如果"
    (setE $g_1 $..h $g_r) "是" $W^0 "任意的基, 那么"
    (MB (&= $W (&Cap (&= $i $1) $r (_ $N $g_i))) "."))
   ((exercise #:n "3")
    "令" $S "是一个集合, " $F "是一个域, 以及" (app $V (&\; $S $F)) "是所有从" $S
    "到" $F "的函数构成的空间:"
    (MB (&cm (&= (app (@+ $f $g) $x) (&+ (app $f $x) (app $g $x)))
             (&= (app (@i* $c $f) $x) (&i* $c (app $f $x)))) ".")
    "令" $W "是" (app $V (&\; $S $F)) "任意的" $n "维子空间. 证明存在" $S "中的点"
    (&cm $x_1 $..h $x_n) "和" $W "中的函数" (&cm $f_1 $..h $f_n) "满足"
    (&= (app $f_i $x_j) δij) ".")
   (H3 "第3.7节 线性变换的转置")
   ((exercise #:n "1")
    "令" $F "是一个域, 令" $f "是" $F^2 "上由" (&= (appl $f $x_1 $x_2) (LC $a $x_1 $b $x_2))
    "定义的线性泛函. 对于以下的每个线性算子" $T ", 令" (&= $g (ap $T^t $f)) ", 找出"
    (appl $g $x_1 $x_2) "."
    (Ol #:attr* '((type "a"))
        (Li (&= (appl $T $x_1 $x_2) (tu0 $x_1 $0)) ";")
        (Li (&= (appl $T $x_1 $x_2) (tu0 (&- $x_2) $x_1)) ";")
        (Li (&= (appl $T $x_1 $x_2) (tu0 (&- $x_1 $x_2) (&+ $x_1 $x_2))) ".")))
   ((exercise #:n "2")
    "令" $V "是实数域上的多项式函数的向量空间. 令" $a "和" $b "是固定的实数, 令" $f
    "是" $V "上由"
    (MB (&= (app $f $p) (integral $a $b (app $p $x) $x)))
    "定义的线性泛函. 如果" $D "是" $V "上的微分算子, 那么" (ap $D^t $f) "是什么呢?")
   ((exercise #:n "3")
    "令" $A "是域" $F "上" n*n "矩阵的向量空间, 令" $B "是一个固定的" n*n "矩阵. 如果"
    $T "是" $V "上由" (&= (app $T $A) (&- (&i* $A $B) (&i* $B $A))) "定义的线性算子, "
    $f "是迹函数, 那么" (ap $T^t $f) "是什么呢?")
   ((exercise #:n "4")
    "令" $V "是域" $F "上的一个有限维向量空间, 令" $T "是" $V "上的一个线性算子. 令" $c
    "是一个标量, 设" $V "中存在非零的向量" $alpha "使得" (&= (ap $T $alpha) (&i* $c $alpha))
    ". 证明" $V "上存在一个非零的线性泛函" $f "使得" (&= (ap $T^t $f) (&i* $c $f)) ".")
   ((exercise #:n "5")
    "令" $A "是" $RR "上的" m*n "矩阵. 证明" (&= $A $0) "当且仅当"
    (&= (&trace (&i* $A^t $A)) $0) ".")
   ((exercise #:n "6")
    "令" $n "是一个正整数, 令" $V "是实数域上次数不超过" $n "的多项式函数构成的向量空间, 即所有具有形式"
    (MB (&= (app $f $x) (&+ $c_0 (&i* $c_1 $x) $..c (&i* $c_n $x^n))))
    "的函数构成的空间. 令" $D "是" $V "上的微分算子. 找出转置算子" $D^t "的零空间的一个基.")
   ((exercise #:n "7")
    "令" $V "是域" $F "上的一个有限维向量空间. 证明" (&\|-> $T $T^t) "是一个从" (&L $V $V)
    "到" (&L V* V*) "的同构.")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的" n*n "矩阵构成的向量空间."
    (Ol #:attr* '((type "a"))
        (Li "如果" $B "是一个固定的" n*n "矩阵, 以" (&= (app $f_B $A) (&trace (&i* $B^t $A)))
            "定义一个" $V "上的函数" $f_B ". 证明" $f_B "是" $V "上的一个线性泛函.")
        (Li "证明每个" $V "上的线性泛函都具有以上形式, 即是某个" $B "下的" $f_B ".")
        (Li "证明" (&\|-> $B $f_B) "是一个从" $V "到" V* "的同构.")))
   (H2 "第4章 多项式")
   (H3 "第4.1节 代数")
   (H3 "第4.2节 多项式代数")
   ((exercise #:n "1")
    "令" $F "是复数域的子域, 令" $A "是如下" $F "上的" (&c* $2 $2) "矩阵"
    (MB (&= $A (Mat ($2 $1) ($-1 $3))) ".")
    "对于下列" $F "上的多项式" $f ", 计算" (app $f $A) "."
    (Ol #:attr* '((type "a"))
        (Li (&= $f (: $x^2 $- $x $+ $2)) ";")
        (Li (&= $f (&- $x^3 $1)) ";")
        (Li (&= $f (: $x^2 $- (&i* $5 $x) $+ $7)) ".")))
   ((exercise #:n "2")
    "令" $T "是" $RR^3 "上由"
    (MB (&= (appl $T $x_1 $x_2 $x_3)
            (tu0 $x_1 $x_3 (&- (&i* $-2 $x_2) $x_3))))
    "定义的线性算子. 令" $f "是" $RR "上的多项式, 由"
    (&= $f (&+ (&- $x^3) $2)) "定义. 找出" (app $f $T) ".")
   ((exercise #:n "3")
    "令" $A "是域" $F "上的一个" n*n "对角矩阵, 即对于" (&!= $i $j)
    "有" (&= Aij $0) "的矩阵. 令" $f "是" $F "上的多项式, 由"
    (MB (&= $f (&i* (@- $x (mref $A $1 $1)) $..c (@- $x (mref $A $n $n)))))
    "定义. 矩阵" (app $f $A) "是什么?")
   ((exercise #:n "4")
    "如果" $f "和" $g "是域" $F "上线性无关的多项式, " $h "是域" $F
    "上一个非零的多项式, 证明" (&i* $f $h) "和" (&i* $g $h) "是线性无关的.")
   ((exercise #:n "5")
    "如果" $F "是一个域, 证明" $F^inf "的两个非零元素之积仍然是非零的.")
   ((exercise #:n "6")
    "令" $S "是域" $F "上的某些非零多项式的集合. 如果" $S "中没有两个元素具有相同的次数, 证明"
    $S "在" polyF "中是一个线性无关的集合.")
   ((exercise #:n "7")
    "如果" $a "和" $b "是域" $F "的元素并且" (&!= $a $0) ", 证明多项式"
    (&cm $1 (LC $a $x $b) (^ (@LC $a $x $b) $2) (^ (@LC $a $x $b) $3) $..h)
    "构成了" polyF "的一个基.")
   ((exercise #:n "8")
    "如果" $F "是一个域, " $h "是" $F "上一个满足" (&>= (&deg $h) $1) "的多项式, 证明映射"
    (&\|-> $f (app $f $h)) "是" polyF "上的一个非奇异的线性算子. 证明这个算子是从" polyF
    "到自身的同构当且仅当" (&= (&deg $h) $1) ".")
   ((exercise #:n "9")
    "令" $F "是复数域的一个子域, 定义" polyF "上的变换" (&cm $T $D) "为"
    (MB (&= (ap $T (@sum (&= $i $0) $n (&i* $c_i $x^i)))
            (sum (&= $i $0) $n (&i* (~ $c_i (&+ $1 $i)) (^ $x (&+ $i $1))))))
    "和"
    (MB (&= (ap $D (@sum (&= $i $0) $n (&i* $c_i $x^i)))
            (sum (&= $i $1) $n (&i* $i $c_i (^ $x (&- $i $1))))) ".")
    (Ol #:attr* '((type "a"))
        (Li "证明" $T "是" polyF "上的非奇异线性算子, 并表明" $T "不是可逆的.")
        (Li "证明" $D "是" polyF "上满射的线性算子, 并找出其零空间.")
        (Li "证明" (&= (&i* $D $T) $I) "但是" (&!= (&i* $T $D) $I) ".")
        (Li "证明对于所有" polyF "中的" $f "和" $g "有"
            (&= (ap $T (bra0 (ap (@ap $T $f) $g)))
                (&- (ap (@ap $T $f) (@ap $T $g))
                    (ap $T (bra0 (app $f (ap $T $g)))))) ".")
        (Li "陈述并证明一条与d中为" $T "给出的类似的" $D "的规律.")
        (Li "设" $V "是" polyF "的一个非零的子空间, 其满足对于每个" (&in $f $V)
            ", " (&in (ap $T $f) $V) ". 证明" $V "不是有限维的.")
        (Li "设" $V "是" polyF "的一个有限维子空间. 证明存在整数" (&>= $m $0)
            "使得对于每个" (&in $f $V) "有" (&= (ap $D^m $f) $0) ".")))
   (H3 "第4.3节 Lagrange插值")
   ((exercise #:n "1")
    "使用Lagrange插值公式找出这样一个实系数的多项式" $f ", 其次数小于等于" $3 ", 并且满足"
    (&cm (&= (app $f $-1) $-6) (&= (app $f $0) $2) (&= (app $f $1) $-2) (&= (app $f $2) $6)) ".")
   ((exercise #:n "2")
    "令" (&cm $alpha $beta $gamma $delta) "是实数. 我们问何时能够找到一个域" $RR "上的次数不高于"
    $2 "的多项式" $f "满足"
    (&cm (&= (app $f $-1) $alpha) (&= (app $f $1) $beta)
         (&= (app $f $3) $gamma) (&= (app $f $0) $delta))
    ". 证明当且仅当"
    (MB (&= (: (&i* $3 $alpha) $+ (&i* $6 $beta) $- $gamma $- (&i* $8 $delta)) $0))
    "的时候这是可能的.")
   ((exercise #:n "3")
    "令" $F "是实数域,"
    (MB (&cm (&= $A (Mat ($2 $0 $0 $0) ($0 $2 $0 $0) ($0 $0 $3 $0) ($0 $0 $0 $1)))
             (&= $p (&i* (@- $x $2) (@- $x $3) (@- $x $1)))) ".")
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (app $p $A) $0) ".")
        (Li "令" (&cm $P_1 $P_2 $P_3) "是对于" (&cm (&= $t_1 $2) (&= $t_2 $3) (&= $t_3 $1))
            "的Lagrange多项式, 计算" (&cm (&= $E_i (app $P_i $A)) (&= $i (&cm $1 $2 $3))) ".")
        (Li "证明" (&= (&+ $E_1 $E_2 $E_3) $I) "; 如果" (&!= $i $j) ", " (&= (&i* $E_i $E_j) $0)
            "; " (&= (_^ $E $i $2) $E_i) ".")
        (Li "证明" (&= $A (&+ (&i* $2 $E_1) (&i* $3 $E_2) $E_3)) ".")))
   ((exercise #:n "4")
    "令" (&= $p (&i* (@- $x $2) (@- $x $3) (@- $x $1))) ", 令" $T "是" $RR^4 "上任意的满足"
    (&= (app $p $T) $0) "的线性算子. 令" (&cm $P_1 $P_2 $P_3) "是练习3的Lagrange多项式. 令"
    (&cm (&= $E_i (app $P_i $T)) (&= $i (&cm $1 $2 $3))) ". 证明" (&= (&+ $E_1 $E_2 $E_3) $I)
    "; 如果" (&!= $i $j) ", " (&= (&i* $E_i $E_j) $0) "; " (&= (_^ $E $i $2) $E_i) "; "
    (&= $T (&+ (&i* $2 $E_1) (&i* $3 $E_2) $E_3)) ".")
   ((exercise #:n "5")
    "令" $n "是一个正整数, " $F "是一个域. 设" $A "是域" $F "上的一个" n*n "矩阵, " $P
    "是域" $F "上一个可逆的" n*n "矩阵. 如果" $f "是域" $F "上任意的多项式, 证明"
    (MB (&= (app $f (sim $A)) (sim (app $f $A))) "."))
   ((exercise #:n "6")
    "令" $F "是一个域. 我们已经考虑了由&quot;在" $t "处求值&quot;得到的"
    polyF "上的相当特殊的线性泛函:"
    (MB (&= (app $L $f) (app $f $t)) ".")
    "这样的线性泛函不仅是线性的, 还具有" (preserve* $L $f $g) "的性质. 证明如果" $L
    "是" polyF "上的线性泛函, 并且满足"
    (MB (preserve* $L $f $g))
    "对于所有的域" $F "上的多项式" $f "和" $g "成立, 那么要么" (&= $L $0) ", 要么存在"
    (&in $t $F) "使得对于每个多项式" $f "有" (&= (app $L $f) (app $f $t)) ".")
   (H3 "第4.4节 多项式理想")
   ((exercise #:n "1")
    "令" $QQ "是有理数域, 判断以下" (&poly $QQ)
    "的子集是否是理想. 若是理想, 则找出其首项系数为一的生成元."
    (Ol #:attr* '((type "a"))
        (Li "所有偶数次的" $f ";")
        (Li "所有次数大于等于" $5 "的" $f ";")
        (Li "所有满足" (&= (app $f $0) $0) "的" $f ";")
        (Li "所有满足" (&= (app $f $2) (app $f $4) $0)
            "的" $f ";")
        (Li "所有线性算子" $T "的像中的" $f ", 其中" $T "由"
            (MB (&= (ap $T (@sum (&= $i $0) $n (&i* $c_i $x^i)))
                    (sum (&= $i $0) $n
                         (&i* (~ $c_i (&+ $i $1))
                              (^ $x (&+ $i $1))))))
            "定义.")))
   ((exercise #:n "2")
    "找出以下每对多项式的最大公因子"
    (Ol #:attr* '((type "a"))
        (Li (&cm (&+ (&- (&i* $2 $x^5) $x^3 (&i* $3 $x^2) (&i* $6 $x)) $4)
                 (&+ $x^4 (&- $x^3 $x^2 (&i* $2 $x) $2))) ";")
        (Li (&cm (&- (LC 3 $x^4 8 $x^2) 3)
                 (&+ $x^3 (LC 2 $x^2 3 $x 6))) ";")
        (Li (&cm (&- $x^4 (&i* $2 $x^3) (&i* $2 $x^2) (&i* $2 $x) $3)
                 (&+ $x^3 (&i* $6 $x^2) (&i* $7 $x) $1)) ".")))
   ((exercise #:n "3")
    "令" $A "是域" $F "上的一个" n*n "矩阵. 证明所有满足" (&= (app $f $A) $0)
    "的多项式" (&in $f polyF) "构成了一个理想.")
   ((exercise #:n "4")
    "令" $F "是复数域的一个子域, 令"
    (MB (&= $A (Mat (1 -2) (0 3))) ".")
    "找出使得" (&= (app $f $A) $0) "的所有多项式" (&in $f polyF)
    "构成的理想的首项系数为一的生成元.")
   ((exercise #:n "5")
    "令" $F "是一个域, 证明" polyF "中任意数目的理想之交仍然是一个理想.")
   ((exercise #:n "6")
    "令" $F "是一个域, 证明由" (&in (&cm $f_1 $..h $f_n) polyF)
    "生成的理想是所有包含" (&cm $f_1 $..h $f_n) "的理想之交.")
   ((exercise #:n "7")
    "令" $K "是域" $F "的一个子域, 设多项式" (&in (&cm $f $g) (&poly $K))
    ". 令" $M_K "是" (&poly $K) "中由" $f "和" $g "生成的理想, " $M_F
    "是" polyF "中由" $f "和" $g "生成的理想. 证明" $M_K "和" $M_F
    "有着相同的首项系数为一的生成元.")
   (H3 "第4.5节 多项式的素因子分解")
   ((exercise #:n "1")
    "令" $p "是域" $F "上一个首项系数为一的多项式. 令" $f "和" $g "是域" $F "上互素的多项式. 证明"
    (&i* $p $f) "和" (&i* $p $g) "的最大公因子是" $p ".")
   ((exercise #:n "2")
    "默认代数基本定理成立, 证明以下事实. 如果" $f "和" $g "是复数域上的多项式, 那么"
    (&= (&gcd $f $g) $1) "当且仅当" $f "和" $g "没有共同的根.")
   ((exercise #:n "3")
    "令" $D "是" (&poly $CC) "上的微分算子. 令" $f "是复数域上的首项系数为一多项式. 证明"
    (MB (&= $f (&i* (@- $x $c_1) $..c (@- $x $c_k))))
    "其中" (&cm $c_1 $..h $c_k) "是不同的复数, 当且仅当" $f "和" (ap $D $f) "互素. 换言之, " $f
    "没有重复的根当且仅当" $f "和" (ap $D $f) "没有相同的根. (默认代数基本定理成立.)")
   ((exercise #:n "4")
    "证明以下Taylor公式的推广. 令" (&cm $f $g $h) "是某个复数域的子域上的多项式, 并且"
    (&<= (&deg $f) $n) ", 那么"
    (MB (&= (app $f $g) (sum (&= $k $0) $n
                             (&i* (~ $1 (&fact $k))
                                  (app (^ $f (@ $k)) $h)
                                  (^ (@- $g $h) $k)))) ".")
    "(这里" (app $f $g) "代表&quot;应用" $f "于" $g "&quot;.)")
   (P "对于剩余的练习, 我们需要如下定义. 如果" (&cm $f $g $p) "是域" $F "上的多项式并且"
      (&!= $p $0) ", 那么我们称模" $p "下" $f "和" $g "同余, 如果" (@- $f $g) "被" $p
      "整除. 如果模" $p "下" $f "同余于" $g ", 那么我们记"
      (MB (equivmod $f $g) "."))
   ((exercise #:n "5")
    "对于任意的非零多项式" $p ", 证明模" $p "同余是一个等价关系."
    (Ol #:attr* '((type "a"))
        (Li "自反: " (equivmod $f $f) ".")
        (Li "对称: 如果" (equivmod $f $g) ", 那么" (equivmod $g $f) ".")
        (Li "传递: 如果" (equivmod $f $g) "并且" (equivmod $g $h)
            ", 那么" (equivmod $f $h) ".")))
   ((exercise #:n "6")
    "设" (equivmod $f $g) "且" (equivmod $f_1 $g_1) "."
    (Ol #:attr* '((type "a"))
        (Li "证明" (equivmod (&+ $f $f_1) (&+ $g $g_1)) ".")
        (Li "证明" (equivmod (&i* $f $f_1) (&i* $g $g_1)) ".")))
   ((exercise #:n "7")
    "使用练习6证明以下结果. 如果" (&cm $f $g $h $p) "是域" $F "上的多项式而" (&!= $p $0)
    ", 若" (equivmod $f $g) ", 则" (equivmod (app $h $f) (app $h $g))
    ". [译注: 原文是练习7, 应该是练习6. 或许其他地方这样的编号引用错误还有很多, 因为我没有一一检查.]")
   ((exercise #:n "8")
    "如果" $p "是一个 [译注: 非标量] 不可约多项式而" (equivmod (&i* $f $g) $0) ", 那么" (equivmod $f $0)
    "或者" (equivmod $g $0) ". 给出反例说明在" $p "可约的情况下这是错误的.")
   ((answer)
    "这个练习本身只是定理8的重述而已, 也就是说, 对于素多项式 (即非标量的不可约多项式) " $p
    "而言, 如果" $p "整除" (&i* $f $g) ", 那么" $p "整除" $f "或" $p "整除" $g
    ". 若" $p "可约, 举出反例是很简单的, 例如令"
    (&cm (&= $p $x^2) (&= $f $x) (&= $g $x)) ".")
   (H2 "第5章 行列式")
   (H3 "第5.1节 交换环")
   (H3 "第5.2节 行列式函数")
   ((exercise #:n "1")
    "下列每个表达式都定义了一个实数域上的" (&c* $3 $3) "矩阵上的函数" $D ", 其中哪些" $D
    "是" $3 "线性函数?"
    (Ol #:attr* '((type "a"))
        (Li (&= (app $D $A) (&+ (mref $A $1 $1) (mref $A $2 $2) (mref $A $3 $3))) ";")
        (Li (&= (app $D $A) (&+ (^ (@ (mref $A $1 $1)) $2)
                                (&i* $3 (mref $A $1 $1) (mref $A $2 $2)))) ";")
        (Li (&= (app $D $A) (&i* (mref $A $1 $1) (mref $A $1 $2) (mref $A $3 $3))) ";")
        (Li (&= (app $D $A)
                (&+ (&i* (mref $A $1 $3) (mref $A $2 $2) (mref $A $3 $2))
                    (&i* $5 (mref $A $1 $2) (mref $A $2 $2) (mref $A $3 $2)))) ";")
        (Li (&= (app $D $A) $0) ";")
        (Li (&= (app $D $A) $1) ".")))
   (Ol #:attr* '((type "a"))
       (Li "不是, 比如说令" $A "的一行为零就能看出来, " (app $D $A) "可以不为零.")
       (Li "不是, 比如说令" $A "的第三行为零, 但是" (app $D $A) "可以不为零.")
       (Li "不是, 比如说令" $A "的第二行为零, 但是" (app $D $A) "可以不为零.")
       (Li "是的, 它是例子1给出的一类多线性函数的线性组合.")
       (Li "是的, 平凡的情况.")
       (Li "不是, 平凡地不是.")
       )
   ((exercise #:n "2")
    "直接验证前文中的" (&cm $E_1 $E_2 $E_3) "是等同的.")
   ((exercise #:n "3")
    "令" $K "是一个含幺交换环. 如果" $A "是" $K "上的一个" (&c* $2 $2)
    "矩阵, 那么" $A "的古典伴随" (ap $adj $A) "由"
    (MB (&= (ap $adj $A)
            (Mat ((mref $A $2 $2) (&- (mref $A $1 $2)))
                 ((&- (mref $A $2 $1)) (mref $A $1 $1)))))
    "定义. 如果" $det "代表" $K "上的" (&c* $2 $2) "矩阵上唯一的行列式函数, 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&i* (&adj $A) $A) (&i* $A (&adj $A)) (&i* (&det0 $A) $I)) ";")
        (Li (&= (ap $det (&adj $A)) (&det $A)) ";")
        (Li (&= (app $adj $A^t) (^ (&adj $A) $t)) "."))
    "(" $A^t "代表" $A "的转置.)")
   ((exercise #:n "4")
    "令" $A "是一个域" $F "上的" (&c* $2 $2) "矩阵. 证明" $A "可逆当且仅当"
    (&!= (&det $A) $0) ". 当" $A "可逆时, 给出一个" (inv $A) "的公式.")
   ((exercise #:n "5")
    "令" $A "是一个域" $F "上的" (&c* $2 $2) "矩阵, 设" (&= $A^2 $0) ". 证明对于每个标量"
    $c "有" (&= (&det (&- (&i* $c $I) $A)) $c^2) ".")
   ((exercise #:n "6")
    "令" $K "是一个复数域的子域, 并且" $n "是一个正整数. 令" (&cm $j_1 $..h $j_n) "和"
    (&cm $k_1 $..h $k_n) "是不超过" $n "的正整数. 对于一个" $K "上的" n*n "的矩阵" $A
    "而言定义"
    (MB (&= (app $D $A)
            (&i* (appl $A $j_1 $k_1) (appl $A $j_2 $k_2) $..c
                 (appl $A $j_n $k_n))))
    "证明" $D "是" $n "线性的当且仅当整数" (&cm $j_1 $..h $j_n) "是互异的.")
   ((exercise #:n "7")
    "令" $K "是一个含幺交换环. 证明" $K "上的" (&c* $2 $2) "矩阵上的行列式函数对于列是" $2 
    "线性的和交错的.")
   ((exercise #:n "8")
    "令" $K "是一个含幺交换环. 通过规则"
    (MB (&= (app $D $A)
            (&+ (&- (&i* (mref $A $1 $1)
                         (Det ((mref $A $2 $2) (mref $A $2 $3))
                              ((mref $A $3 $2) (mref $A $3 $3))))
                    (&i* (mref $A $1 $2)
                         (Det ((mref $A $2 $1) (mref $A $2 $3))
                              ((mref $A $3 $1) (mref $A $3 $3)))))
                (&i* (mref $A $1 $3)
                     (Det ((mref $A $2 $1) (mref $A $2 $2))
                          ((mref $A $3 $1) (mref $A $3 $2)))))))
    "定义了一个" $K "上的" (&c* $3 $3) "矩阵上的函数" $D ". "
    "证明" $D "对于列而言是交错的和" $3 "线性的.")
   ((exercise #:n "9")
    "令" $K "是一个含幺交换环而" $D "是" $K "上的" n*n "矩阵上的交错的" $n
    "线性函数, 证明"
    (Ol #:attr* '((type "a"))
        (Li "如果" $A "有一行为" $0 ", 那么" (&= (app $D $A) $0) ";")
        (Li "如果" $B "是由" $A "通过将一行的倍数加到另一行上去得到的, 那么"
            (&= (app $D $B) (app $D $A)) ".")))
   ((exercise #:n "10")
    "令" $F "是一个域, " $A "是一个域" $F "上的" (&c* $2 $3) "矩阵. "
    (tu0 $c_1 $c_2 $c_3) "是一个" $F^3 "中的向量, 由"
    (MB (&cm (&= $c_1 (Det ((mref $A $1 $2) (mref $A $1 $3))
                           ((mref $A $2 $2) (mref $A $2 $3))))
             (&= $c_2 (Det ((mref $A $1 $3) (mref $A $1 $1))
                           ((mref $A $2 $3) (mref $A $2 $1))))
             (&= $c_3 (Det ((mref $A $1 $1) (mref $A $1 $2))
                           ((mref $A $2 $1) (mref $A $2 $2))))))
    "定义. 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&rank $A) $2) "当且仅当" (&!= (tu0 $c_1 $c_2 $c_3) $0) ";")
        (Li "如果" $A "的秩为" $2 ", 那么" (tu0 $c_1 $c_2 $c_3)
            "是线性方程组" AX=0 "的解空间的一个基.")))
   ((exercise #:n "11")
    "令" $K "是一个含幺交换环而" $D "是" $K "上的" (&c* $2 $2) "矩阵上的一个交错的" $2
    "线性函数. 证明对于每个" $A "而言有" (&= (app $D $A) (&i* (&det0 $A) (app $D $I)))
    ". 现在使用这个结果, 在不对于矩阵的元素进行计算的情况下, 证明"
    (&= (&det (&i* $A $B)) (&i* (&det0 $A) (&det0 $B))) "对于" $K "上任意的"
    (&c* $2 $2) "矩阵" $A "和" $B "成立.")
   ((exercise #:n "12")
    "令" $F "是一个域, " $D "是一个" $F "上的" n*n "矩阵上的函数. 设"
    (&= (app $D (&i* $A $B)) (&i* (app $D $A) (app $D $B)))
    "对于所有" $A "和" $B "成立. 证明要么对于所有的" $A "有" (&= (app $D $A) $0)
    ", 要么" (&= (app $D $I) $1) ". 在后一种情况, 证明凡" $A "可逆即有"
    (&!= (app $D $A) $0) ".")
   ((exercise #:n "13")
    "令" $RR "是实数域, 令" $D "是一个" $RR "上的" (&c* $2 $2) "矩阵上的函数, 满足"
    (&= (app $D (&i* $A $B)) (&i* (app $D $A) (app $D $B)))
    "对于所有" $A "和" $B "成立, 并设"
    (MB (&!= (ap $D (pare (Mat ($0 $1) ($1 $0))))
             (ap $D (pare (Mat ($1 $0) ($0 $1))))))
    "证明以下命题."
    (Ol #:attr* '((type "a"))
        (Li (&= (app $D $0) $0) ";")
        (Li "如果" (&= $A^2 $0) ", 那么" (&= (app $D $A) $0) ";")
        (Li "如果" $B "由" $A "交换两行 (或交换两列) 获得, 那么"
            (&= (app $D $B) (&- (app $D $A))) ";")
        (Li "如果" $A "有一行 (或一列) 为零, 那么" (&= (app $D $A) $0) ";")
        (Li "若" $A "是奇异的, 那么" (&= (app $D $A) $0) ".")))
   ((exercise #:n "14")
    "令" $A "是域" $F "上的一个" (&c* $2 $2) "矩阵, 那么所有具有形式" (app $f $A)
    "的矩阵, 其中" $f "是" $F "上的一个多项式, 构成了一个含幺交换环" $K ". "
    "如果" $B "是" $K "上的一个" (&c* $2 $2) "矩阵, 那么" $B
    "的行列式是" $F "上的一个" (&c* $2 $2) "矩阵. 设" $I "是" $F "上的"
    (&c* $2 $2) "的恒等矩阵, " $K "上的" (&c* $2 $2) "矩阵" $B "为"
    (MB (&= $B (Mat ((&- $A (&i* (mref $A $1 $1) $I)) (&- (&i* (mref $A $1 $2) $I)))
                    ((&- (&i* (mref $A $2 $1) $I)) (&- $A (&i* (mref $A $2 $2) $I))))))
    "证明" (&= (&det $B) (app $f $A)) ", 其中"
    (&= $f (&+ (&- $x^2 (&i* (@ (&+ (mref $A $1 $1) (mref $A $2 $2))) $x)) (&det $A)))
    ", 并证明" (&= (app $f $A) $0) ".")
   (H3 "第5.3节 置换和行列式的唯一性")
   ((exercise #:n "1")
    "如果" $K "是一个含幺交换环, 而" $K "上的矩阵"
    (MB (&= $A (Mat ($0 $a $b)
                    ((&- $a) $0 $c)
                    ((&- $b) (&- $c) $0))))
    "证明" (&= (&det $A) $0) ".")
   (MB (deriv (&det $A)
              (Det ($0 $a $b)
                   ((&- $a) $0 $c)
                   ((&- $b) (&- $c) $0))
              (&- (&i* $a (Det ($a $b)
                               ((&- $c) $0)))
                  (&i* $b (Det ($a $b)
                               ($0 $c))))
              (&- (&i* $a $b $c)
                  (&i* $b $a $c))
              $0))
   ((exercise #:n "2")
    "证明Vandermonde矩阵"
    (MB (Mat ($1 $a $a^2)
             ($1 $b $b^2)
             ($1 $c $c^2)))
    "的行列式为" (&i* (@ (&- $b $a)) (@ (&- $c $a)) (@ (&- $c $b))) ".")
   (MB (deriv (Det ($1 $a $a^2)
                   ($1 $b $b^2)
                   ($1 $c $c^2))
              (&+
               (&- (Det ($b $b^2)
                        ($c $c^2))
                   (Det ($a $a^2)
                        ($c $c^2)))
               (Det ($a $a^2)
                    ($b $b^2)))
              (: (&i* $b $c^2) $- (&i* $b^2 $c) $- (&i* $a $c^2) $+
                 (&i* $a^2 $c) $+ (&i* $a $b^2) $- (&i* $a^2 $b))
              (: (@ (&i* $b $c^2) $- (&i* $a $c^2)) $+
                 (@ (&i* $a^2 $c) $- (&i* $b^2 $c)) $+
                 (@ (&i* $a $b^2) $- (&i* $a^2 $b)))
              (: (&i* (@ (&- $b $a)) $c^2) $-
                 (&i* (@ (&- $b $a)) (&i* (@ (&+ $a $b)) $c)) $+
                 (&i* (@ (&- $b $a)) (&i* $a $b)))
              (: (&i* (@ (&- $b $a))
                      (brac (: $c^2 $- (&i* (@ (&+ $a $b)) $c) $+
                               (&i* $a $b)))))
              (&i* (@ (&- $b $a)) (@ (&- $c $a)) (@ (&- $c $b)))
              ))
   ((exercise #:n "3")
    "显式列出所有的六个" $3 "阶置换, 判断它们是奇是偶, 然后给出" (&c* $3 $3)
    "行列式的完整公式.")
   (MB (&cm (Ma0 ($1 $2 $3)
                 ($1 $2 $3))
            (Ma0 ($1 $2 $3)
                 ($1 $3 $2))
            (Ma0 ($1 $2 $3)
                 ($2 $1 $3))
            (Ma0 ($1 $2 $3)
                 ($2 $3 $1))
            (Ma0 ($1 $2 $3)
                 ($3 $1 $2))
            (Ma0 ($1 $2 $3)
                 ($3 $2 $1))
            ))
   (P "分别是偶置换, 奇置换, 奇置换, 偶置换, 偶置换, 奇置换. "
      "对于" (&c* $3 $3) "矩阵" $A ","
      (MB (deriv0 (app (Mi "det") $A)
                  $=
                  (sum $sigma $
                       (&i* (@ (&sgn $sigma))
                            (appl $A $1 (ap $sigma $1))
                            (appl $A $2 (ap $sigma $2))
                            (appl $A $3 (ap $sigma $3))))
                  $=
                  (&+ (&i* (brac (&sgn (Ma0 ($1 $2 $3)
                                            ($1 $2 $3))))
                           (appl $A $1 $1)
                           (appl $A $2 $2)
                           (appl $A $3 $3))
                      (&i* (brac (&sgn (Ma0 ($1 $2 $3)
                                            ($1 $3 $2))))
                           (appl $A $1 $1)
                           (appl $A $2 $3)
                           (appl $A $3 $2)))
                  $+
                  (&+ (&i* (brac (&sgn (Ma0 ($1 $2 $3)
                                            ($2 $1 $3))))
                           (appl $A $1 $2)
                           (appl $A $2 $1)
                           (appl $A $3 $3))
                      (&i* (brac (&sgn (Ma0 ($1 $2 $3)
                                            ($2 $3 $1))))
                           (appl $A $1 $2)
                           (appl $A $2 $3)
                           (appl $A $3 $1)))
                  $+
                  (&+ (&i* (brac (&sgn (Ma0 ($1 $2 $3)
                                            ($3 $1 $2))))
                           (appl $A $1 $3)
                           (appl $A $2 $1)
                           (appl $A $3 $2))
                      (&i* (brac (&sgn (Ma0 ($1 $2 $3)
                                            ($3 $2 $1))))
                           (appl $A $1 $3)
                           (appl $A $2 $2)
                           (appl $A $3 $1)))
                  $=
                  (&- (&i* (appl $A $1 $2)
                           (appl $A $2 $1)
                           (appl $A $3 $3))
                      (&i* (appl $A $1 $1)
                           (appl $A $2 $3)
                           (appl $A $3 $2))
                      (&i* (appl $A $1 $2)
                           (appl $A $2 $1)
                           (appl $A $3 $3)))
                  $+
                  (: (&i* (appl $A $1 $2)
                          (appl $A $2 $3)
                          (appl $A $3 $1))
                     $+
                     (&i* (appl $A $1 $3)
                          (appl $A $2 $1)
                          (appl $A $3 $2))
                     $-
                     (&i* (appl $A $1 $3)
                          (appl $A $2 $2)
                          (appl $A $3 $1))))))
   ((exercise #:n "4")
    "令" $sigma "和" $tau "是" $4 "阶置换, 其由"
    (&cm (&= (ap $sigma $1) $2) (&= (ap $sigma $2) $3)
         (&= (ap $sigma $3) $4) (&= (ap $sigma $4) $1))
    "和"
    (&cm (&= (ap $tau $1) $3) (&= (ap $tau $2) $1)
         (&= (ap $tau $3) $2) (&= (ap $tau $4) $4))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li "判断" $sigma "和" $tau "奇偶性.")
        (Li "找出" (&i* $sigma $tau) "和" (&i* $tau $sigma) ".")))
   ((exercise #:n "5")
    "如果" $A "是一个" n*n "的可逆矩阵, 证明" (&!= (&det $A) $0) ".")
   (P "因为" $A "可逆, 所以" $A "是一系列初等矩阵之积, 而"
      (&det $A) "是这些初等矩阵的行列式之积. 鉴于初等矩阵的行列式不为零, 所以"
      (&!= (&det $A) $0) ".")
   ((exercise #:n "6")
    "如果" $A "是某个域上的" (&c* $2 $2) "矩阵, 证明"
    (&= (&det (&+ $I $A)) (&+ $1 (&det $A))) "当且仅当"
    (&= (app (Mi "trace") $A) $0) "."
    )
   ((exercise #:n "7")
    "一个" n*n "的矩阵" $A "被称为三角的, 若每当" (&> $i $j)
    "即有" (&= (mref $A $i $j) $0) ", 或是每当" (&< $i $j)
    "即有" (&= (mref $A $i $j) $0) ". 证明三角矩阵的行列式是其对角线元素之积"
    (&i* (mref $A $1 $1) (mref $A $2 $2) $..c (mref $A $n $n)) ".")
   ((exercise #:n "8")
    "令" $A "是复数域上的一个" (&c* $3 $3) "矩阵. 我们构造一个矩阵"
    (&- (&i* $x $I) $A) ", 其元素是多项式, 该矩阵第" $i "行" $j "列的元素是"
    (&- (&i* (&delta $i $j) $x) (mref $A $i $j)) ". 如果"
    (&= $f (&det (&- (&i* $x $I) $A))) ", 证明" $f "是一个次数为" $3
    "的首项次数为一的多项式. 如果我们将多项式写成"
    (MB (&= $f
            (&i* (@ (&- $x $c_1))
                 (@ (&- $x $c_2))
                 (@ (&- $x $c_3)))))
    "其中" (&cm $c_1 $c_2 $c_3) "是复数, 证明"
    (MB (&= (&+ $c_1 $c_2 $c_3) (&trace $A))
        (Mtext "和")
        (&= (&i* $c_1 $c_2 $c_3) (&det $A))))
   ((exercise #:n "9")
    "令" $n "是一个正整数而" $F "是一个域, 如果" $sigma "是一个" $n "阶置换, 证明函数"
    (MB (&= (appl $T $x_1 $..h $x_n)
            (tu0 (_ $x (ap $sigma $1)) $..h (_ $x (ap $sigma $n)))))
    "是一个" $F^n "上的可逆线性算子.")
   ((exercise #:n "10")
    "令" $F "是一个域, " $n "是一个正整数, " $S "是域" $F "上的" n*n "所有矩阵的集合. "
    "令" $V "是一个从" $S "到" $F "的所有函数构成的向量空间, 令" $W
    "是" $S "上交错" $n "线性形式的集合. 证明" $W "是" $V "的一个子空间. "
    $W "的维数又是多少?")
   ((exercise #:n "11")
    "令" $T "是" $F^n "上的一个线性算子. 定义"
    (MB (&= (appl $D_T $alpha_1 $..h $alpha_n)
            (appl $det (ap $T $alpha_1) $..h (ap $T $alpha_n))))
    (Ol #:attr* '((type "a"))
        (Li "证明" $D_T "是一个交错的" $n "线性函数.")
        (Li "如果"
            (MB (&= $c (appl $det (ap $T $epsilon_1) $..h (ap $T $epsilon_n))))
            "证明对于任意的" $n "个向量" (&cm $alpha_1 $..h $alpha_n) "我们有"
            (MB (&= (appl $det (ap $T $alpha_1) $..h (ap $T $alpha_n))
                    (&i* $c (appl $det $alpha_1 $..h $alpha_n))))
            )
        (Li "如果" $BBB "是" $F^n "任意的有序基, " $A "是" $T "在有序基" $BBB
            "下的矩阵, 证明" (&= (&det $A) $c) ".")
        (Li "你觉得标量" $c "的合理名字是什么?")))
   ((exercise #:n "12")
    "如果" $sigma "是一个" $n "阶置换, " $A "是一个以" (&cm $alpha_1 $..h $alpha_n)
    "为行向量的域" $F "上的" n*n "矩阵, 令" (app $sigma $A)
    "代表以" (&cm (_ $alpha (ap $sigma $1)) $..h (_ $alpha (ap $sigma $n)))
    "为行向量的" n*n "矩阵."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (app $sigma (&i* $A $B)) (&i* (app $sigma $A) $B)) "并且特别地, "
            (&= (app $sigma $A) (&i* (app $sigma $I) $A)) ".")
        (Li "如果" $T "是练习9中的线性算子, 证明" $T "在标准有序基下的矩阵是"
            (app $sigma $I) ".")
        (Li (app (inv $sigma) $I) "是" (app $sigma $I) "的逆矩阵吗?")
        (Li (app $sigma $A) "相似于" $A "吗?")))
   ((exercise #:n "13")
    "证明置换的符号函数在以下意义上是唯一的. 如果" $f "是一个函数, 其赋每个" $n
    "阶置换以一个整数, 并且" (preserve* $f $sigma $tau)
    ", 那么要么" $f "恒为" $0 ", 要么" $f "是符号函数.")
   (H3 "第5.4节 行列式的额外性质")
   ((exercise #:n "1")
    "使用古典伴随公式计算下列" (&c* $3 $3) "实矩阵的逆."
    (MB (&cm (Mat ($-2 $3 $2)
                  ($6 $0 $3)
                  ($4 $1 $-1))
             (Mat ((&cos $theta) $0 (&- (&sin $theta)))
                  ($0 $1 $0)
                  ((&sin $theta) $0 (&cos $theta)))
             ))
    )
   ((exercise #:n "2")
    "使用Cramer法则计算下列每个有理数域上的线性方程组的解."
    (Ol #:attr* '((type "a"))
        (Li (MB (: $lc
                   (Ttle
                    (&Table
                     ($x $+ $y $+ $z $= (Mn "11"))
                     ((&i* $2 $x) $- (&i* $6 $y) $- $z $= $0)
                     ((&i* $3 $x) $+ (&i* $4 $y) $+ (&i* $2 $z) $= $0))))))
        (Li (MB (: $lc
                   (Ttle
                    (&Table
                     ((&i* $3 $x) $- (&i* $2 $y) $= $7)
                     ((&i* $3 $y) $- (&i* $2 $z) $= $6)
                     ((&i* $3 $z) $- (&i* $2 $x) $= $-1))))))))
   ((exercise #:n "3")
    "一个域" $F "上的" n*n "矩阵" $A "被称为斜对称的, 如果" (&= $A^t (&- $A))
    ". 如果" $A "是一个复数域上的" n*n "的斜对称矩阵, 并且" $n "是奇数, 证明"
    (&= (&det $A) $0) ".")
   ((exercise #:n "4")
    "一个域" $F "上的" n*n "矩阵" $A "被称为正交的, 如果" (&= (&i* $A $A^t) $I)
    ". 如果" $A "是正交的, 证明" (&= (&det $A) (&+- $1)) ". 给出一个正交矩阵" $A
    "的例子, 其行列式" (&= (&det $A) $-1) ".")
   ((exercise #:n "5")
    "一个复数域上的" n*n "矩阵被称为是酉的 (unitary), 如果" (&= (&i* $A (ctrans $A)) $I)
    " (" (ctrans $A) "代表" $A "的共轭转置). 如果" $A "是酉矩阵, 证明"
    (&= (&abs (&det $A)) $1) ".")
   ((exercise #:n "6")
    "令" $T "和" $U "是有限维向量空间" $V "上的线性算子, 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&det (&i* $T $U)) (&i* (&det0 $T) (&det0 $U))) ";")
        (Li $T "可逆当且仅当" (&!= (&det $T) $0) ".")))
   ((exercise #:n "7")
    "令" $A "是一个含幺交换环" $K "上的" n*n "矩阵, 设" $A "具有分块形式"
    (MB (&= $A (Mat ($A_1 $0 $..c $0)
                    ($0 $A_2 $..c $0)
                    ($..v $..v $ $..v)
                    ($0 $0 $..c $A_k))))
    "其中" $A_j "是一个" (&c* $r_j $r_j) "矩阵. 证明"
    (MB (&= (&det $A) (&i* (&det0 $A_1) (&det0 $A_2) $..c (&det0 $A_k))))
    )
   ((exercise #:n "8")
    "令" $V "是域" $F "上的" n*n "矩阵构成的向量空间, 令" $B "是" $V
    "的一个固定元素. 令" $T_B "是一个" $V "上的线性算子, 由"
    (&= (app $T_B $A) (&- (&i* $A $B) (&i* $B $A))) "定义. 证明"
    (&= (&det $T_B) $0) "."
    )
   ((exercise #:n "9")
    "令" $A "是域" $F "上的一个" n*n "矩阵, 并且" (&!= $A $0) ". "
    "如果" $r "是一个" $1 "和" $n "之间的正整数, 那么" $A "的" (&c* $r $r)
    "子矩阵是由" $A "删去" (@ (&- $n $r)) "行和" (@ (&- $n $r)) "列得到的. "
    $A "的行列式秩是最大的正整数" $r ", 满足存在" $A "的某个" (&c* $r $r)
    "子矩阵其行列式不为零. 证明" $A "的行列式秩等于" $A "的行秩, 当然也等于" $A "的列秩.")
   ((exercise #:n "10")
    "令" $A "是一个域" $F "上的" n*n "矩阵. 证明至多存在" $n "个不同的标量" $c
    "满足" (&= (&det (&- (&i* $c $I) $A)) $0) ".")
   ((exercise #:n "11")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵. 证明如果" $A "可逆, 那么至多存在" $n
    "个不同的标量" $c "使得矩阵" (&+ (&i* $c $A) $B) "不可逆.")
   ((exercise #:n "12")
    "如果" $V "是域" $F "上的" n*n "矩阵的向量空间, " $B "是" $F "上一个固定的" n*n
    "矩阵, 令" $L_B "和" $R_B "是" $V "上的线性算子, 由"
    (&= (app $L_B $A) (&i* $B $A)) "和" (&= (app $R_B $A) (&i* $A $B)) "定义. 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&det $L_B) (^ (&det0 $B) $n)) ";")
        (Li (&= (&det $R_B) (^ (&det0 $B) $n)) ".")))
   ((exercise #:n "13")
    "令" $V "是复数域上所有的" n*n "矩阵构成的向量空间, 令" $B "是" $CC "上一个固定的"
    n*n "矩阵. 由" (&= (app $M_B $A) (&i* $B $A (ctrans $B)))
    "定义一个" $V "上的线性算子" $M_B ", 其中"
    (&= (ctrans $B) (OverBar $B^t)) ". 证明"
    (MB (&= (&det $M_B) (^ (&abs (&det $B)) (&i* $2 $n))))
    "现在令" $H "是" $V "中所有的Hermite矩阵构成的集合, 称" $A "是Hermite的, 如果"
    (&= $A (ctrans $A)) ", 那么" $H "是实数域上的一个向量空间. "
    "证明由" (&= (app $T_B $A) (&i* $B $A (ctrans $B))) "定义的函数" $T_B
    "实向量空间" $H "上的一个线性算子, 并证明"
    (&= (&det $T_B) (^ (&abs (&det $B)) (&i* $2 $n))) ". "
    "(提示: 计算" $T_B "的时候表明" $V "具有一个由Hermite矩阵构成的基, 然后证明"
    (&= (&det $T_B) (&det $M_B)) ".)")
   ((exercise #:n "14")
    "令" (&cm $A $B $C $D) "是域" $F "上" n*n "的可交换矩阵, 证明"
    (&c* (&i* $2 $n) (&i* $2 $n)) "矩阵"
    (MB (Mat ($A $B)
             ($C $D)))
    "的行列式为" (&det (&- (&i* $A $D) (&i* $B $C))) ".")
   (H2 "第6章 初等标准形式")
   (H3 "第6.1节 引论")
   (H3 "第6.2节 特征值")
   ((exercise #:n "1")
    "以下的每种情形, 令" $T "是" $RR^2 "上的线性算子, 其在" $RR^2 "的标准有序基下由矩阵"
    $A "表示. 并且, 令" $U "是" $CC^2 "上的线性算子, 其在" $CC^2 "的标准有序基下也由矩阵"
    $A "表示. 找出" $T "和" $U "的特征多项式, 找出" $T "和" $U "的特征值, 以及找出每个特征值"
    "所对应的特征空间的一个基."
    (MB (&cm (&= $A (Mat ($1 $0) ($0 $0)))
             (&= $A (Mat ($2 $3) ($-1 $1)))
             (&= $A (Mat ($1 $1) ($1 $1)))) "."))
   ((answer)
    "对于"
    (MB (&= $A (Mat ($1 $0) ($0 $0))))
    "其特征多项式 (也就是" $T "和" $U "的) 为"
    (MB (&= $f (&i* (@- $x $1) $x)))
    "因此" $T "和" $U "的特征值都是" $1 "和" $0 ". 特征值" $1 "下的一个基是" $epsilon_1
    ", 特征值" $0 "下的一个基是" $epsilon_2 ", 而且对于" $T "和" $U "都是一样的." (Br)
    "对于"
    (MB (&= $A (Mat ($2 $3) ($-1 $1))))
    "其特征多项式 (也就是" $T "和" $U "的) 为"
    (MB (&= $f (&+ (&- $x^2 (&i* $3 $x)) $5)))
    "在实数域上其没有根, 而在复数域上的根是"
    (MB (~ (&+- $3 (&i* (Msqrt 11) $i)) $2))
    "所以" $T "没有特征值, " $U "的特征值则是以上两个复数. "
    "代入计算线性方程组的解我们就能找到特征空间的基了." (Br)
    "对于"
    (MB (&= $A (Mat ($1 $1) ($1 $1))))
    "其特征多项式 (也就是" $T "和" $U "的) 为"
    (MB (&= $f (&i* (@- $x $2) $x)))
    "因此" $T "和" $U "的特征值为" $2 "和" $0 ". 在特征值" $2 "下的一个基是"
    (tu0 $1 $1) ", 特征值" $0 "下的一个基是" (tu0 $1 $-1) ", 对于" $T
    "和" $U "皆如此.")
   ((exercise #:n "2")
    "令" $V "是域" $F "上的一个" $n "维向量空间. " $V "上的恒等算子的特征多项式是什么? " $V
    "上的零算子的特征多项式是什么?")
   ((answer)
    $I "的特征多项式为" (^ (@- $x $1) $n) ", 零算子的特征多项式为" $x^n ".")
   ((exercise #:n "3")
    "令" $A "是域" $F "上的一个" n*n "的三角矩阵. 证明" $A "的特征值就是其对角线的元素, 即标量"
    (mref $A $i $i) ".")
   ((answer)
    "根据直接的计算可知"
    (MB (&= (&det (&- (&i* $x $I) $A))
            (&i* (@- $x (mref $A $1 $1)) $..c (@- $x (mref $A $n $n)))))
    "因此, " $A "的特征值就是其对角线的元素.")
   ((exercise #:n "4")
    "令" $T "是" $RR^3 "上在标准有序基下由矩阵"
    (MB (Mat (-9 4 4) (-8 3 4) (-16 8 7)))
    "表示的线性算子. 证明" $T "是可对角化的, 通过给出" $RR^3 "的一个基, 其每个向量都是" $T
    "的特征向量.")
   
   ((exercise #:n "5")
    "令"
    (MB (&= $A (Mat (6 -3 -2) (4 -1 -2) (10 -5 -3))) ".")
    "域" $RR "上" $A "是否相似于一个对角矩阵? 域" $CC "上" $A "是否相似于一个对角矩阵?")
   ((exercise #:n "6")
    "令" $T "是" $RR^4 "上在标准有序基下由矩阵"
    (MB (Mat (0 0 0 0) ($a 0 0 0) (0 $b 0 0) (0 0 $c 0)))
    "表示的线性算子. " (&cm $a $b $c) "在何种条件下使得" $T "是可对角化的?")
   ((exercise #:n "7")
    "令" $T "是" $n "维向量空间" $V "上的一个线性算子. 如果" $T "具有" $n
    "个不同的特征值, 证明" $T "是可对角化的.")
   ((exercise #:n "8")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵, 证明如果" (@- $I AB) "是可逆的, 那么"
    (@- $I (&i* $B $A)) "也是可逆的, 并且"
    (MB (&= (inv (@- $I (&i* $B $A)))
            (&+ $I (&i* $B (inv (@- $I AB)) $A))) "."))
   ((exercise #:n "9")
    "使用练习8的结果证明, 如果" $A "和" $B "是域" $F "上的" n*n "矩阵, 那么" AB
    "和" (&i* $B $A) "在域" $F "中恰好拥有相同的特征值.")
   ((exercise #:n "10")
    "设" $A "是一个" 2*2 "的实对称矩阵, 证明" $A "在" $RR "上相似于一个对角矩阵.")
   ((exercise #:n "11")
    "令" $N "是一个" 2*2 "的复矩阵满足" (&= $N^2 $0) ", 证明要么" (&= $N $0)
    ", 要么" $N "在" $CC "上相似于"
    (MB (Mat (0 0) (1 0)) "."))
   ((exercise #:n "12")
    "使用练习11的结果证明, 如果" $A "是一个" 2*2 "的复矩阵, 那么" $A "在" $CC
    "上相似于以下两种类型的矩阵中的一种:"
    (MB (&cm (Mat ($a 0) (0 $b)) (Mat ($a 0) (1 $a))) "."))
   ((exercise #:n "13")
    "令" $V "是所有从" $RR "到" $RR "的连续函数构成的向量空间, 令" $T "是" $V "上由"
    (MB (&= (app (@ap $T $f) $x) (integral $0 $x (app $f $t) $t)))
    "定义的线性算子, 证明" $T "没有特征值.")
   ((exercise #:n "14")
    "令" $A "是" n*n "的对角矩阵, 它的特征多项式为"
    (MB (&i* (^ (@- $x $c_1) $d_1) $..c (^ (@- $x $c_k) $d_k)))
    "其中" (&cm $c_1 $..h $c_k) "是不同的标量. 令" $V "是所有与" $A "交换的" n*n
    "矩阵构成的向量空间, 证明" $V "的维数是" (&+ (_^ $d $1 $2) $..c (_^ $d $k $2)) ".")
   ((exercise #:n "15")
    "令" $V "是" (^ $F n*n) ", 矩阵" (∈ $A $V) ", " $T "是" $V "上&quot;左乘" $A
    "&quot;的线性算子, " $A "和" $T "具有相同的特征值吗?")
   (H3 "第6.3节 零化多项式")
   ((exercise #:n "1")
    "令" $V "是有限维向量空间. " $V "上的恒等算子的极小多项式是什么? " $V
    "上的零算子的极小多项式是什么?")
   ((exercise #:n "2")
    "令" (&cm $a $b $c) "是一个域" $F "的元素, " $A "是以下" $F "上的" (&c* 3 3) "矩阵:"
    (MB (&= $A (Mat (0 0 $c) (1 0 $b) (0 1 $a))) ".")
    "证明" $A "的特征多项式为" (&- $x^3 (&i* $a $x^2) (&i* $b $x) $c)
    ", 并且这也是" $A "的极小多项式.")
   ((exercise #:n "3")
    "令" $A "是" (&c* 4 4) "的实矩阵"
    (MB (&= $A (Mat (1 1 0 0) (-1 -1 0 0) (-2 -2 2 1) (1 1 -1 0))) ".")
    "证明" $A "的特征多项式为" (&i* $x^2 (^ (@- $x $1) $2)) ", 而这也是其极小多项式.")
   ((exercise #:n "4")
    "练习3的矩阵" $A "在复数域上是可对角化矩阵吗?")
   ((exercise #:n "5")
    "令" $V "是一个" $n "维向量空间而" $T "是" $V "上的一个线性算子. 设存在某个正整数" $k
    "使得" (&= $T^k $0) ", 证明" (&= $T^n $0) ".")
   ((exercise #:n "6")
    "找出一个" (&c* 3 3) "的矩阵, 其极小多项式是" $x^2 ".")
   ((exercise #:n "7")
    "令" $n "是一个正整数, " $V "是次数不超过" $n "的实多项式的向量空间, " $D
    "是" $V "上的微分算子. " $D "的极小多项式是什么?")
   ((exercise #:n "8")
    "令" $P "是" $RR^2 "上将每个向量平行于" $y "轴投影于" $x "轴的算子: "
    (&= (appl $P $x $y) (tu0 $x $0)) ". 表明" $P "是线性的. " $P
    "的极小多项式是什么?")
   ((exercise #:n "9")
    "令" $A "是一个" n*n "的矩阵, 其特征多项式为"
    (MB (&= $f (&i* (^ (@- $x $c_1) $d_1) $..c (^ (@- $x $c_k) $d_k))) ".")
    "证明"
    (MB (&= (LC0 $c_1 $d_1 $c_k $d_k) (&trace $A)) "."))
   ((exercise #:n "10")
    "令" $V "是域" $F "上的" n*n "矩阵的向量空间. 令" $A "是一个固定的" n*n
    "矩阵. 令" $T "是" $V "上由"
    (MB (&= (app $T $B) (&i* $A $B)))
    "定义的线性算子. 证明" $T "的极小多项式是" $A "的极小多项式.")
   ((exercise #:n "11")
    "令" $A "和" $B "是域" $F "上的" n*n "矩阵. 根据6.2节的练习9, 矩阵"
    AB "和" (&i* $B $A) "拥有相同的特征值. 它们有着相同的特征多项式吗? "
    "它们有着相同的极小多项式吗?")
   (H3 "第6.4节 不变子空间")
   ((exercise #:n "1")
    "令" $T "是" $RR^2 "上的线性算子, 其在标准有序基下的矩阵为"
    (MB (&= $A (Mat (1 -1) (2 2))) ".")
    (Ol #:attr* '((type "a"))
        (Li "证明" $T "的不变子空间仅可能是平凡的.")
        (Li "如果" $U "是" $CC^2 "上的线性算子, 其在标准有序基下的矩阵和" $T
            "一样, 表明" $U "拥有一维的不变子空间.")))
   ((exercise #:n "2")
    "令" $W "是" $T "的一个不变子空间. 证明限制算子" $T_W "的极小多项式整除"
    $T "的极小多项式, 但是不涉及矩阵的概念.")
   ((exercise #:n "3")
    "令" $c "是" $T "的一个特征值, " $W "是与特征值" $c "相关的特征空间. 限制算子"
    $T_W "是什么?")
   ((exercise #:n "4")
    "令"
    (MB (&= $A (Mat (0 1 0) (2 -2 2) (2 -3 2))) ".")
    $A "在实数域上相似于三角矩阵吗? 如果可以, 找出这样的一个三角矩阵.")
   ((exercise #:n "5")
    "每个满足" (&= $A^2 $A) "的矩阵" $A "都是可对角化的.")
   ((exercise #:n "6")
    "令" $T "是" $n "维向量空间" $V "上的一个可对角化算子, " $W
    "是在" $T "下不变的一个子空间. 证明限制算子" $T_W "也是可对角化的.")
   ((exercise #:n "7")
    "令" $T "是域" $CC "上的一个有限维向量空间上的一个线性算子. 证明"
    $T "是可对角化的当且仅当" $T "可由某个域" $CC "上根互异的多项式零化.")
   ((exercise #:n "8")
    "令" $T "是" $V "上的一个线性算子. 如果" $V "的每个子空间都在" $T
    "下不变, 那么" $T "是恒等算子的标量倍数.")
   ((exercise #:n "9")
    "令" $T "是区间" (li0 $0 $1) "上的连续函数空间上的不定积分算子"
    (MB (&= (app (@ap $T $f) $x) (integral $0 $x (app $f $t) $t)) ".")
    "多项式函数空间在" $T "下不变吗? 可微函数空间呢? " (&= $x 1/2)
    "时为零的函数空间呢?")
   ((exercise #:n "10")
    "令" $A "是一个" (&c* $3 $3) "的实矩阵. 证明如果" $A "在" $RR
    "上不相似于一个三角矩阵, 那么" $A "在" $CC "上相似于一个对角矩阵.")
   ((exercise #:n "11")
    "对还是错? 若三角矩阵" $A "相似于一个对角矩阵, 那么" $A
    "已经是一个对角矩阵了.")
   ((exercise #:n "12")
    "令" $T "是某个代数闭域" $F "上的一个有限维向量空间上的一个线性算子, "
    $f "是域" $F "上的一个多项式. 证明" $c "是" (app $f $T)
    "的特征值当且仅当" (&= $c (app $f $t)) ", 其中" $t "是" $T "的一个特征值.")
   ((exercise #:n "13")
    "令" (&= $V (^ $F n*n)) ", " (&in $A $V) ", " $V "上的线性算子"
    $T "和" $U "分别由"
    (&cm (&= (app $T $B) (&i* $A $B))
         (&= (app $U $B) (&- (&i* $A $B) (&i* $B $A))))
    "定义."
    (Ol #:attr* '((type "a"))
        (Li "对还是错? 如果" $A "(在" $F "上)可对角化, 那么" $T "是可对角化的.")
        (Li "对还是错? 如果" $A "是可对角化的, 那么" $U "是可对角化的.")))
   (H3 "第6.5节 同时三角化; 同时对角化")
   ((exercise #:n "1")
    "找到一个可逆的实矩阵" $P "使得" (sim $A) "和" (sim $B) "都是对角矩阵, 其中"
    $A "和" $B "是实矩阵"
    (Ol #:attr* '((type "a"))
        (Li (MB (&cm (&= $A (Mat (1 2) (0 2))) (&= $B (Mat (3 -8) (0 -1))))))
        (Li (MB (&cm (&= $A (Mat (1 1) (1 1))) (&= $B (Mat (1 $a) ($a 1))))))))
   ((exercise #:n "2")
    "令" $FFF "是一个" (&c* $3 $3) "复矩阵的交换族. " $FFF
    "至多可以包含多少线性无关的矩阵? " n*n "的情形呢?")
   ((exercise #:n "3")
    "令" $T "是" $n "维空间" $V "上的一个线性算子, 设" $T "具有" $n
    "个不同的特征值. 证明对于任意与" $T "交换的线性算子" $U ", 存在多项式" $g
    "使得" (&= $U (app $g $T)) ".")
   ((exercise #:n "4")
    "令" (&cm $A $B $C $D) "是交换的" n*n "复矩阵. 令" $E "是"
    (&c* (&i* $2 $n) (&i* $2 $n)) "矩阵"
    (MB (&= $E (Mat ($A $B) ($C $D))) ".")
    "证明" (&= (&det $E) (&det (&- (&i* $A $D) (&i* $B $C)))) ".")
   ((exercise #:n "5")
    "令" (&= $V (^ $F n*n)) ", " (∈ $A $V) ", " $V "上的线性算子"
    (&= (app $T_A $B) (&- (&i* $A $B) (&i* $B $A)))
    ". 考虑线性算子族" (setI (∈ $T_A (&L $V $V)) (: $A "为对角矩阵"))
    ", 证明其可以被同时对角化.")
   (H3 "第6.6节 直和分解")
   ((exercise #:n "1")
    "令" $V "是一个有限维向量空间, " $W_1 "是" $V "任意的子空间, 证明存在"
    $V "的子空间" $W_2 "满足" (&= $V (&d+ $W_1 $W_2)) ".")
   ((exercise #:n "2")
    "令" $V "是一个有限维向量空间, 而" (&cm $W_1 $..h $W_k) "是满足"
    (MB (&= $V (&+ $W_1 $..c $W_k)) "且"
        (&= (&dim $V) (&+ (&dim $W_1) $..c (&dim $W_k))))
    "的子空间, 证明" (&= $V (&d+ $W_1 $..c $W_k)) ".")
   ((exercise #:n "3")
    "寻找这样一个投影" $E ", 其将" $RR^2 "沿着由" (tu0 $1 $2)
    "张成的子空间投影至由" (tu0 $1 $-1) "张成的子空间.")
   ((exercise #:n "4")
    "如果" $E_1 "和" $E_2 "是投影至线性无关的子空间的算子, 那么"
    (&+ $E_1 $E_2) "也是一个投影, 对还是错呢?")
   ((exercise #:n "5")
    "如果" $E "是一个投影而" $f "是一个多项式, 那么"
    (&= (app $f $E) (LC $a $I $b $E)) ". 如何以" $f
    "的系数表示" $a "和" $b "?")
   ((exercise #:n "6")
    "对还是错? 如果一个可对角化算子的特征值仅是" $0 "和" $1
    ", 那么它是一个投影.")
   ((exercise #:n "7")
    "证明如果" $E "是沿着" $N "到" $R "上的投影, 那么" (@- $I $E)
    "是沿着" $R "到" $N "上的投影.")
   ((exercise #:n "8")
    "令" (&cm $E_1 $..h $E_k) "是空间" $V "上满足"
    (&= (&+ $E_1 $..c $E_k) $I) "的线性算子."
    (Ol #:attr* '((type "a"))
        (Li "证明若" (&!= $i $j) "时有" (&= (&i* $E_i $E_j) $0)
            ", 那么对于每个" $i "有" (&= (_^ $E $i $2) $E_i) ".")
        (Li "在" (&= $k $2) "的情形下, 证明a的逆, 即若有"
            (&= (&+ $E_1 $E_2) $I) "且"
            (&cm (&= (_^ $E $1 $2) $E_1) (&= (_^ $E $2 $2) $E_2))
            ", 那么" (&= (&i* $E_1 $E_2) $0) ".")))
   ((exercise #:n "9")
    "令" $V "是一个实向量空间, " $E "是" $V "上的一个幂等线性算子, 即"
    "投影, 证明" (@+ $I $E) "是可逆的, 并找出" (inv (@+ $I $E)) "是什么.")
   ((exercise #:n "10")
    "令" $F "是复数域的一个子域 (或者一个特征为零的域), " $V "是" $F
    "上的一个有限维向量空间, " (&cm $E_1 $..h $E_k) "是" $V
    "的投影并且满足" (&= (&+ $E_1 $..c $E_k) $I) ". 证明如果"
    (&!= $i $j) ", 那么" (&= (&i* $E_i $E_j) $0)
    ". (提示: 使用迹函数并问问自己投影的迹是什么.)")
   ((exercise #:n "11")
    "令" $V "是一个向量空间, " (&cm $W_1 $..h $W_k) "是" $V "的子空间, "
    (MB (&= $V_j (&+ $W_1 $..c (_ $W (&- $j $1))
                     (_ $W (&+ $j $1)) $..c $W_k)) ".")
    "设" (&= $V (&d+ $W_1 $..c $W_k)) ", 证明对偶空间" V* "拥有直和分解"
    (&= V* (&d+ (_^ $V $1 $0) $..c (_^ $V $k $0))) ".")
   (H3 "第6.7节 不变直和")
   ((exercise #:n "1")
    "令" $E "是一个" $V "的投影, " $T "是" $V "上的一个线性算子. 证明"
    $E "的像在" $T "下不变当且仅当" (&= (&i* $E $T $E) (&i* $T $E))
    ". 证明" $E "的像与零空间均在" $T "下不变当且仅当" (commute* $E $T) ".")
   ((exercise #:n "2")
    "令" $T "是" $RR^2 "上的线性算子, 其在标准有序基下的矩阵为"
    (MB (Mat ($2 $1) ($0 $2)) ".")
    "令" $W_1 "是由" (&= $epsilon_1 (tu0 $1 $0)) "张成的" $RR^2 "的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W_1 "在" $T "下不变.")
        (Li "证明不存在子空间" $W_2 "满足其在" $T "下不变且与" $W_1 "互补:"
            (MB (&= $RR^2 (&d+ $W_1 $W_2)) "."))))
   ((exercise #:n "3")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, " $R "是" $T
    "的像, " $N "是" $T "的零空间, 证明" $R "和" $N "线性无关当且仅当"
    (&= $V (&d+ $R $N)) ".")
   ((exercise #:n "4")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 设"
    (&= $V (&d+ $W_1 $..c $W_k)) ", 其中每个" $W_i "都在" $T
    "下不变, 令" $T_i "是" $W_i "上导出的(限制)算子."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= (&det $T) (&i* (&det $T_1) $..c (&det $T_k))) ".")
        (Li "证明" $T "的特征多项式是" (&cm $T_1 $..h $T_k)
            "的特征多项式之积.")
        (Li "证明" $T "的极小多项式是" (&cm $T_1 $..h $T_k)
            "的极小多项式的最小公倍式. (提示: 证明并使用与矩阵直和有关的相应事实.)")))
   ((exercise #:n "5")
    "令" $T "是第6.2节例子3中的线性算子, 使用Lagrange多项式将表示矩阵" $A "写成"
    (&cm (&= $A (&+ $E_1 (&i* $2 $E_2)))
         (&= (&+ $E_1 $E_2) $I)
         (&= (&i* $E_1 $E_2) $0))
    "的形式.")
   ((exercise #:n "6")
    "令" $A "是第6.3节例子5中的矩阵, 找出矩阵" (&cm $E_1 $E_2 $E_3) "使得"
    (&cm (&= $A (LC $c_1 $E_1 $c_2 $E_2 $c_3 $E_3))
         (&= (&+ $E_1 $E_2 $E_3) $I)
         (&= (&i* $E_i $E_j) $0) (&!= $i $j)) ".")
   ((exercise #:n "7")
    "在练习5和6中, 注意到(对于每个" $i ")与特征值" $c_i
    "相关联的特征空间由满足" (&!= $j $i) "的各个矩阵" $E_j
    "的列向量张成, 这是巧合吗? [译注: 练习本身很有可能是错误的, "
    "应该将其改为&quot;由" $E_i "的列向量张成&quot;.]")
   ((exercise #:n "8")
    "令" $T "是" $V "上的一个线性算子, 其与每个" $V "的投影交换, 关于"
    $T "你能知道什么?")
   ((exercise #:n "9")
    "令" $V "是区间" (li0 $-1 $1) "上的实值连续函数的向量空间, "
    $W_e "是由偶函数构成的子空间, " $W_o "是由奇函数构成的子空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" (&= $V (&d+ $W_e $W_o)) ".")
        (Li "如果" $T "是不定积分算子"
            (MB (&= (app (@ap $T $f) $x)
                    (integral $0 $x (app $f $t) $t)))
            $W_e "和" $W_o "在" $T "下不变吗?")))
   (H3 "第6.8节 准素分解定理")
   ((exercise #:n "1")
    "令" $T "是" $RR^3 "上的一个线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (6 -3 -2) (4 -1 -2) (10 -5 -3)))
    "表示. 将" $T "的极小多项式" $p "表示为" (&= $p (&i* $p_1 $p_2))
    "的形式, 其中" $p_1 "和" $p_2 "是实数域上首项系数为一的素多项式. 令"
    $W_i "是" (app $p_i $T) "的零空间, 找出" $W_1 "和" $W_2
    "各自的一个基" $BBB_i ". 如果" $T_i "是" $T "在" $W_i
    "上由限制导出的算子, 求出" $T_i "在基" $BBB_i "下的矩阵.")
   ((exercise #:n "2")
    "令" $T "是" $RR^3 "上的一个线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (3 1 -1) (2 2 -1) (2 2 0)))
    "表示. 证明" $RR^3 "上存在可对角化算子" $D "和幂零算子" $N
    "满足" (&= $T (&+ $D $N)) "且" (commute* $D $N)
    ". 找出" $D "和" $N "在标准基下的矩阵. (只需要对于这个特殊情形"
    "重复定理12的证明就够了.)")
   ((exercise #:n "3")
    "如果" $V "是域" $F "上所有次数小于等于" $n "的多项式构成的向量空间, 证明"
    $V "上的微分算子是幂零的.")
   ((exercise #:n "4")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 其特征多项式为"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "而极小多项式为"
    (MB (&= $p (decomp $c_1 $r_1 $c_k $r_k)) ".")
    "令" $W_i "是" (^ (@- $T (&i* $c_i $I)) $r_i) "的零空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W_i "是集合"
            (setI (∈ $alpha $V)
                  (: "存在正整数" $m "满足"
                     (&= (ap (^ (@- $T (&i* $c_i $I)) $m) $alpha) $0)))
            " (" $m "可以依赖于" $alpha ").")
        (Li "证明" $W_i "的维数是" $d_i ". (提示: 如果" $T_i
            "是" $T "于" $W_i "上通过限制导出的算子, 那么" (&- $T_i (&i* $c_i $I))
            "是幂零的; 因而" (&- $T_i (&i* $c_i $I)) "的特征多项式必然是"
            (^ $x $e_i) ", 其中" $e_i "是" $W_i "的维数 (证明?); 于是" $T_i
            "的特征多项式为" (^ (@- $x $c_i) $e_i) "; 现在使用" $T
            "的特征多项式是" $T_i "的特征多项式之积的事实来说明"
            (&= $e_i $d_i) ".)")))
   ((exercise #:n "5")
    "令" $V "是复数域上的一个有限维向量空间. 令" $T "是" $V
    "上的一个线性算子, " $D "是" $T "的可对角化部分. 证明如果" $g
    "是复数域上任意的多项式, 那么" (app $g $T) "的可对角化部分是"
    (app $g $D) ".")
   ((exercise #:n "6")
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子且" (&= (&rank $T) $1) ". 证明" $T
    "要么是可对角化的, 要么是幂零的, 但不可兼任.")
   ((exercise #:n "7")
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子. 设" $T "与" $V "上的每个可对角化算子交换, 证明"
    $T "是恒等算子的标量倍数.")
   ((exercise #:n "8")
    "令" $V "是域" $F "上的" n*n "矩阵的空间, " $A "是域" $F
    "上一个固定的" n*n "矩阵. 我们定义" $V "上的线性算子"
    (&= (app $T_A $B) (&- (&i* $A $B) (&i* $B $A)))
    ". 证明如果" $A "是一个幂零矩阵, 那么" $T_A "是一个幂零算子. "
    "[译注: 参照幂零算子的定义, 可以定义幂零矩阵.]")
   ((exercise #:n "9")
    "给出这样的一个例子, 两个" (&c* $4 $4) "的幂零矩阵具有相同的极小多项式 "
    "(它们的特征多项式必然也是相同的), 但是并不相似.")
   ((exercise #:n "10")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, "
    (&= $p (&i* (_^ $p $1 $r_1) $..c (_^ $p $k $r_k)))
    "是" $T "的极小多项式, " (&= $V (&d+ $W_1 $..c $W_k))
    "是" $T "的准素分解, 即" $W_i "是" (app (_^ $p $i $r_i) $T)
    "的零空间, " $W "是" $V "任意的在" $T "下不变的子空间, 证明"
    (MB (&= $W (&d+ (@cap $W $W_1) (@cap $W $W_2) $..c
                    (@cap $W $W_k))) "."))
   ((exercise #:n "11")
    "以下对于定理13的证明有何问题? 设" $T "的极小多项式是线性因子之积. "
    "那么, 根据定理5, " $T "是可三角化的. 令" $BBB "是一个使得"
    (&= $A (coordm $T)) "为上三角矩阵的有序基. 令" $D
    "是以" (&cm (mref $A $1 $1) $..c (mref $A $n $n))
    "为对角线元素的对角矩阵, 那么" (&= $A (&+ $D $N))
    ", 其中" $N "是一个严格上三角矩阵. 显然" $N "是幂零的. "
    "[译注: 严格上三角矩阵指的是对角线元素均为零的上三角矩阵.]")
   ((exercise #:n "12")
    "如果你已经思考过了练习11, 在你观察到定理7告诉你的关于" $T
    "的可对角化部分和幂零部分的东西之后, 再次思考这个练习.")
   ((exercise #:n "13")
    "令" $T "是" $V "上的一个线性算子, 它的极小多项式具有" $p^n
    "的形式, 其中" $p "在标量域上是不可约的. 证明存在" (∈ $alpha $V)
    "使得" $alpha "的" $T "-annihilator为" $p^n ".")
   ((exercise #:n "14")
    "使用准素分解定理和练习13的结果证明以下结论. 如果" $T
    "是有限维向量空间" $V "上任意的线性算子, 那么存在" (∈ $alpha $V)
    "使得" $alpha "的" $T "-annihilator等于" $T "的极小多项式.")
   ((exercise #:n "15")
    "如果" $N "是" $n "维向量空间" $V "上的一个幂零线性算子, 那么"
    $N "的特征多项式为" $x^n ".")
   ((answer)
    "因为" $N "是一个幂零算子, 所以存在正整数" $m "满足"
    (&= $N^m $0) ". 换言之, " $x^m "是" $N "的一个零化多项式. 于是, 极小多项式"
    $p "整除" $x^m ", 因而" $p "具有" $x^r "的形式, 其中" $r
    "是一个正整数. (若" $n "是正整数, 则" $p "的次数大于等于" $1
    ".) 我们知道" $p "整除特征多项式" $f ", " $f "的次数为" $n
    ", 并且" $p "和" $f "拥有相同的根, 于是" (&= $f $x^n)
    ". 这其实是标量域为代数闭域时才成立的证明, 尽管通过域扩张的定理以及"
    "原文关于极小多项式的注记, 这个证明对于任意的域也是成立的. 然而"
    "这的确有点舍近求远了, 因此或许直接证明更好." (Br)
    "鉴于极小多项式是一次因子之积, 我们知道极小多项式是可三角化的. 三角矩阵的幂"
    "的对角线元素恰是对角线元素之幂. 再根据幂零的定义, 我们知道对角线元素"
    "必须全为零. 很容易根据计算直接看出, 这个矩阵的特征多项式就是" $x^n
    ". 换言之, 幂零算子的特征多项式就是" $x^n ".")
   (H2 "第7章 有理形式和Jordan形式")
   (H3 "第7.1节 循环子空间和零化子")
   ((exercise #:n "1")
    "令" $T "是" $F^2 "上的一个线性算子. 证明对于向量" $alpha ", 若" $alpha
    "非零且" $alpha "不是" $T "的特征向量, 那么" $alpha "是" $T
    "的一个循环向量. 据此, 证明要么" $T "拥有循环向量, 要么" $T
    "是恒等算子的标量倍数.")
   ((exercise #:n "2")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (2 0 0) (0 2 0) (0 0 -1)))
    "表示. 证明" $T "没有循环向量. 由向量" (tu0 1 -1 3) "生成的"
    $T "循环子空间是什么?")
   ((exercise #:n "3")
    "令" $T "是" $CC^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (1 $i 0) (-1 2 (&- $i)) (0 1 1)))
    "表示. 找出向量" (tu0 1 0 0) "的" $T "零化子. 找出"
    (tu0 1 0 $i) "的" $T "零化子.")
   ((exercise #:n "4")
    "证明如果" $T^2 "拥有循环向量, 那么" $T "拥有循环向量. 反过来正确吗?")
   ((exercise #:n "5")
    "令" $V "是域" $F "上的一个" $n "维向量空间, " $N "是" $V
    "上的一个幂零线性算子. 设" (&!= (^ $N (&- $n $1)) $0) ", 令"
    (∈ $alpha $V) "是满足" (&!= (ap (^ $N (&- $n $1)) $alpha) $0)
    "的一个向量. 证明" $alpha "是" $N "的一个循环向量. " $N "在有序基"
    (setE $alpha (ap $N $alpha) $..h (ap (^ $N (&- $n $1)) $alpha))
    "的矩阵是什么?")
   ((exercise #:n "6")
    "给出以下事实的一个直接证明. 如果" $A "是首项系数为一的多项式"
    $p "的同伴矩阵, 那么" $p "是" $A "的特征多项式.")
   ((exercise #:n "7")
    "令" $V "是一个" $n "维向量空间, " $T "是" $V "上的一个线性算子. 设"
    $T "是可对角化的."
    (Ol #:attr* '((type "a"))
        (Li "如果" $T "拥有循环向量, 证明" $T "拥有" $n "个不同的特征值.")
        (Li "如果" $T "拥有" $n "个不同的特征值, 并且" (setE $alpha_1 $..h $alpha_k)
            "是由" $T "的特征向量构成的一个基, 证明"
            (&= $alpha (&+ $alpha_1 $..c $alpha_k))
            "是" $T "的一个循环向量.")))
   ((exercise #:n "8")
    "令" $T "是有限维向量空间" $V "上的一个线性算子. 设" $T "拥有循环向量. 证明如果"
    $U "是任意与" $T "交换的线性算子, 那么" $U "是应用某个多项式于" $T "的结果.")
   (H3 "第7.2节 循环分解和有理形式")
   ((exercise #:n "1")
    "令" $T "是" $F^2 "上在标准有序基下由矩阵"
    (MB (Mat (0 0) (1 0)))
    "表示的线性算子. 令" (&= $alpha_1 (tu0 $0 $1))
    ". 证明" (&!= $F^2 (cyc $alpha_1 $T)) "且不存在非零向量"
    (∈ $alpha_2 $F^2) "满足"
    (&= (&cap (cyc $alpha_2 $T) (cyc $alpha_1 $T)) (setE $0)) ".")
   ((exercise #:n "2")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, "
    $R "是" $T "的像."
    (Ol #:attr* '((type "a"))
        (Li "证明" $R "拥有一个与之互补的" $T "不变子空间当且仅当"
            $R "与" $T "的零空间" $N "线性无关.")
        (Li "如果" $R "和" $N "线性无关, 证明" $N
            "是唯一的与" $R "互补的" $T "不变子空间.")))
   ((exercise #:n "3")
    "令" $T "是" $RR^3 "上在标准有序基下由矩阵"
    (MB (Mat (2 0 0) (1 2 0) (0 0 3)))
    "表示的线性算子. 令" $W "是" (&- $T (&i* $2 $I))
    "的零空间. 证明" $W "没有与之互补的" $T
    "不变子空间. (提示: 令" (&= $beta $epsilon_1)
    ", 观察到" (∈ (ap (@- $T (&i* $2 $I)) $beta) $W)
    ", 证明不存在" (∈ $alpha $W) "使得"
    (let ((T-2I (@- $T (&i* $2 $I))))
      (&= (ap T-2I $beta) (ap T-2I $alpha)))
    ".) [译注: " $W "存在" $T "不变的补子空间当且仅当" $W
    "是" $T "可容许的.]")
   ((exercise #:n "4")
    "令" $T "是" $F^4 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat ($c 0 0 0)
             (1 $c 0 0)
             (0 1 $c 0)
             (0 0 1 $c)))
    "表示. 令" $W "是" (&- $T (&i* $c $I)) "的零空间."
    (Ol #:attr* '((type "a"))
        (Li "证明" $W "是由" $epsilon_4 "张成的子空间.")
        (Li "找出理想"
            (&cm (conduct $epsilon_4 $T)
                 (conduct $epsilon_3 $T)
                 (conduct $epsilon_2 $T)
                 (conduct $epsilon_1 $T))
            "的首项系数为一的生成元.")))
   ((exercise #:n "5")
    "令" $T "是域" $F "上的向量空间" $V "上的一个线性算子. 如果" $f
    "是域" $F "上的一个多项式而" (∈ $alpha $V) ", 令"
    (&= (ap $f $alpha) (ap (app $f $T) $alpha)) ". 如果"
    (&cm $V_1 $..h $V_k) "是" $T "不变子空间而"
    (&= $V (&d+ $V_1 $..c $V_k)) ", 证明"
    (MB (&= (ap $f $V) (&..d+ (ap $f $V_1) (ap $f $V_k))) ".")
    "[译注: 这个是定理3的证明中留给读者补充证明的引理.]")
   ((exercise #:n "6")
    "令" $T "是域" $F "上的向量空间" $V "上的一个线性算子. 如果向量"
    (∈ $alpha $beta $V) "有着相同的" $T "零化子, 证明对于任意的多项式"
    $f ", " (ap $f $alpha) "和" (ap $f $beta) "也有着相同的" $T
    "零化子. [译注: 这个亦是定理3的证明中留给读者补充证明的引理.]")
   ((exercise #:n "7")
    "找出以下每个实矩阵的极小多项式和有理形式."
    (MB (&cm (Mat (0 -1 -1)
                  (1 0 0)
                  (-1 0 0))
             (Mat ($c 0 -1)
                  (0 $c 1)
                  (-1 1 $c))
             (Mat ((&cos $theta) (&sin $theta))
                  ((&- (&sin $theta)) (&cos $theta))))))
   ((exercise #:n "8")
    "令" $T "是" $RR^3 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (3 -4 -4) (-1 3 2) (2 -4 -3)))
    "表示. 找出满足定理3条件的非零向量" (&cm $alpha_1 $..h $alpha_r) ".")
   ((exercise #:n "9")
    "令" $A "是实矩阵"
    (MB (&= $A (Mat (1 3 3) (3 1 3) (-3 -3 -5))) ".")
    "找出一个" (&c* $3 $3) "的可逆实矩阵" $P "使得"
    (sim $A) "是有理形式.")
   ((exercise #:n "10")
    "令" $F "是复数域的一个子域, " $T "是" $F^4
    "上的线性算子, 其在标准有序基下由矩阵"
    (MB (Mat (2 0 0 0) (1 2 0 0) (0 $a 2 0) (0 0 $b 2)))
    "表示. 找出" $T "的特征多项式. 考虑"
    (&= $a $b $1) "; " (&= $a $b $0) "; " (&cm (&= $a $0) (&= $b $1))
    "的情形. 在这三种情形下, 找出" $T "的极小多项式以及满足定理3条件的非零向量"
    (&cm $alpha_1 $..h $alpha_r) ".")
   ((exercise #:n "11")
    "证明如果" $A "和" $B "是域" $F "上的" (&c* $3 $3) "矩阵, 那么" $A "和" $B
    "在域" $F "上相似的充要条件是它们拥有相同的特征多项式和极小多项式. 给出一个"
    "例子表明对于" (&c* $4 $4) "的矩阵而言这是不对的.")
   ((exercise #:n "12")
    "令" $F "是复数域的一个子域, " $A "和" $B "是域" $F "上的" n*n "矩阵. 证明如果"
    $A "和" $B "在复数域上相似, 那么它们也在" $F "上相似. (提示: 证明" $A
    "的有理形式不论" $A "被视为" $F "还是" $CC "上的矩阵都是一样的, " $B "当然也是如此.)")
   ((exercise #:n "13")
    "令" $A "是一个" n*n "复矩阵, 证明如果" $A "的每个特征值都是实数, 那么" $A
    "相似于一个实矩阵.")
   ((exercise #:n "14")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 证明存在满足以下性质的向量"
    (∈ $alpha $V) ". 如果" $f "是一个多项式而" (&= (ap (app $f $T) $alpha) $0)
    ", 那么" (&= (app $f $T) $0) ". (这样的向量" $alpha "被称为" $T "的多项式代数的一个"
    (B "分离向量") ".) 当" $T "拥有循环向量时, 给出循环向量也是分离向量的直接证明.")
   ((exercise #:n "15")
    "令" $F "是复数域的一个子域, " $A "是" $F "上的一个" n*n "矩阵, " $p
    "是" $A "的极小多项式. 如果我们将" $A "视为" $CC "上的矩阵, 那么" $A
    "在" $CC "上也拥有一个极小多项式" $f ". 使用关于线性方程组的定理证明"
    (&= $p $f) ". 另外, 你能看出这也可由循环分解定理推得吗?")
   ((exercise #:n "16")
    "令" $A "是一个满足" (&= (&+ $A^2 $I) $0) "的" n*n "实矩阵, 证明"
    $n "是偶数, 并且如果" (&= $n (&i* $2 $k)) ", 那么" $A
    "在实数域上相似于以下分块形式的矩阵"
    (MB (Mat (0 (&- $I)) ($I 0)))
    "其中" $I "是" (&c* $k $k) "的恒等矩阵.")
   ((exercise #:n "17")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 设"
    (Ol #:attr* '((type "a"))
        (Li $T "的极小多项式是素多项式之幂;")
        (Li $T "的极小多项式等于特征多项式."))
    "证明不存在非平凡的" $T "不变子空间拥有" $T "不变的补子空间.")
   ((exercise #:n "18")
    "如果" $T "是可对角化线性算子, 那么每个" $T "不变子空间都有与之互补的"
    $T "不变子空间.")
   ((exercise #:n "19")
    "令" $T "是有限维向量空间" $V "上的一个线性算子, 证明" $T
    "拥有循环向量当且仅当每个与" $T "交换的线性算子" $U
    "都是应用某个多项式于" $T "的结果.")
   ((exercise #:n "20")
    "令" $V "是域" $F "上的一个有限维向量空间, " $T "是" $V
    "上的一个线性算子. 我们问何时" $V "中的每个非零向量都是"
    $T "的一个循环向量, 证明其成立的充要条件为" $T
    "的特征多项式在" $F "上不可约.")
   ((exercise #:n "21")
    "令" $A "是一个" n*n "实矩阵, " $T "是" $RR^n "上在标准有序基下由"
    $A "表示的线性算子, " $U "是" $CC^n "上在标准有序基下由" $A
    "表示的线性算子. 使用练习20的结果证明以下结论: 若" $T
    "仅有平凡的不变子空间, 那么" $U "是可对角化的.")
   ((proof)
    "若" $alpha "是" $V "中的非零向量, 那么" (cyc $alpha $T)
    "必然就是" $V ", 鉴于其并非零子空间且在" $T
    "下不变. 换言之, " $V "的每个非零向量都是" $T
    "的循环向量. 利用练习20的结果, 我们知道" $T
    "的特征多项式在" $RR "上不可约, 这说明其要么是一次多项式要么是二次多项式, "
    "且若是二次多项式则在实数域上不可解. 在这样的条件下, 若是一次多项式, "
    "那么" $U "不需要任何条件即是可对角化的; 若是二次多项式, " $U
    "具有两个非实共轭复特征值, 也就是两个互异的特征值, 所以自然也是可对角化的.")
   (H3 "第7.3节 Jordan形式")
   ((exercise #:n "1")
    "令" $N_1 "和" $N_2 "是域" $F "上的" (&c* $3 $3) "幂零矩阵, 证明" $N_1
    "和" $N_2 "相似当且仅当它们拥有相同的极小多项式.")
   ((proof)
    "若" $N_1 "和" $N_2 "相似, 则它们的有理形式相同. 有理形式相同, 则左上角的块"
    "相同, 因而极小多项式相同. 如果" $N_1 "和" $N_2 "的极小多项式相同, "
    "那么它们的有理形式的左上角的块相同. 左上角的块的大小有可能是"
    (&cm $1 $2 $3) ", 每一种情况下, 根据要求, 有理形式都是唯一的, 所以"
    $N_1 "和" $N_2 "必然是相似的.")
   ((exercise #:n "2")
    "使用练习1和Jordan形式的结果证明以下事实: 如果域" $F "上的" n*n
    "矩阵" $A "和" $B "有着相同的特征多项式"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "和相同的极小多项式, 并且没有" $d_i "大于" $3 ", 那么" $A "和"
    $B "是相似的.")
   ((exercise #:n "3")
    "如果" $A "是一个" (&c* $5 $5) "的复矩阵, 其特征多项式为"
    (MB (&= $f (&i* (^ (@- $x $2) $3) (^ (@+ $x $7) $2))))
    "而极小多项式为"
    (MB (&= $p (&i* (^ (@- $x $2) $2) (@+ $x $7))))
    "那么" $A "的Jordan形式是什么呢?")
   ((exercise #:n "4")
    (&c* $6 $6) "的复矩阵, 若其特征多项式为"
    (&i* (^ (@+ $x $2) $4) (^ (@- $x $1) $2))
    ", 那么其Jordan形式有多少种可能呢?")
   ((exercise #:n "5")
    "次数小于等于" $3 "的多项式构成的向量空间 [译注: 当然包括不能定义次数的零多项式] 上的微分算子, "
    "其在&quot;自然&quot;有序基下由矩阵"
    (MB (Mat (0 1 0 0) (0 0 2 0) (0 0 0 3) (0 0 0 0)))
    "表示. 这个矩阵的Jordan形式是什么? (" $F "是复数域的一个子域.)")
   ((exercise #:n "6")
    "令" $A "是复矩阵"
    (MB (Mat (2 0 0 0 0 0)
             (1 2 0 0 0 0)
             (-1 0 2 0 0 0)
             (0 1 0 2 0 0)
             (1 1 1 1 2 0)
             (0 0 0 0 1 -1)))
    "找出" $A "的Jordan形式.")
   ((exercise #:n "7")
    "如果域" $F "上的" n*n "矩阵" $A "以"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "为特征多项式, 请问" $A "的迹是多少?")
   ((exercise #:n "8")
    "按照相似对于满足" (&= $A^3 $I) "的" (&c* $3 $3) "复矩阵" $A "进行分类.")
   ((exercise #:n "9")
    "按照相似对于满足" (&= $A^n $I) "的" n*n "复矩阵" $A "进行分类.")
   ((exercise #:n "10")
    "令" $n "是大于" $1 "的整数, " $N "是域" $F "上一个满足" (&= $N^n $0)
    "但是" (&!= (^ $N $n-1) $0) "的" n*n "矩阵, 证明" $N
    "没有平方根, 即不存在" n*n "的矩阵" $A "使得" (&= $A^2 $N) ".")
   ((exercise #:n "11")
    "令" $N_1 "和" $N_2 "是域" $F "上的" (&c* $6 $6)
    "幂零矩阵, 设其拥有相同的极小多项式和相同的零化度, 证明" $N_1
    "和" $N_2 "是相似的. 说明为何这对于" (&c* $7 $7) "的情况并不成立.")
   ((exercise #:n "12")
    "使用练习11和Jordan形式的结果证明以下事实: 令" $A "和" $B
    "是域" $F "有着相同特征多项式"
    (MB (&= $f (decomp $c_1 $d_1 $c_k $d_k)))
    "和相同极小多项式的" n*n "矩阵, 并且设对于每个" $i ", "
    (@- $A (&i* $c_i $I)) "和" (@- $B (&i* $c_i $I))
    "的解空间有着相同的维数, 如果没有" $d_i "大于" $6
    ", 那么" $A "和" $B "是相似的.")
   ((exercise #:n "13")
    "如果" $N "是一个" (&c* $k $k) "的基本幂零矩阵, 即" (&= $N^k $0)
    "但是" (&!= (^ $N (&- $k $1)) $0) ", 证明" $N^t "相似于" $N
    ". 现在使用Jordan形式来证明每个复矩阵都相似于其转置.")
   ((exercise #:n "14")
    "以下证明有何错误? 如果" $A "是一个" n*n "的复矩阵满足"
    (&= $A^t (&- $A)) ", 那么" (&= $A $0) ". (证明: 令" $J
    "是" $A "的Jordan形式, 因为" (&= $A^t (&- $A))
    ", 所以" (&= $J^t (&- $J)) ". 但是, 鉴于" $J
    "是下三角矩阵, " (&= $J^t (&- $J)) "可以推出" $J
    "的每个元素都是" $0 ". 既然" (&= $J $0) "而" $A "相似于"
    $J ", 那么" (&= $A $0) ".) (给出非零矩阵" $A "满足"
    (&= $A^t (&- $A)) "的例子.)")
   ((exercise #:n "15")
    "如果" $N "是" $CC "上的一个" (&c* $3 $3) "的幂零矩阵, 证明"
    (&= $A (&- (&+ $I (&i* 1/2 $N)) (&i* 1/8 $N^2))) "满足"
    (&= $A^2 (&+ $I $N)) ", 即" $A "是" (&+ $I $N)
    "的一个平方根. 使用" (^ (@+ $1 $t) (&/ $1 $2))
    "的二项级数展开以得到类似的" (&+ $I $N)
    "的平方根公式, 其中" $N "是" $CC "上任意的" n*n "的幂零矩阵.")
   ((exercise #:n "16")
    "使用练习15的结果证明如果" $c "是一个非零复数而" $N
    "是一个幂零的复矩阵, 那么" (@LC $c $I $N)
    "拥有平方根. 现在使用Jordan形式来证明每个非奇异的"
    n*n "复矩阵都拥有平方根.")
   (H3 "第7.4节 不变因子的计算")
   ((exercise #:n "1")
    "对还是错? 每个" (^ polyF m*n) "中的矩阵都行等价于一个上三角矩阵.")
   ((exercise #:n "2")
    "令" $T "是有限维向量空间上的一个线性算子, " $A "是" $T
    "在某个有序基下的矩阵, 那么" $T "拥有循环向量当且仅当" (@- (&i* $x $I) $A)
    "的各" (&c* (@- $n $1) (@- $n $1)) "子矩阵的行列式互素.")
   ((exercise #:n "3")
    "令" (∈ $A (^ $F n*n)) ", 设" (&cm $f_1 $..h $f_n)
    "是" (&- (&i* $x $I) $A) "的规范形式的对角线元素. 对于什么样的矩阵"
    $A "有" (&!= $f_1 $1) "呢?")
   ((exercise #:n "4")
    "构造一个以" (&i* $x^2 (^ (@- $x $1) $2)) "为极小多项式且以"
    (&i* $x^3 (^ (@- $x $1) $4)) "为特征多项式的线性算子" $T
    ". 描述" $T "下对于向量空间的准素分解, 并找出投影至这些不变子空间的算子. "
    "找到一个基使得" $T "的表示矩阵呈现Jordan形式. 最后, 显式给出定理3"
    "中的循环分解 (其将向量空间分解为" $T "循环子空间的直和), 并求出不变因子.")
   ((exercise #:n "5")
    "令" $T "是" $RR^8 "上的线性算子, 其在标准有序基下由矩阵"
    (MB (&= $A (MatR (1 1 1 1 1 1 1 1)
                     (0 0 0 0 0 0 0 1)
                     (0 0 0 0 0 0 0 -1)
                     (0 1 1 0 0 0 0 1)
                     (0 0 0 1 1 0 0 0)
                     (0 1 1 1 1 1 0 1)
                     (0 -1 -1 -1 -1 0 1 -1)
                     (0 0 0 0 0 0 0 0))))
    "表示."
    (Ol #:attr* '((type "a"))
        (Li "找出特征多项式和不变因子.")
        (Li "找出" $RR^8 "在" $T "下的准素分解以及相应的那些投影. "
            "对于准素分解的每个直和分量, 找出如定理3那样的循环分解.")
        (Li "找出" $A "的Jordan形式.")
        (Li "如定理3那样, 将" $RR^8 "分解为" $T
            "循环子空间的直和. (提示: 一种做法是使用b的结果并对于例子4"
            "中所讨论的想法进行适当泛化.)")))
   (H3 "第7.5节 总结; 半单算子")
   ((exercise #:n "1")
    "对于标量域为复数域的一个子域的有限维向量空间" $V
    ", 如果" $N "是" $V "上的一个幂零线性算子, 那么对于任意的多项式"
    $f ", " (app $f $N) "的半单部分是恒等算子的一个标量倍数.")
   ((exercise #:n "2")
    "令" $F "是复数域的一个子域, " $V "是" $F "上的一个有限维向量空间, "
    $T "是" $V "上的一个半单线性算子. 如果" $f "是域" $F
    "上任意的一个多项式, 那么" (app $f $T) "也是半单的.")
   ((exercise #:n "3")
    "设标量域为复数域的一个子域, 对于向量空间上的一个线性算子"
    $T ", 证明" $T "是半单算子当且仅当对于任意的多项式" $f
    ", " (app $f $T) "是幂零算子可以推出" (&= (app $f $T) $0) ".")
   (H2 "第8章 内积空间")
   (H3 "第8.1节 内积")
   ((exercise #:n "1")
    "令" $V "是一个向量空间而" (inner* $ $) "是" $V "上的一个内积."
    (Ol #:attr* '((type "a"))
        (Li "证明对于任意的" (∈ $beta $V) "有"
            (&= (inner* $0 $beta) $0) ".")
        (Li "证明若对于任意的" (∈ $beta $V) "有"
            (&= (inner* $alpha $beta) $0) ", 那么"
            (&= $alpha $0) ".")))
   ((proof)
    "鉴于"
    (MB (&= (inner* $0 $beta)
            (inner* (&+ $0 $0) $beta)
            (&+ (inner* $0 $beta) (inner* $0 $beta))))
    "因而" (&= (inner* $0 $beta) $0) ". 既然对于任意的"
    (∈ $beta $V) "有" (&= (inner* $alpha $beta) $0)
    ", 那么"
    (MB (&= (inner* $alpha $alpha) $0))
    "而这成立当且仅当" (&= $alpha $0) ".")
   ((exercise #:n "2")
    "令" $V "是域" $F "上的一个向量空间. 证明" $V
    "上的两个内积之和仍然是" $V "上的一个内积. "
    "两个内积之差是内积吗? 证明一个内积的正倍数"
    "仍然是一个内积.")
   
   ((exercise #:n "3")
    "显式描述" $RR^1 "和" $CC^1 "上的所有内积.")
   ((exercise #:n "4")
    "验证" $F^n "上的标准内积的确是一个内积.")
   ((exercise #:n "5")
    "令" (inner* $ $) "是" $RR^2 "上的标准内积."
    (Ol #:attr* '((type "a"))
        (Li "令" (&cm (&= $alpha (tu0 $1 $2)) (&= $beta (tu0 $-1 $1)))
            ", 如果向量" $gamma "满足" (&= (inner* $alpha $gamma) $-1)
            "且" (&= (inner* $beta $gamma) $3) ", 求出" $gamma ".")
        (Li "证明对于任意的" (∈ $alpha $RR^2) ", 我们有"
            (&= $alpha (LC (inner* $alpha $epsilon_1) $epsilon_1
                           (inner* $alpha $epsilon_2) $epsilon_2)) ".")))
   ((exercise #:n "6")
    "令" (inner* $ $) "是" $RR^2 "上的标准内积, 而"
    (&= (appl $T $x_1 $x_2) (tu0 (&- $x_2) $x_1))
    "是" $RR^2 "上的线性算子. 现在" $T "是&quot;逆时针旋转90度&quot;"
    "的变换, 并且对于所有的" (∈ $alpha $RR^2) ", 都有"
    (&= (inner* $alpha (ap $T $alpha)) $0) ". 找出所有这样的"
    $RR^2 "上的内积" (in* $ $) ", 其对于每个向量" $alpha "有"
    (&= (in* $alpha (ap $T $alpha)) $0) ".")
   ((exercise #:n "7")
    "令" (inner* $ $) "是" $CC^2 "上的标准内积, 证明不存在非零的"
    $CC^2 "上的线性算子" $T "使得对于每个" (∈ $alpha $CC^2)
    "有" (&= (inner* $alpha (ap $T $alpha)) $0) ". 推广这个结果.")
   ((exercise #:n "8")
    "令" (∈ $A (^ $RR 2*2)) ", 定义映射"
    (func $f_A (&c* (^ $RR (&c* $2 $1)) (^ $RR (&c* $2 $1))) $RR)
    "为"
    (MB (&= (appl $f_A $X $Y) (&i* $Y^t $A $X)) ".")
    "证明" $f_A "是" (^ $RR (&c* $2 $1)) "上的一个内积当且仅当"
    (&cm (&= $A $A^t) (&> (mref $A $1 $1) $0)
         (&> (mref $A $2 $2) $0) (&> (&det $A) $0)) ".")
   ((exercise #:n "9")
    "令" $V "是一个带有的内积的实或复向量空间, 证明由内积确定"
    "的范数满足" (B "平行四边形定律")
    (MB (&= (&+ (&sqr (&norm (&+ $alpha $beta)))
                (&sqr (&norm (&- $alpha $beta))))
            (LC $2 (&sqr (&norm $alpha))
                $2 (&sqr (&norm $beta)))) "."))
   ((proof)
    (eqnderiv
     (&+ (&sqr (&norm (&+ $alpha $beta)))
         (&sqr (&norm (&- $alpha $beta))))
     (&+ (@+ (sqrnorm $alpha)
             (&i* $2 (Re (inner* $alpha $beta)))
             (sqrnorm $beta))
         (@ (sqrnorm $alpha) $-
            (&i* $2 (Re (inner* $alpha $beta))) $+
            (sqrnorm $beta)))
     (LC $2 (&sqr (&norm $alpha))
         $2 (&sqr (&norm $beta)))))
   ((exercise #:n "10")
    "找出例子2中的内积在" $RR^2 "的标准有序基下的矩阵.")
   ((exercise #:n "11")
    "证明公式"
    (MB (&= (Inner*
             (sum (&= $j $0) $l (&i* $a_j $x^j))
             (sum (&= $k $0) $m (&i* $b_k $x^k)))
            (sum (&= $j $0) $l
                 (sum (&= $k $0) $m
                      (~ (&i* $a_j $b_k)
                         (&+ $j $k $1))))))
    "定义了" (&poly $RR) "上的一个内积. 令" $W
    "是次数小于等于" $n "的多项式构成的子空间. "
    "限制以上内积于" $W ", 找出其相对于有序基"
    (setE $1 $x $x^2 $..h $x^n)
    "的矩阵. (提示: 为了表明这个公式的确定义了一个内积, 观察到"
    (MB (&= (inner* $f $g)
            (uintegral
             (&i* (app $f $t) (app $g $t)))))
    "然后处理这个积分表达式.)")
   ((exercise #:n "12")
    "令" $V "是一个有限维向量空间, " basis:def
    "是" $V "的一个有序基, " (inner* $ $)
    "是" $V "上的一个内积. 如果" (&..cm $c_1 $c_n)
    "是任意的" $n "个标量, 那么恰存在一个向量"
    (∈ $alpha $V) "使得"
    (&cm (&= (inner* $alpha $alpha_j) $c_j)
         (&= $j (&..cm $1 $n))) ".")
   ((exercise #:n "13")
    "令" $V "是一个复向量空间. 一个函数" (func $J $V $V)
    "被称为一个" (B "共轭 (conjugation)") ", 如果"
    (&cm (linear+ (lambda (v) (app $J v))
                  $alpha $beta)
         (&= (app $J (&i* $c $alpha))
             (&i* (OverBar $c) (app $J $alpha)))
         (&= (app $J (app $J $alpha)) $alpha))
    ", 其中" $c "是任意的标量而" (∈ $alpha $beta $V)
    ". 如果" $J "是一个共轭, 证明:"
    (Ol #:attr* '((type "a"))
        (Li (&= $W (setI (∈ $alpha $V) (&= (ap $J $alpha) $alpha)))
            "相对于" $V "中所定义的运算可以被视为域" $RR
            "上的一个向量空间.")
        (Li "对于每个" (∈ $alpha $V) ", 存在唯一的向量"
            (∈ $beta $gamma $W) "使得"
            (&= $alpha (&+ $beta (&i* $i $gamma))) ".")))
   ((exercise #:n "14")
    "令" $V "是一个复向量空间, " $W "是一个满足以下性质的"
    $V "的子集:"
    (Ol #:attr* '((type "a"))
        (Li "相对于" $V "中所定义的运算, " $W
            "可以被视为一个实向量空间.")
        (Li "对于每个" (∈ $alpha $V) ", 存在唯一的向量"
            (∈ $beta $gamma $W) "满足"
            (&= $alpha (&+ $beta (&i* $i $gamma))) "."))
    "证明" (&= (ap $J $alpha) (&- $beta (&i* $i $gamma)))
    "定义了" $V "上的一个共轭, 其满足"
    (&= (ap $J $alpha) $alpha) "当且仅当" (∈ $alpha $W)
    ". 另外, 证明" $J "是" $V "上唯一带有此性质的共轭.")
   ((exercise #:n "15")
    "找出" $CC^1 "和" $CC^2 "上的所有共轭.")
   ((exercise #:n "16")
    "令" $W "是复向量空间" $V "的一个有限维实子空间. 证明"
    $W "满足练习14的条件b当且仅当" $W
    "的每个基也是" $V "的一个基.")
   ((exercise #:n "17")
    "令" $V "是一个复向量空间, " $J "是" $V "上的一个共轭, "
    (&= $W (setI (∈ $alpha $V) (&= (ap $J $alpha) $alpha)))
    "是" $V "的一个实子空间, " $f "是" $W "上的一个内积, 证明:"
    (Ol #:attr* '((type "a"))
        (Li "存在唯一的" $V "上的内积" $g "使得对于任意的"
            (∈ $alpha $beta $W) "有"
            (&= (appl $g $alpha $beta)
                (appl $f $alpha $beta)) ".")
        (Li "对于所有的" (∈ $alpha $beta $V) ", "
            (&= (appl $g (ap $J $alpha) (ap $J $beta))
                (appl $g $beta $alpha)) "."))
    "以上的部分a是在说" $RR^1 "和" $CC^1 " (或者"
    $RR^n "和" $CC^n ") 上的标准内积之间的什么关系?")
   (H3 "第8.2节 内积空间")
   ((exercise #:n "1")
    "考虑装备了标准内积的" $RR^4 ", 令子空间"
    (MB (&= $W (setI (∈ $gamma $RR^4)
                     (: (&= (inner* $gamma $alpha) $0) "且"
                        (&= (inner* $gamma $beta) $0)))))
    "其中" (&= $alpha (tu0 1 0 -1 1)) "而"
    (&= $beta (tu0 2 3 -1 2)) ", 找出" $W "的一个基.")
   ((exercise #:n "2")
    "应用Gram-Schmidt过程于向量"
    (&= $beta_1 (tu0 1 0 1)) ", "
    (&= $beta_2 (tu0 1 0 -1)) ", "
    (&= $beta_3 (tu0 0 3 4))
    "以得到装备有标准内积的" $RR^3 "的一个规范正交基.")
   ((exercise #:n "3")
    "考虑装备有标准内积的" $CC^3 ", 找出由"
    (&= $beta_1 (tu0 $1 $0 $i)) "和"
    (&= $beta_2 (tu0 $2 $1 (&+ $1 $i)))
    "张成的子空间的一个规范正交基.")
   ((exercise #:n "4")
    "令" $V "是一个内积空间, 两个向量" $alpha "和" $beta
    "之间的" (B "距离") "由"
    (MB (&= (appl $d $alpha $beta)
            (&norm (&- $alpha $beta))))
    "定义, 证明"
    (Ol #:attr* '((type "a"))
        (Li (&>= (appl $d $alpha $beta) $0) ";")
        (Li (&= (appl $d $alpha $beta) $0)
            "当且仅当" (&= $alpha $beta) ";")
        (Li (&= (appl $d $alpha $beta)
                (appl $d $beta $alpha)) ";")
        (Li (&<= (appl $d $alpha $beta)
                 (&+ (appl $d $alpha $gamma)
                     (appl $d $gamma $beta))) ".")))
   ((exercise #:n "5")
    "令" $V "是一个内积空间而" (∈ $alpha $beta $V)
    ", 那么" (&= $alpha $beta) "当且仅当对于每个"
    (∈ $gamma $V) "有"
    (&= (inner* $alpha $gamma)
        (inner* $beta $gamma)) ".")
   ((exercise #:n "6")
    "给定装备有标准内积的" $RR^2 ", 令" $W
    "是由" (tu0 $3 $4) "张成的子空间, " $E
    "是" $RR^2 "在" $W "上的正交投影, 找出"
    (Ol #:attr* '((type "a"))
        (Li (appl $E $x_1 $x_2) "的公式;")
        (Li "标准有序基下" $E "的矩阵;")
        (Li (^ $W $perp) ";")
        (Li "使得" $E "由矩阵"
            (MB (Mat (1 0) (0 0)))
            "表示的一个规范正交基.")))
   ((exercise #:n "7")
    "令" $V "是一个内积空间, 其向量空间为" $RR^2 ", 而其内积的二次形式由"
    (MB (&= (sqrnorm (tu0 $x_1 $x_2))
            (&+ (&sqr (@- $x_1 $x_2))
                (&i* $3 (_^ $x $2 $2)))))
    "定义. 令" $E "是" $V "在由" (tu0 $3 $4) "张成的子空间"
    $W "上的正交投影, 现在回答练习6的四个问题.")
   ((exercise #:n "8")
    "找出" $RR^2 "上的一个内积使得"
    (&= (inner* $epsilon_1 $epsilon_2) $2) ".")
   ((exercise #:n "9")
    "令" $V "是" (&poly $RR) "的次数至多为" $3
    "的多项式构成的子空间, 其上装备的内积为"
    (MB (&= (inner* $f $g)
            (uintegral
             (&i* (app $f $t) (app $g $t)))) ".")
    (Ol #:attr* '((type "a"))
        (Li "找出由所有标量多项式构成的子空间的正交补.")
        (Li "应用Gram-Schmidt过程于基"
            (setE $1 $x $x^2 $x^3) ".")))
   ((exercise #:n "10")
    "令" $V "是向量空间" (^ $CC n*n) ", 设其上的内积为"
    (&= (inner* $A $B) (&tr (&i* $A (&* $B))))
    ", 找出由所有对角矩阵构成的子空间的正交补.")
   ((exercise #:n "11")
    "令" $V "是一个有限维内积空间, "
    (setE $alpha_1 $..h $alpha_n)
    "是" $V "的一个规范正交基, 证明对于任意的"
    (∈ $alpha $beta $V) ", 我们都有"
    (MB (&= (inner* $alpha $beta)
            (sum (&= $k $1) $n
                 (&i* (inner* $alpha $alpha_k)
                      (OverBar
                       (inner* $beta $alpha_k))))) "."))
   ((exercise #:n "12")
    "令" $W "是内积空间" $V "的一个有限维子空间, " $E
    "是" $V "在" $W "上的正交投影, 证明对于所有"
    (∈ $alpha $beta $V) ", "
    (&= (inner* (ap $E $alpha) $beta)
        (inner* $alpha (ap $E $beta))) ".")
   ((exercise #:n "13")
    "令" $S "是内积空间" $V "的一个子集. 证明"
    (&perp (@perp $S)) "包含由" $S
    "张成的子空间. 当" $V "是有限维的时候, 证明"
    (&perp (@perp $S)) "就是由" $S
    "张成的子空间.")
   ((exercise #:n "14")
    "令" $V "是一个有限维内积空间而" basis:def
    "是" $V "的一个规范正交基. 令" $T "是" $V
    "上的一个线性算子而" $A "是在有序基" $BBB
    "下的矩阵. 证明"
    (MB (&= (mref $A $i $j)
            (inner* (ap $T $alpha_j)
                    $alpha_i)) "."))
   ((exercise #:n "15")
    "设" (&= $V (&d+ $W_1 $W_2)) "而"
    $f_1 "和" $f_2 "分别是" $W_1 "和"
    $W_2 "上的内积. 证明存在唯一的" $V
    "上的内积" $f "使得"
    (Ol #:attr* '((type "a"))
        (Li (&= $W_2 (_^ $W $1 $perp)) ";")
        (Li "对于"
            (&cm (∈ $alpha $beta $W_k)
                 (&= $k (&cm $1 $2)))
            ", 有"
            (&= (appl $f $alpha $beta)
                (appl $f_k $alpha $beta)) ".")))
   ((exercise #:n "16")
    "令" $V "是一个内积空间而" $W "是" $V
    "的一个有限维子空间, 一般存在许多以" $W
    "为像的投影. 其中一种当然是" $W
    "上的正交投影, 它具有对于每个" (∈ $alpha $V)
    ", " (&<= (&norm (ap $E $alpha)) (&norm $alpha))
    "的性质. 证明如果" $E "是一个以" $W
    "为像的投影且对于每个" (∈ $alpha $V) "有"
    (&<= (&norm (ap $E $alpha)) (&norm $alpha))
    ", 那么" $E "是" $W "上的正交投影. "
    "[译注: 这个不等式和Bessel不等式差不多.]")
   ((exercise #:n "17")
    "令" $V "是一个实内积空间, 其由区间" (li0 -1 1)
    "上的所有连续实值函数构成, 而内积为"
    (MB (&= (inner* $f $g)
            (integral $-1 $1
                      (&i* (app $f $t)
                           (app $g $t))
                      $t)) ".")
    "令" $W "是所有奇函数构成子空间, 找出" $W
    "的正交补.")
   (H3 "第8.3节 线性泛函和伴随")
   ((exercise #:n "1")
    "令" $V "是带有标准内积的向量空间" $CC^2
    ", " $T "是由" (&= (ap $T $epsilon_1) (tu0 $1 -2))
    "和" (&= (ap $T $epsilon_2) (tu0 $i $-1))
    "定义的线性算子. 如果" (&= $alpha (tu0 $x_1 $x_2))
    ", 找出" (ap (&* $T) $alpha) ".")
   ((exercise #:n "2")
    "令" $T "是" $CC^2 "上的线性算子, 由"
    (&= (ap $T $epsilon_1) (tu0 (&+ $1 $i) $2)) "和"
    (&= (ap $T $epsilon_2) (tu0 $i $i))
    "定义. 使用标准内积, 找出" (&* $T)
    "在标准有序基下的矩阵. " $T "与" (&* $T) "交换吗?")
   ((exercise #:n "3")
    "令" $V "是带有标准内积的" $CC^3 ", " $T "是"
    $V "上的线性算子, 其在标准有序基下的矩阵由"
    (MB (&= (mref $A $j $k) (^ $i (&+ $j $k))))
    "定义, 其中" $i "是虚数单位. 找出" (&* $T)
    "的零空间的一个基.")
   ((exercise #:n "4")
    "令" $V "是一个有限维内积空间, " $T "是" $V
    "上的一个线性算子, 证明" (&* $T) "的像是" $T
    "的零空间的正交补.")
   ((exercise #:n "5")
    "令" $V "是一个有限维内积空间, " $T "是" $V
    "上的一个线性算子. 如果" $T "是可逆的, 证明"
    (&* $T) "也是可逆的, 并且"
    (&= (inv (@ (&* $T))) (&* (@ (inv $T)))) ".")
   ((exercise #:n "6")
    "令" $V "是一个内积空间, 而" $beta "和" $gamma
    "是" $V "中固定的向量. 证明"
    (&= (ap $T $alpha) (&i* (inner* $alpha $beta) $gamma))
    "定义了" $V "上的一个线性算子. 证明" $T
    "具有伴随, 并显式描述" (&* $T) "." (Br)
    "现在设" $V "是带有标准内积的" $CC^n
    ", " (&= $beta (tu0 $y_1 $..h $y_n)) "而"
    (&= $gamma (tu0 $x_1 $..h $x_n))
    ". " $T "在标准有序基下的矩阵的第" $j
    "行" $k "列的元素是什么? 这个矩阵的秩是多少?")
   ((exercise #:n "7")
    "证明两个自伴算子之积是自伴的当且仅当这两个算子交换.")
   ((exercise #:n "8")
    "令" $V "是" $RR "上次数小于等于" $3
    "的多项式构成的向量空间, 而内积为"
    (MB (&= (inner* $f $g)
            (uintegral (&i* (app $f $t) (app $g $t)))) ".")
    "如果" $t "是一个实数, 找出多项式" (∈ $g_t $V) "使得对于每个"
    (∈ $f $V) "都有" (&= (inner* $f $g_t) (app $f $t)) ".")
   ((exercise #:n "9")
    "令" $V "是练习8的内积空间, " $D "是" $V
    "上的形式微分算子, 找出" (&* $D) ".")
   ((exercise #:n "10")
    "令" $V "是" (^ $CC n*n) ", 其上的内积为"
    (&= (inner* $A $B) (&tr (&i* $A (&* $B))))
    ". 令" (∈ $P $V) "是一个固定的可逆矩阵, 而"
    (&= (app $T_P $A) (sim $A)) "是" $V
    "上的线性算子. 找出" $T_P "的伴随.")
   ((exercise #:n "11")
    "令" $V "是一个有限维内积空间, " $E "是" $V
    "上的一个幂等线性算子, 证明" $E "是自伴的当且仅当"
    (commute* $E (&* $E)) ".")
   ((exercise #:n "12")
    "令" $V "是一个有限维" (Em "复") "内积空间, "
    $T "是" $V "上的一个线性算子, 证明" $T
    "是自伴的当且仅当对于每个" (∈ $alpha $V) ", "
    (inner* (ap $T $alpha) $alpha) "是实数.")
   (H3 "第8.4节 酉算子")
   ((exercise #:n "1")
    "找出一个不是正交矩阵的酉矩阵, 以及一个不是酉矩阵的正交矩阵.")
   ((exercise #:n "2")
    "令" $V "是" (^ $CC n*n) ", 带有通常内积"
    (&= (inner* $A $B) (&tr (&i* $A (&* $B)))) ". 对于每个"
    (∈ $M $A) ", 令" (&= (app $T_M $A) (&i* $M $A))
    "是" $V "上的线性算子. 证明" $T_M "是一个酉算子当且仅当"
    $M "是一个酉矩阵.")
   ((exercise #:n "3")
    "令" $V "是被当作" (Em "实") "向量空间的复数域."
    (Ol #:attr* '((type "a"))
        (Li "表明"
            (&= (inner* $alpha $beta)
                (Re (@i* $alpha (OverBar $beta))))
            "定义了一个" $V "上的内积.")
        (Li "找出一个从" $V "到带有标准内积的" $RR^2
            "的(内积空间的)同构.")
        (Li "对于每个" (∈ $gamma $V) ", 令"
            (&= (app $M_gamma $alpha) (&i* $gamma $alpha))
            "是" $V "上的线性算子, 证明"
            (&= (&* (@ $M_gamma)) (_ $M (OverBar $gamma))) ".")
        (Li "对于什么样的复数" $gamma ", " $M_gamma
            "是自伴算子?")
        (Li "对于什么样的复数" $gamma ", " $M_gamma
            "是酉算子?")
        (Li "对于什么样的复数" $gamma ", " $M_gamma
            "是正定算子? [译注: 正定算子的定义见第9.3节.]")
        (Li (&det $M_gamma) "是多少?")
        (Li "找出" $M_gamma "在基" (setE $1 $i) "下的矩阵.")
        (Li "如果" $T "是" $V "上的一个线性算子, 找出存在"
            (∈ $gamma $CC) "使得" (&= $T $M_gamma)
            "的充要条件.")
        (Li "找出一个" $V "上的酉算子" $U ", 但是不存在"
            (∈ $gamma $CC) "使得" (&= $U $M_gamma) ".")))
   ((exercise #:n "4")
    "令" $V "是带有标准内积的" $RR^2 ". 如果" $U "是" $V
    "上的一个酉算子, 证明" $U "在标准有序基下的矩阵是"
    (MB (MatR ((&cos $theta) (&- (&sin $theta)))
              ((&sin $theta) (&cos $theta)))
        "或者"
        (MatR ((&cos $theta) (&sin $theta))
              ((&sin $theta) (&- (&cos $theta)))))
    "其中" (: $0 $<= $theta $< (&i* $2 $pi)) ". 令"
    $U_theta "是在标准有序基下以"
    (MB (MatR ((&cos $theta) (&- (&sin $theta)))
              ((&sin $theta) (&cos $theta))))
    "为矩阵表示的线性算子, 即" $U_theta "是逆时针旋转"
    $theta "的变换. 现在读者应该说服自己, " $V
    "上的每个酉矩阵, 要么是一个旋转, 要么是一个关于"
    $epsilon_1 "轴的反射接着一个旋转. [译注: 对于后一种变换, "
    "另外一种描述方法是关于角度为" (&/ $theta $2) "的轴的反射.]"
    (Ol #:attr* '((type "a"))
        (Li (&i* $U_theta (_ $U $phiv)) "是什么?")
        (Li "表明" (&= (_^ $U $theta $*) (_ $U (&- $theta))) ".")
        (Li "令" $phiv "是一个固定的实数, "
            (&= $BBB (setE $alpha_1 $alpha_2)) "是由"
            (setE $epsilon_1 $epsilon_2) "经过逆时针旋转"
            $phiv "得到的规范正交基, 即"
            (&= $alpha_j (ap (_ $U $phiv) $epsilon_j))
            ". 如果" $theta "是另一个实数, 那么"
            $U_theta "在有序基" $BBB "下的矩阵是什么?")))
   ((exercise #:n "5")
    "令" $V "是带有标准内积的" $RR^3 ". 令" $W "是由"
    (&= $alpha (tu0 $1 $1 $1)) "和" (&= $beta (tu0 $1 $1 $-2))
    "张成的平面. 令" $U "是按照以下方式几何地定义的线性算子: "
    $U "是关于过原点正交于" $W "的直线旋转" $theta
    "的变换. 实际上存在两种这样的旋转, 选择一个即可. 找出" $U
    "在标准有序基下的矩阵. (这里给出一种可行的方法. 找到" $W
    "的一个规范正交基" $alpha_1 "和" $alpha_2 ". 令" $alpha_3
    "是正交于" $W "且范数为" $1 "的向量. 找出" $U "在基"
    (setE $alpha_1 $alpha_2 $alpha_3) "的矩阵. 施行一次基变换.)")
   ((exercise #:n "6")
    "令" $V "是有限维的内积空间, " $W "是" $V "的一个子空间, 那么"
    (&= $V (&d+ $W (&perp $W))) ", 即每个" (∈ $alpha $V)
    "都可以唯一地被表示为" (&= $alpha (&+ $beta $gamma))
    "的形式, 其中" (∈ $beta $W) "而" (∈ $gamma (&perp $W))
    ". 我们定义线性算子" (&= (ap $U $alpha) (&- $beta $gamma)) "."
    (Ol #:attr* '((type "a"))
        (Li "证明" $U "既是自伴算子又是酉算子.")
        (Li "如果" $V "是带有标准内积的" $RR^3 "而" $W "是由"
            (tu0 $1 $0 $1) "张成的子空间, 找出" $U
            "在标准有序基下的矩阵.")))
   ((exercise #:n "7")
    "令" $V "是一个复内积空间而" $T "是" $V
    "上的一个自伴线性算子, 证明"
    (Ol #:attr* '((type "a"))
        (Li (&= (&norm (&+ $alpha (&i* $i (ap $T $alpha))))
                (&norm (&- $alpha (&i* $i (ap $T $alpha))))) ".")
        (Li (&= (&+ $alpha (&i* $i (ap $T $alpha)))
                (&+ $beta (&i* $i (ap $T $beta))))
            "当且仅当" (&= $alpha $beta) ".")
        (Li (&+ $I (&i* $i $T)) "是非奇异的.")
        (Li (&- $I (&i* $i $T)) "是非奇异的.")
        (Li "现在设" $V "是有限维的, 证明"
            (MB (&= $U (&i* (@- $I (&i* $i $T))
                            (inv (@+ $I (&i* $i $T))))))
            "是一个酉算子. " $U "被称为" $T "的"
            (B "Cayley变换") ". 在某种意义上说, 令"
            (&= (app $f $x)
                (&/ (@- $1 (&i* $i $x))
                    (@+ $1 (&i* $i $x))))
            ", 那么" (&= $U (app $f $T)) ".")))
   ((exercise #:n "8")
    "如果" $theta "是一个实数, 证明"
    (MB (MatR ((&cos $theta) (&- (&sin $theta)))
              ((&sin $theta) (&cos $theta)))
        "和"
        (Mat (e^iθ $0)
             ($0 (^ $e (&- (&i* $i $theta))))))
    "是酉等价的.")
   ((exercise #:n "9")
    "令" $V "是一个有限维内积空间而" $T "是" $V
    "上的一个正定算子. 令"
    (&= (appl $p_T $alpha $beta)
        (inner* (ap $T $alpha) $beta))
    "是" $V "上的内积. 令" $U "是" $V
    "上的一个线性算子而" (&* $U) "是其相对于"
    (inner* $ $) "的伴随. 证明" $U
    "是相对于内积" $p_T "的酉算子当且仅当"
    (&= $T (&i* (&* $U) $T $U)) ".")
   ((exercise #:n "10")
    "令" $V "是一个有限维内积空间, 对于每个"
    (∈ $alpha $beta $V) ", 定义" $V "上的线性算子"
    (&= (app (_ $T (&cm $alpha $beta)) $gamma)
        (&i* (inner* $gamma $beta) $alpha))
    ", 证明以下命题."
    (Ol #:attr* '((type "a"))
        (Li (&= (_^ $T (&cm $alpha $beta) $*)
                (_ $T (&cm $beta $alpha))) ".")
        (Li (&= (&trace (_ $T (&cm $alpha $beta)))
                (inner* $alpha $beta)) ".")
        (Li (&= (&i* (_ $T (&cm $alpha $beta))
                     (_ $T (&cm $gamma $delta)))
                (_ $T (&cm $alpha
                           (&i* (inner* $beta $gamma)
                                $delta)))) ".")
        (Li "在何种条件下" (_ $T (&cm $alpha $beta))
            "是自伴算子?")))
   ((exercise #:n "11")
    "令" $V "是域" $F "上的一个" $n "维内积空间, "
    (&L $V $V) "是" $V "上的所有线性算子构成的空间, 证明"
    (&L $V $V) "上存在唯一的一个内积使得对于任意的"
    (∈ $alpha $beta $V) ", "
    (&= (&norm (_ $T (&cm $alpha $beta)))
        (&i* (sqrnorm $alpha) (sqrnorm $beta)))
    ", 其中" (_ $T (&cm $alpha $beta))
    "是练习10中那样定义的线性算子. 找到一个带有此内积的"
    (&L $V $V) "和带有内积"
    (&= (inner* $A $B) (&tr (&i* $A (&* $B))))
    "的空间" (^ $F n*n) "之间的同构.")
   ((exercise #:n "12")
    "令" $V "是一个有限维内积空间. 在练习6中, 我们展示了"
    "如何构造一个" $V "上既自伴又酉的算子. 现在证明对于每个"
    $V "上的自伴酉算子, 都存在一个子空间" $W
    "使得这个算子可由练习6中所描述的方法构造出来.")
   ((exercise #:n "13")
    "令" $V "和" $W "是有限维内积空间, " $U "是从"
    $V "到" $W "的同构, 证明"
    (Ol #:attr* '((type "a"))
        (Li "映射" (&\|-> $T (iaut $T))
            "是从向量空间" (&L $V $V) "到向量空间"
            (&L $W $W) "的同构.")
        (Li "对于每个" (∈ $T (&L $V $V)) ", "
            (&= (&trace (iaut $T)) (&trace $T)) ".")
        (Li (&= (iaut (_ $T (&cm $alpha $beta)))
                (_ $T (&cm (ap $U $alpha) (ap $U $beta))))
            ", 其中" (_ $T (&cm $alpha $beta))
            "于练习10中被定义.")
        (Li (&= (&* (@iaut $T)) (iaut (&* $T))) ".")
        (Li "如果我们装备" (&L $V $V) "以内积"
            (&= (inner* $T_1 $T_2)
                (&trace (&i* $T_1 (_^ $T $2 $*))))
            ", 并以类似的方式定义" (&L $W $W)
            "上的内积, 那么" (&\|-> $T (iaut $T))
            "是一个内积空间的同构.")))
   ((exercise #:n "14")
    "如果" $V "是一个内积空间, 那么" (B "刚体运动")
    "是满足对于每个" (∈ $alpha $beta $V) "有"
    (&= (&norm (&- (ap $T $alpha) (ap $T $beta)))
        (&norm (&- $alpha $beta)))
    "的映射" (func $T $V $V) ", 其中" $T
    "不必是线性变换. 酉算子是刚体运动的一个例子. "
    "另外一个例子是平移一个固定的向量" $gamma ":"
    (MB (&= (app $T_gamma $alpha)
            (&+ $alpha $gamma)) ".")
    (Ol #:attr* '((type "a"))
        (Li "令" $V "是带有标准内积的" $RR^2
            ", 设" $T "是" $V "的一个刚体运动, 并且"
            (&= (app $T $0) $0) ", 证明"
            $T "是线性的, 而且是一个酉算子.")
        (Li "使用a的结果证明每个" $RR^2
            "的刚体运动都是由一个平移接着一个酉算子复合而成的.")
        (Li "现在证明" $RR^2 "的刚体运动要么是一个平移接着一个"
            "旋转, 要么是一个平移接着一个反射接着一个旋转.")))
   ((exercise #:n "15")
    $RR^4 " (带有标准内积) 上的酉算子不过就是保持二次形式"
    (MB (&= (sqrnorm (tu0 $x $y $z $t))
            (&+ $x^2 $y^2 $z^2 $t^2)))
    "的线性算子, 即对于每个" (∈ $alpha $RR^4) "满足"
    (&= (sqrnorm (ap $U $alpha)) (sqrnorm $alpha))
    "的线性算子" $U ". 在相对论的特定部分中, 寻找保持形式"
    (MB (&= (Lorentz^2 (tu0 $x $y $z $t))
            (&- $t^2 $x^2 $y^2 $z^2)))
    "的线性算子" $T "是令人感兴趣的. " (Lorentz^2 $)
    "并不来源于内积, 而是某种被称为&quot;Lorentz度量&quot;"
    "的东西 (我们不会深入讨论这个). 出于这种原因, "
    $RR^4 "上的线性变换" $T ", 若满足对于每个"
    (∈ $alpha $RR^4) "都有"
    (&= (Lorentz^2 (ap $T $alpha)) (Lorentz^2 $alpha))
    ", 则被称为" (B "Lorentz变换") "."
    (Ol #:attr* '((type "a"))
        (Li "说明由"
            (MB (&= (appl $U $x $y $z $t)
                    (Mat ((&+ $t $x) (Complex $y $z))
                         ((&- $y (&i* $i $z)) (&- $t $x)))))
            "定义的函数" $U "是从" $RR^4 "到由所有" 2*2
            "的自伴复矩阵构成的实向量空间" $H "的同构.")
        (Li "说明"
            (&= (Lorentz^2 $alpha)
                (&det (ap $U $alpha))) ".")
        (Li "设" $T "是" $H "上的一个(实)线性算子, 说明"
            (&= $L (sim $T $U)) "是" $RR^4 "上的线性算子.")
        (Li "令" $M "是任意的" 2*2 "复矩阵, 说明"
            (&= (app $T_M $A) (&i* (&* $M) $A $M))
            "定义了一个" $H "上的线性算子. (一定要检查"
            $T_M "的确将" $H "映入" $H ".)")
        (Li "如果" (∈ $M (^ $CC 2*2)) "满足"
            (&= (&abs (&det $M)) $1) ", 说明"
            (&= $L_M (sim $T_M $U)) "是" $RR^4
            "上的一个Lorentz变换.")
        (Li "找到一个这样的Lorentz变换" $L ", 不存在"
            (∈ $M (^ $CC 2*2)) "使得" (&= $L $L_M) ".")))
   (H3 "第8.5节 正规算子")
   ((exercise #:n "1")
    "对于以下每个实对称矩阵" $A ", 找出一个实正交矩阵" $P
    "使得" (osim $A) "成为对角矩阵."
    (MB (&cm (Mat ($1 $1) ($1 $1))
             (Mat ($1 $2) ($2 $1))
             (MatR ((&cos $theta) (&sin $theta))
                   ((&sin $theta) (&- (&cos $theta)))))))
   ((exercise #:n "2")
    "复对称矩阵是自伴的吗? 是正规的吗?")
   ((exercise #:n "3")
    "对于"
    (MB (&= $A (Mat ($1 $2 $3) ($2 $3 $4) ($3 $4 $5))))
    "存在实正交矩阵" $P "使得" (&= (osim $A) $D)
    "是一个对角矩阵. 找出一个这样的对角矩阵" $D ".")
   ((exercise #:n "4")
    "令" $V "是带有标准内积的" $CC^2 ", " $T
    "是" $V "上在标准有序基下由矩阵"
    (MB (&= $A (Mat ($1 $i) ($i $1))))
    "表示的线性算子. 证明" $T "是正规算子, 并找到"
    $V "的一个全由" $T "的特征向量构成的规范正交基.")
   ((exercise #:n "5")
    "给出一个" 2*2 "的矩阵" $A "的例子, " $A^2
    "是正规的, 但是" $A "不是正规的.")
   ((exercise #:n "6")
    "令" $T "是有限维复内积空间上的一个正规算子, 证明"
    (Ol #:attr* '((type "i"))
        (Li "如果" $T "的每个特征值都是实数, 那么"
            $T "是一个自伴算子.")
        (Li "如果" $T "的每个特征值都是正数, 那么"
            $T "是一个正定算子.")
        (Li "如果" $T "的每个特征值的绝对值均为" $1
            ", 那么" $T "是一个酉算子.")))
   ((exercise #:n "7")
    "令" $T "是有限维内积空间" $V "上的一个线性算子, 设"
    $T "既是正定算子又是酉算子, 证明" (&= $T $I) ".")
   ((exercise #:n "8")
    "证明有限维复内积空间上的线性算子" $T
    "是正规的当且仅当存在交换的自伴算子"
    $T_1 "和" $T_2 "使得"
    (&= $T (Complex $T_1 $T_2)) ".")
   ((exercise #:n "9")
    "证明实对称矩阵具有实对称立方根, 即若"
    $A "为实对称矩阵, 则存在实对称的" $B
    "满足" (&= $B^3 $A) ".")
   ((exercise #:n "10")
    "证明每个正定矩阵都是某个正定矩阵的平方.")
   ((exercise #:n "11")
    "设" $T "是有限维复内积空间上的一个线性算子, 若"
    $T "既是正规算子也是幂零算子, 那么" (&= $T $0) ".")
   ((exercise #:n "12")
    "如果" $T "是有限维内积空间上的一个正规算子, 证明"
    $T "的不同特征值所对应的特征向量之间是正交的.")
   ((exercise #:n "13")
    "令" $T "是有限维复内积空间上的一个正规算子, "
    "证明存在复数域上的多项式" $f "使得"
    (&= (&* $T) (app $f $T)) ". (表示" $T
    "以对角矩阵, 看看" $f "必须是什么.)")
   ((exercise #:n "14")
    "如果有限维复内积空间上的两个正规算子交换, "
    "证明它们的积也是正规算子.")
   ((tcomment)
    "以上诸多练习缺少条件, 经过译者考察, "
    "绝大部分都应该是有限维复内积空间. "
    "实际上, 读者也可以看到, 虽然正文中的"
    "正规算子也可以定义在实内积空间上, "
    "但是理论构建的主要结果中只考虑"
    "复内积空间上的正规算子.")
   (H2 "第9章 内积空间上的算子")
   (H3 "第9.1节 引论")
   (H3 "第9.2节 内积空间上的形式")
   ((exercise #:n "1")
    "请问下列函数" (func $f (&c* $CC^2 $CC^2) $CC)
    "中哪些是" $CC^2 "上的(半双线性)形式, 其中我们设"
    (&= $alpha (tu0 $x_1 $x_2)) ", "
    (&= $beta (tu0 $y_1 $y_2)) "?"
    (Ol #:attr* '((type "a"))
        (Li (&= (appl $f $alpha $beta) $1) ".")
        (Li (&= (appl $f $alpha $beta)
                (&+ (&sqr (@- $x_1 (_ (OverBar $y) $1)))
                    (&i* $x_2 (_ (OverBar $y) $2)))) ".")
        (Li (&= (appl $f $alpha $beta)
                (&- (&sqr (@+ $x_1 (_ (OverBar $y) $1)))
                    (&sqr (@- $x_1 (_ (OverBar $y) $1))))) ".")
        (Li (&= (appl $f $alpha $beta)
                (&- (&i* $x_1 (_ (OverBar $y) $2))
                    (&i* (_ (OverBar $x) $2) $y_1))) ".")))
   ((exercise #:n "2")
    "令"
    (MB (&= (appl $f (tu0 $x_1 $x_2) (tu0 $y_1 $y_2))
            (&+ (&i* $x_1 $y_1) (&i* $x_2 $y_2))))
    "是" $RR^2 "上的形式, 找出" $f "在以下的每个基下的矩阵:"
    (MB (&cm (setE (tu0 $1 $0) (tu0 $0 $1))
             (setE (tu0 $1 $-1) (tu0 $1 $1))
             (setE (tu0 $1 $2) (tu0 $3 $4))) "."))
   ((exercise #:n "3")
    "令"
    (MB (&= $A (MatR ($1 $i) ((&- $i) $2))))
    "而" (&= (appl $g $X $Y) (&i* (&* $Y) $A $X))
    "是" (^ $CC (&c* $2 $1)) "上的形式, 那么" $g
    "是一个内积吗?")
   ((exercise #:n "4")
    "令" $V "是一个复向量空间而" $f "是" $V
    "上的一个对称的(半双线性)形式, 即"
    (&= (appl $f $alpha $beta)
        (appl $f $beta $alpha))
    ", 那么" $f "是什么呢?")
   ((exercise #:n "5")
    "令"
    (MB (&= (appl $f (tu0 $x_1 $x_2) (tu0 $y_1 $y_2))
            (&+ (&i* $x_1 $y_1)
                (&i* $4 $x_2 $y_2)
                (&i* $2 $x_1 $y_2)
                (&i* $2 $x_2 $y_1))))
    "是" $RR^2 "上的形式, 找到一个有序基使得" $f
    "由一个对角矩阵表示.")
   ((exercise #:n "6")
    "称形式" $f "为(左)非退化的, 如果对于每个向量"
    $beta "有" (&= (appl $f $alpha $beta) $0)
    "可以推出" (&= $alpha $0) ". 令" $f
    "是有限维内积空间" $V "上的一个形式, 证明" $f
    "是非退化的当且仅当其对应的线性算子" $T_f
    " (定理1) 是非奇异的.")
   ((exercise #:n "7")
    "令" $f "是有限维向量空间" $V "上的一个形式. "
    "参考练习6给出的左非退化的概念, 定义右非退化, 并证明"
    $f "是左非退化的当且仅当" $f "是右非退化的.")
   ((exercise #:n "8")
    "令" $f "是有限维向量空间" $V
    "上的一个非退化形式 (练习6和7), " $L "是" $V
    "上的一个线性泛函, 证明存在唯一的" (∈ $beta $V)
    "使得对于每个" (∈ $alpha $V) "有"
    (&= (app $L $alpha) (appl $f $alpha $beta)) ".")
   ((exercise #:n "9")
    "令" $f "是有限维向量空间" $V
    "上的一个非退化形式, 证明每个线性算子"
    $S "都有一个&quot;相对于" $f
    "的伴随&quot;, 即一个线性算子" $S^ "满足对于每个"
    (∈ $alpha $beta $V) "有"
    (&= (appl $f (ap $S $alpha) $beta)
        (appl $f $alpha (ap $S^ $beta))) ".")
   (H3 "第9.3节 正定形式")
   
   ))