#lang racket
(provide logic.html)
(require SMathML)
(define $<:id (Mi "&lt;"))
(define-infix*
  (&conj $conj)
  (&disj $disj))
(define (∀ x P)
  (: $forall x (@ P)))
(define-@lized-op*
  (@disj &disj))
(define logic.html
  (TnTmPrelude
   #:title "逻辑学习指南"
   #:css "styles.css"
   (H1. "逻辑学习指南")
   (P "这是逻辑学家Peter Smith所写的逻辑学习指南, 我曾经读过相当一部分, 但不是全部. "
      "我翻译此书的目的或许是希望有更多的人能够享受逻辑学的乐趣.")
   (H2. "指南本身, 以及如何使用它")
   (H3. "本书是为谁而写的?")
   (H3. "指南的结构")
   (H3. "从逻辑书籍中自学的策略")
   (H3. "选择, 还是选择")
   (H2. "一点非形式化的集合论")
   (H3. "集合: 基本知识清单")
   (H3. "关于朴素 (naivety) 的注记")
   (H3. "非形式化的基本集合论的推荐材料")
   (P "如果你是一个数学系学生, 那么你必然已经对于我们清单上列出的想法相当熟悉了. "
      "数学书籍中经常出现的导引章节或者附录中往往会包含这些内容. 一个特别好的例子是"
      (Ol (Li "James R. Munkres, " (I "Topology")
              " (Prentice Hall, 2nd edition, 2000). Chapter 1, "
              "'Set Theory and Logic'. 这部分内容将非常清晰地告诉你基本的集合论概念, "
              "直至可数集和不可数集的对比以及选择公理 (外加其他一些值得晓得的东西)."))
      "但是非数学系的学生或者锈蚀了的数学系学生或许会发现下面的诸多书籍之一可能更符合他们的口味:"
      (Ol #:attr* '((start "2"))
          (Li "Tim Button, " (I "Set Theory: An Open Introduction")
              " (Open Logic Project), Chapters 1-5. 可在"
              (A #:attr* '((href "https://tinyurl.com/opensettheory")) "tinyurl.com/opensettheory")
              "上找到."
              )
          )
      )
   (H3. "虚拟的类, 真实的集合")
   (H2. "一阶逻辑")
   (H3. "命题逻辑")
   (H3. "FOL基础")
   (H3. "一点关于证明系统的类型的注记")
   (H3. "FOL读物的基本推荐")
   (H3. "一些并行但稍微高级一些的读物")
   (H2. "二阶逻辑, 相当扼要地")
   (H2. "模型论")
   (P "第一次严肃接触一阶逻辑的高光时刻在于完备性定理的证明. "
      "导引性质的书籍然后至少还会讨论该证明的几个快速推论, 例如"
      (Em "紧致性定理") " (我们已经见过了) 和"
      (Em "向下L&ouml;wenheim-Skolem定理")
      ". 如此我们进入我们称之为Level 1模型论的世界里走了几步. "
      "沿着这条路径我们将会遇到Level 3模型论 "
      "(我正在想着的是诸如在之后章节里出现的由"
      "Wilfrid Hodges和David Marker所著的如今被视为经典文献的"
      "书籍里所覆盖那种主题, 其在" (Ref "more-model-theory")
      "里被推荐为高级读物). "
      )
   (H3. "初等模型论")
   (P "模型论是关于数学结构以及如何使用形式语言刻画结构和对于结构进行分类的学科. "
      "换言之, 其关心的是一个数学理论 (编排为一个形式句子的集合) 和"
      (Q "实现") "理论的结构 (即可以解释理论为真的结构, "
      "即为理论提供了模型的结构) 之间的关系.")
   (P "心中有一些作为例子的理论和其所对应的结构是有用的. "
      "例如, 了解一些算术理论, 代数理论 (如群论或者布尔代数), "
      )
   (P "以下是一些我们需要探索的最初主题:"
      (Ol (Li "我们需要开始更多地思考结构以及结构之间的交互联系. "
              "例如, 一个结构可以直接是另一个结构的子结构, "
              "或者扩展了另外一个结构. 或者, "
              "我们可以将一个结构以保持某些相关结构特征的方式映射至另外一个结构 "
              
              )
          (Li "一个语言可以告诉我们多少关于一个结构的信息? "
              "作为一个玩具例子, 我们取结构" (tu0 $NN $<:id)
              ", 即装备有标准序关系的自然数. "
              "并且, 考虑一个一阶形式语言, 其唯一的非逻辑语汇是代表序关系的符号 "
              "(让我们仍然使用" $<:id ", 上下文会使得现在这" (Em "是")
              "一个属于某个形式语言的表达式明了化). 然后, "
              "注意到我们可以使用这个语言定义" $NN "上的后继关系, 通过公式"
              (MB #:attr* '((mathvariant "sans-serif"))
                  (&conj (&< $x $y)
                         (∀ $z (&-> (&< $x $z)
                                    (@disj (&= $z $y)
                                           (&< $y $z))))))
              "其带有遍历" $NN "的量化子. 显然对于一对数字"
              (&cm $x $y) "而言, 如果" $y "在序上来得在" $x
              "的立即之后, 那么其满足这个公式. "
              "而且既然我们可以定义后继关系, 那么现在我们可以定义"
              $0 "为结构" (tu0 $NN $<:id)
              "中不是任何东西的后继的那个数字."
              )
          )
      )
   (H2. "算术, 可计算性, 以及不完备性")
   (H2. "不那么朴素的集合论")
   (H2. "直觉主义逻辑")
   (H2. "初等证明论")
   (H2. "模态逻辑")
   (H2. "其他逻辑?")
   (H2. "更加深入")
   (H3. "一点逻辑代数?")
   (H3. "更多的模型论" #:id "more-model-theory")
   ))