#lang racket
(provide modal_logic.html)
(require SMathML)
(define modal_logic.html
  (TnTmPrelude
   #:title "模态逻辑"
   #:css "styles.css"
   (H1. "模态逻辑")
   (H2 "前言")
   (P "如果你去问三位模态逻辑学家什么是模态逻辑, "
      "很可能会得到至少三种不同的回答. "
      "本书的作者们也不例外, 因此我们不打算一上来就给出一个简洁的定义. "
      "尽管如此, 有一些基本思想贯穿了我们对这一学科的思考, "
      "我们将以三句口号的形式, 率先呈现其中最重要的几个. "
      "这些口号旨在供你现在阅读, 而且更重要的是, 供你日后不时回顾; "
      "这样做将有助于你牢固掌握塑造本书的核心思想与直觉. "
      "在这些口号之后, 我们将更详细地讨论本书的目标与内容.")
   
   (H2. "基本概念")
   (H2. "模型")
   (H2. "框架")
   (H2. "完备性")
   ))