#lang racket
(provide monadic.html)
(require SMathML)
(define App (&split 2))
(define (Apply f x)
  (ap f (&db0 x)))
(define (deno x)
  (Apply $E x))
(define $Term (Mi "Term"))
(define $Env (Mi "Env"))
(define $Value (Mi "Value"))
(define $Ans (Mi "Ans"))
(define $return (Mi "return"))
(define (&return v)
  (App $return v))
(define $bind (Mi "bind"))
(define (&bind mv f)
  (App $bind mv f))
(define (Lam x t)
  (: $lambda x $. t))
(define Lam*
  (case-lambda
    ((x t) (Lam x t))
    ((x y . z*)
     (Lam x (apply Lam* y z*)))))
(define (Do . x*)
  (cur0 (apply &\; x*)))
(define-@lized-op*
  (@App App)
  (@deno deno)
  (@Lam Lam)
  (@Lam* Lam*))
(define monadic.html
  (TnTmPrelude
   #:title "模块化单子语义和编译"
   #:css "styles.css"
   (H1. "模块化单子语义和编译")
   (H2. "引论")
   (H3. "概览")
   (P "指称语义 [Stoy, 1977] 是编程语言理论中最重要的发展之一. "
      "它为编程语言提供了精确的数学描述, "
      "可用于语言的设计与实现以及程序的推理. "
      "例如, 指称语义的进展促进了语言特性的澄清, "
      "推动了更一致的编程语言设计, 并催生了新的编程构造.")
   (P "然而, 人们很早就认识到, "
      "传统的指称语义缺乏模块性和可扩展性 "
      "[Mosses, 1984] [Lee, 1989]. "
      "这被视为将指称语义应用于实际编程语言的一大障碍.")
   (P "在本论文中, 我们利用编程语言理论中的一项新发展"
      -- "单子方法 [Moggi, 1990]" --
      "来构建结构化的指称语义. "
      "由此产生的模块化单子语义实现了高度的模块性和可扩展性. "
      "它能够将各个编程语言特性封装为可重用的构建模块, "
      "并通过组合所需的特性来定义编程语言.")
   (P "由于模块化单子语义本质上就是一种结构化的指称语义, "
      "所有的等式推理方法均可适用. 此外, "
      "我们将展示模块化单子语义如何进一步促进推理, "
      "它允许我们为编程语言特性指定公理, "
      "并构造可重用的模块化证明.")
   (P "模块化单子语义可以使用现代编程语言来实现, "
      "例如Haskell [Hudak et al., 1992], "
      "ML [Milner et al., 1990] "
      "或Scheme [Clinger and Rees, 1991]. "
      "其结果是一个模块化的解释器. "
      "我们发现, Gofer (以及Haskell 1.3) "
      "中相对较新的" (Em "构造子类") "概念特别适合于"
      "表示模块化解释器中一些相当复杂的类型关系.")
   (P "我们的工作可直接应用于语义导向的编译器构造. "
      "我们将提出一种基于单子语义和单子程序变换的编译方法, "
      "并通过重新定向一个Haskell编译器来验证我们的想法.")
   (P "在介绍模块化单子语义之前, "
      "我们将在下一节给出一个示例, "
      "以说明传统指称语义缺乏模块性. "
      "本文的表述遵循传统的指称语义风格, "
      "并辅以类似于Haskell或ML的类型声明句法. "
      "我们假设读者具备指称语义和函数式编程的基本知识.")
   (H3. "指称语义的模块性缺乏")
   (P "让我们首先来看一个简单算术语言的语义:"
      (eqn*
       ($E $: (&-> $Term $Value))
       ((deno $n) $= $n)
       ((deno (&+ $e_1 $e_2))
        $= (&+ (deno $e_1) (deno $e_2)))))
   (P "指称语义将源语言中的项映射为元语言中的值. "
      "源语言的项用" (Q (&db0 $))
      "括起来. 右侧的" $n "和" $+
      "符号对应于元语言中的数字和加法算术运算的概念.")
   ((tcomment)
    "其实就指称语义而言, " (&db0 $)
    "记号一般就相当于指称函数本身了. "
    "不过指称函数可能不止一个, "
    "所以有时可能需要某种手段进行标记. "
    "有的人选择下标, 有的人选择在前面加上符号. "
    "当然, 像本文一样理解也没有任何问题.")
   (P "模块性的一个重要度量方式是"
      "语义描述能否被扩展以纳入新的编程语言特性. "
      "例如, 如果我们用变量和函数来扩展源语言, "
      "就需要引入一个环境" --
      "即从变量名到值的映射:"
      (eqn*
       ($E $: (&-> $Term $Env $Value))
       ((deno $n) $= (Lam $rho $n))
       ((deno (&+ $e_1 $e_2))
        $= (Lam $rho (&+ (ap (deno $e_1) $rho)
                         (ap (deno $e_2) $rho))))
       ((deno $v) $= (Lam $rho (Apply $rho $v)))))
   (P "尽管数字与环境无关, 我们仍然必须修改数字的语义, "
      "以适应新引入的环境参数. "
      "{译注: 此处说的数字是源语言中的, "
      "一个更好的名字或许是numeral.} "
      "同样, 环境参数必须递归地传递给" (&+ $e_1 $e_2)
      "的子表达式, 即便算术运算本身与环境无关.")
   (P "如果我们进一步在语义中加入延续 "
      "(例如, 为了支持顺序运算符"
      (Q $\;) "), 就必须再次修改数字的语义:"
      (eqn*
       ($E $: (&-> $Term $Env (@-> $Value $Ans) $Ans))
       ((deno $n) $= (Lam* $rho $k (ap $k $n)))
       ((deno (&+ $e_1 $e_2))
        $= (Lam* $rho $k
                 (ap* (deno $e_1)
                      $rho (@Lam
                            $i (ap* (deno $e_2)
                                    $rho (@Lam
                                          $j (app $k (&+ $i $j))))))))
       ((deno (&\; $e_1 $e_2))
        $= (Lam* $rho $k
                 (ap* (deno $e_1)
                      $rho (@Lam $x (ap* (deno $e_2) $rho $k)))))))
   ((tcomment)
    "为了完整性, 我们加上原文可能是忘了的变量的语义."
    (MB (&= (deno $v) (Lam* $rho $k (app $k (Apply $rho $v))))))
   (P "总而言之, 为了向源语言添加新特性, "
      "我们必须对传统指称语义进行全局修改. "
      "传统指称语义缺乏模块性这一问题"
      "早已被人们所认识 [Mosses, 1984] [Lee, 1989]. "
      "它被视为将指称语义应用于现实编程语言的最大障碍.")
   (P "在下一节中, 我们将展示如何通过使用一种称为"
      (Em "单子") "的抽象机制来增强模块性.")
   (H3. "单子" -- "一种抽象机制")
   (P "我们将使用一个类型构造子" $M "和两个函数:"
      (eqn*
       ($return $: (&-> $a (App $M $a)))
       ($bind $: (&-> (App $M $a)
                      (@-> $a (App $M $b))
                      (App $M $b)))))
   (P "这些构造的直觉性含义如下:"
      (Ul (Li (App $M $a)
              ": 返回类型为" $a "的值的"
              (Em "计算") ".")
          (Li (&bind $c_1 (@Lam $v $c_2))
              ": 首先计算" $c_1 ", 将结果绑定至" $v
              ", 然后计算" $c_2 "的计算.")
          (Li (&return $v)
              ": 平凡的计算, 其直接返回"
              $v "作为结果.")))
   (P "接下来, 我们使用" $M ", " $bind "和" $return
      "为算术表达式写下一个" (Em "参数化语义") ":"
      (eqn*
       ($E $: (&-> $Term (App $M $Value)))
       ((deno $n) $= (&return $n))
       ((deno (&+ $e_1 $e_2))
        $= (&bind (@deno $e_1)
                  (@Lam $i (&bind (@deno $e_2)
                                  (@Lam $j (&return (@+ $i $j))))))))
      "语义函数" $E "将项映射为计算 (其具有类型"
      (App $M $Value) "). " (deno $n)
      "的语义是返回" $n "作为结果的平凡计算. "
      (deno (&+ $e_1 $e_2))
      "的语义是先计算" (deno $e_1)
      ", 将其结果绑定至" $i
      ", 然后计算" (deno $e_2)
      ", 将其结果绑定至" $j
      ", 最终返回" (&+ $i $j) "的计算.")
   ((tcomment)
    "对于原文这里的"
    (Q (deno $n) "和" (deno (&+ $e_1 $e_2))
       "的语义 (semantics)")
    ", 个人认为使用" (Q "意义 (meaning)")
    "更为贴切.")
   (P "参数化语义的优势在于, 根据我们如何实例化"
      $M ", " $bind "和" $return
      ", 可以得到我们所选择的不同语义. "
      "图1.1展示了如何将算术语义实例化为"
      "上一节中描述的平凡语义和基于环境的语义. "
      "在本论文的后续部分, 我们将看到, 对"
      $M ", " $bind "和" $return
      "进行适当的定义, 还可以导出其他语义 "
      "(例如, 基于延续的语义).")
   (P "类型构造子" $M "连同两个函数"
      $return "和" $bind
      ", 被称为一个单子 (monad). "
      "上面为算术表达式定义的参数化语义被称为单子语义 (monadic semantics). "
      "单子语义可以使用不同的"
      (Em "潜在单子 (underlying monad)")
      "来实例化. 要向单子语义中添加一个新特性, "
      "我们只需添加该新特性的语义描述, 并更改潜在单子, "
      "而无需修改现有特性的语义描述.")
   (H3. "论文的背景和组织方式")
   (P "本论文在前人工作的基础上, 探讨单子和单子语义的理论与实际应用. "
      "单子的概念源于范畴论 [Mac Lane, 1971]. "
      "使用三元组 (" $bind ", " $return
      "和类型构造子) 来表述单子的方式归功于Kleisli. "
      "Moggi [Moggi, 1990] 最先提出单子是构造指称语义的有用工具. "
      "Wadler的早期工作 [Wadler, 1990] 展示了单子与函数式编程之间的关系. "
      "近来, 人们对使用单子来构造模块化语义和模块化解释器产生了极大的兴趣 "
      "[Wadler, 1992] [Jones and Duponcheel, 1993] "
      "[Espinosa, 1993] [Steele Jr., 1994].")
   (P "在第2章中, 我们将为广泛的编程语言特性呈现模块化单子语义. "
      "我们将展示单子转换器 (monad transformer) 如何捕获各个特性, "
      "以及提升 (lifting) 如何捕获不同特性之间的交互.")
   (P "在第3章中, 我们将研究单子和单子转换器的理论. "
      "这包括例如单子转换器和提升的形式化性质. "
      "我们将使用单子律和公理, "
      "在比传统指称语义更高的层次上进行等式推理.")
   (P "在第4章中, 我们将展示单子和单子转换器的形式化概念"
      "如何自然地融入Gofer [Jones, 1991] 的类型系统. "
      "通过在Gofer中实现模块化单子语义, "
      "我们可以获得一个模块化解释器.")
   (P "在第5章中, 我们将把单子语义应用于语义导向的编译. "
      "我们将展示如何利用单子框架的模块性和推理能力, "
      "推导出一个有效且可证明正确的编译方案. "
      "我们将通过构建一个可重定向的Haskell编译器来检验我们的一些想法.")
   (P "在整篇论文中, 我们将使用一种共同的源语言来讨论"
      "单子语义, 模块化解释器和编译中的各种问题. "
      "这个源语言将于下一节引入.")
   (H3. "源语言")
   (P "本论文中所考虑的源语言具有多种特性, "
      "包括不同的函数调用机制, 命令式特性, 第一级延续, "
      "追踪 (用于调试), 以及非确定性."
      
      )
   (H3. "记号")
   (P "为清晰起见, 我们采用以下缩略形式:"
      (eqn*
       ($E $: (&-> $Term (App $M $Value)))
       ((deno (&+ $e_1 $e_2))
        $= (&bind (@deno $e_1)
                  (@Lam $i (&bind (@deno $e_2)
                                  (@Lam $j (&return (@+ $i $j))))))))
      (MB $dArr)
      (eqn*
       ($E $: (&-> $Term (App $M $Value)))
       ((deno (&+ $e_1 $e_2))
        $= (Do (&<- $i (deno $e_1))
               (&<- $j (deno $e_2))
               (&return (@+ $i $j))))))
   (P "这种记号类似于Haskell中的" (Q "do")
      "语法 [Peterson and Hammond, 1996], "
      "也与单子概括式 (monad comprehension) "
      "[Wadler, 1990] 有一定的相似之处. "
      "需要注意的是, 尽管具有命令式的外观, "
      "单子语义仍然是由lambda表达式和函数应用所构成的. "
      "我们将以可互换的方式使用" $bind
      "和这种缩略形式, 完全取决于哪一种更为方便.")
   (H2. "模块化单子语义")
   (P "在本章中, 我们将介绍源语言的模块化单子语义. "
      "与传统的指称语义相比, "
      "我们的方法使用模块化的构建块来捕获各个编程语言特性.")
   
   ))