#lang racket
(provide msp.html)
(require SMathML)
(define msp.html
  (TnTmPrelude
   #:title "多阶段编程的温和介绍"
   #:css "styles.css"
   (H1. "多阶段编程的温和介绍")
   (H2. "引论")
   (H3. "构建程序生成器的问题")
   (H3. "三种基本的MSP构造")
   (P (B "括号 (bracket)")
      " (记作" (Code ".&lt;...>.")
      ") 可以被插入到任意表达式的周围来推迟其执行. "
      "MetaOCaml通过在运行时动态生成源代码来实现被推迟的表达式. "
      "尽管使用源代码表示并非实现MSP语言的唯一方式, "
      "这种方法是最简单的. "
      "以下简单的MetaOCaml交互会话刻画了括号的行为:"
      (CodeB "# let a = 1+2;;
val a : int = 3
# let a = .&lt;1+2>.;;
val a : int code = .&lt;1+2>.")
      "以" (Code "#") "开始的行是由用户输入的, "
      "而接着的行是由系统输出返回的内容. 如果"
      (Code "1+2") "周围没有括号, "
      "那么加法就会立即执行. "
      "而带了括号之后, 结果就是表示程序"
      (Code "1+2") "的一段代码了. "
      "这个代码片段要么可以用作更大程序的一部分, "
      "要么可以被编译和执行.")
   (P "除了推迟计算, 括号也反映在类型里. "
      "之前的最后一个声明中的类型是" (Code "int code")
      ". 一个代码片段的类型反映了当其被执行时所产生的值的类型. "
      "静态确定生成代码的类型允许我们避免写出会产生不能定型的代码的生成器. "
      "代码类型的构造子将推迟的值和其他值区分开来, "
      "阻止用户尝试不安全的操作, 例如"
      (Code "1 + .&lt;5>.") ".")
   (P (B "逃逸 (escape)")
      " (记作" (Code ".~...")
      ") 允许较小的推迟值组合成为更大的推迟值. "
      )
   (H3. "基本的等价概念")
   ))