#lang racket
(provide plcat.html)
(require SMathML "todo.rkt")
(define (Func* x*)
  (apply : (map-toggle
            #f (λ (f) (^^ $-> f)) x*)))
(define (Func . x*) (Func* x*))
(define (|[]| a b)
  (: $lb a $cm b $rb))
(define (extend env var val)
  (: env (bra0 (&\|-> var val))))
(define (deno x)
  (&db0 x))
(define $? (Mi "?"))
(define $=? (^^ $= $?))
(define $dummy (Mi "&minus;"))
(define $emptyCtx (Mi "&bull;"))
(define $element (Mi "&Star;"))
(define (PointsTo x y)
  (bra0 (&\|-> x y)))
(define :x (Ms "x"))
(define :y (Ms "y"))
(define (!- . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (: (apply &cm a*) $vdash (car b*))))
(define (G!- . x*)
  (apply !- Γ x*))
(define (&rule #:space [n 8] . j*)
  (let-values (((j* j1) (split-at-right j* 1)))
    (~ #:attr* '((displaystyle "true"))
       (apply (&split n) j*) (car j1))))
(define split2 (&split 2))
(define App (&split 2))
(define split16 (&split 16))
(define (RLabel x)
  (Mtext #:attr* '((class "small-caps")) x))
(define $Calc (RLabel "Calc"))
(define $TinyPPL (RLabel "TinyPPL"))
(define $stlc (RLabel "stlc"))
(define (Pid str)
  (Mi str #:attr* '((mathvariant "monospace"))))
(define $dom (Pid "dom"))
(define $cod (Pid "cod"))
(define $id (Pid "id"))
(define (Id A) (_ $id A))
(define $Set (Pid "Set"))
(define $FinSet (Pid "FinSet"))
(define $Bern (Pid "Bern"))
(define $flip (Pid "flip"))
(define $let (Pid "let"))
(define $be (Pid "be"))
(define $in (Pid "in"))
(define (Let x M N)
  (split2 $let x $be M $in N))
(define $true (Pid "true"))
(define $false (Pid "false"))
(define $if (Pid "if"))
(define $then (Pid "then"))
(define $else (Pid "else"))
(define (If q a e)
  (split2 $if q $then a $else e))
(define Cons tupa0)
(define $fst (Pid "fst"))
(define (Fst M) (ap $fst M))
(define $snd (Pid "snd"))
(define (Snd M) (ap $snd M))
(define $unit (Cons))
(define $Bool (Pid "Bool"))
(define $Unit (Pid "Unit"))
(define (Lam x M)
  (: $lambda x $. M))
(define-@lized-op*
  (@\|-> &\|->)
  (@extend extend)
  (@Let Let))
(define plcat.html
  (TnTmPrelude
   #:title "编程语言范畴论"
   #:css "styles.css"
   (H1. "编程语言范畴论")
   (H2 "前言")
   (P "这些是一门面向程序设计语言研究者的范畴论课程的讲义. "
      "我想说, 这份讲义和这门课程都是" (Q "被逼出来的")
      ": 范畴论的用处无法回避, "
      "我才不得不去学习和理解一些范畴论. "
      "我不会把自己称作范畴论学者, "
      "这门课也与我以往尝试讲授的任何课程都很不一样. "
      "我在这门课上的目标, "
      "是梳理出我认为范畴论中必然出现的东西, "
      "并以我觉得最合理的方式呈现出来. "
      "当然, 没有John, 这一切都不可能实现, "
      "真正理解这里所有内容的人是他.")
   (P "许多程序设计语言研究者和学生都曾在某个时候接触过范畴论. "
      "大多数人第一次见到它, 可能是在学习Haskell时看到"
      (Q "monad (单子)") "和" (Q "functor (函子)")
      "这样的词. 也有些更偏数学的人, "
      "是在学习lambda演算时接触到它的, "
      "他们听说了Scott, Smyth和Plotkin"
      "关于无类型lambda演算模型论的著名成果 [34]. "
      "你来到这里, 很可能是因为你在某处见过范畴论, "
      "想知道为什么需要它, 或者怀疑它是否真的有必要.")
   (P "就我而言, 范畴论第一次出现在我自己的研究中, "
      "并迫使我停下来去理解它, "
      "是因为Heunen等人关于拟Borel空间的论文. "
      "那是我读研究生的第二年, "
      "我得承认这篇论文让我非常发怵. "
      "它可怕地结合了两点: "
      "(1) 似乎对我眼下的研究非常重要, "
      "(2) 完全无法理解. 简而言之, "
      "这篇论文为一种支持连续概率分布的"
      "高阶概率编程语言提出了一种指称语义, "
      "称为拟Borel空间 (quasi-Borel spaces, QBS). "
      "我当时是, 现在也仍然是概率程序设计语言的研究者, "
      "所以这个结果似乎至关重要: 我喜欢函数! "
      "然而当时我甚至看不出这件事为什么一开始就很难做! "
      "如果你连一个问题的动机都理解不了, "
      "那么想理解它的解法就只能祝你好运了.")
   (P "论文第二段恰好给出了核心难题:"
      (Blockquote
       (Q "这些语言中的程序可能会把"
          "高阶函数与连续分布结合起来, "
          "甚至在函数上定义概率分布. 但是, "
          "概率论标准的测度论形式化不能很好地处理高阶函数, "
          "因为可测空间范畴不是笛卡尔闭的.")
       " [14]"))
   (P "这句话我当时完全看不懂. "
      "它唯一的引用是一篇1961年的论文, 题为"
      (Q "Borel structures for function spaces "
         "(函数空间上的 Borel 结构)")
      " [3]. 这篇论文和我当时想读懂的那篇一样难以理解, "
      "甚至更难! 我已经力不能及, 只好先放下, "
      "而且很多年都没能读懂这篇论文.")
   (P "当时, QBS论文像晴天霹雳一样突然出现, "
      "严重动摇了我对自己做研究能力的信心. "
      "但在过去8年里, 我逐渐意识到, "
      "这篇看起来像是神来之笔, "
      "又像来自外星的论文, "
      "在某种意义上几乎是若干简单想法"
      "必然会走到一起的结果. 原来, "
      "拟Borel空间的想法并不诞生于概率论, "
      "而是来自一个看似毫不相干的数学角落: "
      "微分几何与拓扑. "
      "去年我和Max New聊起QBS, 他告诉我, "
      "他读研究生时就想到过这套构造, "
      "但因为它与微分空间 (diffeological spaces) "
      "的关系看起来太直接, "
      "他没有动力把它完整地发展出来. "
      "这些结果在结构上非常相似, "
      "以至于在训练有素的专家眼里, "
      "那篇庞大的QBS论文几乎显得过于平凡! "
      "这是我们对" (Q "为什么要学范畴论?")
      "这个问题的第一个回答: "
      "它把不同数学领域之间存在的类比精确化, "
      "让你可以用非常相似的工具解决不同的问题.")
   (P "如果这是我唯一一次遇到范畴论, "
      "我不会在它上面投入足够多的精力, "
      "以至于尝试开一门相关的课. "
      "但范畴论一再出现. 我后来与范畴论的接触, "
      "主要是由我的博士生John推动的, "
      "他正在帮我讲授这门课并撰写这份讲义. "
      "这个故事要从Lilac [22] 说起. "
      "Lilac是一种概率分离逻辑, "
      "是我们在John读博的头两年里开发的. "
      "在讲Lilac之前, "
      "我们需要先简要讨论一下分离逻辑. "
      "我保证我们会讲到范畴论的.")
   (P "分离逻辑是描述资源的逻辑. "
      "它们在程序设计语言领域被广泛使用, "
      "用来建模内存等资源如何在程序中流动. "
      "具体来说, 考虑下面这个C程序:"
      (CodeB "void foo(int* x, int* y) {
  for(int i = 0; i &lt; 3; i++) {
    *x += *y;
  }
}")
      "有人看到" (Code "foo")
      "可能会觉得它写得非常低效: "
      "它完全可以优化成直接把"
      (Code "3*y") "加到" (Code "x")
      "上. 但如果" (Code "x")
      "和" (Code "y")
      "指向内存中的同一个位置 "
      "(也就是说, 它们互为别名) 呢? "
      "那么这个优化就不再成立, 因为" (Code "y")
      "在循环的每一次迭代中也会被修改. "
      "由于C编译器必须做最坏的假设, "
      "它不能进行这个优化.")
   (P "分离逻辑为我们提供了一种描述内存所有权的语言, "
      "让我们可以告诉编译器这些指针不会互为别名. "
      "要让这个优化成立, " (Code "foo")
      "必须有一个前置条件, "
      "断言这两个参数不会互为别名. "
      "在分离逻辑中, 这个前置条件可以写成:"
      (MB (&* (PointsTo :x $dummy)
              (PointsTo :y $dummy))))
   (P $* "称为分离合取 (separating conjunction): "
      "它表示两个命题" (PointsTo :x $dummy)
      " (读作" (Q :x "指向某个位置")
      ") 和" (PointsTo :y $dummy)
      "分别在堆中互不相交的部分上成立, 因此"
      :x "和" :y "不可能互为别名.")
   (P "然而, 内存并不是程序中唯一的一种资源: "
      "随机性也是一种很自然的资源. "
      "在概率程序中, 我们可能想表达这样的命题:"
      (MB (&* (bra0 (&~ $x (ap $Bern (&/ $1 $2))))
              (bra0 (&~ $y (ap $Bern (&/ $1 $2))))))
      "它表示两个变量" $x "和" $y
      "是相互独立的Bernoulli随机变量. "
      "除了概率之外, 程序显然还可能涉及许多其他类型的资源, "
      "比如网络套接字, 互斥锁等. "
      "难道我们必须为每一种资源都从头开发一套分离逻辑吗?")
   (P "这引出了" (Q "为什么要学范畴论?") "的第二个回答: "
      "它能让一些看似随意的选择变成必然的结果. "
      "我们会看到, 分离合取有一个范畴论的描述, "
      "可以用一种叫做" (Q "Day卷积 (Day convolution)")
      "的构造计算出来 [11, 6]. 如果你对" $*
      "的解释来自这个构造, "
      "那么它会自动满足分离合取"
      "应当满足的许多其他良构性要求. "
      "这说明了范畴论如何为种类繁多的资源交互带来清晰的理解: "
      "它指出你做出的哪些决定是真正新的, 哪些只是推论. "
      "它会逼你出牌, 而当你不知道该出哪张牌时, 这一点非常有用.")
   (P "到这里, 我已经确信, "
      "对于任何从事程序设计语言研究的人来说, "
      "掌握一些范畴论都是值得的投入, "
      "尤其是研究概率这类特殊效应 "
      "(exotic effects) 或研究程序逻辑的人. "
      "我也有些自负: 我认为范畴论并不难理解, "
      "尤其是当你被我们将在课程中"
      "逐步介绍的一些应用充分激发了兴趣时. "
      "这门课的目标读者是2017年的我. "
      "那时的我在自己的领域里看到一篇重要论文, "
      "却因为它熟练运用了范畴论的思想而觉得它遥不可及. "
      "我希望我们能把其中一些思想讲得足够清楚, "
      "让你看到这些优雅思想的必然性, "
      "而不是被它们的晦涩难懂淹没.")
   (H2. "为什么需要范畴?")
   (P "人们最常遇到范畴论的地方之一是语义. "
      "为了刻画为何范畴出现在这里, "
      "以及它们的典型用途, "
      "我们将会考虑一个每个程序员都遇到过的具体例子: "
      "我们想要建立什么操作会改变我们程序的行为, "
      "什么操作则是无关紧要的.")
   (P "考虑一个微型语言" $Calc
      ", 其由let绑定, 序对, 以及布尔构成:"
      (eqn*
       ((&cm $M $N)
        $::=
        (&\| (Let $x $M $N) $x $true $false))
       ($ $\| (&\| (If $M $N $O)
                   (Cons $M $N)
                   (Fst $M) (Snd $M)))
       ((&cm $A $B)
        $::=
        (&\| (&c* $A $B) $Bool)))
      $Calc "有着一个简单类型系统:"
      (MB (split16
           (&rule (G!- (&: $true $Bool)))
           (&rule (G!- (&: $false $Bool)))))
      (MB (split16
           (&rule
            (G!- (&: $M $Bool))
            (G!- (&: $N $A))
            (G!- (&: $O $A))
            (G!- (&: (If $M $N $O) $A)))
           (&rule
            (G!- (&: $M $A))
            (G!- (&: $N $B))
            (G!- (&: (Cons $M $N) (&c* $A $B))))))
      (MB (split16
           (&rule (∈ (&: $x $A) Γ)
                  (G!- (&: $x $A)))
           (&rule (G!- (&: $M (&c* $A $B)))
                  (G!- (&: (Fst $M) $A)))
           (&rule (G!- (&: $M (&c* $A $B)))
                  (G!- (&: (Snd $M) $B)))))
      (MB (&rule (G!- (&: $M $A))
                 (G!- (&: $x $A) (&: $N $B))
                 (G!- (&: (Let $x $M $N) $B))))
      "以下是一个或许我们想要澄清的简单变换: "
      "两个let绑定可以交换, "
      "如果它们的定义没有提及对方."
      (MB (Let $x $M
               (@Let $y $N (Cons $x $y))))
      (MB $=?)
      (MB (Let $y $N
               (@Let $x $M (Cons $x $y))))
      "从直觉上说, 这个等式成立是因为" $Calc
      "程序没有副作用. 要证明这个直觉是对的, "
      "我们可以证明这两个程序具有相同的含义. "
      "为此, 我们需要给" $Calc "程序一个语义.")
   (H3. $Calc "的一个指称语义")
   (P "设计语义的第一步是选择用于陈述语义的元语言. "
      "元语言应该是能够无歧义描述和使用的形式语言, "
      "因为其本身的意义应当在我们解释程序时理所当然. "
      "对于像" $Calc "这一的简单语言, "
      "一种自然的选择是集合与函数的语言.")
   (P "用这种元语言, 我们可以给" $Calc
      "程序一个指称语义, "
      "也就是用所选的元语言来描述语法层面的程序的含义. "
      "类型将被解释为集合:"
      (MBL "(1.1)"
           (&= (deno $Bool) (setE $0 $1)))
      (MBL "(1.2)"
           (!commute deno &c* $A $B))
      "布尔类型指称二元素集合" (setE $0 $1)
      ", 积类型" (&c* $A $B)
      "指称" $A "的指称与" $B
      "的指称的笛卡尔积. "
      "利用对类型的这种解释, "
      "我们可以给出对类型上下文 "
      "(typing contexts) 的一种解释:"
      (MB (split16
           (&= (deno $emptyCtx)
               (setE $element))
           (&= (deno (&cm Γ (&: $x $A)))
               (&c* (deno Γ) (deno $A)))))
      "空上下文" $emptyCtx
      "被解释为单元素集" (setE $element)
      ", 而上下文扩展则解释为笛卡尔积. "
      "将这些拼在一起, 该解释将" (deno Γ)
      "定义为具有形状" Γ "的替换集合, "
      "其元素是将" Γ "中的变量" $x
      "映射为" (deno (app Γ $x))
      "的元素的函数.")
   (P "使用这种对于类型和上下文的解释, "
      "我们可以将" $Calc "项"
      (G!- (&: $M $A)) "解释为函数"
      (apply func
             (map* deno (G!- (&: $M $A)) Γ $A))
      ":"
      (eqn*
       ((deno $true) $= (&\|-> $gamma $1))
       ((deno $false) $= (&\|-> $gamma $0))
       ((deno (If $M $N $O))
        $=
        (&\|-> $gamma
               (Choice0
                ((ap (deno $N) $gamma)
                 $cm (&= (ap (deno $M) $gamma) $1))
                ((ap (deno $O) $gamma)
                 $cm (&= (ap (deno $M) $gamma) $0)))))
       ((deno (Cons $M $N))
        $= (&\|-> $gamma
                  (tu0 (ap (deno $M) $gamma)
                       (ap (deno $N) $gamma))))
       ((deno (Fst $M))
        $= (&\|-> $gamma
                  (app $pi_1 (ap (deno $M) $gamma))))
       ((deno (Snd $M))
        $= (&\|-> $gamma
                  (app $pi_2 (ap (deno $M) $gamma))))
       ((deno $x) $= (&\|-> $gamma (app $pi_x $gamma)))
       ((deno (Let $x $M $N))
        $= (&\|-> $gamma
                  (ap (deno $N)
                      (@extend $gamma $x
                               (ap (deno $M) $gamma))))))
      "我们可以使用这种语义来validate先前的重排, "
      "因为等式两边指称着相同的函数."
      (MB (deriv^
           (deno (Let $x $M (@Let $y $N (Cons $x $y))))
           (&\|-> $gamma (tu0 (ap (deno $M) $gamma)
                              (ap (deno $N) $gamma)))
           (deno (Let $y $N (@Let $x $M (Cons $x $y))))))
      "但请注意, 这里有一些微妙之处! "
      "我们在这里依赖元语言中函数相等的概念来判定相等. "
      "两个函数" (func (&cm $f $g) $A $B)
      "被认为相等, 当且仅当它们外延相等 "
      "(extensionally equal), "
      "也就是说, 对所有" (∈ $a $A)
      ", 都有" (&= (app $f $a) (app $g $a))
      ". 如果仔细展开这两个语义, 我们会看到函数"
      (deno $M) "和" (deno $N)
      "是以不同的顺序复合的. "
      "在集合语义下, 这个复合顺序无关紧要, "
      "因为它不会改变输入输出行为.")
   (H3. "一般性的需要")
   (P "总结一下刚才的过程: "
      "为了证明一个涉及let绑定重排的自然程序等价, "
      "我们用集合与函数给出了" $Calc
      "的指称语义. 然后, 元语言的一个性质, "
      "即函数的外延相等, 直接推出了这一改写是保持语义的.")
   (P "这种指称推理方式在验证程序等价时效果相当好, "
      "由此引出一个问题: "
      "它能多好地推广到其他类型的程序设计语言和分析上? "
      "我们可能希望沿着几个有趣的方向推广这类论证:"
      (Ol (Li "推广到具有更有趣的效应的语言, "
              "比如随机性, 非确定性或可变状态;")
          (Li "推广到具有更有趣的特性的语言, "
              "比如高阶函数或更有趣的类型系统."))
      "我们会看到, 用集合与函数作为元语言其实相当不方便. "
      "这将成为我们发展范畴论的核心动机: "
      "范畴论是另一种更灵活的元语言, "
      "可以用来给程序 (以及程序逻辑等其他对象) 赋予语义. "
      "不过在看到这一点之前, "
      "我们先分别看一个这两类推广的例子.")
   (H3. "泛化1: 概率效应")
   (P "我们来看一个推广到具有有趣的概率效应的语言的例子. "
      "考虑下面这个叫做" $TinyPPL
      "的小型概率编程语言. 它在" $Calc
      "的基础上增加了一个原语" $flip
      ", 用来生成随机布尔值:"
      (MBL $TinyPPL
           (&::= (&cm $M $N)
                 (&\| $..c $flip))))
   (P "概率编程语言指称的是概率分布. 例如, "
      $flip "的指称如下:"
      (eqn*
       ((deno $flip) $: (&-> (deno $Bool)
                             (|[]| $0 $1)))
       ((deno $flip)
        $=
        (&\|-> $b (Choice0
                   ((&/ $1 $2)
                    ", 如果" (&= $b $1))
                   ((&/ $1 $2)
                    ", 如果" (&= $b $0))
                   ($0 ", 否则的话")))))
      "{译注: 个人感觉这里是不是不太对, "
      "比如说少了个环境" $gamma
      ". 另外, 原文第一行写的是" $=
      ", 我改成了" $: ".}")
   (P "我们同样想证明一些自然的等价, "
      "比如前面见过的let绑定可以重排的那个等价 "
      "(回忆一下, " $N "不引用" $x "):"
      (MB (Let $x $M
               (@Let $y $N (Cons $x $y))))
      (MB $=?)
      (MB (Let $y $N
               (@Let $x $M (Cons $x $y))))
      "{译注: 当然, " $M "也不能引用" $y
      ". 不过, 如果出现这种引用, "
      "似乎连指称的类型也对不上了, 鉴于"
      (deno Γ) "对于自由变量是敏感的.}")
   (P "直观上, 这个改写似乎应该是保持语义的, 理由和"
      $Calc "中同样的改写成立的理由非常相似. 但"
      $TinyPPL "的指称与" $Calc
      "不同, 所以要证明这个改写是可靠的 (sound), "
      "似乎需要从头证明.")
   (P "显然, 这种重排是一个普遍的现象, "
      "我们希望在许多具有不同语义解释的语言中研究它. "
      "范畴论为语义domain的这种性质起了一个名字: "
      "交换性 (commutativity). "
      "此外, 范畴论还提供了一套语言, "
      "用来描述各种各样效应的性质. "
      "概率是单子 (monad) 的一个例子, "
      "而这个单子是交换的. 因此, "
      "这类改写对所有交换单子都成立.")
   (H3. "泛化2: 高阶函数")
   (P "函数式语言不只有let绑定和序对. "
      "例如, OCaml还有高阶函数, "
      "和类型 (sum types) 以及模式匹配. "
      "这些特性可能很难刻画, "
      "而范畴论为设计这些规约"
      "提供了一种典范的方式.")
   (P "我们用高阶函数来说明这一原则:"
      (eqn*
       ((&cm $A $B) $::= (&\| $Unit (&c* $A $B) (&-> $A $B)))
       ((&cm $M $N) $::= (&\| $unit (Cons $M $N)
                              (Fst $M) (Snd $M)
                              (Lam $x $M)
                              (App $M $N)
                              $x))))
   (P "函数类型" (&-> $A $B) "代表从" $A "到" $B
      "的函数. 函数是由lambda抽象规则" (Lam $x $M)
      "引入的, 其定义了一个具有自由变量" $x
      "的函数. {译注: 我不理解这里的自由变量是什么意思.} "
      "函数由lambda应用规则" (App $M $N)
      "消去, 其调用函数" $M "以参数" $N ".")
   (P "沿用" $Calc "最初的设定, 我们可以给" $stlc
      "一个指称语义: 把每个类型对应到一个集合, "
      "把每个项对应到集合之间的一个函数. "
      "对于函数和函数应用, 语义如下:"
      (eqn*
       ((deno (Lam $x $M))
        $=
        (&\|-> $gamma
               (@\|-> $v (ap (deno $M)
                             (@extend $gamma $x $v)))))
       ((deno (App $M $N))
        $=
        (&\|-> $gamma (ap (@ap (deno $M) $gamma)
                          (@ap (deno $N) $gamma)))))
      "你应该注意到, 这个解释是否合法并不显然: 还需要论证"
      (@\|-> $v (ap (deno $M)
                    (@extend $gamma $x $v)))
      "本身可以表示为某个集合的元素. 这一点成立, "
      "因为两个集合之间所有函数构成的集合本身可以表示为一个集合: "
      "一个函数可以用它的图 (graph), 即输入输出序对的集合, "
      "来表示, 而这本身就是一个集合.")
   (P "我们再次沿着从" $Calc "到" $TinyPPL
      "的思路发问: 在概率编程语言的指称中, "
      "能否同样表示一等函数 (first-class functions)? "
      "一开始完全不清楚概率编程语言中的一等函数应该是什么形状, "
      "也不清楚能否表示这样的对象. "
      "在离散概率中可以表示一等函数, "
      "但在连续概率中, 事情远没有这么直接: "
      "这正是 [14] 研究的问题.")
   (P "关键的想法是, 范畴论会给出一个一般的刻画, "
      "说明一个语义domain支持一等函数意味着什么. "
      "这样的对象称为指数对象 (exponential objects). "
      "具有指数对象的范畴称为笛卡尔闭范畴 "
      "(Cartesian closed categories), "
      "它们能够为简单类型lambda演算提供指称.")
   (H3. "结语")
   (P "这引出一个问题: 一个数学对象必须具备什么样的结构, "
      "才能用来解释一门程序设计语言? 对于这个问题, "
      "范畴论 (除了其他许多作用之外) 给出了非常令人满意的回答. "
      "我们将看到, 某些数学结构能够支持" (Q "高阶函数")
      ", 能够赋予" (Q "自然数") "含义, 能够表达"
      (Q "逻辑真值") ", 并保证" (Q "不动点的存在")
      "等性质. 范畴论为描述一个数学环境"
      "具有什么样的结构提供了一种形式语言. "
      "不过在讲到那里之前, 我们会先看更多解释程序的例子.")
   (H2. "范畴")
   (P "作为元语言, 集合与函数作为纯函数式编程的模型最能发挥效用, "
      "其程序被想成是一个黑盒, 对于每个输入有唯一确定的输出. "
      "但是现实程序很少是纯函数式的: "
      "野生的程序基本上都需要操纵资源 (指针, 文件, 锁), "
      "与其环境进行交互 (输入和输出), "
      "并使用复杂的控制流构造 (异常, 协程).")
   (P "范畴论提供了一种更换周遭 (ambient) 元语言的框架: "
      "它给出一些系统化的技术, "
      "用更适合建模实际编程特性的构造来取代集合与函数. "
      "每个范畴都代表一种元语言的选择. "
      "集合与函数属于集合范畴" $Set
      ", 我们稍后会遇到它. 把" $Set
      "换成其他范畴, 就能得到更适合建模编程语言特性的元语言:"
      (Ul (Li "传统的domain论活在domain的范畴. "
              "它研究无类型lambda演算, "
              "以及Haskell这类递归函数式编程. "
              "作为元语言, 它支持任意递归定义和递归类型.")
          (Li "许多现代语义学工作在步进索引集合 "
              "(step-indexed sets) 的范畴中进行. "
              "作为元语言, 它支持非常强的递归类型. "
              "我们会在讨论预层 (presheaves) 时遇到这个范畴.")
          (Li "操作资源的程序属于资源化集合 "
              "(resourceful sets) 的范畴, "
              "这些范畴用于定义现代分离逻辑. "
              "我们会在讨论Day卷积时遇到它们.")
          (Li "普通的连续概率属于可测空间的范畴, "
              "它的高阶推广属于拟Borel空间 "
              "(quasi-Borel spaces). "
              "如果时间允许, 我们也许会讲到这些范畴."))
      (Q "范畴") "的概念对于所有这些例子进行了抽象. "
      "首先, 范畴定义在一集对象上: "
      "这些用来解释类型和定型上下文. "
      "对象是通过态射" (Func $A $f $B)
      "相互联系的, 有时就记作" $f
      "; 这些解释了项. 每个态射都与一个定义域"
      $A "和一个陪域" $B "关联. "
      "以下是一个范畴的图像, 其中有一些对象和态射:"
      todo.svg
      "态射可以通过复合操作进行组合, "
      "其将邻接的态射粘在一起以形成新的态射. "
      "将" $g "复合在" $f "之后记作"
      (&compose $g $f) ", 或者有时简记为"
      (&i* $g $f) ". 顺序有时令人迷惑, "
      "我喜欢将" $compose "读作"
      (Q "之后") ". 图示上, 我们可以将边"
      $f "和" $g "粘在一起以得到边" $h ":"
      todo.svg
      "范畴满足一些迫使它们表现良好的要求:"
      
      )
   (H3. "我们的第一个元语言")
   (P "现在我们手头上有了范畴的精确定义, "
      "那么我们准备好迎接第一个元语言了.")
   ((Definition)
    "有限集合的范畴" $FinSet (Br)
    "令" $FinSet "是范畴"
    (tu0 $O $M $dom $cod $compose $id)
    ", 其中"
    (Ul (Li $O "是有限集合的类.")
        (Li $M "是元组" (tu0 $A $f $B)
            "的类, 其中" $A "和" $B
            "是有限集合, 而" $f
            "是一个从" $A "到" $B
            "的函数.")
        (Li $dom "是函数"
            (&= (ap $dom (tu0 $A $f $B)) $A) ".")
        (Li $cod "是函数"
            (&= (ap $cod (tu0 $A $f $B)) $B) ".")
        (Li $compose "是函数"
            (&= (&compose (tu0 $B $f $C)
                          (tu0 $A $g $B))
                (tu0 $A (&compose $f $g) $C))
            ", 其中" (&compose $f $g)
            "是" $f "和" $g
            "的通常函数复合, "
            )
        )
    )
   (H3. "获得对于范畴的直觉")
   (P "范畴的定义高度抽象, 实际中遇到的范畴可能与" $FinSet
      "大不相同. 随着学习的深入, 我们会看到, "
      "正是这种抽象层次让我们能够以所谓" (Q "泛构造")
      "的形式, 对元语言可能支持的各种" (Q "特性")
      "给出简洁的公理化. 但要在这种抽象层次上工作, "
      "心中最好有几个具体的例子. 大致说来, 思考范畴时, "
      "有三类例子值得放在脑海中随时备用.")
   (H4. "范畴作为图")
   (P "第一种视角对计算机科学家来说或许最顺手: "
      "范畴是一种图. 对象是顶点, 态射是边. "
      "此外, 范畴还带有一个复合运算, "
      "它把两条首尾相接的边拼接成第三条边; 每个顶点"
      $A "处还有一个恒等态射" (Id $A)
      ", 构成以该顶点为中心的自环. "
      "范畴公理则是说: 边的拼接满足结合律, "
      "并且与恒等态射拼接不产生任何效果. "
      "这一视角提供了很好的直观图像, "
      "也带来了大量例子. 事实上,")
   ((tcomment)
    "实际上, 态射应该是路径. "
    "路径可以复合, 边不太容易复合.")
   (H4. "范畴作为序")
   (P "预序集可以视为范畴.")
   
   (H4. "范畴作为代数")
   (P "幺半群可以视为范畴.")
   
   (H2. "泛构造I: 积")
   (P "我们之前一直在暗示, "
      "知道范畴中含有某些特殊对象是很有用的. "
      "例如, 如果我们想给出一个能够验证编程语言等式的范畴, "
      "这个范畴就需要能够表示程序可能具有的各种特性: "
      "积 (product), 和 (sum), 函数等. "
      "这里我们将介绍泛构造 "
      "(universal construction) 的核心思想, "
      "它刻画了范畴在什么情况下包含这些特殊对象.")
   (H3. "终对象与单位类型")
   (P "回忆一下, 在为编程语言设计范畴语义时, "
      "我们把类型和类型上下文对应到范畴中的对象, "
      "把项对应到态射. 具体来说, 如果有一个良类型的项"
      (G!- (&: $e $A))
      ", 那么它的解释" (deno (G!- (&: $e $A)))
      "是一个态射" (Func* (map* deno Γ $e $A))
      ". 之前我们展示了如何用" $FinSet
      "来解释" $Calc "程序: 把像单位类型"
      $Unit "这样的类型对应到特殊的集合, "
      "例如只含一个元素的集合" (setE $element)
      ". 但如果我们想看看除了" $FinSet
      "之外, 其他范畴能否也给" $Unit
      "一个合理的解释呢?")
   (P "为此, 我们在范畴" $C:script
      "中选取一个特定的对象" (deno $Unit)
      ", 并探究它需要具备哪些性质才算是"
      (Q "像" $Unit "的") ":"
      (Ul (Li "事实1, 引入规则: "
              "在任何类型上下文中, "
              "都必须能够产生一个类型为" $Unit
              "的值. 这告诉我们, 对任意上下文" Γ
              ", 必须存在一个" $C:script
              "中的态射" (&-> (deno Γ) (deno $Unit))
              ". 例如, 必须有"
              (Func* (map* deno Γ $unit $Unit))
              ".")
          (Li "事实2, 等式律: "
              "既然" $Calc "没有副作用, 所以有如果"
              (G!- (&: $e $Unit))
              ", 那么其就不能与项" $unit
              "区分开来. 这被称为" (B "eta相等")
              ", 我们将其记作" (&equiv $e $unit)
              ". eta相等是一种等式律, "
              "其刻画了一个" $Unit "项必须如何表现. "
              "现在来一点洞察: "
              "这些等式律可以翻译为态射相等. "
              "必然如此, 对于任意的态射"
              (Func* (map* deno Γ $e $Unit))
              ", 可以得到" (&= (deno $e) (deno $unit))
              ". 换言之, 态射"
              (Func* (map* deno Γ $unit $Unit))
              "是唯一的. {译注: 个人感觉其实应该写成"
              (&-> (deno Γ) (deno $Unit))
              ".}")))
   (P "这两条性质可以打包为以下的精确定义:")
   
   (H2. "泛构造II: ")
   (H2. "从范畴到语言")
   (P "考虑第1章的" $Calc "的一个变种, "
      )
   (H2. "Yoneda I: 内部 vs. 外部")
   (P "本章开始一段漫长的旅程, "
      "其终点是Yoneda引理的陈述与证明. "
      "与范畴论中任何重要的概念一样, "
      "Yoneda引理可以从多种视角来理解. "
      "在这些笔记中, 我们将探讨一种与编程语言最相关的特定视角: "
      "Yoneda引理是连接" (Q "内部") "与" (Q "外部")
      "的一种手段. 以积为例. 在前面的章节中, "
      "我们给出的积的定义是标准范畴论教科书中最常见的那种. "
      "这个定义具有" (Q "内部")
      "的特征, 因为它完全借助范畴" $C:script
      "内部的其他对象和态射来定义"
      $C:script "中的积.")
   (P "但积还有另一种定义方式. 回想定理5.0.1, "
      "它展示了如何在一个任意的具有有限积的范畴"
      $C:script "中解释一门简单的编程语言. "
      "定理5.0.1的证明给出了一套方法, 用于在"
      $C:script "中解释该编程语言的每一个判断 (judgment). "
      "按照这套方法, 每一条定型规则都变成了作用于态射的函数. "
      "例如, 定型规则"
      
      )
   (H2. "Yoneda II: 索引集合论")
   (H2. "Yoneda III: 可表性")
   (H2. "Yoneda IV: 泛构造, 元素, 和性质")
   
   ))