#lang racket
(provide real.html)
(require SMathML)
(define -- "&mdash;&mdash;")
(define (associate & a b c)
  (&= (& a (@ (& b c)))
      (& (@ (& a b)) c)))
(define $.
  (Mo "." #:attr* '((lspace "0"))))
(define (∀ . x*)
  (let-values (((a* P*) (split-at-right x* 1)))
    (: $forall (apply : a*) $. (car P*))))
(define (∃ . x*)
  (let-values (((a* P*) (split-at-right x* 1)))
    (: $exists (apply : a*) $. (car P*))))
(define $.* (Mo "."))
(define $inv (Mi "inv"))
(define $!< (Mo "&nlt;"))
(define-infix*
  (&!< $!<)
  (&conj $conj)
  (&disj $disj)
  (&=> $=>)
  (&.* $.*))
(define-@lized-op*
  (@∀ ∀)
  (@∃ ∃))
(define real.html
  (TnTmPrelude
   #:title "实数定理证明"
   #:css "styles.css"
   (H1. "实数定理证明")
   (P "本书是基于John Harrison的PhD论文修改而来.")
   (H2. "引论")
   (H2. "构造实数")
   (H3. "实数的性质")
   (P "我们可以采取形式化的观念, 实数是一个集合" $RR
      "连带着两个突出常量" (∈ $0 $RR) "和" (∈ $1 $RR)
      ", 并且还有运算" (func $+ (&c* $RR $RR) $RR) ", "
      (func $.* (&c* $RR $RR) $RR) ", " (func $- $RR $RR) "和"
      (func $inv (&- $RR (setE $0)) $RR)
      ", 其具有所有的" (Q "有序域") "性质:"
      (MB (set-attr*
           (&Table
            ((&!= $1 $0))
            ((∀ $x $y (commute &+ $x $y)))
            ((∀ $x $y $z (associate &+ $x $y $z)))
            ((∀ $x (&= (&+ $0 $x) $x)))
            ((∀ $x (&= (&+ (@- $x) $x) $0)))
            ((∀ $x $y (commute &i* $x $y)))
            ((∀ $x $y $z (associate &i* $x $y $z)))
            ((∀ $x (&= (&i* $1 $x) $x)))
            ((∀ $x (&=> (&!= $x $0)
                        (&= (&i* (inv $x) $x) $1))))
            ((∀ $x $y $z (disR $x $y $z)))
            ((∀ $x $y (&disj (&= $x $y)
                             (&< $x $y)
                             (&< $y $x))))
            ((∀ $x $y $z (&=> (&conj (&< $x $y) (&< $y $z))
                              (&< $x $z))))
            ((∀ $x (&!< $x $x)))
            ((∀ $y $z (&=> (&< $y $z)
                           (∀ $x (&< (&+ $x $y)
                                     (&+ $x $z))))))
            ((∀ $x $y (&=> (&conj (&< $0 $x) (&< $0 $y))
                           (&< $0 (&i* $x $y))))))
           'columnalign "left"))
      "连带着" (Em "完备性")
      ". 这是使得实数区别于有理数的性质, "
      "并且可以诸多等价形式进行陈述. "
      "或许其中最为简单的是" (Em "最小上界性质")
      ", 其陈述了任何上有界的非空实数集合都有最小上界."
      (let* ((sup (λ (m) (∀ (∈ $x $S) (&<= $x m))))
             (@sup (@lize sup)))
        (MB (∀ $S (&=> (&conj (@∃ $x (∈ $x $S)) (@∃ $M (sup $M)))
                       (∃ $m (&conj (@sup $m)
                                    (∀ $m^ (&=> (@sup $m^)
                                                (&<= $m $m^)))))))))
      "(这里我们将" (&<= $x $y) "视为" (&disj (&< $x $y) (&= $x $y))
      "的缩写.) 例如, 两个集合" (setI (∈ $x $RR) (&<= $x^2 $2)) "和"
      (setI (∈ $x $RR) (&< $x^2 $2)) "都以" (Msqrt $2)
      "为其上确界, 尽管一个包含" (Msqrt $2)
      "作为其最大元素, 另一个则不包含.")
   (P "我们当然可以直接引入一个新类型" (Code "real")
      "以及相应的运算, 并将上述公理作为断言. "
      "然而, 这与引言中所阐述的HOL精神相违背" --
      "在HOL中, 所有新类型都是显式构造的, "
      "所有新运算都是显式定义的, "
      "这种方法能够保证不会引入不一致性. "
      "此外还存在哲学上的反对意见, "
      "Abian (1981) 对此曾激烈地表达过: "
      "人们通常借助某种具体的直观图景来理解实数, "
      "例如十进制展开, "
      "因此从一组抽象公理出发是不自然的. "
      "我们选择在HOL中构造实数.")
   (H3. "实数的唯一性")
   (P "我们稍后将会看到, 上述公理并非全部独立. "
      "然而它们是范畴性的, 即所有满足这些公理的结构都是同构的" --
      "例如可参见Burrill (1967), Cohen和Ehrlich (1963) 或Stoll (1979). "
      "这里的前提是这些公理在集合论或高阶逻辑中加以解释. "
      "与之类似的一阶公理化方案使用一个公理模式来表达完备性性质, "
      "虽然对许多目的而言已经足够, 但这些公理不可避免地不具有范畴性: "
      "事实上, 非阿基米德模型的存在正是非标准分析的出发点 (Robinson 1966). "
      "实际上, 对于任意无穷基数" $kappa ", 这些公理甚至都不是" $kappa
      "-范畴的, 这与复数域的一个合理公理化形成了对比. "
      "不过, 实数的一阶公理是完备的: "
      "我们稍后将针对同一理论的一个略有不同的公理化给出一个实际的判定过程.")
   
   (H3. "构造实数")
   (H2. "形式化分析学")
   (H2. "显式计算")
   ))