#lang racket
(provide refal.html)
(require SMathML)
(define refal.html
  (TnTmPrelude
   #:title "REFAL-5编程指南和参考手册"
   #:css "styles.css"
   (H1. "REFAL-5编程指南和参考手册")
   (H2. "基本的REFAL")
   (H3. "一个简单的函数定义")
   (P "考虑这个非常简单的问题. "
      "你想要定义一个函数来判定一个给定字符串是否是一个回文. "
      "一个回文是一个自左向右读和自右向左读相同的字符串. "
      "存在两种显然的方式可以使得这个定义更加精确. "
      "第一种方式是定义一个反转字符串的过程, "
      "然后将反转的字符串和初始的字符串进行比较. "
      "显然, 以这种定义为基础的算法不会是最高效的. "
      "如果一个字符串以一个不同于开头字符的字符作结, "
      "那么它肯定不是回文, 而这种定义无需反转即可建立. "
      "因此, 我们将采取这另外的定义, "
      "其可以写成通常的数学形式:"
      (Ol (Li "一个空字符串是一个回文.")
          (Li "单个符号构成的字符串是一个回文.")
          (Li "如果一个字符串以相同的符号开头和作结, "
              "那么其是回文当且仅当去除首尾符号"
              "之后剩下来的字符串是一个回文.")
          (Li "如果以上规则均无法应用, "
              "那么该字符串不是回文.")))
   (P "让我们称想要定义的函数为" (Code "Pal")
      ", 并且当参数是回文时取" (Code "True")
      "值, 否则的话则取" (Code "False")
      ". Refal中的定义紧贴数学定义:"
      (CodeB "Pal { = True;
      s.1 = True;
      s.1 e.2 s.1 = &lt;Pal e.2>;
      e.1 = False;  }"))
   (P "这个程序以函数名开始, 后面跟着由括号括起的"
      (Em "块") ". 一个块是一列由分号隔开的句子. "
      "在我们的这种情况下块有着四个句子, "
      "分别对应于以上由文字描述的数学定义的每个分句. "
      
      )
   (H3. "符号和表达式")
   (H3. "模式匹配")
   (H3. "句子和程序")
   (H3. "抽象Refal机器")
   (H3. "更多函数的例子")
   (H2. "计算机中的REFAL")
   (H2. "基本的编程技巧")
   (H2. "扩展的REFAL")
   (H2. "程序建立")
   (H2. "元系统转换")
   ))