#lang racket
(provide residuated.html)
(require SMathML)
(define $ell (Mi "&ell;"))
(define $!- $vdash)
(define (!- . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (: (apply &cm a*) $!- (car b*))))
(define $meet $conj)
(define $join $disj)
(define $\\ (Mo "\\"))
(define-infix*
  (&\\ $\\)
  (&meet $meet)
  (&join $join))
(define residuated.html
  (TnTmPrelude
   #:title "代数和逻辑中的剩余结构"
   #:css "styles.css"
   (H1. "代数和逻辑中的剩余结构")
   (H2 "引论")
   (P "本书与代数 (大致可以理解为对于结构的研究) "
      "和逻辑 (可以理解为对于推理的研究) "
      "之间令人着迷且深刻的联系有关. "
      "我们的关键主张是贯穿和绑定这两个分隔的领域的线索是"
      (Em "剩余结构") "的概念.")
   (P "我们不想在这个阶段给出形式化的定义, "
      "先让我们考虑一些代数和逻辑中出现的剩余结构的例子吧.")
   (P (B "逻辑代数. ")
      "对于集合" $A "的任意子集" (&cm $X $Y $Z)
      ", 子集关系 (subsethood) " $sube
      ", 交" $cap ", 并" $cup "与补" (^ $ $c)
      "之间有如下关系成立:"
      (MB (&<==> (&sube (&cap $X $Y) $Z)
                 (&sube $X (&cup $Y^c $Z))) ".")
      "对于任意由" $A "的子集构成的, 在"
      $cap ", " $cup "和" (^ $ $c)
      "下封闭的非空集合" $B
      ", 结构" (tupa0 $B $cap $cup (^ $ $c) $empty $A)
      "是一个Boole代数, 是源于George Boole"
      "关于思维规律的开创性工作的" (Q "逻辑代数")
      "之一. 事实上, 根据Marshall Stone的一个定理, "
      "每个Boole代数都容许这样一个表示, "
      "并且可以被视为一个剩余结构, "
      "其中被定义的运算"
      (&:= (&-> $Y $Z) (&cup $Y^c $Z))
      "被称为" $cap "的剩余 (residual). "
      "更一般地, 对应于一大族非经典逻辑的代数容许在一个集合"
      $L "上的一个格序 (lattice-order) " $<=
      "和二元运算" $d* "与" $-> ", 它们对"
      $L "的所有元素" (&cm $a $b $c) "满足"
      (MB (&<==> (&<= (&d* $a $b) $c)
                 (&<= $a (&-> $b $c))) ".")
      "例如, 一个带有对于"
      (&:= (&d* $a $b) (&meet $a $b))
      "满足这一条件的二元运算" $-> "的有界分配格"
      (tupa0 $L $meet $join $0 $1)
      "被称为一个Heyting代数, 而带有二元运算"
      (&:= (&d* $a $b) (&max $0 (&- (&+ $a $b) $1)))
      "和" (&= (&-> $a $b) (&min $1 (&+ (&- $1 $a) $b)))
      ", 以及常数" $0 "和" $1 "的实单位区间" (li0 $0 $1)
      "也满足这一条件, 并构成一个MV代数 (MV-algebra) "
      "的一个重要实例. {译注: 实际上对于有界格, "
      "如果其满足" $meet "和" $-> "之间的剩余条件, "
      "那么它自动就是分配的.}")
   (P (B "逻辑推论. ")
      "逻辑推论" $!- ", 合取" $conj ", 以及推出" $->
      "在" (Em "经典命题逻辑") "中由一个" (Q "演绎定理")
      "联系起来, 该定理断言, 对于任意的公式"
      (&cm $alpha $beta $gamma) ", 我们有"
      (MB (&<==> (!- (&conj $alpha $beta) $gamma)
                 (!- $alpha (&-> $beta $gamma))) ".")
      "其与Boole代数所满足的剩余条件的相似性当然并非巧合, "
      "不过经典命题逻辑中的推论可以按照诸多不同的方式定义: "
      "语义上可以藉由真值表, 集合, Boole代数, "
      "句法上可以藉由公理系统, 相继式演算, tableau. "
      "此外, 在其他非经典逻辑中, "
      "推论与联结词之间也有类似的关系成立, "
      "这些逻辑由各种各样的代数类和证明系统定义.")
   (P (B "Lambek演算. ")
      (Em "范畴文法")
      "旨在通过给语言表达式指派文法范畴或类型来分析自然语言. "
      "这些范畴或类型描述了表达式的句法角色, "
      "例如名词, 动词, 名词短语, 动词短语或句子. "
      "然后, 新的类型可以使用运算" $d* ", " $\\
      ", " $/ "构造, 其中每当" (&= $w (&i* $u $v))
      "且" $u "具有类型" $alpha "而" $v
      "具有类型" $beta "时" $w "就具有类型"
      (&d* $alpha $beta) ", 每当表达式"
      $u "具有类型" $alpha "则表达式"
      (&i* $u $w) "具有类型" $beta "的话"
      $w "就具有类型" (&\\ $alpha $beta)
      ", 类似地还可以刻画" (&/ $beta $alpha)
      ". 类型的组合及其结果使用符号" $=>
      "来表达, 以得到诸如"
      (&=> (&d* $alpha (&\\ $alpha $beta)) $beta) "或者"
      (&=> (&d* (&/ $alpha $beta) $beta) $alpha)
      ". 如果允许假言推理, 那么对于所有的类型"
      (&cm $alpha $beta $gamma) ", 我们有"
      (MB (&<==> (&=> $beta (&\\ $alpha $gamma))
                 (&=> (&d* $alpha $beta) $gamma)
                 (&=> $alpha (&/ $gamma $beta))) ".")
      "这些观察引导Joachim Lambek发展了一个用于判定形如"
      (&=> Γ $alpha) "的相继式的演算, 其中" Γ
      "是任意有限的类型序列, " $alpha
      "是任意类型. 后来, 这一演算被扩展了"
      "关于更多常量符号和格联结词 (lattice connective) "
      "的规则, 给出了现在被称为完全Lambek演算 "
      "(full Lambek calculus) 的东西, "
      "它是亚结构逻辑的一个基本例子.")
   (P (B "环的理想. ")
      
      )
   (P (B "格序群. ")
      
      )
   (P "剩余结构的概念提供了把这些各不相同的例子联结在一起的纽带. "
      "这样的结构反过来又可以使用推论关系的概念在一个统一的逻辑框架中加以研究: "
      "推论关系是某个由公式, 等式或其他对象构成的集合中的元素 (的集合) 之间的一种关系, "
      "它告诉我们" (Q "什么由什么推出")
      ". 任何同一型的代数类都可以以一种自然的方式与等式上的一族推论关系相关联. "
      "此外, 任何证明系统都通过在该系统中的可推导性, "
      "产生公式, 相继式或更复杂对象上的一个推论关系.")
   (P "代数类的推论关系与证明系统的推论关系可以通过一个自然的等价概念联系起来. "
      "众所周知, 经由经典命题逻辑的一个公理系统所定义的公式上的推论关系, "
      "既等价于Boole代数的等式推论关系, "
      "也等价于由Gentzen的相继式演算LK的命题部分得到的相继式上的推论关系. "
      "类似地, 本书中建立了剩余结构类的等式推论关系与"
      "由完全Lambek演算的扩张得到的相继式上的推论关系之间的等价.")
   (P "等价概念所提供的代数与逻辑之间的桥梁为双方都带来了好处. "
      "证明论方法可以被用来处理代数中的大量问题, "
      "而通过研究相关联的代数类, 又能获得对逻辑系统的新认识. "
      "事实上, 一个领域的结果常常可以借助所谓的"
      (Q "桥梁定理") "被直接引入另一个领域. "
      "特别地, 一个等式代数类的代数性质, "
      "例如融合性 (amalgamation) 或由某个子类生成, "
      "可以与一个等式推论关系的性质, "
      "例如插值性 (interpolation) "
      "或某条规则的可容许性 (admissibility), 联系起来. "
      "一个合适的证明系统" --
      "粗略地说, 是指其中的推导由已经出现在待证明结构中的元素构造而成的系统"
      -- "随后不仅可以被用来传递像可判定性这样的算法性质, "
      "还可以通过为该系统证明一个对应的句法性质来建立代数性质.")
   (P "在剩余结构的情形中, 代数与逻辑的相互作用所带来的好处"
      "远远超出了解决特定问题的方法的传递: "
      "它们为理解那些最初针对特定代数类或逻辑系统"
      "所得到的结果提供了一个统摄性的概念. 值得注意的是, "
      $ell "-群的某些基本结构定理"
      "只依赖于其他剩余格类所共有的纯序论性质, 而"
      $ell "-群的一些为人熟知的性质, 例如可除性和可消性, "
      "在许多非经典逻辑的代数的结构理论中起着关键作用. "
      "特别地, 有界可除剩余格包含了"
      "直觉主义命题逻辑的代数 (Heyting代数), "
      "Łukasiewicz逻辑的代数 (MV-代数) "
      "以及Hájek的基本模糊逻辑的代数 (BL-代数), "
      "并且容许强有力的分解定理. 类似地, "
      "在研究这些分解的不可约分量时, "
      "可消性随处可见, 并且某些可消剩余格类可以"
      -- "经由范畴等价" -- "被看作基于"
      $ell "-群的模态逻辑的代数语义.")
   
   (H2. "序与剩余")
   (P "剩余的关键思想出现于序, 代数和逻辑领域中若干条"
      -- "在概念上和历史上" -- "相互交织的研究脉络. "
      "本章的目的是回顾这些领域中一些最相关的结果, "
      "同时或许甚至能给有经验的读者提供一个"
      "关于它们之间联系的新视角.")
   (H3. "偏序集与格")
   
   (H3. "剩余映射")
   
   (H2. "证明系统")
   (H2. "推论关系")
   (H2. "结构理论")
   (H2. "半线性和分配性")
   (H2. "cancellativity")
   (H2. "可除性")
   (H2. "代数和逻辑之间的桥梁")
   (H2. "有限嵌入和有限模型")
   (H2 "附录A. 开放问题")
   (H2 "附录B. 泛代数的基本问题")
   ))