#lang racket
(provide rewrite.html)
(require SMathML)
(define (LP label #:attr* [attr* '()] . x*)
  `(p ,attr* ,(B label ": ") . ,x*))
(define $asymp (Mo "&asymp;"))
(define-infix*
  (&asymp $asymp))
(define-@lized-op*
  (@* &*))
(define rewrite.html
  (TnTmPrelude
   #:title "项重写"
   #:css "styles.css"
   (H1. "项重写")
   (H2 "翻译勘误")
   (P "原书第1页, 作者将"
      (MB (&asymp
           (&+ (app $s $0) (app $s (app $s $0)))
           (app $s (&+ (app $s $0) (app $s $0)))
           (app $s (app $s (&+ (app $s $0) $0)))
           (app $s (app $s (app $s $0)))))
      "误写为了"
      (MB (&asymp
           (&+ (app $s $0) (app $s (app $s $0)))
           (app $s (&+ (app $s $0) (app $s $0)))
           (app $s (&+ (app $s (app $s $0)) $0))
           (app $s (app $s (app $s $0))))))
   
   (H2 "前言")
   (P "项重写是理论计算机科学的分支, "
      "其结合了逻辑学, 泛代数, 自动定理证明, 以及函数式编程的元素. "
      "其基础是等式性逻辑. 项重写与等式性逻辑的不同之处在于等式被用作"
      (Em "具有方向") "的替换规则, 即左侧可以被右侧替换, "
      "但相反方向不行. 这构成了一种Turing完备的计算模型, "
      "其非常接近函数式编程. 其有着于代数 (例如布尔代数, 群论, 环论), "
      "递归论 (特定重写规则集合之下的可计算与否), "
      "软件工程 (对于诸如数字, 列表, 集合这样的等式性定义数据类型进行推理), "
      "以及编程语言 (特别是函数式编程和逻辑编程) 之中的应用. "
      "从一般角度来说, 项重写可以应用于任何需要等式推理的有效方法的上下文.")
   
   (H2. "启发性的例子")
   (P "等式性推理所关心的是相当受限的一类一阶语言: 唯一的谓词符号是相等. "
      "然而, 其位于数学和计算机科学的诸多问题的核心, "
      "这解释了为什么建立对于这种推理的特化方法和工具是非常流行且重要的. "
      "例如, 数学之中人们经常通过给出定义等式 "
      "(其陈述了群运算的结合性, 诸如此类) 来定义代数的种类. "
      "在这种上下文之中, 明白哪些其他的等式可由定义等式推导出来是重要的. "
      "在代数规格之中, 新运算是由既有的运算定义的, "
      "其方法在于陈述对于被定义运算而言必须满足的特征性等式. "
      "作为一种特殊的情形, 我们有函数式程序, 其函数由递归等式所定义.")
   (P "例如, 假定我们想要使用常量" $0 "和后继函数" $s
      "定义自然数的加法. 这可由以下等式完成:"
      (eqn*
       ((&+ $x $0) $asymp $x)
       ((&+ $x (app $s $y)) $asymp (app $s (&+ $x $y))))
      "通过这些等式, 我们可以计算" $1 " (编码为" (app $s $0)
      ") 和" $2 " (编码为" (app $s (app $s $0)) ") 之和:"
      (MB (&asymp
           (&+ (app $s $0) (app $s (app $s $0)))
           (app $s (&+ (app $s $0) (app $s $0)))
           (app $s (app $s (&+ (app $s $0) $0)))
           (app $s (app $s (app $s $0)))))
      "在这个计算之中, 我们将等式解释为了重写规则, "
      "其告诉我们一个给定项的某个子项是如何可以被替换为另一个项的.")
   (P "这将我们带至了本书的关键概念之一, 即" (B "项重写系统")
      ". 何谓" (B "项") "? 它们是由" (B "变量") ", "
      (B "常量符号") ", 以及" (B "函数符号") "构筑而成的. "
      "在上述例子之中, " $+ "是一个二元函数符号, " $s
      "是一个幺元函数符号, " $0 "是一个常量符号, 而"
      (&cm $x $y) "是变量. 这些符号之上的项的例子有"
      $0 ", " $x ", " (app $s (app $s $0)) ", "
      (&+ $x (app $s $0)) ", "
      (app $s (&+ (app $s (app $s $0)) $0))
      ". 在我们的示例计算之中, 我们只以从左到右的方式使用等式. "
      "但是一般而言, 等式可以在两个方向上运用.")
   (P "以下我们将给出两个例子用于刻画等式与项重写系统的联系之中出现的一些关键议题, "
      "而其也将会在本书之中得到详细处理. "
      "在第一个例子里, 重写规则只意图以一个方向使用 "
      "(这表达以写作" $-> "而非" $asymp
      "). 这是重写作为计算机制的实例. "
      "在第二个例子里, 我们考虑了定义群的等式, "
      "其意图以两个方向使用. 这是重写作为演绎机制的实例.")
   (H3. "符号微分")
   (P "我们考虑由运算" (&cm $+ $*) ", 未定元" (&cm $X $Y)
      ", 以及数字" (&cm $0 $1) "所构成的算术表达式的符号微分. 例如, "
      (&+ (@* (@+ $X $X) $Y) $1) "是一个可容许的表达式. "
      "这些表达式可以被视为由常量符号" (&cm $0 $1 $X $Y)
      "和二元函数符号" (&cm $+ $*) "构筑而成的项. "
      "对于相对于" $X "而言的偏导数, 我们引入了额外的(幺元)函数符号"
      $D_X ". 以下是计算导数的(其中一些)著名规则:"
      (MB (set-attr*
           (&Table
            ("(R1)" (app $D_X $X) $-> $1)
            ("(R2)" (app $D_X $Y) $-> $0)
            ("(R3)" (app $D_X (&+ $u $v))
                    $->
                    (&+ (app $D_X $u) (app $D_X $v)))
            ("(R4)" (app $D_X (&* $u $v))
                    $->
                    (&+ (@* $u (app $D_X $v))
                        (@* (app $D_X $u) $v))))
           'columnalign "left right center left"))
      "在诸如" (app $D_X (&+ $u $v)) "这样的项之中, 符号"
      $u "和" $v "是变量, 其意图的含义在于它们可以被任意的表达式所替换. "
      "因此, 规则(R3)可以被应用于任何具有和其左侧相同模式的项, 即一个"
      $D_X "后面跟着一个" $+ "表达式.")
   (P "从项" (app $D_X (&* $X $X))
      ", 规则(R1)-(R4)将会导致如图1.1中所描绘的可能归约. "
      "我们使用这个例子来刻画项重写系统的两个最为重要的性质:")
   (LP "终止性 (termination)"
       "是否总是在有限多次规则应用之后我们将会抵达一个没有规则可以应用的表达式? "
       "{译注: 实际上这句话有点歧义, "
       "既可以理解为是否存在一个有限的归约/重写序列到达所谓的规范形式, "
       "也可以理解为是否所有归约/重写序列都只能是有限的, "
       "以至于最终必然到达一个规范形式. "
       "以术语来说, 即弱规范化性质和强规范化性质.} "
       "然后, 这样一个表达式被称为一个" (B "规范形式") "." (Br)
       "对于规则(R1)-(R4)而言的确如此. "
       "然而, 表明这项性质并非全然平凡, "
       "因为规则(R4)会导致表达式体积的相当膨胀." (Br)
       "一个非终止规则的例子是"
       (MB (&-> (&+ $u $v) (&+ $v $u)))
       "其表达了加法的可交换性质. 序列"
       (MB (&-> (&+ (@* $X $1) (@* $1 $X))
                (&+ (@* $1 $X) (@* $X $1))
                (&+ (@* $X $1) (@* $1 $X))
                $..c))
       "是一条该规则应用的无限的链. "
       "当然了, 非终止性不一定非得是由单独一条规则所导致的; "
       "其可以来源于多条规则的交互作用.")
   (LP "合流性 (confluence)"
       "如果对于给定的项" $t "而言存在应用规则的不同方法, "
       "那么将会导致不同的导出项" $t_1 "和" $t_2
       
       )
   (H3. "群论")
   (H2. "抽象归约系统")
   (H2. "泛代数")
   (H2. "等式性问题")
   (H2. "终止性")
   (H2. "合流性")
   
   ))