#lang racket
(provide simple-ad.html)
(require SMathML)
(define $:: (Mo "::"))
(define $partial (Mi "&part;"))
(define (&partial x)
  (ap $partial x))
(define-infix*
  (&:: $::))
(define (Arrow f A B)
  (&:: f (&-> A B)))
(define simple-ad.html
  (TnTmPrelude
   #:title "自动微分的简单本质"
   #:css "styles.css"
   (H1. "自动微分的简单本质")
   (H2. "引论")
   (P "近年来, 导数的精确, 高效和可靠计算变得越来越重要, "
      "这在很大程度上得益于反向传播在机器学习中的成功应用, "
      "包括多层神经网络, 也称为" (Q "深度学习")
      " [Lecun et al., 2015; Goodfellow et al., 2016]. "
      "反向传播是自动微分 (AD) 反向模式的一种特化形式和独立发明, "
      "用于通过梯度下降 (或随机梯度下降) 调整参数化模型, "
      "使其尽可能拟合观测数据. "
      "机器学习及其他基于梯度的优化问题通常"
      "依赖于具有极高维数定义域和标量陪域的函数的导数"
      -- "而这恰恰是反向模式AD比前向模式AD高效得多的条件 "
      "(效率提升倍数与定义域维数成正比). "
      "遗憾的是, 尽管前向模式AD (FAD) 易于理解和实现, "
      "反向模式AD (RAD) 和反向传播的解释和实现却复杂得多, "
      "涉及mutation, 图的构建与遍历, 以及" (Q "tape")
      " (由具体化的, 可解释的赋值语句组成的序列, 也称为"
      (Q "trace") "或" (Q "Wengert list")
      "). mutation虽然出于效率考虑而被采用, "
      "但它使并行执行变得困难, 因而反过来也损害了效率. "
      "图和tape的构建与解释 (或编译) 同样增加了执行开销. "
      "RAD的重要性使得其当前复杂而臃肿的实现尤为令人担忧. "
      "利用RAD (通常通过反向传播) 所解决的机器学习 "
      "(及其他优化) 问题规模日益庞大, "
      "这表明有必要寻找更精简更高效的实现方式, "
      "尤其是在以GPU和FPGA形式提供的大规模硬件并行能力"
      "已变得唾手可得且价格低廉的今天.")
   (P "自动微分在机器学习 (ML) 实际应用中的另一个困难, "
      "源于当前许多流行的机器学习框架的性质, "
      "包括Caffe [Jia et al., 2014], "
      "TensorFlow [Abadi et al., 2016] "
      "和Keras [Chollet, 2016]. 这些框架围绕相互连接的节点构成的"
      (Q "图") " (或" (Q "网络") ") 这一概念而设计, "
      "每个节点代表一个数学运算" -- "本质上是一种数据流图. "
      "应用程序显式地构建这些图, 创建节点并将其与其他节点相连. "
      "构建完成后, 还需要将这些图处理为更高效的表示形式, 以便于训练和求值. "
      "这些图本质上是带有共享结构的数学表达式, 因而是有向无环图 (DAG). "
      "这种图的构建, 编译和执行的范式, "
      "与程序员和编译器日常所做的工作有着惊人的相似之处:"
      (Ul (Li "程序由人编写.")
          (Li "编译器或解释器的前端将程序解析为DAG表示.")
          (Li "编译器后端将DAG转换为高效执行的形式.")
          (Li "由人运行编译的结果."))
      "在使用典型的机器学习框架时, "
      "程序员在两个层面上经历这一系列步骤: "
      "一个是他们的代码本身, 另一个是代码所生成的图. "
      "这两个层面都有各自的运算, 变量, "
      "信息流, 值, 类型和参数化的概念, "
      "也都有各自需要理解的执行模型.")
   (P "为机器学习提供一个更简洁更清晰的基础, "
      "方法是只保留编程语言本身, 完全省去图/网络. "
      "由于机器学习的核心是(数学)函数, "
      "人们自然希望选择一种对函数有良好支持的编程语言, "
      "即函数式语言, 或至少是具有强大函数式特性的语言. "
      "这种替代方案可以称为" (Q "可微函数式编程")
      ". 在这一范式中, 程序员使用函数式编程的标准工具直接定义其关心的函数, "
      "并额外引入一个微分算子 (一个有类型的高阶函数, 不过是部分函数, "
      "因为并非所有可计算函数都是可微的). "
      "假设使用纯函数式语言或其子集 (具有简洁而精确的数学语义), "
      "微分的含义与传统微积分中的定义完全一致.")
   (P "我们如何实现可微函数式编程的这一愿景? "
      "一种方式是创造新语言, "
      "但这样做需要付出巨大的努力来定义和高效实现, "
      "而推广可能还需要更多的努力. "
      "另一种方式是选择一种合适的纯函数式语言, "
      "如Haskell, 然后为其添加微分能力. "
      "本文采用的是后一种方案, "
      "通过为流行的Haskell编译器GHC增加一个插件, "
      "将标准Haskell代码转换为范畴形式, "
      "从而可以在多种范畴中实例化, "
      "包括可微函数的范畴 [Elliott, 2017].")
   (P "本文做出了以下具体贡献:"
      (Ul (Li "从一个简单的导数增强函数范畴出发, "
              "通过要求这种增强 (相对于普通函数) "
              "对于一系列标准范畴抽象和基本数学运算是同态的, "
              "从而简洁而精确地刻画自动微分.")
          (Li "从同态描述出发, 推导出一个构造即正确的自动微分实现.")
          (Li "通过将线性映射 (一般的导数值) "
              "替换为任意笛卡尔范畴 [Elliott, 2017] 来推广自动微分, "
              "定义了若干自动微分变体, 它们均源自线性映射的不同表示: "
              "函数 (满足线性性), " (Q "广义矩阵")
              " (由representable functor复合而成), "
              "基于continuation的任意线性映射表示变换, "
              "以及任意线性映射表示的对偶化版本. "
              "后两种变体产生了构造即正确的反向模式自动微分实现, "
              "比此前已知的实现简洁得多, 且由通用的组件组合而成. "
              "选择对偶化线性函数进行梯度计算, 在简洁性上尤为引人注目. "
              "它似乎也相当高效" -- "不需要矩阵级别的表示或计算" --
              "并且适用于基于梯度的优化, 例如机器学习. "
              "与传统的反向模式自动微分算法不同, "
              "本文中的所有算法都不涉及mutation, "
              "因而天然适合并行执行. "
              "类似的构造也可以得到前向模式自动微分.")))
   (H2. "什么是导数?")
   (P "既然自动微分 (AD) 和计算导数有关, "
      "让我们以考虑什么是导数开始. "
      "如果你所接受的入门性微积分课程和我差不多的话, "
      "那么你会学到一个函数" (Arrow $f $RR $RR)
      "在一个点" $x "处 (要求其在" $f
      "的定义域之中) 的导数" (app $f^ $x)
      "是一个" (Em "数字") ", 定义如下:"
      (MBL "(1)"
           (&= (app $f^ $x)
               (lim $epsilon $0
                    (~ (&- (app $f (&+ $x $epsilon))
                           (app $f $x))
                       $epsilon))))
      "也就是说, " (app $f^ $x) "告诉了我们" $f
      "在" $x "处对于输入变化的缩放有多快.")
   (P "这个定义对于类型" (&-> $RR $RR)
      "之外的函数有多适用呢? 复数情形 ("
      (&-> $CC $CC) ") 表现良好, 其中除法也有定义. "
      "扩展至" (&-> $RR $RR^n) "的情形也能成立, "
      "如果我们以通常的方式解释一个(" $RR^n
      "中的)向量除以一个标量. 然而, 如果我们扩展至"
      (&-> $RR^m $RR^n) "的情形, 或者甚至只是"
      (&-> $RR^m $RR) ", 这个定义就不再适用了, "
      "因为其依赖于除以一个向量" (&:: $epsilon $RR^m) ".")
   (P "这种非标量定义域上的微分的困难通常以相对于"
      $RR^m "的" $m "个标量分量的"
      (Q "偏导数") "的概念解决, 经常记作"
      (&/ (&partial $f) (&partial $x_j))
      ", 其中" (∈ $j (setE $1 $..h $m))
      ". 当" $RR^n "也是一个非标量时, 即"
      (&> $n $1) ", 那么我们就有了一个矩阵"
      $J:bold " (Jacobi矩阵), 其中"
      (&= (_cm $J:bold $i $j)
          (&/ (&partial $f_i) (&partial $x_j)))
      "而每个" $f_i "是函数" $f
      "的第" $i "投影, 其由取" $f
      "的结果的第" $i "个分量得到. "
      "{译注: 然而, 即便" (&= $n $1)
      ", 我们得到的也是一个矩阵, 只不过是"
      (&c* $1 $m) "的矩阵而已.}")
   (P "到目前为止, 我们已经看到了一个函数的导数可以是一个数字 ("
      (&-> $RR $RR) "), 一个向量 (" (&-> $RR $RR^n)
      "), 一个矩阵(" (&-> $RR^m $RR^n)
      "). 而且, 每种情形都有与之相伴的链式规则, "
      "其说明了该如何对于函数的复合进行微分. "
      "标量链式规则牵涉将两个标量导数相乘, "
      "而向量链式规则牵涉将两个矩阵"
      $A:bold "和" $B:bold " (Jacobi矩阵) "
      (Q "相乘") ", 其定义如下:"
      (MB (&= (_cm (@d* $A:bold $B:bold) $i $j)
              (sum (&= $k $1) $m
                   (&d* (_cm $A:bold $i $k)
                        (_cm $B:bold $k $j)))))
      "既然我们可以将标量视为向量的特殊情形, "
      "那么标量乘法也可以是为矩阵乘法的特殊情形, "
      "或许我们已经抵达了所需的一般性. "
      "然而, 当我们将注意力转向高阶导数的时候, "
      "即导数的导数, 情况就变得复杂起来了, "
      "我们需要更高维度的表示, "
      "以及相应的更加复杂的链式规则.")
   (P "幸运的是, 存在一种单一而优雅的微分推广, "
      "并且伴以相应简洁的链式法则. "
      "首先, 将上述定义(1)改写如下:"
      (MB (&= (&- (lim $epsilon $0
                       (~ (&- (app $f (&+ $x $epsilon))
                              (app $f $x))
                          $epsilon))
                  (app $f^ $x))
              $0))
      "等价地,"
      (MB (&= (lim $epsilon $0
                   (~ (&- (app $f (&+ $x $epsilon))
                          (@+ (app $f $x)
                              (&d* $epsilon (app $f^ $x))))
                      $epsilon))
              $0))
      "注意" (app $f^ $x) "被用来对于" $epsilon
      "进行线性变换. 接着, "
      )
   (H2. "微分的规则")
   (H3. "顺序复合")
   (H3. "并行复合")
   (H3. "线性函数")
   (H2. "将碎片拼在一起")
   (H3. "范畴")
   (H3. "幺半范畴")
   (H3. "笛卡尔范畴")
   (H3. "余笛卡尔范畴")
   ))