#lang racket
(provide sos.html)
(require SMathML)
(define tuple tupa0)
(define sos.html
  (TnTmPrelude
   #:title "操作语义的结构方法"
   #:css "styles.css"
   (H1. "操作语义的结构方法")
   (P "这篇颇有影响力的论文开启了现代操作语义的时代.")
   (H2. "转换系统和自动机解释")
   (H3. "引论")
   (P "这些笔记的目的是为了建立描述编程语言的语义的一种简单而直接的方法. "
      "几乎不需要数学背景; 牵涉到的数学只是这样或那样的" (Q "symbol-pushing")
      ", 若是读者具有非数值方面的编程经验, 或者对于数理逻辑中所采用的形式演绎系统的经验, "
      "那么就应该已经对此相当熟悉了.")
   (P "除了数学上的简单性, 这种方法意在产生简明而可理解的语义定义. "
      
      )
   (H3. "转换系统")
   (H3. "转换系统的例子")
   (P "我们回忆一下来源于可计算理论和形式语言理论的"
      "一些我们熟悉或者不那么熟悉的例子.")
   (H4. "有限自动机")
   (H4. "三计数器机器")
   (H4. "上下文无关文法")
   (H4. "带标签转换系统")
   (H3. "自动机的解释")
   (H2. "参考文献")
   (H2. "简单表达式和命令")
   (H2. "参考文献")
   (H2. "定义和声明")
   (H2. "参考文献")
   (H2. "函数, 过程和类")
   
   ))