#lang racket
(provide stone_spaces.html)
(require SMathML)
(define (distr a * b + c)
  (&= (* a (@ (+ b c)))
      (+ (@ (* a b)) (@ (* a c)))))
(define $min (Mi "min"))
(define tuple tu0)
(define $cup (Mo "&cup;"))
(define-infix*
  (&disj $disj)
  (&conj $conj)
  (&cup $cup))
(define-@lized-op*
  (@disj &disj)
  (@conj &conj)
  (@cup &cup)
  (@cap &cap))
(define eqnderiv (compose MB deriv))
(define ((tcomment #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "tcomment")))
   (B (format "译者注记~a." n)) " " x*))
(define ((answer #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "answer")))
   (B (format "解答~a." n)) " " x*))
(define stone_spaces.html
  (TmPrelude
   #:title "Stone空间"
   #:css "styles.css"
   (H1 "Stone空间")
   (H2 "前言")
   (H2 "给读者的建议")
   (P "就和许多研究层次的数学书籍一样, 本书是学生的教科书和专家的参考书之间的"
      "一种紧张的妥协. 专家当然无需帮助即可找到本书中他想要了解的内容, "
      "所以说这些评注主要是面向学生的, 或者是那些考虑将本书用作某个研究生课程"
      "的基础的授课教师.")
   
   (H2 "引论: 历史角度下的Stone定理")
   (P "本书与一个特定的定理有关, 即Boole代数的Stone表示定理, "
      "并包括了过去45年间自该定理始所发展的一些数学结果. "
      "若一本书籍的作者试图描绘某个数学想法的发展, 那么他"
      "不可避免地要在在两种方法之间作出妥协: 第一种是历史性的方法, "
      "作者尽量以时间顺序追踪每一脉络的发展, 但可能会忽略不同脉络"
      "之间的一些内在联系; 第二种是逻辑性的方法, 或者说"
      "&quot;遗传性的方法&quot; [Mac Lane 1980], 作者以"
      "后见之明选取抵达主要结果的捷径, 但因而也失去了一些关于"
      "这些结果何以重要的洞察.")
   (P "我的折衷方案为, 在正文本身中选择全心全意的逻辑性方法. "
      "我们最终将在第II.4节抵达Stone定理的证明, 而采取的路线"
      "保守来说也会震撼那些只了解历史的读者. "
      )
   (P "我们的历史调查自抽象代数的诞生开始, 近来Saunders Mac Lane"
      "就这个主题写了一篇极好的文章 [1981]. Mac Lane追溯代数的"
      "抽象/公理方法的第一个清晰例子至Cayley [1854]关于群论的论文. "
      "然而, 群论并不位于本世纪早期驱动代数迈向抽象的前沿, "
      "或许这是因为Cayley的表示定理 [1878], 其表明每个抽象的群"
      "都抽象地同构于一个&quot;具体&quot;的置换群, "
      "这免除了抽象地发展群论的必要性, 直至很久以后.")
   (P "如果说群论是抽象代数最古老的分支, 那么声明Boole代数"
      "为第二古老的分支是很恰当的. 当然, Boole [1847, 1854]和"
      "Peirce [1880]真的只关心具体的命题代数, 但是"
      "Whitehead [1898]和Huntington [1904]的确都采用了"
      "抽象的方式. 然而, 似乎在1930年以前, 人们对于非布尔格"
      "没有一点兴趣, 除了令人瞩目的Dedekind [1897, 1900], "
      "但是他也只关心具体的格, 这种情况下是理想的格. 实际上, "
      "Boole理论本身除开炒作公理之外也没有多少发展.")
   (P "虽然Cayley的表示定理可能推迟了抽象群论的发展, "
      )
   (H2 "第1章 预备")
   (H3 "第1节 格")
   ((definition #:n "1.1")
    "偏序和偏序集的定义, 没什么好翻译的.")
   ((definition #:n "1.2")
    "join的定义, 同样没什么好翻译的, 只是要注意记号.")
   ((comment #:n "1.3")
    "设" $A "是一个偏序集, 并且其有限子集都有join. 那么, "
    "join具有幂等性, 交换律, 结合律, 而且最小元"
    $0 "充当了join的单位元. (最小元的存在性来源于空集的最小元的存在性.) "
    "换言之, join使得偏序集" $A "成为一个交换幺半群, 并且每个元素都是幂等的.")
   ((theorem)
    "反过来, 令" (tuple $A $disj $0)
    "是一个交换幺半群, 并且每个元素都是幂等的, 那么" $A
    "上存在唯一的偏序使得" (&disj $a $b) "是" $a
    "和" $b "的join, 并且" $0 "是最小元.")
   ((proof)
    "显然, 若这样的偏序存在, 则我们必有"
    (&<= $a $b) "当且仅当" (&= (&disj $a $b) $b)
    ". (这说明了唯一性.) 反过来, 将其当作" $<=
    "的定义. 从join的幂等性, 我们可以推出" $<=
    "的自反性. 从join的交换律, 我们可以推出" $<=
    "的反对称性. 为了证明传递性, 设"
    (&<= $a $b) "且" (&<= $b $c) ", 那么"
    (eqnderiv
     (&disj $a $c)
     (&disj $a (@disj $b $c))
     (&disj (@disj $a $b) $c)
     (&disj $b $c)
     $c)
    "于是" (&<= $a $c) "." (Br)
    "我们还需要验证" (&disj $a $b) "的确是" $a
    "和" $b "的join. 令" $a "和" $b "是" $A
    "的任意元素, 那么"
    (eqnderiv
     (&disj $a (@disj $a $b))
     (&disj (@disj $a $a) $b)
     (&disj $a $b))
    "于是" (&<= $a (&disj $a $b)) ". 类似地, 可得"
    (&<= $b (&disj $a $b)) ". 但是, 如果元素" $c
    "满足" (&<= $a $c) "且" (&<= $b $c) ", 那么"
    (eqnderiv
     (&disj (@disj $a $b) $c)
     (&disj $a (@disj $b $c))
     (&disj $a $c)
     $c)
    "于是" (&<= (&disj $a $b) $c)
    ". 换言之, " (&disj $a $b) "是" $a
    "和" $b "的join. 最后, 我们要说一下, "
    $0 "是最小元是显然的, 因为对于任意的元素"
    $a ", " (&= (&disj $0 $a) $a) ".")
   (P "带有以上定理中所描述的结构的集合被称为"
      (Em "半格") ", 或者有时称为"
      (Em "join半格") ". 这个定理是说, "
      "半格的概念既可以基于序关系定义, "
      "也可以基于join运算定义 [译注: 也就是一种代数定义]; "
      "但是, 当我们考虑同态 (保持结构的映射) 时, "
      "这里存在着重要的不同. 半格同态"
      (func $f $A $B)
      " (即保持最小元和运算" $disj
      "的映射) 必然是保序映射, "
      "但是半格之间的保序映射不一定是同态. "
      "[译注: 这或许说明的是半格比偏序集的结构更多一点.]")
   ((tcomment)
    "关于join semilattice包不包含bottom, "
    "不同的材料有不同的约定, 本书是包含的.")
   ((exercise)
    "给出一个半格" $A ", 以及一个" (&sube $B $A)
    "使得" $B "在继承的偏序下是一个半格, 但是"
    $B "不是" $A "的子半格.")
   ((answer)
    (&= $A (setE $0 $1)) "而" (&= $B (setE $1))
    ", 序是通常的序.")
   ((comment #:n "1.4")
    "我们可以对偶地考虑偏序集中的meet概念. 所谓的"
    (Em "格") ", 指的是任意子集均有join和meet的偏序集. "
    "[译注: 有的书里lattice不包含top和bottom, 但这本书的确包含, 请注意.] "
    "根据之前的定理, 这等价于是说" $A "装备了两个二元运算"
    $disj "和" $conj ", 以及bottom元素" $0 "和top元素"
    $1 ", 其满足" (tuple $A $disj $0) "和"
    (tuple $A $conj $1) "都是半格, 并且由这两个半格结构导出的"
    $A "上的偏序是相反的, 或者说对偶的.")
   ((proposition)
    "设" (tuple $A $disj $0) "和" (tuple $A $conj $1)
    "都是半格, 那么" (tuple $A $disj $conj $0 $1)
    "是一个格当且仅当" (Em "吸收律")
    (MB (&cm (&= (&conj $a (@disj $a $b)) $a)
             (&= (&disj $a (@conj $a $b)) $a)))
    "对于所有" (∈ $a $b $A) "成立.")
   ((proof)
    
    )
   (P "我们对于格的形式定义因而是一个集合, 带有两个二元运算"
      $disj "和" $conj ", 以及两个特别的元素" $0
      "和" $1 ", 满足" $disj "具有结合律, 交换律, 和幂等性, 并且"
      $0 "是其单位元, " $conj "具有结合律, 交换律, 和幂等性, 并且"
      $1 "是其单位元, 最后" $disj "和" $conj
      "还需要满足吸收律.")
   ((remark)
    "(原来作者还知道写这个注记啊, 是我浅薄了.) "
    "许多作者纯粹基于" $disj "和" $conj "来定义格, 而不需要"
    $0 "和" $1 "的存在性. 这似乎不是很自然, 因为如果一个偏序集"
    "对于所有的非空有限子集都拥有join和meet的话, 那么"
    "也应该考虑空集的情形才显得合理; 我们遇到的绝大多数例子"
    "都证实了这一点. 另一方面, 我们不需要" $0 "和" $1
    "相异. 我们的确希望考虑单元素集在装备了唯一的偏序后成为一个格.")
   ((definition #:n "1.5")
    "绝大多数我们遇到的格都会满足一条额外的性质, 即分配律"
    (MB (&= (&conj $a (@disj $b $c))
            (&disj (@conj $a $b) (@conj $a $c))))
    "如果我们将" $conj "想成是乘法而" $disj
    "想成是加法, 那就是通常算术的分配律.")
   ((lemma)
    "如果一个格满足分配律, 那么其对偶也满足, 即"
    (MB (&= (&disj $a (@conj $b $c))
            (&conj (@disj $a $b) (@disj $a $c)))))
   ((proof)
    
    )
   ((proposition #:n "1.6")
    "给定一个分配格" $A ", 令" (∈ $a $b $c $A)
    ", 那么至多存在一个" (∈ $x $A) "满足"
    (&= (&conj $x $a) $b) "而"
    (&= (&disj $x $a) $c) ".")
   ((proof)
    
    )
   (P "在任意的格中, 一个元素" $x ", 若满足"
      (&= (&conj $x $a) $0) "且" (&= (&disj $x $a) $1)
      ", 则被称为" $a "的一个补. 上述命题告诉我们, "
      "分配格中的补若存在则唯一. 一个"
      (Em "布尔代数") "是一个装备了额外幺元运算的分配格"
      $A ", 这个运算是" (func $neg $A $A)
      ", 而" (&neg $a) "代表的是" $a
      "的补. 因为" $neg "是由定义的其他资料唯一确定的, "
      "显然任意布尔代数之间的格同态" (func $f $A $B)
      "实际上也就是布尔代数同态. 换言之, " $f
      "和" $neg "交换.")
   ((example #:n "1.7")
    "是时候来点例子了."
    (Ol (Li "对于任意的集合" $X ", 幂集" (ap $P $X)
            "是一个格, 其上的偏序" $<= "即集合的包含关系, "
            $disj "和" $conj "分别是并集和交集操作, "
            $0 "和" $1 "分别是空集和" $X ". 而且, "
            (ap $P $X) "是分配的, 因为对于"
            (&sube (&cm $A $B $C) $X) ", 我们有"
            (eqnderiv
             (&conj $A (@disj $B $C))
             (&cap $A (@cup $B $C))
             (&cup (@cap $A $B) (@cap $A $C))
             (&disj (@conj $A $B) (@conj $A $C)))
            "另外, " (ap $P $X) "中的补其实就是补集操作. "
            "于是, 它也是一个布尔代数.")
        (Li "令" $A "是一个全序集, 并且其最小元和最大元分别是"
            $0 "和" $1 ", 那么" $A "是一个格, "
            $disj "和" $conj "应该解释为" $max "和" $min
            ". "
            )
        (Li ""
            )
        )
    )
   ((comment #:n "1.8")
    "接下来我们描绘布尔代数和布尔环之间的等价性. 在任意的布尔代数"
    $A "中, 我们定义" (Em "对称差") $+ "为"
    (MB (&= (&+ $a $b)
            (&disj (@conj $a (&neg $b))
                   (@conj $b (&neg $a))))))
   ((lemma)
    "分配律"
    (MB (distr $a &conj $b &+ $c))
    "成立.")
   ((proof)
    
    )
   
   ))