#lang racket
(provide synsem.html)
(require SMathML)
(define-infix*
  (&=> $=>))
(define synsem.html
  (TnTmPrelude
   #:title "线性逻辑: 其句法和语义"
   #:css "styles.css"
   (H1. "线性逻辑: 其句法和语义")
   (P "作者: Jean-Yves Girard")
   (H2. "线性逻辑的句法")
   (H3. "线性逻辑的联结词")
   (P "线性逻辑不是另外一种逻辑, 而应该被视为通常逻辑的一种扩展. "
      "既然并无希望修改现有的古典或者直觉主义联结词, "
      "线性逻辑引入了新的联结词.")
   (H4. "Exponentials: actions vs situations")
   (P "古典和直觉主义逻辑处理稳定的事实:"
      (Blockquote
       "如果" $A "且" (&=> $A $B) ", 那么" $B ", "
       (Em "但是" $A "仍然成立") ".")
      "这在数学上是完美的, 但在现实生活中却是错误的, "
      "因为现实的推出 (implication) 是" (Em "因果性的(causal)")
      ". 一个因果性的推出不能被迭代使用, 因为其条件在使用后会被修改 (modified). "
      "这种修改前提 (或者说条件) 的过程在物理中被称为" (Em "反作用(reaction)")
      ". [译注: 我总觉得作者所说的概念更接近于所谓的观测者效应.] "
      "例如, 如果" $A "是花" $1 "块钱买一包香烟, 而" $B "是得到这包香烟, "
      "那么在这个过程里你就失去了" $1 "块钱, 而且你不能第二次再这么做. "
      "这里的反作用是" $1 "块钱从你的钱包里溜走了. "
      )
   ))