#lang racket
(provide tapl.html)
(require SMathML)
(define $nv (Mi "nv" #:attr* '((mathvariant "italic"))))
(define $nv_1 (_ $nv $1))
(define $nv_2 (_ $nv $2))
(define (_prime x n)
  (_^ x n $prime))
(define $t^^ (&Prime $t))
(define $dummy (Mi "&bull;"))
(define &length &abs)
(define (^+ R) (^ R $+))
(define $R^^ (&Prime $R))
(define $fail (Mi "fail"))
(define $↓ (Mi "&darr;"))
(define (&↓ x)
  (: x $↓))
(define $↑ (Mi "&uarr;"))
(define (&↑ x)
  (: x $↑))
(define-syntax-rule (define-simple* (&id $id str) ...)
  (begin
    (define $id (Mi str))
    ...
    (define (&id x) (app $id x))
    ...))
(define-simple*
  (&depth $depth "depth")
  (&size $size "size")
  (&Consts $Consts "Consts")
  (&range $range "range")
  (&dom $dom "dom"))
(define &card &abs)
(define (Trd . x*)
  (apply Tr (map Td x*)))
(define &split16 (&split 16))
(define &split2 (&split 2))
(define (format-num section index)
  (and index
       (format "~a.~a"
               (apply string-append
                      (add-between
                       (map number->string
                            (cdr (reverse section))) "."))
               index)))
(define (format-head name section index)
  (let ((num (format-num section index)))
    (if num
        (B (format "~a~a. " name num))
        (B (format "~a. " name)))))
(define (Entry name class)
  (define (present %entry attr* . html*)
    (define id (%entry-id %entry))
    (define Attr* (attr*-set attr* 'class class 'id id))
    (define section (%entry-section %entry))
    (define index (%entry-index %entry))
    (define head (format-head name section index))
    `(div ,Attr* ,head . ,html*))
  (define (cite %entry)
    (define id (%entry-id %entry))
    (define href (string-append "#" id))
    (define section (%entry-section %entry))
    (define index (%entry-index %entry))
    (define num (format-num section index))
    (Cite name `(a ((href ,href)) ,num)))
  (lambda (#:id [id #f] #:auto? [auto? #t])
    (lambda (#:attr* [attr* '()] . html*)
      (cons (build-%entry #:id id #:auto? auto? #:present present #:cite cite)
            (cons attr* html*)))))
(define-syntax-rule (define-Entry* (id name class) ...)
  (begin (define id (Entry name class))
         ...))
(define-Entry*
  (Example "例子" "example")
  (Theorem "定理" "theorem")
  (Definition "定义" "definition")
  (Lemma "引理" "lemma")
  (Corollary "推论" "corollary")
  (Proposition "命题" "proposition")
  (Remark "评注" "remark")
  (Exercise "练习" "exercise")
  (Figure "图片" "figure")
  (Axiom "公理" "axiom")
  
  )
(define $if (Mi "if"))
(define $then (Mi "then"))
(define $else (Mi "else"))
(define (If t1 t2 t3)
  (&split2 $if t1 $then t2 $else t3))
(define $true (Mi "true"))
(define $false (Mi "false"))
(define $zero (Mi "0"))
(define $succ (Mi "succ"))
(define (&succ x)
  (&split2 $succ x))
(define $pred (Mi "pred"))
(define (&pred x)
  (&split2 $pred x))
(define $iszero (Mi "iszero"))
(define (&iszero x)
  (&split2 $iszero x))
(define $Nat (Mi "Nat"))
(define $Top (Mi "Top"))
(define $Bool (Mi "Bool"))
(define $List (Mi "List"))
(define (&List T) (app $List T))
(define (powerset U)
  (app $P:script U))
(define (&rule #:space [n 8] . j*)
  (let-values (((j* j1) (split-at-right j* 1)))
    (~ #:attr* '((displaystyle "true"))
       (apply (&split n) j*) (car j1))))
(define (&rull label . x*)
  (if label
      (: (apply &rule x*) label)
      (apply &rule x*)))
(define $. (Mo "."))
(define (∀ x P)
  (: $forall x $. P))
(define (RuleLabel x)
  (Mtext #:attr* '((class "small-caps")) x))
(define (Emm x)
  (Mtext #:attr* '((class "emm")) x))
(define S<:T (Code "S &lt;: T"))
(define -- "&mdash;&mdash;")
(define $space:2ex (&space 2))
(define (RcdType . x*)
  (apply setE (map2 &: x*)))
(define (AbsRcdType l T i n)
  (setE (^ (&: (_ l i) (_ T i))
           (∈ i (&cm $1 $..h n)))))
(define (Record . x*)
  (apply setE (map2 &= x*)))
(define (APP . x*)
  (apply : (add-between x* $space:2ex)))
(define (MBL label . exp*)
  (MB (Mtable #:attr*
              '((columnalign "left center right")
                (width "100%"))
              (Mtr (Mtd (Mphantom label))
                   (apply Mtd exp*)
                   (Mtd label)))))
(define $11 (Mn "11"))
(define $12 (Mn "12"))
(define $T_11 (_ $T $11))
(define $T_12 (_ $T $12))
(define Γ $Gamma:normal)
(define $vdash (Mo "&vdash;"))
(define (!- . x*)
  (let-values (((a* b*) (split-at-right x* 1)))
    (let ((b (car b*)))
      (: (apply &cm a*) $vdash b))))
(define (G!- . x*)
  (apply !- Γ x*))
(define $<: (Mo "&lt;:"))
(define $\\ (Mo "\\"))
(define $sqsube (Mo "&sqsube;"))
(define $dArr (Mo "&dArr;"))
(define $->* (&* $->))
(define-infix*
  (&->* $->*)
  (&dArr $dArr)
  (&::= $::=)
  (&=> $=>)
  (&conj $conj)
  (&sqsube $sqsube)
  (&R $R)
  (&\\ $\\)
  (&<: $<:))
(define-@lized-op*
  (@If If)
  (@<= &<=))
(define (μ F) (ap $mu F))
(define (υ F) (ap $upsilon F))
(define ((tcomment #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "tcomment")))
   (B (format "译者注记~a." n)) " " x*))
(define ((figure #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "figure")))
   (B (format "图片~a." n)) " " x*))
(define ((answer #:n [n ""]) . x*)
  (keyword-apply
   Div '(#:attr*) '(((class "answer")))
   (B (format "解答~a." n)) " " x*))
(define tapl.html
  (TnTmPrelude
   #:title "类型和编程语言"
   #:css "styles.css"
   (H1. "类型和编程语言")
   (P "这是一本历久弥新的编程语言入门教科书. "
      "这本书的特点在于深入浅出, 几乎不假设读者具有任何数学知识. "
      "另外, 这本书还使用了OCaml语言编写的程序来帮助读者理解, "
      "避免自然语言的一些可能的歧义和模糊.")
   (H2. "引论")
   (H3. "计算机科学中的类型")
   (P "现代软件工程认识到一系列广泛的形式化方法, "
      "可用于帮助确保系统相对于其期望行为的某种描述 (无论是隐式的还是显式的) 能够正确运行. "
      "在这个谱系的一端是一些强大的框架, 例如Hoare逻辑, 代数规格语言, 模态逻辑和指称语义. "
      "这些方法可以用来表达非常通用的正确性性质, 但使用起来往往较为繁琐, 且要求程序员具备相当的专业素养. "
      "在谱系的另一端则是一些能力远为有限的技术" -- "有限到可以将自动检查器内置于编译器, 链接器或程序分析器中, "
      "从而即使是不熟悉底层理论的程序员也能使用. 这类轻量级形式化方法中一个著名的例子是模型检查器, "
      "即在有限状态系统 (如芯片设计或通信协议) 中搜索错误的工具. "
      "另一个日益流行的例子是运行时监控, 它是一组允许系统动态检测何时其某个组件未按照规格运行的技术. "
      "但到目前为止, 最流行且最成熟的轻量级形式化方法是类型系统, 也正是本书的核心主题.")
   (P "与许多被各种大型团体共同使用的术语一样, 要以一种既涵盖编程语言设计者和实现者的非正式用法, "
      "又足够具体从而具有实际意义的方式来定义" (Q "类型系统") ", 是很困难的. 一个合理的定义如下:"
      (Blockquote
       "类型系统是一种易于处理的句法性方法, 它通过根据phrase所计算的值的种类对其进行划分, "
       "来证明程序中不存在某些特定行为. {译注: 这里phrase很难翻译, "
       "它指的是编程语言句法描述里的一些特定" (Em "子句法") "的元素.}"))
   (P "有几个要点值得讨论. 首先, 这个定义将类型系统确定为推理程序的工具. "
      "这种措辞反映了本书面向编程语言中类型系统的取向. "
      "更广泛地说, 类型系统 (或类型理论) 这一术语指的是逻辑, 数学和哲学中一个范围大得多的研究领域. "
      "这个意义上的类型系统最早在20世纪初被形式化, 作为避免逻辑悖论的方法, "
      "例如Russell悖论 (Russell, 1902), 这些悖论曾威胁到数学的基础. "
      "在整个二十世纪, 类型已成为逻辑学中的标准工具, 尤其是在证明论中 (参见Gandy, 1976和Hindley, 1997), "
      "并且已经渗透到哲学和科学的语言中. 这一领域的重要里程碑包括Russell最初的分歧类型论 (Whitehead和Russell, 1910), "
      "Ramsey的简单类型论 (1925)" -- "它是Church的简单类型lambda演算 (1940) 的基础" --
      "Martin-Löf的构造类型论 (1973, 1984), 以及Berardi, Terlouw和Barendregt的纯类型系统 "
      "(Berardi, 1988; Terlouw, 1989; Barendregt, 1992).")
   (P "即使在计算机科学内部, 类型系统的研究也有两个主要分支. "
      "更偏实践的分支关注在编程语言中的应用, 是本书的主要关注点. "
      "更偏抽象的分支则聚焦于各种" (Q "纯粹的类型化lambda演算")
      "与不同逻辑之间的联系, 这通过Curry-Howard对应 (第9.4节) 来建立. "
      "两个社区使用相似的概念, 记号和技术, 但在研究取向上存在一些重要的差异. "
      "例如, 关于类型化lambda演算的研究通常关注的是每个良类型的计算都保证终止的系统, "
      "而大多数编程语言为了递归函数定义等特性而牺牲了这一性质.")
   (P "上述定义中另一个重要的要素是它强调根据项" -- "即句法phrase" --
      "在执行时所计算出的值的性质来对其进行分类. "
      "类型系统可以被视为对程序中各项的运行时行为计算出一种" (Em "静态")
      "近似. (而且, 赋予各项的类型通常是以" (Em "复合性")
      "的方式计算的, 即一个表达式的类型仅依赖于其子表达式的类型.)")
   (P (Q "静态") "一词有时会被显式地加上" --
      "例如我们会说" (Q "静态定型编程语言") --
      "以区分我们这里所考虑的编译时分析与Scheme "
      "(Sussman和Steele, 1975; Kelsey, Clinger和Rees, 1998; Dybvig, 1996) "
      "等语言中的动态定型或者说潜在定型, "
      "其中运行时类型标签用来区分堆中不同种类的结构. 像" (Q "动态定型")
      "这样的术语可以说是用词不当, 或许应该用" (Q "动态检查")
      "来替代, 但这种用法已经是标准的了. "
      "{译注: 这里的typed被译者翻译为了定型, 意思是确定类型这一动作. "
      "这种翻译方式并不普遍, 一般来说其实人们就将其翻译为类型, "
      "例如静态类型和动态类型.}")
   (P "由于是静态的, 类型系统也必然是保守的: 它们能够明确地证明某些不良程序行为的不存在性, "
      "但无法证明这些行为的存在性, 因此有时也不得不拒绝那些在运行时实际上行为良好的程序. "
      "{译注: 这句话并不非常容易理解. 所谓静态, 指的是类型检查是一种事前分析, "
      "所以说从原则上某些东西的确无法计算. 但是, 我们也只能选择保守的方法. "
      "换言之, 如果一个程序通过了类型检查, 我们所确保的是其没有特定的错误, "
      "或者说没有类型错误. 但是, 即便类型检查拒斥了某个程序, "
      "我们(有时)也不能断言其在运行时就一定会发生这些特定错误之一.} "
      "例如, 以下程序"
      (CodeB "if &lt;complex test> then 5 else &lt;type error>")
      "会因为是病态类型的而被拒绝, 即便可能" (Code "&lt;complex test>")
      "总是会求值至" (Code "true") ", 因为静态分析并不能确定的确如此. "
      "保守性与表达力之间的张力是类型系统设计中一个根本性的现实. "
      "希望允许更多的程序通过类型检查" --
      "通过为其各部分赋予更精确的类型" --
      "是推动该领域研究的主要动力.")
   (P "一个相关的观点是, 大多数类型系统中所体现的相对简单的分析, 并不能够禁止任意的不良程序行为; "
      "它们只能保证良类型的程序免于某些特定种类的错误行为. "
      "例如, 大多数类型系统可以静态地检查原始算术运算的参数是否始终为数字, "
      "方法调用中的接收者对象是否始终提供所请求的方法, 等等, "
      "但无法检查除法运算的第二个参数是否为非零值, "
      "或者数组访问是否始终在边界范围内.")
   (P "在给定语言中, 能够被类型系统消除的不良行为通常被称为运行时类型错误. "
      "重要的是要记住, 这组行为是每种语言各自的选择: "
      "尽管不同语言中被视为运行时类型错误的行为之间存在大量重叠, "
      "但原则上每个类型系统都附带着一个关于其旨在防止的行为的定义. "
      "每个类型系统的安全性 (或者说可靠性 (soundness)) "
      "必须根据其自身的运行时错误的集合来判断.")
   (P "类型分析所检测的不良行为并不局限于像调用不存在的方法这样的低级故障: "
      "类型系统还被用于强制实施更高层次的模块化特性, 以及保护用户定义的抽象的完整性. "
      "对信息隐藏的违反, 例如直接访问一个其表示本应是抽象的数据值的字段, "
      "与将整数当作指针使用并导致机器崩溃一样, 都是完全相同意义上的运行时类型错误.")
   (P "类型检查器通常内置于编译器或链接器中. 这意味着它们必须能够自动完成工作, "
      "无需人工干预或与程序员交互" --
      "也就是说, 它们必须体现计算上可处理的分析. "
      "然而, 仍然有很大的空间要求程序员提供引导, 即在程序中提供显式的类型注解. "
      "通常, 这些注解会保持相当轻量, 以使程序更易于编写和阅读. "
      "但从原则上说, 一个证明程序满足某种任意的规格的完整证明可以编码在类型注解中; "
      "在这种情况下, 类型检查器实际上就变成了一个证明检查器. "
      "诸如扩展静态检查 (Detlefs, Leino, Nelson和Saxe, 1998) "
      "之类的技术正致力于在类型系统和全面的程序验证方法之间开拓这片领域, "
      "为某些广泛的正确性属性类别实现完全自动的检查, 并且仅依赖于"
      (Q "合理轻量") "的程序注解来引导其工作.")
   (P "同样地, 我们最感兴趣的是那些不仅在原则上可自动化, 而且实际上附带有高效类型检查算法的方法. "
      "然而, 究竟什么算作高效, 这是一个有争议的问题. "
      "即使是像ML (Damas和Milner, 1982) 这样被广泛使用的类型系统, "
      "在病态情况下也可能表现出极长的类型检查时间 (Henglein和Mairson, 1991). "
      "甚至存在一些语言, 其类型检查或类型重构问题是不可判定的, 但仍然有可用的算法能够在"
      (Q "大多数实际感兴趣的情况下")
      "快速终止 (例如 Pierce和Turner, 2000; Nadathur和Miller, 1988; Pfenning, 1994).")
   (H3. "类型系统有什么好处")
   (H4 "发现错误")
   (P "静态类型检查最明显的好处是它允许早期检测出一些编程错误. 早期检测到的错误可以立即修复, "
      "而不是潜伏在代码中, 等到很久以后才被发现" -- "那时程序员可能正忙于其他事情" --
      "甚至在程序已经部署之后才被发现. 此外, 在类型检查期间定位错误通常比在运行时更加精确, "
      "因为在运行时, 错误的影响可能在事情开始出错之后过了一段时间才变得可见.")
   (P "在实践中, 静态类型检查能够暴露出范围惊人广泛的错误. 使用富类型语言工作的程序员经常感叹, "
      "他们的程序一旦通过了类型检查器, 往往就能" (Q "直接运行")
      ", 其频率远超他们觉得自己有理由期望的程度. 对此一个可能的解释是, 不仅是琐碎的心智疏忽 "
      "(例如, 忘记在取平方根之前将字符串转换为数字), 而且更深层次的概念性错误 "
      "(例如, 在复杂的情况分析中忽略了边界条件, 或者在科学计算中混淆了单位), "
      "往往都会在类型层面上表现为不一致性. "
      "这种效果的强度取决于类型系统的表达力以及所涉及的编程任务: "
      "操作多种数据结构的程序 (例如, 像编译器这样的符号处理应用) 为类型检查器提供了更多的用武之地, "
      "而仅涉及少数简单类型的程序, 例如科学应用中的数值计算, 则相对较少 "
      "(不过, 即使在这种情况下, 支持量纲分析的细化类型系统 [Kennedy, 1994] 也可以相当有用).")
   (P "要从类型系统中获得最大的益处, 通常需要程序员付出一定的注意力, 并且愿意充分利用语言所提供的设施; "
      "例如, 一个将所有数据结构都编码为列表的复杂程序, "
      "不会像一个为每种数据结构定义不同的数据类型或抽象类型的程序那样, 从编译器那里获得同样多的帮助. "
      "富有表达力的类型系统提供了许多" (Q "技巧") ", 可以用类型来编码有关结构的信息.")
   (P "对于某些类型的程序, 类型检查器还可以成为一个非常宝贵的维护工具. "
      "例如, 一个需要修改复杂数据结构定义的程序员, "
      "不必手动搜索大型程序中所有涉及该结构的代码需要修改的地方. "
      "一旦数据类型的声明被更改, 所有这些位置都会变成类型不一致的, "
      "只需运行编译器并检查类型检查失败的位置, 就可以将它们逐一列举出来.")
   (H4 "抽象")
   (P "类型系统支持编程过程的另一个重要方式是强制实施纪律性编程. "
      "特别是, 在大规模软件组合的背景下, 类型系统构成了模块语言的骨干, "
      "这些模块语言用于打包和连接大型系统的各个组件. "
      "类型出现在模块 (以及类等相关结构) 的接口中; "
      "实际上, 接口本身可以被视为" (Q "模块的类型")
      ", 它提供了该模块所提供功能的摘要" --
      "一种实现者与使用者之间的部分契约.")
   (P "以具有清晰接口的模块来构建大型系统, 会导向一种更加抽象的设计风格, "
      "其中接口的设计和讨论独立于其最终的实现. "
      "对接口进行更抽象的思考通常会带来更好的设计.")
   (H4 "文档")
   (P "类型在阅读程序时也很有用. "
      "过程头 (header) 和模块接口中的类型声明构成了一种文档形式, "
      "提供了关于行为的有用提示. 而且, 与嵌入在注释中的描述不同, "
      "这种形式的文档不会过时, 因为它在每次编译器运行时都会被检查. "
      "类型的这一角色在模块签名中尤为重要.")
   (H4 "语言安全性")
   (P "不幸的是, " (Q "安全语言") "这一术语, 甚至比" (Q "类型系统")
      "更具争议性. 尽管人们通常觉得自己看到一种安全语言时能够认出它, "
      "但他们关于语言安全性究竟由什么构成的概念, 深受他们所属的语言社区的影响. "
      "不过, 非正式地说, 安全语言可以被定义为那些使得在编程时不可能搬起石头砸自己脚的语言.")
   (P "稍微精炼一下这个直觉, 我们可以说, 安全语言是一种保护其自身抽象的语言. "
      "每种高级语言都提供了对于机器服务的抽象. "
      "安全性指的是语言保证这些抽象以及程序员使用语言的定义设施"
      "所引入的更高层次抽象的完整性 (integrity) 的能力. "
      "例如, 一种语言可能提供数组, 以及访问和更新操作, 作为对底层内存的抽象. "
      "使用该语言的程序员随后期望数组只能通过显式地对其使用更新操作来改变" --
      "而不是, 例如, 通过写入超过某个其他数据结构的末尾来改变. "
      "类似地, 人们期望词法作用域的变量只能从其作用域内访问, 调用栈确实表现得像一个栈, 等等. "
      "在安全语言中, 这些抽象可以被抽象地使用; 在不安全的语言中则不能: "
      "为了完全理解一个程序可能如何表现 (或者表现不良), 必须时刻牢记各种低级细节, "
      "例如数据结构在内存中的布局以及编译器分配它们的顺序. "
      "在极端情况下, 不安全语言中的程序不仅可能破坏自身的数据结构, "
      "甚至可能破坏运行时系统的数据结构; 这种情况下的结果可能是完全任意的.")
   (P "语言安全性与静态类型安全性并不是同一回事. "
      "语言安全性可以通过静态检查来实现, 但也可以通过运行时检查来实现, "
      "后者在无意义的操作被尝试执行的那一刻将其捕获, 并停止程序或抛出异常. "
      "例如, Scheme是一种安全语言, 尽管它没有静态类型系统. "
      "{译注: 实际上, 使用静态类型的语言也不得不捕获特定的运行时(非类型)错误, "
      "因为有的错误是无法提前避免的. 这同样是语言安全性的一个必要环节.}")
   (P "反过来, 不安全的语言通常提供" (Q "尽力而为")
      "的静态类型检查器, 帮助程序员至少消除最明显的那些疏忽, "
      "但根据我们的定义, 这些语言也不能被称为类型安全的, "
      "因为它们通常无法提供任何关于良类型程序是良行为的保证" --
      "这些语言的类型检查器可以提示运行时类型错误的存在 "
      "(这当然比什么都没有要好), 但无法证明它们的不存在. "
      "{译注: 当然, 这只能是提示部分运行时类型错误的存在, "
      "而不可能涵盖所有的错误. 不然的话, 这种语言反而是安全的了.}")
   (Table
    #:attr* '((align "center") (border "1"))
    (Tr (Td "") (Td "静态检查") (Td "动态检查"))
    (Tr (Td "安全") (Td "ML, Haskell, Java, 等等")
        (Td "Lisp, Scheme, Perl, PostScript, 等等"))
    (Tr (Td "不安全") (Td "C, C++, 等等") (Td "")))
   (P "上述表格中右下角条目为空, 这是因为一旦具备了在强制保证" (Em "大多数")
      "运行时操作的安全性的设施, 检查" (Em "所有") "操作的额外开销就很小了. "
      "(实际上, 确实存在少数动态检查的语言, "
      "例如一些用于具有极小操作系统的微型计算机的Basic方言, "
      "它们确实提供了读写任意内存位置的低级原语, "
      "这些原语可能被滥用从而破坏运行时系统的完整性.) "
      "{译注: 这里所谓的大多数运行时操作, 就译者本人的感觉而言, "
      "指的是数目而非种类. 也就是说, 这些操作在实际数目上占据了运行时的大多数. "
      "另外, 或许开销很小也有些误导性. 也许运行时的开销的确很小, "
      "但是为了保证安全所要编写的代码可能也并非那么少. "
      "不过, 这种代码通常相当规整且没有难度, 所以不至于不做.}")
   (P "运行时安全性通常不能仅靠静态定型来实现. "
      "例如, 上表中列为安全的所有语言实际上都是在动态地进行数组越界检查的. "
      "类似地, 静态检查的语言有时会选择提供一些操作 "
      "(例如, Java中的向下转型运算符" -- "见第15.5节), 其类型检查规则实际上是不可靠的"
      -- "语言安全性是通过在运行时每次动态检查对此类构造的使用来获得的.")
   (P "{原注: 静态消除数组越界检查是类型系统设计者的一个长期目标. "
      "原则上, 所需的机制 (基于依赖类型" -- "见第30.5节) 已经被充分理解, "
      "但要将它们封装成一种在表达能力, 类型检查的可预测性与可处理性, "
      "以及程序标注的复杂性之间取得平衡的形式, 仍然是一个重大挑战. "
      "Xi和Pfenning (1998, 1999) 描述了该领域的一些最新进展.}")
   (P "语言安全性很少是绝对的. 安全语言通常为程序员提供" (Q "逃逸通道")
      ", 例如通过外部函数调用来调用用其他可能不安全的语言编写的代码. "
      "事实上, 这样的逃生通道有时以受控的形式在语言内部提供" --
      "OCaml中的" (Code "Obj.magic") " (Leroy, 2000), Standard ML的New Jersey实现中的"
      (Code "Unsafe.cast") ", 等等. Modula-3 (Cardelli et al., 1989; Nelson, 1991) "
      "和C# (Wille, 2000) 更进一步, 提供了一种"
      (Q "不安全子语言") ", 旨在用于实现诸如垃圾收集器之类的低级运行时设施. "
      "该子语言的特殊功能只能在显式标记为不安全的模块中使用.")
   (P "Cardelli (1996) 阐述了一种关于语言安全性的略有不同的观点, "
      "区分了所谓的可捕获运行时错误和不可捕获运行时错误. "
      "可捕获错误会导致计算立即停止 "
      "(或抛出一个可以在程序内部被干净地处理的异常), "
      "而不可捕获错误可能允许计算继续进行 (至少持续一段时间). "
      "不可捕获错误的一个例子可能是在像C这样的语言中访问超出数组末尾的数据. "
      "在这种观点下, 安全语言是一种在运行时防止不可捕获错误的语言.")
   (P "另一种观点则聚焦于可移植性; 它可以用一句口号来表达: "
      (Q "安全语言完全由其程序员手册所定义.")
      " 将语言的定义视为程序员为了预测该语言中每个程序的行为所需要理解的全部内容. "
      "那么像C这样的语言的手册并不构成一个定义, 因为某些程序的行为 "
      "(例如, 涉及未检查的数组访问或指针算术的程序) "
      "在不知道特定C编译器如何在内存中布局结构等细节的情况下是无法预测的, "
      "而且同一个程序在不同的编译器执行时可能会有截然不同的行为. "
      "相比之下, 其他一些语言的手册则 (以不同程度的严格性) "
      "精确地规定了该语言中所有程序的行为. "
      "一个良类型的程序在这些语言的任何正确实现下都将产生相同的结果.")
   (H4 "效率")
   (P "计算机科学中最早的类型系统始于20世纪50年代, 出现在Fortran (Backus, 1981) 等语言中, "
      "其引入目的是通过区分整数值算术表达式和实数值算术表达式来提高数值计算的效率; "
      "这使得编译器能够使用不同的表示方式, 并为基本操作生成相应的机器指令. "
      "在安全语言中, 通过静态证明动态检查总是能被满足, "
      "从而消除许多原本为保证安全性所需的动态检查, 可以获得进一步的效率提升. "
      "如今, 大多数高性能编译器在优化和代码生成阶段都大量依赖类型检查器所收集的信息. "
      "即使是那些本身没有类型系统的语言的编译器, "
      "也会努力恢复 (recover) 这些类型信息的近似值.")
   (P "依赖于类型信息的效率提升可能来自一些令人意想不到的地方. "
      "例如, 最近的研究表明, 并行科学程序中不仅是代码生成决策, "
      "而且指针表示也可以利用类型分析生成的信息来加以改进. "
      "Titanium语言 (Yelick et al., 1998) 使用类型推断技术来分析指针的作用域, "
      "并且能够在此基础上做出比程序员手动调优其程序时更好的决策, "
      "而且这种改进是可以测量的. ML Kit编译器使用一种强大的" (Em "区域推断")
      "算法 (Gifford, Jouvelot, Lucassen和Sheldon, 1987; Jouvelot和Gifford, 1991; "
      "Talpin和Jouvelot, 1992; Tofte和Talpin, 1994, 1997; Tofte和Birkedal, 1998), "
      "通过基于栈的内存管理来替代大部分 (在某些程序中是全部) 对垃圾回收的需求.")
   (H4 "更多的应用")
   (P "除了在编程和语言设计中的传统用途之外, "
      "类型系统如今正被以更多具体的方式应用于计算机科学及相关学科. "
      "这里我们仅简要介绍其中几种.")
   (P "类型系统的一个日益重要的应用领域是计算机和网络安全. "
      "例如, 静态类型处于Java安全模型和JINI网络设备" (Q "即插即用")
      "架构 (Arnold et al., 1999) 的核心, 也是携带证明的代码 (Proof-Carrying Code) "
      "(Necula and Lee, 1996, 1998; Necula, 1997) 的关键使能技术. "
      "与此同时, 安全社区中发展出的许多基本思想正在编程语言的背景下被重新探索, "
      "它们在其中通常以类型分析的形式出现 "
      "(例如, Abadi, Banerjee, Heintze和Riecke, 1999; Abadi, 1999; Leroy和Rouaix, 1998; 等等). "
      "反过来, 人们对将编程语言理论直接应用于安全领域的问题也越来越感兴趣 "
      "(例如, Abadi, 1999; Sumii和Pierce, 2001).")
   (P "类型检查和推断算法也出现在编译器以外的许多程序分析工具中. 例如, AnnoDomini"
      -- "一个用于Cobol程序的2000年转换工具" --
      "就是基于ML风格的类型推导引擎 (Eidorff et al., 1999). "
      "类型推导技术还被用于别名分析 (O'Callahan和Jackson, 1997) 和异常分析 "
      "(Leroy和Pessaux, 2000) 的工具中. "
      "{译注: 所谓的2000年转换工具是为了解决千年虫问题的.}")
   (P "在自动定理证明中, 类型系统" -- "通常是基于依赖类型的非常强大的类型系统" --
      "被用来表示逻辑命题和证明. 几个流行的证明辅助工具, "
      "包括Nuprl (Constable et al., 1986), Lego (Luo和Pollack, 1992; Pollack, 1994), "
      "Coq (Barras et al., 1997) 和Alf (Magnusson和Nordström, 1994), 都直接基于类型理论. "
      "Constable (1998) 和Pfenning (1999) 讨论了这些系统的历史.")
   (P "在数据库社区中, 对类型系统的兴趣也在增长, "
      "这与以文档类型定义 (XML 1998) 和其他用于描述XML结构化数据的模式 "
      "(如新的XML-Schema标准 [XS 2000]) 形式出现的" (Q "网络元数据")
      "的爆炸式增长有关. 用于查询和操作XML的新语言直接基于这些模式语言提供了强大的静态类型系统 "
      "(Hosoya和Pierce, 2000; Hosoya, Vouillon和Pierce, 2001; "
      "Hosoya和Pierce, 2001; Relax, 2000; Shields, 2001).")
   (P "类型系统的一个截然不同的应用出现在计算语言学领域, "
      "其中类型化lambda演算构成了范畴文法 (categorial grammar) 等形式化体系的基础 "
      "(van Benthem, 1995; van Benthem和Meulen, 1997; Ranta, 1995; 等等).")
   (H3. "类型系统和语言设计")
   (P "将类型系统改造到一个在设计时未考虑类型检查的语言上可能是很棘手的; "
      "理想情况下, 语言设计应当与类型系统设计齐头并进.")
   (P "其中一个原因是, 没有类型系统的语言" -- "即使是安全的, 动态检查的语言" --
      "往往会提供一些特性或鼓励一些使类型检查变得困难或不可行的编程习惯用法. "
      "实际上, 在有类型的语言中, 类型系统本身往往被视为设计的基础和组织原则, "
      "设计的每一个其他方面都要在其指导下加以考虑.")
   (P "另一个因素是, 有类型语言的具体句法往往比无类型语言更复杂, 因为必须考虑类型注解. "
      "当所有问题都能一起解决时, 更容易设计出简洁且易于理解的语法.")
   (P "类型应当作为编程语言不可分割的一部分这一主张, "
      "与程序员必须在哪里手动写下类型注解以及哪些地方可以由编译器推断这一问题是分开的. "
      "一个设计良好的静态类型语言绝不会要求程序员显式地, 繁琐地维护大量的类型信息. "
      "不过, 对于多少显式类型信息算是过多, 仍存在一些分歧. "
      "ML家族语言的设计者们努力将标注保持在最低限度, "
      "使用类型推导方法来恢复所需的信息. "
      "C族语言, 包括Java, 则选择了一种更加冗长的风格.")
   (H3. "简史")
   (P "在计算机科学中, 最早的类型系统被用来对数字的整数表示和浮点表示做非常简单的区分 "
      "(例如, 在Fortran中). 在20世纪50年代末和60年代初, "
      "这种分类被扩展到结构化数据 (记录的数组等) 和高阶函数. "
      "在20世纪70年代, 一系列更加丰富的概念 "
      "(参数多态, 抽象数据类型, 模块系统和子类型) 被引入, "
      "类型系统也作为一个独立的研究领域浮现出来. 与此同时, "
      "计算机科学家们开始意识到编程语言中的类型系统与数理逻辑中研究的类型系统之间的联系, "
      "由此产生了丰富的交互影响, 并一直延续至今.")
   (P "图1-1呈现了计算机科学中类型系统历史上一些重要节点的简要 (且极不完整的!) 年表. "
      "逻辑学中的相关发展也包含在内, 以斜体标示, 以突显该领域所做贡献的重要性. "
      "右侧栏中的引用可在参考文献中找到.")
   ((figure #:n "1-1")
    "计算机科学和逻辑学中的类型的简史"
    (MB (set-attr*
         (&Table
          ("1870s" (Emm "形式逻辑的起源")          "Frege (1879)")
          ("1900s" (Emm "数学的形式化")            "Whitehead和Russell (1910)")
          ("1930s" (Emm "无类型lambda演算")        "Church (1941)")
          ("1940s" (Emm "简单类型lambda演算")      "Church (1940), Curry和Feys (1958)")
          ("1950s" "Fortran"                       "Backus (1981)")
          ($       "Algol-60"                      "Naur et al. (1963)")
          ("1960s" (Emm "Automath项目")            "de Bruijn (1980)")
          ($       "Simula"                        "Birtwistle et al. (1979)")
          ($       (Emm "Curry-Howard对应")        "Howard (1980)")
          ($       "Algol-68"                      "van Wijngaarden et al., (1975)")
          ("1970s" "Pascal"                        "Wirth (1971)")
          ($       (Emm "Martin-Löf类型论")        "Martin-Löf (1973, 1982)")
          ($       (&cm (Emm "System F") $F^omega) "Girard (1972)")
          ($       "多态lambda演算"                "Reynolds (1974)")
          ($       "CLU"                           "Liskov et al. (1981)")
          ($       "多态类型推导"                  "Milner (1978), Damas和Milner (1982)")
          ($       "ML"                            "Gordon, Milner和Wadsworth (1979)")
          ($       (Emm "交类型")                  "Coppo和Dezani (1978)")
          ($       $                               "Coppo, Dezani和Sallé (1979), Pottinger (1980)")
          ("1980s" "NuPRL project"                 "Constable et al. (1986)")
          ($       "子定型"                        "Reynolds (1980), Cardelli (1984), Mitchell (1984a)")
          ($       "ADT作为存在类型"               "Mitchell和Plotkin (1988)")
          ($       (Emm "构造演算")                "Coquand (1985), Coquand和Huet (1988)")
          ($       (Emm "线性逻辑")                "Girard (1987) , Girard et al. (1989)")
          ($       "有界量化"                      "Cardelli和Wegner (1985)")
          ($       $                               "Curien和Ghelli (1992), Cardelli et al. (1994)")
          ($       (Emm "Edinburgh逻辑框架")       "Harper, Honsell和Plotkin (1992)")
          ($       "Forsythe"                      "Reynolds (1988)")
          ($       (Emm "纯类型系统")              "Terlouw (1989), Berardi (1988), Barendregt (1991)")
          ($       "依赖类型和模块化"              "Burstall和Lampson (1984), MacQueen (1986)")
          ($       "Quest"                         "Cardelli (1991)")
          ($       "作用系统"                      "Gifford et al. (1987), Talpin和Jouvelot (1992)")
          ($       "行变量; 可扩展记录"            "Wand (1987), Rémy (1989)")
          ($       $                               "Cardelli和Mitchell (1991)")
          ("1990s" "高阶子定型"                    "Cardelli (1990), Cardelli和Longo (1991)")
          ($       "类型化中间语言"                "Tarditi, Morrisett, et al. (1996)")
          ($       "对象演算"                      "Abadi和Cardelli (1996)")
          ($       "半透明类型和模块化"            "Harper和Lillibridge (1994), Leroy (1994)")
          ($       "类型化汇编语言"                "Morrisett et al. (1998)"))
         'width "100%"
         'frame "solid"
         'columnalign "left left right")))
   (H3. "相关阅读")
   (P "尽管本书力求自成体系, 但远非面面俱到; "
      "这一领域过于庞大, 且可以从太多角度加以探讨, 仅凭一本书难以充分涵盖. "
      "本节列出了其他一些优秀的入门资源.")
   (P "Cardelli (1996) 和Mitchell (1990b) 的手册文章提供了对该领域的简明介绍. "
      "Barendregt的文章 (1992) 更适合具有数学倾向的读者. "
      "Mitchell的大部头教材Foundations for Programming Languages (1996)涵盖了基本的lambda演算, "
      "一系列类型系统, 以及语义学的诸多方面. 其重点在于语义问题而非实现问题. "
      "Reynolds的Theories of Programming Languages (1998b) 是一部研究生层次的编程语言理论综述, "
      "其中包含了对多态性, 子定型和交类型的精彩阐述. "
      "Schmidt (1994)的The Structure of Typed Programming Languages"
      "在语言设计的背景下展开类型系统的核心概念, "
      "其中包括若干关于传统命令式语言的章节. Hindley的专著Basic Simple Type Theory (1997) "
      "是关于简单类型lambda演算及密切相关系统的精彩结果汇编. 其覆盖面注重深度而非广度.")
   (P "Abadi和Cardelli的A Theory of Objects (1996) 发展了与本书大量相同的内容, "
      "但淡化了实现方面, 转而专注于将这些思想应用于面向对象编程的基础性处理. "
      "Kim Bruce的Foundations of Object-Oriented Languages: Types and Semantics (2002) "
      "涵盖了类似的领域. 关于面向对象类型系统的入门材料还可参见"
      "Palsberg和Schwartzbach (1994) 以及Castagna (1997).")
   (P "无类型语言和有类型语言的语义基础在"
      "Gunter (1992), Winskel (1993) 和Mitchell (1996) 的教材中均有深入探讨. "
      "Hennessy (1990) 也对操作语义学进行了详细论述. "
      "在范畴论的数学框架中为类型语义学奠定基础的资料同样可以在许多来源中找到, "
      "包括Jacobs (1999), Asperti和Longo (1991), 以及Crole (1994) 的著作; "
      "一份简要入门可参见Basic Category Theory for Computer Scientists (Pierce, 1991a).")
   (P "Girard, Lafont和Taylor的Proofs and Types (1989) "
      "讨论了类型系统的逻辑方面 (Curry-Howard对应等). "
      "该书还包含了System F的创造者对其的描述, 以及一个介绍线性逻辑的附录. "
      "类型与逻辑之间的联系在Pfenning的Computation and Deduction (2001) 中得到了进一步探讨. "
      "Thompson的Type Theory and Functional Programming (1991) 和"
      "Turner的Constructive Foundations for Functional Languages (1991) "
      "侧重于函数式编程 (即Haskell或Miranda意义上的 " (Q "纯函数式编程")
      ") 与构造性类型论之间的联系, 从逻辑的视角加以审视. "
      "若干相关的证明论主题在Goubault-Larrecq和Mackie的"
      "Proof Theory and Automated Deduction (1997) 中有所发展. "
      "类型在逻辑和哲学中的历史在Constable (1998), "
      "Wadler (2000), Huet (1990) 和Pfenning (1999) 这些文章中, "
      "在Laan的博士论文 (1997) 中, 以及在Grattan-Guinness (2001) 和"
      "Sommaruga (2000) 这些书籍中有更详细的描述.")
   (P "章末引言: 事实证明, 要避免对编程语言的类型可靠性 (soundness) 作出错误而令人尴尬的声明, "
      "需要进行相当多的细致分析. 因此, 类型系统的分类, 描述和研究已发展成为一门形式化的学科." (Br)
      -- "Luca Cardelli (1996)")
   (H2. "数学预备")
   (P "在正式开始之前, 我们需要建立一些通用的记号, 并陈述若干基本的数学事实. "
      "大多数读者只需浏览本章, 需要时再回来查阅即可.")
   (H3. "集合, 关系和函数")
   ((Definition)
    "对于集合, 我们使用标准记号: 花括号用于显式列出一个集合的元素, 即"
    (setE $..h) ", 或者用于展示如何由一个集合通过" (Q "概括 (comprehension)")
    "构造出另一个集合, 即" (setI (∈ $x $S) $..h) "; " $empty
    "用于空集; " (&\\ $S $T) "用于" $S "和" $T "的集合差 (由" $S
    "中不在" $T "里的元素构成的集合). 集合" $S "的大小记作" (&card $S)
    ". " $S "的幂集, 即由" $S "的所有子集构成的集合, 记作"
    (powerset $S) ".")
   ((Definition)
    "自然数集合" (setE $0 $1 $2 $3 $4 $5 $..h)
    "以符号" $NN "表示. 一个集合被称为是可数的, "
    "如果其和自然数集之间存在一一对应. "
    "{译注: 一一对应即双射.}")
   ((Definition)
    "集合" (&cm $S_1 $S_2 $..h $S_n) "上的一个"
    $n "位关系是一个元组的集合"
    (&sube $R (&c* $S_1 $S_2 $..c $S_n))
    ". 我们称从元素" (∈ $s_1 $S_1) "到元素" (∈ $s_n $S_n)
    "由" $R "所关联, 如果" (tu0 $s_1 $..h $s_n)
    "是" $R "的一个元素.")
   ((Definition)
    "集合" $S "上的一个幺位关系被称为" $S "上的一个谓词. "
    "我们称谓词" $P "对于元素" (∈ $s $S) "为真, 如果"
    (∈ $s $P) ". 为了强调这种直觉, 我们经常记" (app $P $s)
    "而非" (∈ $s $P) ", 其将" $P "视为一个将" $S
    "的元素映射至真值的函数. "
    "{译注: " (app $P $s) "的涵义其实是"
    (Q (app $P $s) "为真") ", 但是从自然语言的角度, "
    "省略为真或者不省略往往表达了相同的意思.}")
   ((Definition)
    "集合" $S "和" $T "上的一个二位关系被称为一个二元关系. "
    "我们经常记" (&R $s $t) "而非" (∈ (tu0 $s $t) $R)
    ". 当" $S "和" $T "是相同的集合" $U "时, 我们称"
    $R "是" $U "上的一个二元关系.")
   ((Definition)
    "出于可读性的考量, 三位或者更多位的关系经常使用一种"
    (Q "mixfix") "具体句法, 关系中的元素由一系列符号分隔, "
    "这些符号合起来构成了关系的名字. 例如, "
    "对于第9章中的简单类型lambda演算的定型关系, 我们记"
    (!- Γ (&: $s $T)) "以表达"
    (Q "三元组" (tu0 Γ $s $T) "在定型关系之中")
    ". {译注: 这里的表达或许有些含混不清, 似乎"
    (Q "关系中的元素") "实际上指的是"
    (Q "关系中的元素 (其为元组) 的元素") ".}")
   ((Definition)
    "集合" $S "和" $T "上的一个关系" $R "的" (Em "定义域")
    ", 记作" (&dom $R) ", 是集合"
    (MB (setI (∈ $s $S)
              (: "存在" (∈ $t $T) "使得"
                 (∈ (tu0 $s $t) $R))) ".")
    $R "的" (Em "陪域") "或者说" (Em "值域")
    ", 记作" (&range $R) ", 是集合"
    (MB (setI (∈ $t $T)
              (: "存在" (∈ $s $S) "使得"
                 (∈ (tu0 $s $t) $R))) ".")
    "{译注: 这里我使用了标准的set-builder记号, "
    "因为原本用自然语言表述的定义很难翻译. "
    "另外这里的术语值得讨论一下, 因为经常引起混淆. "
    "在范畴论的背景下, 对于关系范畴里两个对象" $S
    "和" $T "之间的态射" $R ", 或者说其上的关系"
    $R ", 它的定义域是" $S "而陪域是" $T
    ", 和关系本身到底是什么样无关. "
    "在一般性的数学或者离散数学的背景下, "
    $R "的定义域的定义倒是与本书相同, "
    "值域的定义也是一样的, "
    "但是通常来说值域和陪域是不同的概念. 这里的"
    $R "的陪域一般指的是" $T
    ". 也就是说, 本书对于陪域的定义和通行材料不同. "
    "另外, 这里的定义域和值域也可以分别定义成"
    $R "在第一投影和第二投影下的像.}")
   ((Definition)
    "集合" $S "和" $T "上的一个关系" $R "被称为一个从"
    $S "到" $T "的" (Em "部分函数") ", 如果"
    (∈ (tu0 $s $t_1) $R) "和" (∈ (tu0 $s $t_2) $R)
    "可以推出" (&= $t_1 $t_2) ". 在此基础之上, 如果"
    (&= (&dom $R) $S) ", 那么" $R "被称为一个从"
    $S "到" $T "的" (Em "完全函数") ", 或者就称为"
    (Em "函数") ". {译注: 在这个定义里, "
    "一个完全函数也是一个部分函数. "
    "不过, 我们也经常使用另外的意思. "
    "也就是说, 部分函数指的是的确存在未定义元素的部分函数, "
    "这就把完全函数从部分函数中剔除了. 读者需要留心上下文.}")
   ((Definition)
    "一个从" $S "到" $T "的部分函数被称为是在其一个参数"
    (∈ $s $S) "上有定义, 如果" (∈ $s (&dom $R))
    ", 否则是未定义的. 我们记" (&↑ (app $f $x))
    "或者" (&= (app $f $x) $↑) "以表达"
    (Q $f "在" $x "上没有定义") ", 而"
    (&↓ (app $f $x)) "则表示"
    (Q $f "在" $x "上有定义") "." (Br)
    "在某些实现章节里, 我们也需要定义可能在某些输入上"
    (Em "失败") "的函数 (例如, 见图片22-2). "
    "将失败 (其是合法的, 可观察的结果) 和发散区分开来是重要的; "
    "一个可能失败的函数可以是部分的 (即其也可能发散), "
    "也可以是完全的 (其总是返回一个结果或者显式失败)" --
    "的确, 我们总是对于证明完全性感兴趣. 当" $f
    "在输入" $x "上返回一个失败时, 我们记"
    (&= (app $f $x) $fail) "." (Br)
    "形式化地说, 一个从" $S "到" $T "的可能失败的函数实际上是一个从"
    $S "到" (&union $T (setE $fail)) "的函数, 其中我们假定"
    $fail "并不属于" $T
    ". {译注: 这种补丁式定义总让人感觉美中不足, "
    "虽然也不至于引起误解, 只是会让某些人感到不舒服而已. "
    "比如说这里先强调失败是一种合法结果, "
    "然后又说完全函数返回结果或者显式失败, "
    "当然后者的或指的是不可兼的或. "
    "实际上本来可以不用打补丁, "
    "需要失败的时候我们就直接在陪域里显式添加一个失败值就行了. "
    "反而原文倒有点辩证的感觉了, 有时我们说失败是一个结果, "
    "有时我们说失败不是一个结果. "
    "虽然也没有问题, 但是不太符合计算机书籍写作的原则.}")
   ((Definition)
    "设" $R "是集合" $S "上的一个二元关系, 而" $P
    "是" $S "上的一个谓词. 我们称" $P "由" $R
    (Em "保持") ", 如果" (&R $s $s^) "和" (app $P $s)
    "可以推出" (app $P $s^) ".")
   (H3. "有序集")
   ((Definition)
    "集合" $S "上的一个二元关系是" (Em "自反的")
    ", 如果" $R "将" $S "的每个元素和其自身联系起来" --
    "即对于每个" (∈ $s $S) "都有" (&R $s $s)
    ", 或者说" (∈ (tu0 $s $s) $R) ". " $R "是"
    (Em "对称的") ", 如果对于所有的" (∈ $s $t $S)
    ", " (&R $s $t) "可以推出" (&R $t $s)
    ". " $R "是" (Em "传递的") ", 如果"
    (&R $s $t) "和" (&R $t $u) "可以推出"
    (&R $s $u) ". " $R "是" (Em "反对称的")
    ", 如果" (&R $s $t) "和" (&R $t $s)
    "可以推出" (&= $s $t) ".")
   ((Definition)
    "集合" $S "上的一个自反传递关系被称为" $S
    "上的一个" (Em "预序") ". (每当我们论及"
    (Q "一个预序集" $S) ", 我们总是在心中已有了"
    $S "上的某个特定预序" $R ".) 预序通常使用符号"
    $<= "或者" $sqsube "书写. 我们记" (&< $s $t)
    " (" $s "严格小于" $t ") 以表达"
    (&conj (&<= $s $t) (&!= $s $t))
    ". {译注: 以个人之见, 这个定义有问题. "
    "对于预序而言, 合理的严格预序应该定义为"
    (&conj (&<= $s $t) (&neg (@<= $t $s)))
    ". 对于下面的偏序, 这样定义倒无妨.}" (Br)
    "(集合" $S ")上的一个预序如果也是反对称的, "
    "那么其被称为" $S "上的" (Em "偏序")
    ". 一个偏序" $<= "被称为一个" (Em "全序")
    ", 如果对于每个" (∈ $s $t $S)
    ", 我们有" (&<= $s $t) "或" (&<= $t $s) ".")
   ((Definition)
    "设" $<= "是集合" $S "上的一个偏序, 而"
    $s "和" $t "是" $S "的元素. 一个元素"
    (∈ $j $S) "被称为是" $s "和" $t "的"
    (Em "join") ", 或者说" (Em "最小上界") ", 如果"
    (Ol (Li (&<= $s $j) "且" (&<= $t $j) ", 另外")
        (Li "对于任意的元素" (∈ $k $S) "满足"
            (&<= $s $k) "且" (&<= $t $k)
            ", 我们有" (&<= $j $k) "."))
    "类似地, 一个元素" (∈ $m $S) "被称为是"
    $s "和" $t "的" (Em "meet") ", 或者说"
    (Em "最大下界") ", 如果"
    (Ol (Li (&<= $m $s) "且" (&<= $m $t) ", 另外")
        (Li "对于任意的元素" (∈ $n $S) "满足"
            (&<= $n $s) "且" (&<= $n $t)
            ", 我们有" (&<= $n $m) ".")))
   ((Definition)
    "集合" $S "上的一个自反, 传递, 对称关系被称为"
    $S "上的一个" (Em "等价") ".")
   ((Definition)
    "设" $R "是集合" $S "上的一个二元关系. " $R
    "的" (Em "自反闭包") "是包含" $R
    "的最小自反关系" $R^ ". (" (Q "最小")
    "的意思是如果" $R^^ "是某个包含" $R
    "的所有序对的自反关系, 那么我们有"
    (&sube $R^ $R^^) ".) 类似地, " $R
    "的" (Em "传递闭包") "是包含" $R
    "的最小传递关系. " $R "的传递闭包经常记作"
    (^+ $R) ". " $R "的" (Em "自反传递闭包")
    "是包含" $R "的最小自反且传递关系, "
    "其经常记为" (&* $R) ".")
   ((Exercise)
    
    )
   ((Exercise)
    
    )
   ((Exercise)
    "设" $R "是集合" $S "上的一个二元关系且"
    $P "是" $S "上一个由" $R "保持的谓词. 证明"
    $P "也由" (&* $R) "保持.")
   ((answer)
    "我们构造" $S "上的一个关系"
    (MB (&= $T (setI (∈ (tu0 $s $t) (&c* $S $S))
                     (&=> (app $P $s) (app $P $t)))))
    "其中" (&=> (app $P $s) (app $P $t))
    "的含义是当" (app $P $s) "为真时"
    (app $P $t) "为真. 因为谓词" $P
    "由关系" $R "保持, 所以对于每个"
    (∈ (tu0 $s $t) $R) ", 我们都有"
    (&=> (app $P $s) (app $P $t))
    "成立. 换言之, " (&sube $R $T)
    ". 另外, 因为对于每个" (∈ $s $S)
    "都有" (&=> (app $P $s) (app $P $s))
    "成立, 故" $T "是自反的. 若"
    (∈ (tu0 $s $t) $T) "且"
    (∈ (tu0 $t $u) $T) ", 那么"
    (&=> (app $P $s) (app $P $t)) "且"
    (&=> (app $P $t) (app $P $u))
    ", 于是" (&=> (app $P $s) (app $P $u))
    ", 即" (∈ (tu0 $s $u) $T)
    ". 换言之, " $T "也是传递的. 鉴于" (&* $R)
    "是包含" $R "的最小自反传递关系, 我们有"
    (&sube (&* $R) $T) ". 也就是说, 如果"
    (∈ (tu0 $s $t) (&* $R)) "且"
    (app $P $s) "成立, 就有" (app $P $t)
    "成立, 即谓词" $P "由" (&* $R)
    "保持. (实际上, 一个关系" $R "保持谓词"
    $P "当且仅当" (&sube $R $T) ".)")
   ((Definition)
    "设我们有了集合" $S "上的一个预序" $<=
    ". " $<= "中的一个" (Em "降链")
    "是一个由" $S "的元素构成的序列"
    (&cm $s_1 $s_2 $s_3 $..h)
    "且对于每个" $i "有"
    (&< (_ $s (&+ $i $1)) $s)
    ". (链可以是有限的也可以是无限的, "
    "但是我们对于无限的情形更感兴趣, "
    "如以下定义所言.)")
   ((Definition)
    "设我们有了集合" $S "上的一个预序" $<=
    ". 我们称" $<= "是" (Em "良基的")
    ", 如果其不包含无限的降链. 例如, "
    "自然数集上的通常序是良基的, "
    "但是整数集上同样的(通常)序不是. "
    "有时我们会省略显式提及" $<=
    "而称" $S "为一个" (Em "良基集合")
    ". {译注: 承接之前的注释, "
    "可以看到为什么之前原文由预序定义严格预序的方式并不合理. "
    "对于一个并非偏序的预序而言, 按照原文的定义, "
    "我们总是可以找到一对" (&cm $x $y) "使得"
    (&< $x $y) "且" (&< $y $x)
    ", 那么我们就直接得到了一个无限降链, "
    "所以(在原文定义下)非偏序的预序就不可能是良基的.}")
   (H3. "序列")
   ((Definition)
    "一个序列通过列出其元素并用逗号分隔来表示. "
    "我们将逗号既用作向序列任一端添加元素的"
    (Q "cons") "操作, 也用作序列之间的" (Q "append")
    "操作. 例如, 如果" $a "是序列" (&cm $3 $2 $1)
    ", 而" $b "是序列" (&cm $5 $6) ", 那么" (&cm $0 $a)
    "表示序列" (&cm $0 $3 $2 $1) ", 而" (&cm $a $0)
    "表示" (&cm $3 $2 $1 $0) ", " (&cm $b $a)
    "表示" (&cm $5 $6 $3 $2 $1) ". (将逗号同时用于"
    (Q "cons") "和" (Q "append") "操作不会引起混淆, "
    "只要我们不需要讨论序列的序列即可.) 从" $1 "到" $n
    "的数字序列可以简写为" (Code "1..n")
    " (只用了两个点). 我们用" (&length $a)
    "表示序列" $a "的长度. 空序列记作" $dummy
    "或留空. 如果一个序列包含与另一个序列"
    "恰好完全相同的元素 (可能顺序不同), "
    "则称其为另一个序列的一个" (Em "置换") ".")
   ((tcomment)
    "cons和append这两个术语应该是来源于Lisp编程语言.")
   ((tcomment)
    "对于有限或者无限的序列" (func (&cm $a $b) $X $A)
    ", 其中" $X "要么是" $NN ", 要么是"
    (setE $0 $..h (&- $n $1)) ", 其中"
    $n "是一个自然数且在" (&= $n $0)
    "时该集合我们规定其为" $empty
    ". 称" $a "是" $b "的一个置换, 如果存在某个双射"
    (func $sigma $X $X) "使得"
    (&= $a (&compose $b $sigma))
    ". 如果将这种置换关系视为一个二元关系, "
    "那么其是自反的, 传递的, 对称的.")
   (H3. "归纳")
   (P "归纳证明在编程语言理论中无处不在, 对于计算机科学也是如此. "
      "这些证明大多基于以下原理之一.")
   ((Axiom)
    (B "[自然数上的通常归纳原理]:") (Br)
    "设" $P "是自然数集上的一个谓词, 那么:"
    (Blockquote
     "如果" (app $P $0) "且" (Br)
     "对于所有的" $i ", " (app $P $i)
     "可以推出" (app $P (&+ $i $1)) "," (Br)
     "那么" (app $P $n) "对于所有的" $n "均成立."))
   ((Axiom)
    (B "[自然数上的完全归纳原理]:") (Br)
    "设" $P "是自然数集上的一个谓词, 那么:"
    (Blockquote
     "如果对于每个自然数" $n "," (Br)
     "&nbsp;&nbsp;&nbsp;&nbsp;"
     "对于所有的" (&< $i $n) "都有" (app $P $i) (Br)
     "&nbsp;&nbsp;&nbsp;&nbsp;"
     "可以推出" (app $P $n) "," (Br)
     "那么" (app $P $n) "对于所有的" $n "均成立."))
   ((Definition)
    "自然数序对上的" (Em "字典序") "定义如下: "
    (&<= (tu0 $m $n) (tu0 $m^ $n^)) "当且仅当要么"
    (&< $m $m^) ", 要么" (&= $m $m^) "且"
    (&<= $n $n^) ".")
   ((Axiom)
    (B "[字典归纳原理]:") (Br)
    "设" $P "是自然数序对上的一个谓词."
    (Blockquote
     "如果对于每个自然数序对" (tu0 $m $n) "," (Br)
     "&nbsp;&nbsp;&nbsp;&nbsp;"
     "对于所有的" (&< (tu0 $m^ $n^) (tu0 $m $n))
     "都有" (appl $P $m^ $n^) (Br)
     "&nbsp;&nbsp;&nbsp;&nbsp;"
     "可以推出" (appl $P $m $n) "," (Br)
     "那么" (appl $P $m $n) "对于所有的" $m
     "和" $n "成立."))
   (P "字典序归纳原理是" (Em "嵌套归纳")
      "证明的基础, 其中归纳证明的某个情形是通过" (Q "内层归纳")
      "处理的. 它可以推广到对于数字的三元组, 四元组等进行字典序归纳. "
      "(对于序对的归纳相当常见; 对三元组偶尔有用; 超过三元组则很少见.)")
   ((tcomment)
    "上面的字典序归纳原理的表达其实相当于使用嵌套归纳的完全归纳法, "
    "但是把内层和外层的归纳假设合并到一起了.")
   (P "第3章的定理3.3.4将引入另一种归纳证明的格式, 其被称为" (Em "结构归纳")
      ", 它对于涉及树结构 (如项或类型推导) 的证明特别有用. "
      "归纳推理的数学基础将在第21章中更详细地讨论, "
      "届时我们将看到所有这些具体的归纳原理都是某个更为深刻的想法的实例.")
   (H3. "背景阅读")
   (P "如果你对本章总结的内容不太熟悉, 可能需要先阅读一些背景材料. "
      "相关资源有很多, 但Winskel的书 (1993) "
      "对于培养归纳法的直觉而言是一个特别好的选择. "
      "Davey和Priestley (1990) 的开篇部分对有序集进行了出色的回顾. "
      "Halmos (1987) 是基本集合论的优秀入门读物.")
   (P "章末引言: 证明是令人信服的可重复实验. " (Br)
      -- "Jim Horning")
   (H2. "无类型算术表达式")
   (P "要严格地讨论类型系统及其性质, 首先我们需要从形式化的角度处理编程语言的一些更基本的方面. "
      "特别是, 我们需要清晰精确且数学上易于处理的工具, 来表达和推理程序的句法与语义.")
   (P "本章和下一章将为一个由数字和布尔值组成的小型语言开发所需的工具. "
      "这个语言简单到几乎不值一提, 但它可以作为一个直观的载体, 用于引入若干基本概念" --
      "抽象句法, 归纳定义与证明, 求值, 以及运行时错误的建模. "
      "第5章到第7章将围绕一个功能强大得多的语言" -- "无类型lambda演算" --
      "展开同样的讨论, 届时我们还必须处理名称绑定和替换的问题. "
      "再往后看, 第8章将正式开始类型系统的研究, 回到本章的简单语言, "
      "并以此引入静态类型的基本概念. 第9章则将这些概念扩展到lambda演算.")
   (H3. "引论")
   (P "本章所使用的语言只包含一手之数的句法形式: 布尔常量" $true "和" $false
      ", 算术运算符" $succ " (后继) 和" $pred " (前继), 测试运算符"
      $iszero ", 其在应用于" $zero "时返回" $true ", 而在应用于其他数字时返回"
      $false ". 这些形式可以紧凑地由以下文法所总结."
      (MB (set-attr*
           (&Table
            ($t $::= $             "项:")
            ($  $    $true         "常量真")
            ($  $    $false        "常量假")
            ($  $    (If $t $t $t) "条件式")
            ($  $    $zero         "常量零")
            ($  $    (&succ $t)    "后继")
            ($  $    (&pred $t)    "前继")
            ($  $    (&iszero $t)  "零测"))
           'width "100%"
           'columnalign "right center left right"))
      "这里和全书所使用的文法的约定和标准BNF相近 "
      "(参见Aho, Sethi和Ullman, 1986). 第一行 ("
      (&::= $t $) ") 声明了我们正在定义" (Em "项")
      "的集合, 并且我们将要使用字母" $t
      "来遍历项. 其下的每一行都给出了项的一种句法形式选择. "
      "在每一处" $t "出现的地方, 我们都可以将任意的项代入. "
      "最右侧的文字是注释.")
   (P "文法规则右侧里的符号" $t "被称为" (Em "元变量")
      ". 说它是变量, 是因其为某个特定项的占位符; 说它是" (Q "元的")
      ", 是因为它并非" (Em "对象语言") "中的变量" --
      "这里的对象语言指的是我们当前正在描述其语法的简单编程语言" --
      "而是元语言中的变量, 即用于描述句法的这种记号中的变量. "
      "(事实上, 当前的对象语言甚至没有变量; 我们将在第5章引入变量.) 前缀"
      (Em "元-") "源自元数学, 它是逻辑学的一个子领域, "
      "研究对象是数学与逻辑的推理系统 (包括编程语言) 的数学性质. "
      "这一领域还给我们带来了" (Em "元理论") "这个术语, "
      "其含义是关于某个特定逻辑系统 (或编程语言) "
      "我们所能作出的所有真陈述之集合" --
      "进而扩展为对这些陈述的研究. 因此, 本书中诸如"
      (Q "子定型的元理论") "这样的表述, 可以理解为"
      (Q "对具有子定型的系统之性质的形式化研究") ".")
   (P "在本书中, 我们使用元变量" $t
      ", 以及相邻的字母如" (&cm $s $u $r)
      ", 还有诸如" $t_1 "和" $s^ "之类的变体, "
      "来代表我们当前所讨论的任意的对象语言中的项; "
      "随着内容的推进, 我们还会引入其他字母, "
      "用以代表从其他句法范畴中抽取的表达式. "
      "元变量约定的完整总结可参见附录B.")
   (P "目前, " (Em "项") "和" (Em "表达式")
      "这两个词可以互换使用. 从第8章开始, "
      "当我们开始讨论具有额外句法范畴 (如类型) 的演算时, "
      "我们将用表达式来泛指所有种类 (sort) 的句法phrase "
      "(包括项表达式, 类型表达式, 种类 (kind) 表达式, 等等), 而将"
      (Em "项") "保留给具有更为特化含义的表示计算的phrase使用, "
      "即可以代入元变量" $t "的phrase.")
   (P "当前语言的程序不过就是以上述给定文法中的形式所构建出来的项. "
      "以下是一些程序的例子, 以及对其求值的结果:"
      (CodeB "  if false then 0 else 1;
▶ 1
  iszero (pred (succ 0));
▶ true")
      "整本书里符号" (Code "▶") "都用来展示对于例子求值的结果. "
      "(为简洁起见, 当结果显而易见或不重要时将予以省略.) "
      "在排版过程中, 示例会由当前讨论的形式系统 (此处为" (Code "arith")
      ") 所对应的实现自动处理; 所显示的响应是该实现的实际输出.")
   (P "在示例中, " $succ ", " $pred "和" $iszero
      "的复合参数用括号括起以提高可读性. "
      "括号在项的文法中并未提及, 因为文法定义的只是抽象句法. "
      "当然, 在我们目前处理的这个极其简单的语言中, "
      "括号的有无几乎没有什么区别: 括号通常用于消解文法中的歧义, "
      "但这个文法本身并不存在任何歧义" --
      "每个记号序列至多只能以一种方式被解析为一个项. "
      "我们将在第5章 (第52页) 回到关于括号和抽象句法的讨论.")
   (P "{原注: 事实上, 本章中用于处理示例的实现 (在本书网站上称为"
      (Code "arith") ") 实际上要求" $succ ", " $pred "和" $iszero
      "的复合参数必须加括号, 尽管即使不加括号也能无歧义地解析. "
      "这是为了与后续的演算保持一致, "
      "因为那些演算中使用类似的语法来表示函数应用.}")
   (P "为使示例简洁, 我们使用标准的阿拉伯数字表示数, "
      "它们在形式上表示为" $succ "对" $zero
      "的嵌套应用. 例如, " (Code "succ(succ(succ(0)))")
      "写作" (Code "3") ".")
   (P "求值的结果是形式特别简单的项: "
      "它们要么是布尔常量, 要么是数字 (零个或多个" $succ "对" $zero
      "的嵌套应用). 这样的项称为" (Em "值")
      ", 它们将在我们对于项的求值顺序的形式化中扮演特殊的角色.")
   (P "注意, 项的句法允许构造一些看起来可疑的项, 如" (&succ $true) "和"
      (If $zero $zero $zero) ". 关于这类项, 我们后面还有更多要说的" --
      "事实上, 从某种意义上说, 正是它们使得这个微型语言对于我们的目的而言变得有趣, "
      "因为它们正是我们希望类型系统能够排除的那类无意义程序的例子.")
   (H3. "句法")
   (P "关于定义我们的语言的句法存在诸多等价的方式. "
      "在第24页的文法中我们已经见过了一种. "
      "这个文法实际上不过就是以下归纳定义的一种简洁记法:")
   ((Definition #:id "terms-inductively")
    (B "[项, 归纳地]: ")
    (Em "项") "的集合是满足"
    (Ol (Li (&sube (setE $true $false $zero) $T:script) ";")
        (Li "如果" (∈ $t_1 $T:script) ", 那么"
            (&sube (setE (&succ $t_1) (&pred $t_1) (&iszero $t_1))
                   $T:script) ";")
        (Li "如果"
            (&cm (∈ $t_1 $T:script)
                 (∈ $t_2 $T:script)
                 (∈ $t_3 $T:script))
            ", 那么"
            (∈ (If $t_1 $t_2 $t_3) $T:script)))
    "的最小集合" $T:script ".")
   (P "由于归纳定义在编程语言的研究中无处不在, "
      "因此值得在此停歇片刻, 仔细审视这一定义. "
      "第一个子句告诉我们三个简单表达式属于" $T:script
      ". 第二和第三个子句给出了规则, 据此我们可以判断某些复合表达式属于"
      $T:script ". 最后, " (Q "最小") " 一词告诉我们, " $T:script
      "中除了这三句话所要求的元素之外, 别无其他.")
   (P "与第24页的文法一样, 这个定义并未涉及使用括号来标记复合子项. "
      "从形式上讲, 我们实际上是将" $T:script
      "定义为一个树的集合, 而非字符串的集合. "
      "在示例中使用括号, 只是为了澄清我们在纸面上书写的项的线性化形式"
      "与其真正的潜在树形式之间的关系.")
   (P "同一归纳定义的另一种简写方式采用了二维的" (Em "推理规则")
      "的格式, 这种格式常用于逻辑系统的" (Q "自然演绎风格")
      "呈现之中:")
   (let ((make-rule (lambda (form . x*)
                      (apply &rule
                             (append
                              (map (λ (x) (∈ x $T:script)) x*)
                              (list (∈ (apply form x*)
                                       $T:script)))))))
     ((Definition #:id "terms-by-inference-rules")
      (B "[项, 根据推理规则]: ")
      (MB (&split16
           (∈ $true $T:script)
           (∈ $false $T:script)
           (∈ $zero $T:script)))
      (MB (&split16
           (make-rule &succ $t_1)
           (make-rule &pred $t_1)
           (make-rule &iszero $t_1)))
      (MB (make-rule If $t_1 $t_2 $t_3))))
   (P "这里前三条规则重述了" (Ref "terms-inductively")
      "中的第一句话, 接下来的四条规则捕获了第二句话和第三句话的含义. "
      "每条规则应该这样阅读, "
      (Q "如果我们已经建立了横线上方作为前提的陈述, "
         "那么我们可以推导出横线下方的结论.")
      " " $T:script "是满足这些规则的" (Em "最小")
      "集合这一事实往往不会显式陈述.")
   (P "术语方面有两点值得提及. 首先, 没有前提的规则 (如以上的前三条) "
      "经常被称为" (Em "公理") ". 本书之中, 术语" (Q "推理规则")
      "既包括公理, 也包括具有一至多条前提的" (Q "真规则")
      ". 公理书写的时候一般不需要横线, 因为上方的确没有东西. "
      "其次, 或许全然咬文嚼字的, 我们所称的" (Q "推理规则")
      "实为" (Em "规则模式") ", 因其前提和结论可能包含元变量. "
      "从形式化的角度来说, 每个模式都代表了" (Em "具体规则")
      "的无限集合, 具体规则可以通过将每个元变量一致地替换为"
      "从合适的句法范畴中选出的phrase得到" --
      "在以上规则里, 即将每个" $t "替换为可能的项.")
   (P "最后, 以下又是一种对于相同的项集合的定义, "
      "以一种有些不同的更为" (Q "具体") "的风格, "
      "其给出了" (Em "生成") $T:script "的元素的显式过程.")
   ((Definition #:id "terms-concretely")
    (B "[项, 具体地]: ")
    "对于每个自然数" $i ", 按照如下方式定义一个集合" $S_i ":"
    (MB (set-attr*
         (&Table
          ($S_0 $= $empty)
          ((_ $S (&+ $i $1))
           $= $
           (setE $true $false $zero))
          ($ $ $union
             (setI (&cm (&succ $t_1) (&pred $t_1) (&iszero $t_1))
                   (∈ $t_1 $S_i)))
          ($ $ $union
             (setI (If $t_1 $t_2 $t_3)
                   (∈ $t_1 $t_2 $t_3 $S_i))))
         'columnalign "left"))
    "最后, 令"
    (MB (&= $S (Union $i $S_i)) ".")
    $S_0 "是空集; " $S_1 "只包含常量; " $S_2
    "包含了常量外加可由常量和仅仅一次" $succ
    ", " $pred ", " $iszero "或者" $if
    "构成的phrase; " $S_3 "包含了这些 "
    "{译注: 指" $S_2 "的元素} 以及所有可由"
    $S_2 "中的phrase通过(单次)" $succ ", " $pred
    ", " $iszero "或" $if "构建的phrase; 诸如此类. "
    $S "收集了所有能以这种方式构建的phrase" --
    "即仅从常量出发, "
    "通过有限次算术和条件运算符所能构建的全部phrase.")
   ((Exercise)
    $S_3 "有多少个元素?")
   ((Exercise)
    "证明集合" $S_i "是" (Em "累积性的") --
    "即对于每个" $i ", 我们有"
    (&sube $S_i (_ $S (&+ $i $1))) ".")
   ((answer)
    "鉴于" (&= $S_0 $empty) ", " (&sube $S_0 $S_1)
    ". 假设对于任意的某个自然数" $k "有"
    (&sube $S_k (_ $S (&+ $k $1)))
    ", 我们希望证明"
    (&sube (_ $S (&+ $k $1)) (_ $S (&+ $k $2)))
    ". 对于" (∈ $t (_ $S (&+ $k $1)))
    "而言, 我们应该分情况讨论:"
    (Ol (Li (∈ $t (setE $true $false $zero))
            ", 此时显然有"
            (∈ $t (_ $S (&+ $k $2))) ".")
        (Li (∈ $t (setI (&cm (&succ $t_1) (&pred $t_1) (&iszero $t_1))
                        (∈ $t_1 $S_k)))
            ", 根据归纳假设" (&sube $S_k (_ $S (&+ $k $1)))
            ", 我们也有"
            (∈ $t (setI (&cm (&succ $t_1) (&pred $t_1) (&iszero $t_1))
                        (∈ $t_1 (_ $S (&+ $k $1)))))
            ", 于是" (∈ $t (_ $S (&+ $k $2))) ".")
        (Li (∈ $t (setI (If $t_1 $t_2 $t_3)
                        (∈ $t_1 $t_2 $t_3 $S_k)))
            ", 根据归纳假设" (&sube $S_k (_ $S (&+ $k $1)))
            ", 我们也有"
            (∈ $t (setI (If $t_1 $t_2 $t_3)
                        (∈ $t_1 $t_2 $t_3 (_ $S (&+ $k $1)))))
            ", 于是" (∈ $t (_ $S (&+ $k $2))) "."))
    "综上所述, 我们证明了"
    (&sube (_ $S (&+ $k $1)) (_ $S (&+ $k $2)))
    ". 根据数学归纳法, 对于每个自然数" $i
    ", 我们都有" (&sube $S_i (_ $S (&+ $i $1))) ".")
   (P "我们所看到的这些定义从不同的方向刻画了同一组术语: "
      (Ref "terms-inductively") "和"
      (Ref "terms-by-inference-rules")
      "只是将该集合刻画为满足某些" (Q "封闭性质")
      "的" (Em "最小") "集合; " (Ref "terms-concretely")
      "则展示了如何将该集合实际" (Em "构造")
      "为一个序列的极限.")
   (P "为了完成这一讨论, "
      "让我们来验证这两种观点实际上定义的是同一个集合. "
      "我们将相当详细地给出证明, "
      "以展示所有碎片是如何拼合在一起的.")
   ((Proposition #:id "explicit-characterization")
    (&= $T:script $S) ".")
   ((proof)
    $T:script "被定义为满足特定条件的最小集合. 因此, 证明"
    (Q "(a) " $S "满足这些条件 "
       "(b) 任何满足这些条件的集合都以" $S "为子集")
    "就足够了. 这两个条件将" $S "刻画为了满足这些条件的"
    (Em "最小") "集合." (Br)
    "对于(a)部分而言, 我们必须检查" (Ref "terms-inductively")
    "中的三个条件每个都对于" $S "成立. 首先, 既然"
    (&= $S_1 (setE $true $false $zero))
    ", 那么显然常量都在" $S "之中. 其次, 如果" (∈ $t_1 $S)
    ", 那么(因为" (&= $S (Union $i $S_i))
    ")必然存在某个" $i "使得" (∈ $t_1 $S_i)
    ". 不过这样的话, 根据" (_ $S (&+ $i $1))
    "的定义, 我们必然有" (∈ (&succ $t_1) (_ $S (&+ $i $1)))
    ", 因而" (∈ (&succ $t_1) $S) "; 类似地, 我们看到"
    (∈ (&pred $t_1) $S) "和" (∈ (&iszero $t_1) $S)
    ". 最后, 如果" (∈ $t_1 $S) ", " (∈ $t_2 $S) ", "
    (∈ $t_3 $S) ", 那么根据类似的论证可得"
    (∈ (If $t_1 $t_2 $t_3) $S) ". {译注: "
    "实际上不完全类似, 因为要用到之前练习所证明的"
    $S_i "是累积性的这一事实.}" (Br)
    "对于(b)部分而言, 设某个集合" $S^ "满足"
    (Ref "terms-inductively")
    "里的三个条件. 我们将会根据" $i
    "上的完全归纳法论证每个" (&sube $S_i $S^)
    ", 由此容易推出" (&sube $S $S^) "." (Br)
    "设对于所有的" (&< $j $i) "都有"
    (&sube $S_j $S^) "; 我们必须要证明"
    (&sube $S_i $S^) ". 因为" $S_i
    "的定义具有两个分句 (分别对于" (&= $i $0)
    "和" (&> $i $0) "的情形), 存在两个需要考虑的情形. 如果"
    (&= $i $0) ", 那么" (&= $S_i $empty) "; 不过"
    (&sube $empty $S^) "平凡地成立. 否则的话, 对于某个"
    $j "有" (&= $i (&+ $j $1)) ". 令" $t "是"
    (_ $S (&+ $j $1)) "的某个元素. 鉴于" (_ $S (&+ $j $1))
    "被定义为三个更小的集合之并, " $t
    "必然来源于其中一个集合; 存在三种需要考量的可能性. "
    "(1) 如果" $t "是一个常量, 那么根据第一个条件可知"
    (∈ $t $S^) ". (2) 如果" $t "对于某个" (∈ $t_1 $S_j)
    "而言具有形式" (&succ $t_1) ", " (&pred $t_1) "或"
    (&iszero $t_1) ", 那么根据归纳假设" (∈ $t_1 $S^)
    ", 于是根据第二个条件可知" (∈ $t $S^)
    ". (3) 如果" $t "对于某" (∈ $t_1 $t_2 $t_3 $S_j)
    "具有形式" (If $t_1 $t_2 $t_3)
    ", 那么又一次根据归纳假设, " (∈ $t_1 $t_2 $t_3 $S^)
    ", 于是根据第三个条件可知" (∈ $t $S^) "." (Br)
    "综上所述, 我们已经表明了每个" (&sube $S_i $S^)
    ". 根据" $S "作为所有" $S_i "之并的定义, 这给出了"
    (&sube $S $S^) ", 完成了整个论证. "
    "{译注: 虽然对于(b)的论证声称使用了完全归纳法, "
    "但是实际上使用普通的归纳法更为自然, "
    "这有点令译者无语.}")
   (P "值得注意的是, 这个证明使用的是自然数上的" (Em "完全")
      "归纳法, 而非更常见的"
      (Q "基础情形/归纳情形") "形式. 对于每个" $i
      ", 我们假设所需的谓词对所有严格小于" $i
      "的自然数成立, 然后证明它对" $i
      "也同样成立. 本质上, 这里的每一步都是归纳步骤; " (&= $i $0)
      "的情形唯一特殊之处在于, 可以用来调用归纳假设的那些更小的" $i
      "值的集合恰好为空. 同样的说明也适用于我们在本书中将要看到的大多数归纳证明"
      -- "尤其是通过" (Q "结构归纳法") "进行的证明.")
   (H3. "项上的归纳")
   (P (Ref "explicit-characterization")
      "中对于项的集合" $T:script
      "的显式刻画澄清了一种对于其元素进行推理的重要原理. 如果"
      (∈ $t $T:script) ", 那么以下三件事情必有其一对于"
      $t "为真: (1) " $t "是一个常量, 或者 (2) " $t
      "对于某个" (Em "更小") "的项" $t_1 "而言具有形式"
      (&succ $t_1) ", " (&pred $t_1) "或" (&iszero $t_1)
      ", 或者 (3) " $t "对于某些" (Em "更小") "的项"
      (&cm $t_1 $t_2 $t_3) "而言具有形式" (If $t_1 $t_2 $t_3)
      ". 我们可以按照两种方式利用这种观察: "
      "我们可以给出项的集合上的函数的" (Em "归纳定义")
      ", 以及我们可以给出关于项的性质的" (Em "归纳证明")
      ". 例如, 以下是一个将每个项" $t "映射为" $t
      "所使用的常量的集合的函数的归纳定义.")
   ((Definition)
    "出现在一个项" $t "里的常量的集合, 记作"
    (&Consts $t) ", 定义如下:"
    (MB (set-attr*
         (&Table
          ((&Consts $true) $= (setE $true))
          ((&Consts $false) $= (setE $false))
          ((&Consts $zero) $= (setE $zero))
          ((&Consts (&succ $t_1))
           $= (&Consts $t_1))
          ((&Consts (&pred $t_1))
           $= (&Consts $t_1))
          ((&Consts (&iszero $t_1))
           $= (&Consts $t_1))
          ((&Consts (If $t_1 $t_2 $t_3))
           $=
           (&union (&Consts $t_1)
                   (&Consts $t_2)
                   (&Consts $t_3))))
         'columnalign "left")))
   (P "可由归纳定义所计算的项的另一性质是其"
      (Em "大小") ".")
   ((Definition)
    "一个项" $t "的" (Em "大小") ", 记作"
    (&size $t) ", 定义如下:"
    (MB (set-attr*
         (&Table
          ((&size $true) $= $1)
          ((&size $false) $= $1)
          ((&size $zero) $= $1)
          ((&size (&succ $t_1))
           $= (&+ (&size $t_1) $1))
          ((&size (&pred $t_1))
           $= (&+ (&size $t_1) $1))
          ((&size (&iszero $t_1))
           $= (&+ (&size $t_1) $1))
          ((&size (If $t_1 $t_2 $t_3))
           $=
           (&+ (&size $t_1) (&size $t_2)
               (&size $t_3) $1)))
         'columnalign "left"))
    "也就是说, " $t "的大小是其抽象句法树的结点数目. "
    "类似地, 一个项" $t "的" (Em "深度") ", 记作"
    (&depth $t) ", 定义如下:"
    (MB (set-attr*
         (&Table
          ((&depth $true) $= $1)
          ((&depth $false) $= $1)
          ((&depth $zero) $= $1)
          ((&depth (&succ $t_1))
           $= (&+ (&depth $t_1) $1))
          ((&depth (&pred $t_1))
           $= (&+ (&depth $t_1) $1))
          ((&depth (&iszero $t_1))
           $= (&+ (&depth $t_1) $1))
          ((&depth (If $t_1 $t_2 $t_3))
           $=
           (&+ (&max (&depth $t_1)
                     (&depth $t_2)
                     (&depth $t_3))
               $1)))
         'columnalign "left"))
    "等价地, " (&depth $t) "是使得" (∈ $t $S_i)
    "的" $i "之中最小的那个, 而" $S_i "的定义见"
    (Ref "terms-concretely") ".")
   (P "下面是一个归纳证明, 证明的是关于一个项中常量数目与其大小之间的一个简单事实. "
      "(当然, 这个性质本身是完全显而易见的. 有趣的是这个归纳证明的形式, "
      "我们在后续内容中将会反复看到这一形式.)")
   ((Lemma)
    "一个项" $t "中不同常量的数目不大于" $t "的大小, 即"
    (&<= (&card (&Consts $t)) (&size $t)) ".")
   ((proof)
    "根据" $t "的深度上的归纳. 假设想要的性质对于所有深度小于"
    $t "的项成立, 我们必须要证明其对于" $t "自身成立. "
    "以下是三种需要考虑的情形:"
    (Ul (Li "情形: " $t "是一个常量" (Br)
            "立即可以推出: "
            (&= (&card (&Consts $t))
                (&card (setE $t))
                $1 (&size $t)) ".")
        (Li "情形: " $t "等于"
            (&succ $t_1) ", " (&pred $t_1) "或" (&iszero $t_1) (Br)
            "根据归纳假设, "
            (&<= (&card (&Consts $t_1)) (&size $t_1))
            ". 现在我们可以按照如下方式进行计算: "
            (: (&card (&Consts $t)) $=
               (&card (&Consts $t_1)) $<=
               (&size $t_1) $<
               (&size $t)) ".")
        (Li "情形: " (&= $t (If $t_1 $t_2 $t_3)) (Br)
            "根据归纳假设, "
            (&<= (&card (&Consts $t_1)) (&size $t_1)) ", "
            (&<= (&card (&Consts $t_2)) (&size $t_2)) ", "
            (&<= (&card (&Consts $t_3)) (&size $t_3))
            ". 现在我们可以按照如下方式进行计算: "
            (MB (deriv0
                 (&card (&Consts $t))
                 $=
                 (&card (&union (&Consts $t_1)
                                (&Consts $t_2)
                                (&Consts $t_3)))
                 $<=
                 (&+ (&card (&Consts $t_1))
                     (&card (&Consts $t_2))
                     (&card (&Consts $t_3)))
                 $<=
                 (&+ (&size $t_1)
                     (&size $t_2)
                     (&size $t_3))
                 $<
                 (&size $t))))))
   (P "这个证明的形式可以通过将其重新表述为某个一般性推理原理来加以澄清. "
      "为了更加完整, 我们还纳入了两个在关于项的证明中经常使用的类似原理.")
   ((Theorem)
    (B "[项上的归纳原理]: ")
    "设" $P "是项上的一个谓词."
    (Blockquote
     (Pre "深度上的归纳:
  如果对于每个项" $s ",
    假设对于所有满足"
           (&< (&depth $r) (&depth $s))
           "的项" $r "都有" (app $P $r)
           "成立的情况下
    我们可以证明" (app $P $s) "成立,
  那么" (app $P $s) "对于所有的" $s "成立.

大小上的归纳:
  如果对于每个项" $s ",
    假设对于所有满足"
           (&< (&size $r) (&size $s))
           "的项" $r "都有" (app $P $r)
           "成立的情况下
    我们可以证明" (app $P $s) "成立,
  那么" (app $P $s) "对于所有的" $s "成立.

结构归纳:
  如果对于每个项" $s ",
    假设对于" $s "的所有立即子项" $r
          "都有" (app $P $r) "成立的情况下
    我们可以证明" (app $P $s) "成立,
  那么" (app $P $s) "对于所有的" $s "成立.")))
   ((proof)
    "留作练习.")
   
   (H3. "语义风格")
   (P "在严格地给出了我们语言的语法之后, "
      "接下来我们需要一个同样精确的定义来说明项是如何求值的" --
      "即该语言的" (Em "语义") ". 形式化语义有三种基本方法:")
   (Ol (Li (Em "操作语义")
           "通过为一门编程语言定义一个简单的抽象机器来规定其行为. "
           "这台机器之所以是" (Q "抽象的")
           ", 是因为它使用该语言的项作为其机器代码, "
           "而非某种低级的微处理器指令集. "
           "对于简单的语言, 机器的一个状态就是一个项, "
           "而机器的行为由一个转移函数定义, 该函数对于每个状态, "
           "要么通过对项执行一步化简来给出下一个状态, 要么声明机器已经停机. "
           "一个项" $t "的含义可以被理解为从" $t
           "作为初始状态开始, 机器最终到达的终止状态." (Br)
           "{原注: 严格来说, 我们这里所描述的是所谓的" (Em "小步") "风格的操作语义, "
           "有时也称为" (Em "结构操作语义") " (Plotkin, 1981). "
           "练习3.5.17引入了一种替代性的大步风格, "
           "有时称为自然语义 (Kahn, 1987), "
           "其中抽象机器的一次转换就将一个项求值到其最终结果.}" (Br)
           "有时为同一门语言给出两种或更多种不同的操作语义是有用的" --
           "有些更为抽象, 其机器状态看起来与程序员所编写的项相似, "
           "另一些则更接近该语言的实际解释器或编译器所操纵的结构. "
           "证明这些不同机器在执行同一程序时的行为在某种适当意义下相互对应, "
           "就等于证明了该语言的一个实现的正确性.")
       (Li (Em "指称语义")
           "对含义采取了一种更为抽象的观点: "
           "一个项的含义不仅仅是一系列机器状态, "
           "而是被视为某个数学对象, 如一个数字或一个函数. "
           "为一门语言给出指称语义包括找到一组语义域, "
           "然后定义一个将项映射到这些域中元素的" (Em "解释函数")
           ". 为建模各种语言特性而寻找合适的语义域, "
           "催生了一个丰富而优雅的研究领域, 即"
           (Em "论域论(domain theory)") "." (Br)
           "指称语义的一个主要优势在于它抽象掉了求值的繁琐细节, "
           "突出了语言的核心概念. 此外, "
           "所选语义域的集合的性质可以用来推导出关于程序行为进行推理的强大定律" --
           "例如, 用于证明两个程序具有完全相同行为的定律, "
           "或者证明一个程序的行为满足某个规格的定律. "
           "最后, 从所选语义域的集合的性质出发, "
           "往往可以直接看出某些(期望的或不期望的)"
           "事情在一门语言中是不可能发生的.")
       (Li (Em "公理语义")
           "对这些定律采取了一种更为直接的方法: "
           "公理化方法不是先定义程序的行为 "
           "(通过给出某种操作语义或指称语义), "
           "然后从该定义中推导出定律, 而是将定律本身作为语言的定义. "
           "一个项的含义就是关于它所能证明的东西." (Br)
           "公理化方法的优美之处在于它将注意力集中在关于程序的推理过程上. "
           "正是这一思路为计算机科学带来了诸如不变量这样强大的概念."))
   (P "在六十年代和七十年代, 操作语义通常被认为不如另外两种风格" --
      "对于快速而粗略地定义语言特性虽然有用, 但不够优雅且在数学上较为薄弱. "
      "然而在八十年代, 更为抽象的方法开始遇到越来越棘手的技术问题, "
      "而操作方法的简洁性和灵活性相比之下变得越来越有吸引力" --
      "尤其是在若干研究者在该领域取得新进展之后, "
      "始于Plotkin的结构化操作语义 (1981), Kahn的自然语义 (1987), "
      "以及Milner关于CCS的工作 (1980; 1989; 1999), "
      "这些工作引入了更为优雅的形式化框架, "
      "并展示了在指称语义背景下发展出的许多强大数学技术"
      "如何可以迁移到操作语义的框架中. "
      "操作语义本身已经成为一个充满活力的研究领域, "
      "并且常常是定义编程语言及研究其性质的首选方法. "
      "本书将全部采用操作语义.")
   (H3. "求值")
   ((figure #:n "3-1")
    "布尔 (B): " $BB " (无类型的)"
    (Table
     #:attr* '((align "center"))
     (Tr (Td (Em "句法"))
         (Td (Em "求值") ": " (&-> $t $t^)))
     (Tr (Td
          (MB (set-attr*
               (&Table
                ($t $::= $             "项:")
                ($  $    $true         "常量真")
                ($  $    $false        "常量假")
                ($  $    (If $t $t $t) "条件式")
                ($v $::= $             "值:")
                ($  $    $true         "真值")
                ($  $    $false        "假值"))
               'columnalign "right center left right")))
         (Td
          (MBL (RuleLabel "(E-IfTrue)")
               (&-> (If $true $t_2 $t_3) $t_2))
          (MBL (RuleLabel "(E-IfFalse)")
               (&-> (If $false $t_2 $t_3) $t_3))
          (MBL (RuleLabel "(E-If)")
               (&rule
                (&-> $t_1 (_prime $t $1))
                (&-> (If $t_1 $t_2 $t_3)
                     (If (_prime $t $1) $t_2 $t_3))))))))
   (P "暂且不考虑数字, 让我们先从布尔表达式的操作语义开始. "
      "图3-1总结了该定义, 下面我们逐一详细考察其各个部分.")
   (P "图3-1的左列是一个文法, 定义了两个表达式集合. "
      "第一个只是 (为方便起见) 对项的句法的重复. "
      "第二个定义了项的一个子集, 称为值, "
      "即求值过程中可能得到的最终结果. "
      "这里, 值仅包括常量" $true "和" $false
      ". 在全书中, 元变量" $v "用于表示值.")
   (P "右列定义了项上的一个" (Em "求值关系") ", 记作" (&-> $t $t^)
      ", 读作" (Q $t "单步求值至" $t^) ". 其直觉含义是, 如果" $t
      "是抽象机在某一时刻的状态, 那么该机器可以执行一步计算, "
      "并将其状态变为" $t^ ". 这个关系由三条推理规则定义 "
      "(如果你愿意, 也可以说是两条公理和一条规则, "
      "因为前两条没有前提).")
   (P "{原注: 一些专家倾向于对于这种关系使用术语" (Em "归约")
      ", 而将" (Em "求值") "保留给练习3.5.17所描述的"
      (Q "大步") "变体使用, 其将项直接映射为最终的值.}")
   (P "第一条规则" (RuleLabel "E-IfTrue")
      "表示, 如果被求值的项是一个条件表达式, 且其guard恰好是常量"
      $true ", 那么机器可以丢弃整个条件表达式, 将then分支"
      $t_2 "作为机器的新状态 (即下一个待求值的项). 类似地, "
      (RuleLabel "E-IfFalse") "表示, guard恰好为" $false
      "的条件表达式可以单步求值至其else分支" $t_3
      ". 这些规则名称中的" (RuleLabel "E-")
      "前缀提示它们是求值关系的一部分; "
      "其他关系的规则将使用不同的前缀.")
   
   ((Definition)
    "一条推理规则的一个" (Em "实例")
    "是由一致地将规则的结论和所有前提 (若有的话) "
    "中的每个元变量替换为相同的项得到的.")
   (P "例如,"
      (MB (&-> (If $true $true (@If $false $false $false))
               $true))
      "是" (RuleLabel "E-IfTrue") "的一个实例, 其中"
      $t_2 "的两次出现都被替换为了" $true ", 而" $t_3
      "被替换为了" (If $false $false $false) ".")
   ((Definition)
    "一条规则由一个关系" (Em "满足")
    ", 如果对于规则的每个实例, "
    "要么结论在关系之中, "
    "要么前提之一不再关系之中.")
   ((tcomment)
    "这里的" (Q "要么要么") "是可兼的或. "
    "另外, 这里所说的结论或者前提在或不在关系之中, "
    "指的其实是对于具有形式" (&-> $t_1 $t_2)
    "的陈述而言, 序对" (tu0 $t_1 $t_2)
    "是否在关系" $-> "之中. 更准确地说, 其实是"
    (&-> $t_1 $t_2) "相对于特定的二元关系 "
    "(也可以说是二元谓词) " $-> "是否成立, "
    "这是由序对" (tu0 $t_1 $t_2) "在或不在"
    $-> "之中决定的. "
    "另外一个对于定义而言更为正面的说法是, "
    "如果前提(的实例)成立, 那么结论(的实例)也成立, "
    "相对于这个特定的关系而言.")
   ((Definition)
    (Em "单步求值关系") $->
    "是满足图3-1的三条规则的最小的项上的二元关系. 当序对"
    (tu0 $t $t^) "在这个求值关系之中时, 我们称"
    (Q "求值" (Em "陈述") " (或者说" (Em "判断") ") "
       (&-> $t $t^) "是" (Em "可推导的")) ".")
   ((tcomment)
    "其实" (Q (tu0 $t $t^) "在关系之中") "和"
    (Q (&-> $t $t^) "可推导")
    "的内涵并不相同, 不过其外延是相同的. "
    "另外, 陈述和判断的微妙区别或许也是类型论的核心.")
   
   ((Theorem)
    (B "[单步求值的确定性]: ")
    "如果" (&-> $t $t^) "且" (&-> $t $t^^)
    ", 那么" (&= $t^ $t^^) ".")
   ((proof)
    
    )
   ((Exercise)
    
    )
   ((Definition)
    
    )
   ((Theorem)
    "每个值都处于规范形式.")
   ((Theorem)
    "如果" $t "处于规范形式, 那么" $t "是一个值.")
   ((proof)
    
    )
   ((Definition #:id "multistep")
    (Em "多步求值") "关系" $->* "是单步求值的自反传递闭包. "
    "也就是说, 其是满足"
    (Q "(1) 如果" (&-> $t $t^) ", 那么" (&->* $t $t^)
       ", (2) 对于每个" $t "都有" (&->* $t $t)
       ", (3) 如果" (&->* $t $t^) "且" (&->* $t^ $t^^)
       ", 那么" (&->* $t $t^^))
    "的最小关系.")
   ((Exercise)
    "将" (Ref "multistep") "重述为推理规则的形式.")
   (P "既已有了多步求值的记号, 那就容易陈述如下事实了:")
   ((Theorem)
    (B "[规范形式的唯一性]: ")
    "如果" (&->* $t $u) "且" (&->* $t $u^)
    ", 其中" $u "和" $u^ "都是规范形式, 那么"
    (&= $u $u^) ".")
   ((Theorem)
    (B "[求值的终止性]: ")
    "对于每个项" $t ", 存在某个规范形式" $t^
    "使得" (&->* $t $t^) ".")
   ((Exercise)
    
    )
   ((Exercise)
    
    )
   ((Definition)
    
    )
   ((Exercise)
    
    )
   ((Exercise)
    "两种操作语义的风格都很常用. 本书所使用的被称为" (Em "小步")
    "风格, 因为求值关系的定义展现了计算的每个独立步骤是如何用来重写一个项的, "
    "一点一点重写, 直至其最终变为了一个值. 基于这种关系, "
    "我们定义了多步求值关系, 其允许我们讨论项(经过多步)求值至值. "
    "另一种风格被称为" (Em "大步") "语义 (或者有时说" (Em "自然语义")
    "), 其直接表述了" (Q "这个项求值至这个最终的值") "的概念, 记作" (&dArr $t $v)
    ". 对于我们的布尔和算术的表达式的语言而言的大步求值规则看起来如下:"
    (MBL (RuleLabel "(B-Value)")
         (&dArr $v $v))
    (MBL (RuleLabel "(B-IfTrue)")
         (&rule
          (&dArr $t_1 $true)
          (&dArr $t_2 $v_2)
          (&dArr (If $t_1 $t_2 $t_3) $v_2)))
    (MBL (RuleLabel "(B-IfFalse)")
         (&rule
          (&dArr $t_1 $false)
          (&dArr $t_3 $v_3)
          (&dArr (If $t_1 $t_2 $t_3) $v_3)))
    (MBL (RuleLabel "(B-Succ)")
         (&rule
          (&dArr $t_1 $nv_1)
          (&dArr (&succ $t_1) (&succ $nv_1))))
    (MBL (RuleLabel "(B-PredZero)")
         (&rule
          (&dArr $t_1 $zero)
          (&dArr (&pred $t_1) $zero)))
    (MBL (RuleLabel "(B-PredSucc)")
         (&rule
          (&dArr $t_1 (&succ $nv_1))
          (&dArr (&pred $t_1) $nv_1)))
    (MBL (RuleLabel "(B-IsZeroZero)")
         (&rule
          (&dArr $t_1 $zero)
          (&dArr (&iszero $t_1) $true)))
    (MBL (RuleLabel "(B-IsZeroSucc)")
         (&rule
          (&dArr $t_1 (&succ $nv_1))
          (&dArr (&iszero $t_1) $false)))
    "请表明对于这个语言而言, 其小步语义和大步语义是相合的, 即"
    (&->* $t $v) "当且仅当" (&dArr $t $v) ".")
   ((exercise)
    
    )
   (H3. "注记")
   (P "抽象句法与具体句法, 句法分析等概念在数十本编译器教材中都有阐述. "
      "归纳定义, 推理规则系统以及归纳证明在Winskel (1993) 和Hennessy (1990) "
      "的著作中有更详细的介绍.")
   (P "我们这里所采用的操作语义风格可以追溯到Plotkin (1981) 的一篇技术报告. "
      "大步语义风格 (练习 3.5.17) 由Kahn (1987) 提出. "
      "更详细的展开可参见Astesiano (1991) 和Hennessy (1990).")
   (P "结构归纳法由Burstall (1969) 引入计算机科学领域.")
   (H2. "算术表达式的一个ML实现")
   
   (H2. "无类型lambda演算")
   (H2. "项的匿名表示")
   (H2. "lambda演算的一个ML实现")
   (H2. "类型化的算术表达式")
   (H3. "类型")
   (H3. "定型关系")
   (H3. "安全=进展+保持")
   (H2. "简单类型lambda演算")
   (H3. "函数类型")
   (H3. "定型关系")
   (H3. "定型的性质")
   (H3. "Curry-Howard对应")
   (H3. "擦除和可定型性")
   (H3. "Curry风格和Church风格的对比")
   (H2. "简单类型的一个ML实现")
   (H2. "简单扩展")
   (H2. "规范化")
   (P "这一章我们将考虑纯简单类型lambda演算的另一个基础的理论性质: "
      )
   (H3. "简单类型的规范化")
   (H3. "注记")
   (H2. "引用")
   (H2. "异常")
   (H2. "子定型")
   (P "我们已经花了数章时间在简单类型lambda演算的框架之下研究了诸多语言特性的类型行为. "
      "这一章所面对的是一种更为基本的扩展: " (Em "子定型") " (有时也被称为" (Em "子类型多态")
      "). 和我们之前所研究的特性不同的是, 前面的特性或多或少算是正交的, "
      "而子定型是一个横切的扩展, 与大多数其他语言特性以非平凡的方式进行交互. "
      "{译注: 也就是说, 加入子定型会影响语言的全局.}")
   (P "子定型总是可以作为" (Em "面向对象") "语言的特征而找到, "
      "其经常被认为是面向对象风格的一个本质特性. "
      "我们将会在第18章仔细探索这种关联, "
      "然而现在我们将会在只有函数和记录这一更为经济的场景下呈现子定型, "
      "不过最有趣的问题已然出现. 第15.5节讨论了子定型与之前我们所见过的一些其他特性的组合. "
      "在最后一节 (也就是15.6), 我们考虑了子定型的一种更为细化的语义, "
      "其中子定型的使用对应于运行时" (Em "强制") "的插入.")
   (H3. "涵摄 (subsumption)")
   (P "简单类型lambda演算没有子定型, 其规则有时可能恼人地顽固. "
      "类型系统对于参数类型和函数的定义域类型必须精确匹配的坚持"
      "将导致类型检查器会拒绝许多对于程序员而言显然良行为的程序. "
      "例如, 回忆一下函数应用的定型规则:"
      (MBL (RuleLabel "(T-App)")
           (&rule
            (G!- (&: $t_1 (&-> $T_11 $T_12)))
            (G!- (&: $t_2 $T_11))
            (G!- (&: (APP $t_1 $t_2) $T_12))))
      "根据这条规则, 良行为的项"
      (CodeB "(λr:{x:Nat}. r.x) {x=0,y=1}")
      "是不可定型的, 因为其参数的类型为"
      (Code "{x:Nat,y:Nat}")
      ". 但是显然, 这个函数只是要求其参数应该是一个带有域"
      (Code "x") "的记录. 它并不在意参数有还是没有其他的域. "
      "而且, 我们从函数的类型就足以看出来这一点" --
      "我们不需要观察其体来验证它没有使用任何" (Code "x")
      "之外的域这一事实. 将具有类型" (Code "{x:Nat,y:Nat}")
      "的参数传递给期待类型" (Code "{x:Nat}")
      "的函数" (Em "总是") "安全的.")
   (P "子定型的目的在于对定型规则进行细化, "
      "以使得类型系统可以接受如上所描述的项. "
      "我们达成所用的方式在于形式化某些类型比其他类型更有信息 "
      "(informative) 这一直觉: 我们称" (Code "S")
      "是" (Code "T") "的一个" (Em "子类型")
      ", 记作" S<:T ", 来表达任何具有类型"
      (Code "S") "的项都可以安全地用在期待具有类型"
      (Code "T") "的项的上下文之中这一事实. "
      "这种看待子定型的观念被称为"
      (Em "安全替换原则") ".")
   (P "更简单的直觉在于将" S<:T "读作"
      (Q "每个由" (Code "S") "所描述的值也可由"
         (Code "T") "所描述")
      ". 也就是说, "
      (Q (Code "S") "的元素 (复数) 是" (Code "T")
         "的元素 (复数) 的一个子集")
      ". 我们将会在第15.6节看到其他的偶尔有用的更为细化的对于子定型的解释, "
      "但是当前这种" (Em "子集语义") "对于绝大多数目的而言已经足够了.")
   (P "定型关系和子类型关系之间的桥梁是通过添加一条新的定型规则提供的, "
      "即所谓的" (Em "涵摄") "规则:"
      (MBL (RuleLabel "(T-Sub)")
           (&rule
            (G!- (&: $t $S))
            (&<: $S $T)
            (G!- (&: $t $T))))
      "这条规则告诉我们, 如果" S<:T
      ", 那么" (Code "S") "的每个元素" (Code "t")
      "也是" (Code "T") "一个元素. "
      "例如, 如果我们定义某种子类型关系使得"
      (Code "{x:Nat,y:Nat} &lt;: {x:Nat}")
      ", 那么我们就可以使用规则"
      (RuleLabel "T-Sub") "来推导出"
      (Code "⊢ {x=0,y=1} : {x:Nat}")
      ", 这是我们为了使得我们的启发性例子通过类型检查所需要的.")
   (H3. "子类型关系")
   (P "子类型关系可以形式化为一集用于推导具有形式"
      S<:T "的陈述的推理规则, " S<:T "应该读作"
      (Q (Code "S") "是" (Code "T") "的一个子类型") "或者"
      (Q (Code "T") "是" (Code "S") "的一个超类型")
      ". 我们分别考虑每种形式的类型 (函数类型, 记录类型, 等等); "
      "对于每种情况, 我们引入一或多条规则来形式化"
      "在期望某个类型的地方何时可以安全地允许使用"
      "具有这种形式的另一类型的元素.")
   (P "在讨论特定类型构造子的(子定型)规则之前, "
      "我们作出两条一般性约定:" (Br)
      "首先, 子定型规则应该是自反的, 即"
      (MBL (RuleLabel "(S-Refl)")
           (&<: $S $S))
      "其次, 它应该是传递的, 即"
      (MBL (RuleLabel "(S-Trans)")
           (&rule
            (&<: $S $U)
            (&<: $U $T)
            (&<: $S $T)))
      "这些规则可以直接根据安全替换的直觉推得.")
   (P "对于记录类型, 现在我们已经明白了我们想要考虑的是将类型"
      (Code "S = {k1:S1...km:Sm}") "作为"
      (Code "T = {l1:T1...ln:Tn}")
      "的一个子类型, 如果" (Code "T")
      "相较于" (Code "S") "有着更少的域. "
      "作为一种特别情形, " (Q "忘记")
      "某个记录类型的末端的一些域是安全的. 所谓的"
      (Em "宽度子定型") "规则捕获了这种直觉:"
      (MBL (RuleLabel "(S-RcdWidth)")
           (&<: (AbsRcdType $l $T $i (&+ $n $k))
                (AbsRcdType $l $T $i $n)))
      "或许会令人惊讶的是, " (Q "更小") "的类型" --
      "即子类型" -- "反而有着" (Em "更多") "的域. "
      "理解这种现象的最简单方式在于如我们在第11.8节"
      "那样采用对待记录类型的一种更自由的观念, "
      "将一个记录类型" (Code "{x:Nat}") "描述为"
      (Q "由所有" (Em "至少") "拥有类型为"
         (Code "Nat") "的域" (Code "x")
         "的记录构成的集合")
      ". 诸如" (Code "{x=3}") "和" (Code "{x=5}")
      "这样的值是这个类型的元素, 诸如" (Code "{x=3,y=100}")
      "和" (Code "{x=3,a=true,b=true}")
      "这样的值也是这个类型的元素. 类似地, 记录类型"
      (Code "{x:Nat,y:Nat}") "描述了" (Em "至少")
      "拥有类型都为" (Code "Nat") "的域" (Code "x")
      "和" (Code "y") "的记录. 诸如"
      (Code "{x=3,y=100}") "和"
      (Code "{x=3,y=100,z=true}")
      "这样的值是这个类型的成员, 但是"
      (Code "{x=3}") "不是, "
      (Code "{x=3,a=true,b=true}")
      "也不是. 因此, 属于第二个类型的值构成的集合"
      "是属于第一个类型的值构成的集合的一个真子集. "
      "更长的记录类型构成了要求更多" -- "即更有信息"
      -- "的刻画, 故其描述了更小的值集合.")
   (P "宽度子定型规则只适用于共同的域等同的记录类型. "
      "允许单独的域的类型发生变化也是安全的, "
      "只要两个记录类型里每个相应的域的类型处于子类型关系. "
      (Em "深度子定型") "规则表达了这种直觉:"
      (MBL (RuleLabel "(S-RcdDepth)")
           (&rule
            (∀ $i (&<: $S_i $T_i))
            (&<: (AbsRcdType $l $S $i $n)
                 (AbsRcdType $l $T $i $n)))))
   (P "下列子定型推导联合使用了" (RuleLabel "S-RcdWidth")
      "和" (RuleLabel "S-RcdDepth") "来表明嵌套的记录类型"
      (Code "{x:{a:Nat,b:Nat},y:{m:Nat}}") "是"
      (Code "{x:{a:Nat},y:{}}") "的一个子类型:"
      (MB (&rull
           (RuleLabel "S-RcdDepth")
           (&rull
            (RuleLabel "S-RcdWidth")
            (&<: (RcdType $a $Nat $b $Nat)
                 (RcdType $a $Nat)))
           (&rull
            (RuleLabel "S-RcdWidth")
            (&<: (RcdType $m $Nat)
                 (RcdType)))
           (&<: (RcdType
                 $x (RcdType $a $Nat $b $Nat)
                 $y (RcdType $m $Nat))
                (RcdType
                 $x (RcdType $a $Nat)
                 $y (RcdType)))))
      "如果我们想要使用" (RuleLabel "S-RcdDepth")
      "来仅仅细化单独一个记录域 "
      "(而不是细化每个域, 如以上例子), "
      "我们可以使用" (RuleLabel "S-Refl")
      "来对于其他的域获得平凡子定型的推导."
      (MB (&rull
           (RuleLabel "S-RcdDepth")
           (&rull
            (RuleLabel "S-RcdWidth")
            (&<: (RcdType $a $Nat $b $Nat)
                 (RcdType $a $Nat)))
           (&rull
            (RuleLabel "S-Refl")
            (&<: (RcdType $m $Nat)
                 (RcdType $m $Nat)))
           (&<: (RcdType
                 $x (RcdType $a $Nat $b $Nat)
                 $y (RcdType $m $Nat))
                (RcdType
                 $x (RcdType $a $Nat)
                 $y (RcdType $m $Nat)))))
      "我们也可以使用传递性规则" (RuleLabel "S-Trans")
      "以将宽度子定型和深度子定型结合起来. 例如, "
      "我们可以藉由抛弃某个域时提升另一个域的类型来得到一个超类型:"
      (MB (&rull
           (RuleLabel "S-Trans")
           (&rull
            (RuleLabel "S-RcdWidth")
            (&<: (RcdType
                  $x (RcdType $a $Nat $b $Nat)
                  $y (RcdType $m $Nat))
                 (RcdType
                  $x (RcdType $a $Nat $b $Nat))))
           (&rull
            (RuleLabel "S-RcdDepth")
            (&rull
             (RuleLabel "S-RcdWidth")
             (&<: (RcdType $a $Nat $b $Nat)
                  (RcdType $a $Nat)))
            (&<: (RcdType
                  $x (RcdType $a $Nat $b $Nat))
                 (RcdType
                  $x (RcdType $a $Nat))))
           (&<: (RcdType
                 $x (RcdType $a $Nat $b $Nat)
                 $y (RcdType $m $Nat))
                (RcdType
                 $x (RcdType $a $Nat))))))
   (P "我们最后的记录子定型规则来源于这样的观察: "
      "记录的域的顺序对于如何安全使用记录不会造成任何影响, "
      "因为我们对于记录能" (Em "做") "的事情" --
      "即对于域进行投影" -- "对于域的顺序是不敏感的."
      (MBL (RuleLabel "(S-RcdPerm)")
           (&rule
            (: (AbsRcdType $k $S $j $n)
               "是"
               (AbsRcdType $l $T $i $n)
               "的一个置换")
            (&<: (AbsRcdType $k $S $j $n)
                 (AbsRcdType $l $T $i $n))))
      "例如, " (RuleLabel "S-RcdPerm") "告诉我们"
      (RcdType $c $Top $b $Bool $a $Nat) "是"
      (RcdType $a $Nat $b $Bool $c $Top)
      "的一个子类型, 反之亦然. (这暗示了子类型关系"
      (Em "并非") "反对称的.)")
   (P (RuleLabel "S-RcdPerm") "可以与"
      (RuleLabel "S-RcdWidth") "和"
      (RuleLabel "S-Trans")
      "进行结合以从一个记录类型的任何位置抛弃域, "
      "而不是只能抛弃末端的域.")
   ((Exercise)
    "绘制一个推导以表明" (RcdType $x $Nat $y $Nat $z $Nat)
    "是" (RcdType $y $Nat) "的一个子类型.")
   (P (RuleLabel "S-RcdWidth") ", "
      (RuleLabel "S-RcdDepth") ", "
      (RuleLabel "S-RcdPerm")
      "这三条规则每条都体现了记录在使用方面的一种不同的灵活性. "
      "出于讨论的目的, 将其呈现为三条单独的规则是有用的. "
      "具体来说, 存在着语言允许其中一些规则而不允许其他的规则; "
      "例如, Abadi和Cardelli的" (Em "对象演算")
      " (1996) 的大多数变体都省略了宽度子定型. "
      "然而, 出于实现的目的, 将这三条规则的所作所为"
      "融合成为一条大型规则是更为方便的. "
      "这条规则在下一章进行了讨论.")
   (P "既然我们在高阶语言的上下文中进行讨论, "
      "不仅是数字和记录, 函数也可以作为参数传递给其他函数, "
      "因而我们必须赋予函数类型以子定型规则" --
      "即我们必须要刻画在期望某个函数类型的上下文之中, "
      "何种情况下可以安全地使用不同类型的函数."
      (MBL (RuleLabel "(S-Arrow)")
           (&rule
            (&<: $T_1 $S_1)
            (&<: $S_2 $T_2)
            (&<: (&-> $S_1 $S_2)
                 (&-> $T_1 $T_2))))
      "注意到子类型关系对于参数类型是逆变的 (contravariant), "
      "对于结果类型是协变的 (covaraint). "
      "直觉在于, 如果我们有了一个类型为" (&-> $S_1 $S_2)
      "的函数" $f ", 那么我们知道" $f "接受类型为" $S_1
      "的元素; 显然, " $f "也接受" $S_1 "的任何子类型"
      $T_1 "的元素. " $f "的类型也告诉我们, 其会返回类型为"
      $S_2 "的元素; 我们也可以将这些结果视为属于" $S_2
      "的任何超类型" $T_2 ". 也就是说, 任何具有类型"
      (&-> $S_1 $S_2) "的函数" $f "也可以视为具有类型"
      (&-> $T_1 $T_2) ".")
   (P "另一种观念是若要在期望类型" (&-> $T_1 $T_2)
      "的上下文之中安全使用类型为" (&-> $S_1 $S_2)
      "的函数, 只需可能传递给该上下文中的函数的参数"
      "不会对函数本身造成惊吓 (故" (&<: $T_1 $S_1)
      "), 并且该函数返回的结果也不会对上下文造成惊吓 (故"
      (&<: $S_2 $T_2) ").")
   (P "最后, 拥有一个每个类型的超类型是方便的. "
      "我们引入一个新的类型常量" $Top
      ", 外加一条规则使得" $Top
      "成为子类型关系的一个最大元素."
      (MBL (RuleLabel "(S-Top)")
           (&<: $S $Top))
      "第15.4节更深入地讨论了" $Top
      "类型.")
   (P "从形式化角度而言, 子类型关系是在我们所给定的规则下封闭的最小关系. "
      
      )
   ((Exercise)
    )
   
   (H2. "子定型的元理论")
   (P "前一章的带有子定型的简单类型lambda演算并不直接适用于实现. "
      "和其他之前我们所见的演算不同的是, 这个系统的规则并非" (Em "句法导向的")
      -- "其无法" (Q "自底而上阅读") "以产生一个类型检查算法. "
      "罪魁祸首是定型关系里涵摄规则的" (RuleLabel "T-Sub")
      "和子定型关系里的传递性" (RuleLabel "S-Trans") ".")
   (P "之所以" (RuleLabel "T-Sub") "是有问题的, "
      )
   (H3. "算法性子定型")
   (H3. "算法性定型")
   
   (H2. "子定型的一个ML实现")
   (H2. "案例研究: 命令式对象")
   (H2. "案例研究: Featherweight Java")
   (H2. "递归类型")
   (P "在第11.12节里我们看到了如何扩展一个简单类型系统以囊括一个类型构造子"
      (&List $T) ", 其元素是列表项为类型" $T "的元素的列表. "
      "列表不过是一类常见结构的一个例子而已" --
      "这类结构也包括队列, 二叉树, 标签树, 抽象句法树, 等等" --
      
      )
   (H2. "递归类型的元理论")
   (H3. "归纳和余归纳")
   ((Definition)
    "一个函数" (∈ $F (&-> (powerset $U:script) (powerset $U:script)))
    "是" (Em "单调的") ", 如果" (&sube $X $Y) "可以推出"
    (&sube (app $F $X) (app $F $Y))
    ". (回忆以下, " (powerset $U:script) "是" $U:script
    "的幂集.)")
   (P "以下我们默认" $F "是" (powerset $U:script)
      "上的某个单调函数. 我们经常将" $F "称为一个"
      (Em "生成函数") ".")
   ((Definition)
    "令" $X "是" $U:script "的一个子集."
    (Ol (Li $X "是" (Em $F "-封闭的")
            ", 如果" (&sube (app $F $X) $X) ".")
        (Li $X "是" (Em $F "-一致的")
            ", 如果" (&sube $X (app $F $X)) ".")
        (Li $X "是" $F "的一个" (Em "不动点")
            ", 如果" (&= (app $F $X) $X) ".")))
   (P "这些定义的一个有用直觉在于将" $U:script
      "的元素想成是某种陈述或者断言, 而" $F
      "代表了某种" (Q "澄清 (justification)")
      "关系, 其对于某个陈述 (前提) 的集合, "
      "告诉我们什么新的陈述 (结论) 可由此推出. "
      "于是, 一个" $F "-封闭集合即不能通过添加由"
      $F "澄清的元素而加大的集合" --
      "其既已包含所有可由其成员所澄清的结论. "
      "另一方面, 一个" $F "-一致集合是" (Em "自澄清的")
      ": 其中的每个断言都可由作为该集合元素的断言所澄清. "
      $F "的一个不动点是一个既封闭又一致的集合: "
      "其包含了所有其成员所需要的澄清, "
      "以及所有可由其成员所推出的结论, 别无其他.")
   ((Example)
    "考虑以下三元素宇宙" (&= $U:script (setE $a $b $c))
    "上的生成函数:"
    (let ((E1 (λ X (app $E_1 (apply setE X)))))
      (MB (set-attr*
           (&Table
            ((app $E_1 $empty) $= (setE $c) (E1 $a $b) $= (setE $c))
            ((E1 $a) $= (setE $c) (E1 $a $c) $= (setE $b $c))
            ((E1 $b) $= (setE $c) (E1 $b $c) $= (setE $a $b $c))
            ((E1 $c) $= (setE $b $c) (E1 $a $b $c) $= (setE $a $b $c)))
           'columnalign "left")))
    "那么只有一个" $E_1 "-封闭集合, 即" (setE $a $b $c)
    ", 以及四个" $E_1 "-一致集合, 即" $empty ", " (setE $c)
    ", " (setE $b $c) ", " (setE $a $b $c) "." (Br)
    $E_1 "可由以下" (Em "推理规则") "集合紧凑表示:"
    (MB (&split16
         (&rule $c)
         (&rule $c $b)
         (&rule $b $c $a)))
    "这每条规则所陈述的是, 如果横线上方的元素都在输入集合之中, "
    "那么横线下方的元素则在输出元素之中.")
   ((Theorem)
    "[Knaster-Tarski (Tarski, 1955)]:"
    (Ol (Li "所有" $F "-封闭集合之交是" $F "的最小不动点.")
        (Li "所有" $F "-一致集合之并是" $F "的最大不动点.")))
   ((proof)
    "我们只考虑对于2的证明, 对于1的证明是对称的. 令"
    (&= $C (setI $X (&sube $X (app $F $X))))
    "是由所有" $F "-一致集合构成的集合, 令" $P
    "是所有这些集合之并. 考虑到" $F "为单调函数的事实, "
    "并且对于任意的" (∈ $X $C) ", " $X "为" $F
    "-一致集合且" (&sube $X $P) ", 那么我们就得到"
    (&sube $X (app $F $X) (app $F $P)) ". 因此, "
    (&sube (&= $P (Union (∈ $X $C) $X)) (app $F $P))
    ", 即" $P "是" $F "-一致的. 而且, 根据定义, " $P
    "是最大的" $F "-一致集合. 再次使用" $F
    "的单调性, 我们得到了"
    (&sube (app $F $P) (app $F (app $F $P)))
    ". 根据" $C "的定义, 这意味着" (∈ (app $F $P) $C)
    ". 于是, 就和" $C "的任意成员一样, 我们有"
    (&sube (app $F $P) $P) ", 即" $P "是" $F
    "-封闭的. 现在我们建立了两个事实: " $P
    "是最大的" $F "-一致集合, 以及" $P "是" $F
    "的一个不动点. 因此, " $P "是最大的不动点.")
   ((Definition)
    $F "的最小不动点记作" (μ $F) ". " $F
    "的最大不动点记作" (υ $F) ".")
   ((Example)
    
    )
   ((Exercise)
    
    )
   ((Corollary)
    (Ol (Li "归纳原理: 如果" $X "是" $F "-封闭的, 那么"
            (&sube (μ $F) $X) ".")
        (Li "余归纳原理: 如果" $X "是" $F "-一致的, 那么"
            (&sube $X (υ $F)) ".")))
   (P "这些原理背后的直觉来源于将集合" $X
      "想成是谓词, 由其特征集合所表示" --
      "即使得谓词为真的" $U:script "的子集; 表明性质"
      $X "对于元素" $x "成立和表明" $x "在集合" $X
      "之中是相同的. 现在, 归纳原理说的是对于任何性质, "
      "如果其特征集合在" $F "下封闭 (即该性质由" $F
      "所保持), 那么性质" $X "对于归纳定义的集合"
      (μ $F) "的所有元素为真.")
   (P "另一方面, 余归纳原理为我们提供了证明某个元素"
      $x "属于余归纳定义的集合" (υ $F)
      "的方法. 为了表明" (∈ $x (υ $F))
      ", 找到一个集合" $X "使得" (∈ $x $X)
      "且" $X "为" $F "-一致的就够了. "
      "尽管余归纳原理不如归纳原理那样令人熟悉, "
      "但是在诸多计算机科学领域其处于中心位置; "
      "例如, 在基于" (Em "双模拟")
      "的并发理论之中其是主要的证明技术, "
      "另外它也是诸多" (Em "模型检查")
      "算法的核心.")
   (P "归纳原理和余归纳原理在整章之中被频繁使用. "
      "我们并不会基于生成函数和谓词写下每个归纳论证, "
      "而是经常依赖于诸如结构归纳这样的缩略形式. "
      "余归纳论证则以更显式的方式呈现.")
   ((Exercise)
    
    )
   (H3. "有限和无限类型")
   ((Definition)
    
    )
   ((Exercise)
    
    )
   (H3. "子定型")
   ((Definition)
    
    )
   (H3. "关于传递性的题外话")
   (H3. "成员资格检查")
   (H3. "更有效的算法")
   (H3. "Regular Trees")
   (H3. $mu "-类型")
   (H3. "对于子表达式进行计数")
   (H3. "离题: 一个指数级算法")
   (H3. "对于同构递归类型进行子定型")
   (H3. "注记")
   (H2. "类型重构")
   (P "我们到目前为止已经见过的类型检查算法都依赖于显式的类型注解" --
      "特别是, 它们要求lambda抽象以其参数类型进行注解. "
      "本章我们将会建立更为强大的" (Em "类型重构")
      "算法, 其能够计算一个项的" (Em "主类型(principal type)")
      ", 而这个项中的某些或者全部的注解都是未刻画的. "
      "相关的算法处于诸如ML和Haskell这样的语言的核心.")
   (P "将类型重构与其他语言特性相结合往往是有点脆弱的. "
      "{译注: 意即不是很正交, 需要专门设计研究.} "
      "特别是, 记录和子定型都提出了严峻的挑战. "
      "为了保持简单, 这里我们只考虑了简单类型的类型重构; "
      "第22.8节给出了深入钻研阅读其他组合的一些起点.")
   (H3. "类型变量和替换")
   (P "在之前章节的某些演算里, "
      "我们假定了类型集合包含了一个由" (Em "未解释")
      "基类型构成的无限集合 (第11.1节). 和诸如"
      $Bool "与" $Nat "这样解释了的基类型不同的是, "
      "这些类型没有用于引入和消去项的操作; "
      "从直觉上来说, 它们只是某个特定类型的占位, "
      "但是对于这个类型的精确身份我们并不关心. "
      "在本章中, 我们将会一直问类似于"
      (Q "如果我们实例化项" $t "中的这个占位" $X
         "以具体类型" $Bool ", 我们能得到一个可定型的项吗")
      "这种问题. 换言之, 我们将我们的未解释基类型当作了"
      (Em "类型变量") ", 其可以用其他类型" (Em "替换")
      "或者说" (Em "实例化") ".")
   
   (H3. "两种看待类型变量的观点")
   (H2. "全称类型")
   (H2. "存在类型")
   (H2. "System F的一个ML实现")
   (H2. "有界量化")
   (H2. "案例研究: 命令式对象, Redux")
   (H2. "有界量化的元理论")
   
   ))