#lang racket
(provide term_of_commutative_algebra.html)
(require SMathML)
(define (unitGroup R) (^ R $c*))
(define $R^c* (unitGroup $R))
(define term_of_commutative_algebra.html
  (TnTmPrelude
   #:title "交换代数"
   #:css "styles.css"
   (H1. "交换代数")
   (H2. "环和理想")
   ((Definition)
    "回忆一下, 一个环" $R "是一个abel群, "
    "其记法是加性的, 并带有一个结合乘法运算, "
    "其对于加法分配.")
   (P "贯穿全书, 每个环都要一个乘法恒元, 记作"
      $1 ". 而且, 每个环都是交换的. "
      "也有例外, 不过例外总会标示出来, "
      "通常是矩阵环.")
   (P "和通常一样, 加法恒元记作" $0
      ". 注意, 对于任意的" (∈ $x $R)
      ", 我们有"
      (MB (&= (&d* $x $0) $0) ";")
      "诚然如此, "
      (&= (&d* $x $0)
          (&d* $x (@+ $0 $0))
          (&+ (&d* $x $0) (&d* $x $0)))
      ", 而" (&d* $x $0) "可以通过两边加上"
      (&- (@d* $x $0)) "消去.")
   (P "我们允许" (&= $1 $0) ". 如果" (&= $1 $0)
      ", 那么" (&= $R $0) "; 的确如此, 对于任意的"
      $x "都有" (&= $x (&d* $x $1) (&d* $x $0) $0) ".")
   (P "一个" (B "单位") "是一个元素" $u
      ", 其带有倒元" (&/ $1 $u) "满足"
      (&= (&d* $u (&/ $1 $u)) $1)
      ". 另外, " (&/ $1 $u) "也可以记为"
      (inv $u) ", 其被称为" $u "的" (B "乘法逆元")
      ". 单位构成了一个乘性群, 记作" $R^c* ".")
   (P "例如, 通常的整数构成了一个环" $ZZ
      ", 其单位是" $1 "和" $-1 ".")
   (P "一个环" (B "同态") ", 或者简称" (B "环映射")
      ", " (func $phi $R $R^) "是一个保持和, 积, "
      $1 "的映射. 显然, "
      (&sub (app $phi $R^c*)
            (unitGroup $R^))
      ". 我们称" $phi "是一个" (B "同构")
      ", 如果其是双射, 然后我们记"
      
      )
   ))