#lang racket
(provide topology_via_logic.html)
(require SMathML)
(define-infix*
  (&conj $conj)
  (&disj $disj))
(define-@lized-op*
  (@conj &conj)
  (@disj &disj))
(define topology_via_logic.html
  (TnTmPrelude
   #:title "拓扑via逻辑"
   #:css "styles.css"
   (H1. "拓扑via逻辑")
   (P "这是一本非主流拓扑入门教科书.")
   (H2 "序言")
   (P "目前已经有太多拓扑学导引书籍可看了, "
      "那么新来者就必须澄清其存在的必要性. "
      "本书基于在帝国理工所讲授的研究生课程, "
      "并且其主题和方法来源于看待拓扑的特定角度, "
      "而这种角度是受到理论计算机科学所启发的. "
      "本书主要是需要学习拓扑的计算机科学家的. "
      "然而, 数学家或许也会对此感兴趣, "
      "因为其将不同的光投射到了这个领域.")
   
   (H2. "引论")
   (P "历史回顾")
   (P "拓扑学的起源和我们将要工作的上下文相当不同, "
      "我们最好在这里将关于拓扑是什么的一些不同想法进行比较.")
   (Ol #:attr* '((type "I"))
       (Li "第一种想法是关于"
           (Em "橡皮膜几何(rubber sheet geometry)")
           "的, 也就是说在这种几何里我们并不在意拉伸空间. "
           "这种几何完全不在乎距离或者角度; "
           "其想要回答这样的问题, "
           (Q "这个对象里有没有一个洞?")
           " (尽管拉伸是允许的, 撕裂是不允许的.) "
           "Martin Gardner [66] 曾说, "
           (Q "拓扑学家无法区分咖啡杯和甜甜圈")
           ", 原因在于它们每个都恰拥有一个贯穿的洞. "
           "根据橡皮膜几何它们是等价的, "
           "因为若是它们均由延展性足够好的材料制成, "
           "那么其中一个可以变形为另一个. "
           "(咖啡杯算数的那个洞是你为了拿起杯子而把手指放进去的那个. "
           "放咖啡的地方不过只是凹陷. "
           "当然, 另外我们所想的甜甜圈是最经典的环状甜甜圈.)")
       (Li "对于边界的研究. "
           "既然撕裂会在橡皮膜拓扑中产生变化, "
           "既然撕裂会在橡皮膜中创造新的边界, "
           "似乎边界是一种值得检视的重要东西. "
           "边界点的特征是不论你如何凑近去看, "
           "你总能看到有些邻近的点在集合里面, "
           "又有些邻近的点在集合外面."
           )
       (Li "对于开集和闭集的抽象研究. "
           "下一步是抽象的步骤. "
           "我们忘记所有的几何, 只是取"
           (Q "点") "的抽象集合, 即" (Em "拓扑空间")
           ". 我们将一些特定的子集刻画为"
           (Em "开集") ", 而开集的补为" (Em "闭集")
           ", 并且要保证特定的公理 (应该归功于Hausdorff) "
           "得到满足. 那么, 我们就将第II阶段的拓扑论证"
           "转换到了这一抽象场景之中.")
       (Li "locale理论. "
           "接着的一步是甚至忘记点, 只是取" (Q "开集")
           "的抽象集合, 其带有抽象的代数运算用以表示并和交. "
           "这种结构是一个" (Em "frame")
           ". 有时, 点可以由这开集的frame重构." (Br)
           "这似乎是抽象的终极, 不过我们将会看到对于"
           (Em "逻辑") "的考虑将会使其成为合适的起点, "
           "自这个阶段我们往回探究."))
   (H3 "Hausdorff空间")
   (P "开集的拓扑公理是极其一般的, "
      "其所涵盖的情况远不止那些由橡皮膜几何的想法所生发的. "
      "因此在实践中, 拓扑学家会应用额外的公理来限制所能考虑的空间. "
      "一种非常常见的公理是" (Em "Hausdorff分离公理")
      ", 其是说任意两个不同的点都可由两个不相交的开集所分别包裹. "
      "主流拓扑学所处理的是这些" (Em "Hausdorff空间") ".")
   (P "然而在计算机科学里, 拓扑是用来解释信息的近似状态的: "
      "一个点集既包含近似的点又包含更为精化 (refined) 的点. "
      "其与拓扑相关的性质在于如果一个开集包含有某个近似点, "
      "那么其也必然该点的任意精化. 因此, "
      "近似点和其精化不可能由不相交的开集所分离, "
      "也就是说这种拓扑空间不可能是Hausdorff的. "
      "这意味着计算机科学中所使用的拓扑, "
      "至少对于这里所描述的方法而言, "
      "与主流方向相异, 尽管这仍然是拓扑.")
   (P "本书以不同寻常的方式接近拓扑学, "
      "从frame和基于逻辑的对于frame的解释开始, "
      "而以不同寻常的应用作结&mdash;&mdash;"
      "计算机科学中所使用的非Hausdorff拓扑. "
      "对于计算机科学家而言本书意在提供自足的导引, "
      "但是作为通往更为传统的应用的一条路径, "
      "其意在对于已有太多的标准导引书籍的内容进行补充.")
   (H3 "其他可读书籍")
   (P "对于橡皮膜几何, 可以浏览Martin Gardner的Scientific American专栏"
      (Q "Mathematical Puzzles and Diversions")
      "的合集. Gardner [63] 和 [86] 都包含相关文章.")
   (P "对于拓扑的传统方法, 其更注重于Hausdorff空间, "
      "可选的材料是相当广泛的. "
      "一种标准教材是Kelley的" (Q "General Topology")
      " [55].")
   (P "若要学习更多locale理论相关内容, 极好的书籍是Johnstone的" (Q "Stone Spaces")
      " [82]. 不过, 这本书后面的章节需要对于传统拓扑相当熟悉.")
   (H3 "范畴论")
   
   (H2. "肯定性和否定性断言")
   (P "本章我们将会见到一种有限观察的逻辑, "
      "并且这将作为我们想要研究的概念.")
   (P "关于拓扑是什么的最终想法是" (Em "一种信息理论")
      ". 为了启发这种想法, 让我们检视断言可能拥有的一些性质, "
      "断言的一个例子是"
      (Blockquote
       (Q "我的宝宝拥有灰色的眼睛.")))
   (P "显然的问题是, " (Q "这是对是错?")
      " "
      )
   (H2. "frame")
   (P "本章我们将建立一种有限观察逻辑的代数理论: "
      "其代数(结构)为frame.")
   (H3. "将逻辑代数化")
   (P "我们将会应用逻辑学中一个相当标准的技术, "
      "也就是将逻辑等价的公式等同起来, 或者说视为相等的. "
      "如此这般逻辑联结词就成为了"
      (Em "服从法则的代数运算")
      ", 并且我们可以使用代数方法来证明等价. "
      "例如, 我们有"
      (MB (&= (&disj $y (@disj $x $y))
              (&disj $y (@disj $y $x))
              (&disj (@disj $y $y) $x)
              (&disj $y $x)
              (&disj $x $y))))
   (P "想法在于, 例如, " (&disj $x $y) "和" (&disj $y $x)
      "真的只是言称相同东西的不同方式. "
      "我们想要让我们只关心" (Em "我们可以说什么")
      ", 而不是" (Em "我们可以怎么说") ".")
   (P "熟悉命题演算的读者或许已经在"
      (Em "Lindenbaum代数")
      "的构造之中见过这种东西了. "
      )
   (H2. "frame作为代数")
   (H2. "拓扑: 定义")
   (H2. "以旧换新")
   (H2. "点逻辑")
   (H2. "紧致性")
   
   ))