#lang racket
(provide tspl4.html)
(require SMathML)
(define (_cm A . x*)
  (_ A (apply &cm x*)))
(define tspl4.html
  (TnTmPrelude
   #:title "Scheme编程语言"
   #:css "styles.css"
   (H1. "Scheme编程语言")
   (P "在某种意义上, 我的确没有时间翻译这本书. "
      "不过, 鉴于Scheme是我学习编程的起点, "
      "我总是感到翻译TSPL4对于我个人而言具有特别的意义.")
   (H2. "前言" #:auto? #f)
   (H2. "引论")
   (H2. "开始")
   (H2. "深入")
   (H2. "过程和变量绑定")
   (H2. "控制操作")
   (H3. "过程应用")
   (H3. "顺序 (sequencing)")
   (H3. "条件式 (conditionals)")
   (H3. "递归和迭代")
   (H3. "map和fold操作")
   (H3. "延续 (continuations)")
   (H3. "延迟求值")
   (H3. "多值")
   (H3. "eval")
   (H2. "对象上的操作")
   (H2. "输入和输出")
   (H2. "句法扩展")
   (H3. "关键词绑定")
   (H3. "syntax-rules转换器")
   (H3. "syntax-case转换器")
   (H3. "例子")
   (H2. "记录")
   (H2. "库和顶层程序")
   (H3. "标准库")
   (H3. "定义新库")
   (H3. "顶层程序")
   (H3. "例子")
   (H2. "异常和条件")
   (H2. "扩展例子")
   (H3. "矩阵和向量乘法")
   (P "这个示例程序牵涉最为基本的编程技术. "
      "其刻画了简单算术和向量操作, 使用"
      (Code "do") "句法形式的循环, "
      "基于对象类型的分派, 以及引起异常.")
   (P "标量和标量, 标量和矩阵, 或者矩阵和矩阵的乘法, "
      "都是由一个被称为" (Code "mul") "的单一"
      (Em "通用(generic)") "过程所执行的. "
      (Code "mul") "被调用以两个参数, "
      "而其根据参数的类型来决定应该执行的操作. "
      "鉴于标量操作使用了Scheme的乘法过程"
      (Code "*") ", " (Code "mul")
      "的标量可以是任意内置的数值类型 "
      "(精确或非精确的复数, 实数, 有理数, 或整数).")
   (P "一个" (&c* $m $n) "的矩阵" $A "和一个"
      (&c* $n $p) "的矩阵" $B "之积是"
      (&c* $m $p) "的矩阵" $C
      ", 其元素由以下公式定义:"
      (MB (&= (_cm $C $i $j)
              (sum (&= $k $0)
                   (&- $n $1)
                   (&i* (_cm $A $i $k)
                        (_cm $B $k $j)))) ".")
      "一个标量" $x "和一个" (&c* $m $n)
      "的矩阵" $A "之积是" (&c* $m $n)
      "的矩阵" $C ", 其元素由以下等式定义:"
      (MB (&= (_cm $C $i $j)
              (&i* $x (_cm $A $i $j))) ".")
      "也就是说, " $C "的每个元素都是" $x
      "和" $A "的相应元素之积. "
      )
   (H3. "排序")
   (H3. "一个集合构造器")
   (H3. "词频统计")
   (H3. "Scheme打印器")
   (H3. "格式化输出")
   (H3. "一个Scheme的元循环解释器")
   (H3. "定义抽象对象")
   (H3. "快速Fourier变换")
   (H3. "一个合一算法")
   (H3. "使用engine的多任务")
   ))