#lang racket
(provide unified.html)
(require SMathML)
(define unified.html
  (TnTmPrelude
   #:title "全局程序优化的统一方法"
   #:css "styles.css"
   (H1. "全局程序优化的统一方法")
   (P "这篇论文太过经典, 其将数据流分析建立在格论之上.")
   (H2 "摘要")
   (P "这里所呈现的是一种对于程序结构进行全局分析的技术, "
      "这种分析是为了对于表达式所生成的目标代码进行编译时优化. "
      "这里所呈现的全局表达式优化包括常量传播, 公共子表达式消除, "
      "冗余寄存器load操作消除, 以及活跃表达式分析. "
      "我们建立了一般目的的程序流分析算法, "
      "其依赖于" (Q "优化函数") "的存在性. "
      "这个算法使用了程序流结构的有向图模型进行形式化定义, "
      "并被证明是正确的. "
      
      )
   (H2. "引论")
   
   ))