#lang racket
(provide universal_coalgebra.html)
(require SMathML)
(define universal_coalgebra.html
  (TnTmPrelude
   #:title "泛余代数: 系统的一个理论"
   #:css "styles.css"
   (H1. "泛余代数: 系统的一个理论")
   (H2 "摘要")
   (P "编程的语义学中诸如有限列表这样的有限数据类型在传统上是由始代数所建模的. "
      "之后的终" (Em "余代数") "用以处理" (Em "无限")
      "数据类型. 而且, 作为代数的对偶, 余代数被证明适合用作"
      "特定类型的自动机以及更一般的(转换和动态)" (Em "系统")
      "的模型. 始代数的一个重要性质在于其满足令人熟悉的归纳原理. "
      "这样一种原理直至Aczel关于非良基集合的理论的工作之前对于余代数而言都是缺失的, "
      "而Aczel的论文引入了一个如今被称为" (Em "余归纳")
      "的证明原理. 余归纳是以" (Em "双模拟")
      "的语言表述的, 双模拟这个概念最初成长于并发编程语言的世界. 使用"
      (Em "余代数同态") "的概念, 余代数上的双模拟的定义可以表明是"
      "形式对偶于代数上的congruence的定义的. 因此, 泛代数的三种基本概念, "
      "即代数, 代数的同态, 以及congruence, 实际上分别对应于余代数, "
      "余代数的同态, 以及双模拟. "
      )
   (H2. "引论")
   (P "在编程的语义学中, 数据类型通常呈现为代数 (参见 [24,47]). "
      
      )
   (H2. "余代数, 同态, 以及双模拟")
   (H2. "系统, 系统, 系统")
   (H2. "系统的极限和余极限")
   (H2. "关于双模拟的基本事实")
   (H2. "子系统")
   (H2. "三个同构定理")
   (H2. "简单系统和余归纳")
   (H2. "终系统")
   (H2. "终系统的存在性")
   (H2. "余归纳定义的例子")
   (H2. "余归纳证明的例子")
   (H2. "归纳和余归纳")
   (H2. "最大和最小不动点")
   (H2. "系统的自然变换")
   
   ))